{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0M0CV_L.jpg",
  "title": "Factbox-Who is the Republican 2024 US presidential hopeful Nikki Haley?",
  "category": "Politics",
  "publisher": "Reuters",
  "date": "Published Jan 23, 2024 06:06AM ET",
  "comments": [
    1,
    [
      [
        "Ken Roth",
        "2024-01-23 11:33:09",
        "Her problem is she does not sleep with p.stars, she is not a liar, thief, insurrectionist, ra……pist and a business fraud as Trump whom the republican regards is a true role model for their children",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/politics/factboxwho-is-the-republican-2024-us-presidential-hopeful-nikki-haley-3280435",
  "paragraph": "© Reuters. Republican presidential candidate and former U.S. Ambassador to the United Nations Nikki Haley takes the stage at a Get Out The Vote campaign rally ahead of the New Hampshire primary election in Salem, New Hampshire, U.S., January 22, 2024. REUTERS/Bria\n(Reuters) - U.S. presidential contender Nikki Haley has enjoyed a bump in support among voters and donors over the last four months, and is now the lone challenger to former President Donald Trump for the Republican presidential nomination. If Haley can make a good showing in Tuesday's New Hampshire primary, it will keep her challenge viable. According to polling and analysis website 538, Trump holds the lead in the New England state with nearly 50% of likely primary voters planning to cast a ballot for the former president. Haley is in second place with nearly 37% support. Here are some facts about Haley's life and political career: DAUGHTER OF IMMIGRANTS Haley, 52, gained a reputation in the Republican Party as a solid conservative who has the ability to address issues of gender and race in a more credible fashion than many of her peers. At the same time, she has drawn criticism for her ambiguous positions on some major policy issues. She is the daughter of two immigrants from India who ran a clothing store in rural South Carolina, and has spoken occasionally about the discrimination her family faced. Haley graduated from Clemson University in 1994 with a degree in accounting, and helped expand her parents' clothing business. She took on leadership roles in several business organizations before winning a seat in the South Carolina state legislature in 2004. She is married and has two children. SOUTH CAROLINA GOVERNOR Elected governor of South Carolina in 2010, Haley became the first woman to hold that post in the Deep South state and the second person of Indian descent to serve as a state governor in the United States. She received national attention in 2015 when she signed a bill into law removing the Confederate battle flag from the grounds of the South Carolina state Capitol following the murder of nine black churchgoers by white supremacist Dylann Roof. But she later received criticism from some elected officials for describing the flag as a symbol of heritage for some Southerners. Haley also appointed Tim Scott, then a U.S. representative from South Carolina, to the U.S. Senate in 2012. Scott was a rival for the presidential nomination, but he dropped out of the primary race in early November after struggling to gain traction in opinion polls and endorsed Trump. UNITED NATIONS AMBASSADOR Haley endorsed several rivals to Trump in the 2016 Republican presidential nominating contest, and occasionally tangled with him during the primaries. But she then went on to serve as his ambassador to the United Nations. During that time, the U.S. pulled out of the Iran nuclear deal, an accord that was unpopular with Republicans. 2024 PRESIDENTIAL CAMPAIGN Haley was among the first candidates to enter the race, throwing her hat into the ring last February. While she enjoyed a brief bump in opinion polls, she subsequently languished in the mid- to lower single digits in most national and state-level surveys, until the first debate gave her a measurable boost starting in late August. She still has just a fraction of the support for Trump. In late November, she received a major boost when the conservative political network led by billionaire Charles Koch endorsed her bid. She has tried to distinguish herself as the most capable contender on foreign policy. While almost all Republican candidates have staked out a tough position on China, Haley's unabashed support for Ukraine represents a contrast with Trump, who says the conflict is not central to U.S. national security. At year's end she drew rebukes from Democrats and some of her rivals when, in answer to a question, she declined to say that slavery was one of the main causes of the U.S. Civil War, an omission she sought to correct a day later. In the Iowa caucus on Jan. 15 - the first Republican nominating contest - Haley came in third behind Florida Governor Ron DeSantis; both were far behind Trump. DeSantis dropped out of the race on Sunday. RELATIONSHIP WITH TRUMP Since leaving the Trump administration in 2018, Haley has had an up-and-down relationship with the former president. She criticized Trump after his supporters attacked the U.S. Capitol on Jan. 6, 2021, in an attempt to overturn his 2020 election loss to Democrat Joe Biden, but later said Trump has an important role to play in the Republican Party. \nHaley later criticized Trump after his indictment in June for mishandling sensitive national security information, saying that if the information laid out in the indictment is true, it is \"incredibly dangerous to our national security.\" On the campaign trail, she rarely discusses Trump's temperament or character, though she frequently accuses him of being too soft on America's adversaries, including China, North Korea and Russia."
}