{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0T0O8_L.jpg",
  "title": "US calls for 'fundamental changes' before UNRWA funding resumes",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 30, 2024 01:48PM ET",
    "Updated Jan 30, 2024 08:21PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Mark Jannetty",
        "2024-01-30 18:55:35",
        "Gaza is getting the help it needs",
        "https://www.investing.com/members/241633026"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/us-says-fundamental-changes-needed-before-unrwa-funding-resumes-3287374",
  "paragraph": "© Reuters. A Palestinian woman holds a placard during a protest against the suspension of UNRWA funding by some Western states, in front of the United Nations Palestinian aid agency UNRWA's building in Beirut, Lebanon January 30, 2024. REUTERS/Mohamed Azakir\nBy Michelle Nichols UNITED NATIONS (Reuters) -The United States said on Tuesday that the U.N. agency for Palestinian refugees needs to make \"fundamental changes\" before Washington will resume funding that was halted over Israeli accusations that some agency staff took part in the Oct. 7 attack by Hamas militants. U.S. Ambassador to the U.N. Linda Thomas-Greenfield welcomed a U.N. inquiry into the accusations against staff at the United Nations Relief and Works Agency for Palestine Refugees in the Near East (UNRWA) and a planned agency review. She also said the U.S. was seeking more detail from Israel about the allegations. She described \"fundamental changes\" as: \"We need to look at the organization, how it operates in Gaza, how they manage their staff and to ensure that people who commit criminal acts, such as these 12 individuals, are held accountable immediately so that UNRWA can continue the essential work that it's doing.\" The accusations became public on Friday when UNRWA announced it had fired some staff after Israel provided the agency with information. U.N. Secretary-General Antonio Guterres said on Sunday that of 12 people implicated nine were fired, one is dead, and the identity of the remaining two was being clarified. The United States - UNRWA's biggest donor - temporarily paused its funding, along with a cascade of other countries. U.S. State Department spokesperson Matthew Miller said on Tuesday that Washington provides $300-400 million a year. Miller said that in the current fiscal year, which began in October, the U.S. had so far provided about $121 million to UNRWA. Guterres met with dozens of UNRWA donors in New York for more than two hours on Tuesday to discuss the U.N. action being taken in response to the Israeli allegations and hear concerns. Several ambassadors described the meeting as constructive.  Guterres appealed to countries who had suspended UNRWA funding to reconsider and to \"other countries, including those in the region, also to step up to the plate,\" Palestinian U.N. envoy Riyad Mansour told reporters after the meeting.  China's U.N. Ambassador Zhang Jun said Guterres shared information with donors about the individual accusations made against UNRWA staff.  \"We are at a very critical moment in coping with the humanitarian catastrophe in Gaza and the war is still going on ... we should not allow these individual cases to dilute our attention in pursuing a ceasefire,\" Zhang told reporters.  'NO SUBSTITUTION' An Israeli intelligence dossier, seen by Reuters on Monday, includes accusations that some UNRWA staff took part in abductions and killings during the Oct. 7 raid that sparked the Gaza war and alleges some 190 UNRWA employees have doubled as Hamas or Islamic Jihad militants.  The Palestinians have accused Israel of falsifying information to tarnish UNRWA.  U.N. spokesman Stephane Dujarric said on Tuesday that Israel has not yet shared the intelligence dossier with the U.N.  UNRWA employs 13,000 people in Gaza, running the enclave's schools, its primary healthcare clinics and other social services, and distributing humanitarian aid. \"Every year, UNRWA shares its list of staff with the host countries where it works,\" said Dujarric. \"For the work that it does in Gaza and the West Bank, UNRWA shares the list of staff with both the Palestinian Authority and with the Israeli government, as the occupying power for those areas.\" Earlier on Tuesday, the U.N. Security Council expressed concern about the \"dire and rapidly deteriorating humanitarian situation\" and urged all parties to work with U.N. Humanitarian and Reconstruction Coordinator for Gaza, Sigrid Kaag. \nThe statement by the 15-member council came after Kaag briefed the body behind closed doors for the first time since she was appointed about a month ago. Kaag said there was \"no substitution\" for the humanitarian role of UNRWA.  \"There is no way that any organization can replace or substitute the tremendous capacity, the fabric of UNRWA, the ability and their knowledge of the population in Gaza,\" Kaag told reporters after the briefing."
}