{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "One-month Gaza truce focus of intensive talks, sources say",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 23, 2024 04:43PM ET",
    "Updated Jan 24, 2024 04:07AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/exclusiveonemonth-gaza-truce-focus-of-intensive-talks-sources-say-3281081",
  "paragraph": "By Andrew Mills, Nidal al-Mughrabi, Ahmed Mohamed Hassan and Dan Williams DOHA/CAIRO/JERUSALEM (Reuters) -Israel and Hamas broadly agree in principle that an exchange of Israeli hostages for Palestinian prisoners could take place during a month-long ceasefire, but the framework plan is being held up by the two sides' differences over how to bring a permanent end to the Gaza war, three sources said. Intense mediation efforts led by Qatar, Washington and Egypt in recent weeks have focused on a phased approach to release different categories of Israeli hostages - starting with civilians and ending with soldiers - in return for a break in hostilities, the release of Palestinian prisoners and more aid to Gaza.  The latest round of shuttle diplomacy started on Dec. 28 and has narrowed disagreements about the length of an initial ceasefire to around 30 days, after Hamas had first proposed a pause of several months, said one of the sources, an official briefed on the negotiations.  However, Hamas has since refused to move forward with the plans until the future conditions of a permanent ceasefire are agreed, according to six sources. Most of the sources consulted for this story requested anonymity in order to speak freely about sensitive matters. While Israel has sought to negotiate one stage at a time, Hamas is seeking \"a package deal\" that agrees a permanent ceasefire before hostages are released during the initial phase, said one of the sources, a Palestinian official close to the mediation efforts. Israel and Hamas are speaking through the mediators, not talking directly. A White House spokesman said on Tuesday U.S. Middle East envoy Brett McGurk was in the region - for the second time in a week - for discussions about releasing hostages and that Washington would support a longer \"humanitarian pause\".  The U.S. State Department and White House, Qatar's foreign ministry and Egypt's State Information Service did not immediately respond to requests for comment.  Two Egyptian security sources said that there was work underway to convince Hamas to accept a one-month truce to be followed by a permanent ceasefire. However, Hamas is requesting guarantees that the second phase of the deal would be carried out, in order to agree to the initial truce, the sources said.  The sources did not provide details of what such guarantees might consist of.  Asked about the negotiations, senior Hamas official Sami Abu Zuhri told Reuters on Monday the organization was open to discussing ideas but that no deal was yet in place.  \"We are open to all initiatives and proposals, but any agreement must be based on ending the aggression and the occupation's complete pullout from Gaza Strip,\" said Abu Zuhri.  One offer by Israel is to end the war if Hamas removes six senior leaders from Gaza, said a seventh source, a senior Hamas official. However, Hamas \"absolutely\" rejected the proposal, he said.  The source said the list included the masterminds of Hamas' Oct. 7 attacks on Israel, Yahya Sinwar and Mohamed al-Deif, who are Israel's top targets to kill or capture in the war and are thought to be hiding deep within Hamas' extensive network of tunnels beneath Gaza.  Reuters was not immediately able to confirm this proposal with Israeli sources. Israeli Prime Minister Benjamin Netanyahu's office declined a request for comment about the proposal or the broader negotiations. According to recordings leaked to Israel's N12 news network, Netanyahu said such a \"surrender and exile\" scenario was being discussed in early January.  NETANYAHU UNDER PRESSURE  Almost four months after the Hamas attack on southern Israel that killed around 1,200 people, Israel's offensive in Gaza has yet to eliminate Hamas' senior leadership or its capacity to fight, despite razing much of the coastal enclave and killing more than 25,000 Palestinians. Netanyahu reiterated this week that only \"total victory\" over Hamas would bring an end to the war, but he is under increasing pressure to reach a deal, including from members of his war cabinet and the families of around 130 hostages who remain in captivity since the Hamas incursion. Israel's military on Monday suffered the highest daily death toll of its Gaza offensive with 24 fatalities, including 21 in a rocket-propelled grenade (RPG) attack in central Gaza and three elsewhere. Five of the sources said Israel had refused to discuss any end to the war that did not include Hamas being dismantled. They did not specify if exiling the leadership would meet that bar. Israeli government spokesperson Eylon Levy said at a press conference on Tuesday that efforts were ongoing to secure the hostages' release. He said Israel would not agree to a ceasefire deal that leaves Hamas in power in the enclave.  Qatar and Washington were instrumental in negotiating a week-long truce in November that led to the release of more than 100 hostages and around 240 Palestinian prisoners. Starting on Dec. 28, Qatar's negotiators sent the framework of a new agreement to Hamas and Israel, asking both sides to indicate what they were prepared to agree to, the official briefed on the negotiations said. When the two sides responded earlier this month, Hamas sought a truce that would last several months, while Israel wanted all the hostages freed in weeks, the official said. Over the past few weeks, U.S. and Qatari mediators have drawn the two sides closer to agreeing the 30-day process, which would include the release of all hostages, entry of more aid to Gaza and the release of Palestinian prisoners, the official said.  Despite the difficulty of bridging the gap in positions, one of the sources, briefed on the discussions, described the talks as intensive and said a deal could be agreed \"at any minute.\" U.S. DIPLOMATIC EFFORTS Washington is ratcheting up diplomatic pressure to end the violence. Earlier in January, U.S. Secretary of State Antony Blinken shuttled between Arab states and Israel on a frenetic tour aimed at finding a way forward from the bloodshed.  However, Hamas is seeking guarantees that Israel will not restart the conflict, a U.S. source briefed on the matter and the Palestinian official said.  Hamas wants the United States, Egypt and Qatar to guarantee the implementation, and is concerned that Netanyahu's government would resume fighting once Hamas frees civilian hostages, even if Israeli soldiers remain captive, the Palestinian official said. During this round, Hamas had sought the release of all Palestinian prisoners from Israel's prisons, including those that participated in the Oct. 7 attacks, the U.S. source said. The official briefed on the talks said Hamas had since softened that demand, which would likely be vehemently opposed by Israel.  \nHamas believes that before seriously talking about a long-term ceasefire, Israel wants to conclude its operations in Khan Younis, the southern city in Gaza that has seen the most intense offensive and fighting in recent weeks, the Palestinian official said. Reuters could not immediately establish the status of discussions about whether Israel's troops and armour would remain in Gaza during any prolonged ceasefire."
}