{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK010JV_L.jpg",
  "title": "Hezbollah chief says group 'cannot be silent' after Hamas leader's killing, warns Israel against spreading Gaza war",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 02, 2024 05:14PM ET",
    "Updated Jan 03, 2024 02:22PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/gaza-war-spreads-to-beirut-with-killing-of-hamas-deputy-leader-3265794",
  "paragraph": "2/2\n© Reuters. Water is sprayed on a damaged building at the site of an explosion, in what security sources say is an Israeli drone strike, in the Beirut suburb of Dahiyeh, Lebanon January 2, 2024. REUTERS/Mohamed Azakir \n2/2\nBy Mohammad Azakir, Nidal al-Mughrabi and Arafat Barbakh BEIRUT/CAIRO/GAZA (Reuters) -The head of Lebanon's Hezbollah said on Wednesday it \"cannot be silent\" after the killing of Hamas' deputy leader in Beirut and warned that his heavily armed forces would fight to the finish if Israel chose to extend war from Gaza to Lebanon. Israeli forces meanwhile kept up their aerial and ground blitz against Hamas militants in Gaza and told civilians to leave a refugee camp in the north of the Palestinian enclave. Israel, which has laid waste to the Gaza Strip in an onslaught to wipe out its ruling Hamas group, has neither confirmed nor denied that it assassinated Saleh al-Arouri in a drone strike in the Lebanese capital on Tuesday.  But its military spokesperson said Israeli forces were in a high state of readiness and prepared for any scenario. Arouri's killing was a further sign that the nearly three-month-old Israel-Hamas war was spreading well beyond Gaza, drawing in the Israeli-occupied West Bank, Hezbollah forces on the Lebanon-Israel border and even Red Sea shipping lanes. Arouri, 57, who lived in Beirut, was the first senior Hamas political leader to be assassinated outside Palestinian territories since Israel began its offensive against the Palestinian Islamist group in response to its deadly rampage from Gaza into Israeli towns on Oct. 7. In a televised speech in Beirut, Hezbollah leader Hassan Nasrallah vowed that his powerful Iran-backed Shi'ite militia \"cannot be silent\" in the wake of Arouri's killing, which he called \"a major dangerous crime\", though he made no concrete threats of action against Israel. Nasrallah said there would be \"no ceilings\" and \"no rules\" to Hezbollah's fighting if Israel launched full war on Lebanon. \"Whoever thinks of war with us, in one word, he will regret it. If war is launched against Lebanon, then Lebanon's national interests require that we take the war to the end.\" Hezbollah, a Hamas ally, has been embroiled in nearly daily exchanges of shelling with Israel across Lebanon's southern border since the Gaza war began. More than 120 Hezbollah fighters and two dozen civilians have been killed on Lebanese territory, as well as at least nine Israeli soldiers in Israel. Hezbollah and Israel last fought a major war in 2006 and it ended in essentially a stalemate. Analysts say Hezbollah has become a more formidable fighting force since with thousands of rockets, missiles and other heavy weaponry. The U.N. peacekeeping mission in south Lebanon warned that any escalation \"could have devastating consequences for people on both sides of the border\". Arouri's death removes a big name from Israel’s most-wanted list of top Islamist foes, but could drive Hamas' exiled leaders deeper into hiding, hampering efforts to negotiate further Gaza ceasefires and hostage releases. Hamas politburo member Hossam Badran said in a eulogy for Arouri: \"We say to the criminal occupation (Israel) that the battle between us is open.\" Israel had long accused him of orchestrating attacks on its citizens. But a Hamas official said he was also \"at the heart of negotiations\" conducted by Qatar and Egypt over the outcome of the Gaza war and the release of Hamas-held Israeli hostages.  Nasrallah also said Hamas' lightning incursion on Oct. 7 dealt a severe and deliberate blow to a process of normalisation between Israel and various U.S.-backed Arab governments unfolding since 2020, even after the collapse of talks on a Palestinian state in Israeli-occupied territory. Nasrallah spoke to commemorate four years since the killing of Iranian Revolutionary Guards top commander Qassem Soleimani in a U.S. drone strike in Iraq. Two explosions on Wednesday during a memorial ceremony at a cemetery in southeastern Iran where Soleimani is buried killed over 100 people, at a time of high tension between arch-enemies Iran and Israel. REFUGEE CAMP UNDER FIRE The total recorded Palestinian death toll from Israel's offensive had reached 22,313 by Wednesday - almost 1% of its 2.3 million population, 128 of them in the past 24 hours, the Gaza health ministry said. The war was triggered by a cross-border Hamas assault on Israeli towns on Oct. 7 in which Israel says 1,200 people were killed and some 240 hostages taken back to Gaza. Since then Israeli bombardments have flattened much of the densely populated enclave, wreaking a humanitarian disaster in which most Gazans have been left homeless, crammed into shrinking areas in hope of rudimentary shelter, and threatened by famine due to food shortages. In its daily briefing on Wednesday, the Israeli military said that \"intensive battles\" with militants continued in the main southern Gaza city of Khan Younis. It has said previously it is trying to flush out Hamas leaders in the area. Residents and Palestinian media said Israeli forces bombed Al-Nusseirat refugee camp in the northern part of the Hamas-run enclave overnight and into Wednesday, destroying several multi-floor buildings.  Israeli planes also dropped leaflets on Al-Nusseirat ordering people to leave seven districts. \"You are in a dangerous combat area. The IDF is operating heavily in your area of residence. For your safety the IDF urges you to immediately evacuate this area,\" the leaflets said. Israeli war planes and tanks also stepped up attacks on the Al-Bureij refugee camp in central Gaza. Residents said tanks that advanced from the east and north besieged two schools and soldiers took prisoner several people sheltering inside.  They also said snipers commandeering rooftops were firing from time to time against residents moving around. In Rafah near south Gaza's border with Egypt, medics said an Israeli missile strike on a house killed three people. The Gaza health ministry also said an Israeli air strike killed and wounded dozens in north Gaza's Jabalia refugee camp. \nThe Israeli military says it tries to avoid harm to civilians but blames Hamas for embedding fighters within residential areas, something the group denies. Hamas' armed wing said it had killed 10 Israeli soldiers in fighting in Al-Bureij and hit five tanks and troop carriers. The Israeli military said the number of its soldiers killed since its first incursion into Gaza on Oct. 20 had reached 177."
}