{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK000GW_L.jpg",
  "title": "Japan quake toll rises to 55 with many trapped under possibly thousands of homes",
  "category": "Stock market news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 01, 2024 04:06PM ET",
    "Updated Jan 02, 2024 12:30PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Ali Attas",
        "2024-01-02 06:02:27",
        "At 16:00 the bathroom door opened for the second time in a short span of time. I picked my iPhone and checked the wind speed. It showed 19 mph, “Pretty strong, I thought”. Stood up and went to close the door. Went to the kitchen and made myself a cup of coffee. Minutes later no sooner had I sat on the couch, drinking my coffee and unwinding away the turbulences of 2023, the bathroom door unlocked itself once more. Time 16:09. Stood up and suddenly felt ‘dizzy’. Dizziness doubled in intensity as my eyes noticed the string of switching on and off the ceiling light bulb was dancing away crazily! “Oh my God! It is an earthquake! And a mighty strong one as the string swayed some more. Walls were producing the familiar earthquake sounds. Quickly I tweeted on my Facebook page, “Huge earthquake shaking us on New Year!” Strange that three days before I had taken a video of a stunningly beautiful full moon hanging in the night sky and shimmering away gloriously!",
        "https://www.investing.com/members/200382224"
      ],
      [
        "Barry Nickerson",
        "2024-01-02 11:27:08",
        "Issues? Do you always lock the bathroom door when you're no in it?  Sit down on your couch, sipping coffee, during a major earthquake?  Run to Facebook, when you should be outside checking on people?  Or is this simply a sarcastic post by you, and I fell for it?",
        "https://www.investing.com/members/249373719"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/stock-market-news/at-least-six-dead-after-huge-earthquake-rocks-japan-on-new-years-day-3265148",
  "paragraph": "By Kiyoshi Takenaka, Sakura Murakami and Kantaro Komiya WAJIMA, Japan (Reuters) - A powerful earthquake that hit Japan on New Year's Day killed at least 55 people, with rescue teams struggling in freezing temperatures on Tuesday to reach coastal areas where many are feared trapped under possibly thousands of destroyed homes. In Suzu, a town of just over 5,000 households near the quake's epicentre, 90% of houses may have been destroyed, according to its mayor Masuhiro Izumiya. \"The situation is catastrophic,\" he said. The quake with a preliminary magnitude of 7.6 struck on Monday afternoon, prompting people in western coastal areas to flee to higher ground as tsunami waves swept cars and houses into the water. Around 200 tremors have been detected since the quake first hit on Monday, according to the Japan Meteorological Agency, which warned that more strong shocks could hit in coming days. A Coast Guard aircraft en route to deliver aid to the quake-hit region collided with a commercial airplane in Tokyo’s Haneda airport on Tuesday, killing five Coast Guard. All 379 on board the Japan Airlines flight escaped. Prime Minister Fumio Kishida said the extent of damage from the quake was becoming \"increasingly clear\" more than 24 hours after it struck on the Noto peninsula in Ishikawa prefecture. \"The government has deployed emergency rescue teams from the Self-Defence Forces, police and fire departments to the area and is doing its utmost to save lives and rescue victims and survivors, but we have received reports that there are still many people waiting to be rescued under collapsed buildings.\"  Kishida said some 3,000 rescuers were finding it difficult to reach the northern tip of the peninsula where helicopter surveys had discovered many fires and widespread damage to buildings and infrastructure. Japan sits on the \"Ring of Fire\" arc of volcanoes and oceanic trenches that partly encircles the Pacific Basin. It accounts for about 20% of the world's earthquakes of magnitude 6 or greater, and each year experiences up to 2,000 quakes that can be felt. Many rail services and flights into the quake area have been suspended. More than 500 people were stranded at Noto's airport which closed due to cracks in its runway and access road and damage to its terminal building.  Authorities have confirmed 55 deaths, all in Ishikawa prefecture, making it Japan's deadliest earthquake since 2016.  Many of those killed are in Suzu and Wajima, another city on the remote northern tip of the Noto peninsula. Scores more have been injured and authorities were battling blazes in several cities on Tuesday and hauling people from collapsed buildings.  \"I've never experienced a quake that powerful,\" said Wajima resident Shoichi Kobayashi, 71, who was at home having a celebratory New Year's meal with his wife and son when the quake struck, sending furniture flying across the dining room.  WRECKED HOMES Fujiko Ueno, a 73-year-old resident of Nanao city in Ishikawa, said nearly 20 people were in her house for a New Year celebration when the quake struck, splintering the walls which came crashing down on a parked car. Miraculously, no one was hurt. \"It all happened in the blink of an eye,\" she said, standing next to the crushed car on a road littered with debris and mud that oozed out from cracks in the surface. The pope and several world leaders sent condolence messages with President Joe Biden saying in a statement the United States was ready to provide any necessary help to Japan. The Japanese government ordered about 100,000 people to evacuate their homes on Monday night, sending them to sports halls and school gymnasiums, commonly used as evacuation centres in emergencies. Almost half of those evacuated had returned to their homes on Tuesday after authorities lifted tsunami warnings. But around 33,000 households remained without power in Ishikawa prefecture after a night when temperatures dropped below freezing. More than 100,000 homes have no water supply.  NUCLEAR PLANTS The quake also comes at a sensitive time for Japan's nuclear industry, which has faced fierce opposition since a 2011 earthquake and tsunami triggered nuclear meltdowns in Fukushima on the eastern coast. Whole towns were devastated and nearly 20,000 people were killed. Japan last week lifted an operational ban imposed on the world's biggest nuclear plant, Kashiwazaki-Kariwa, which has been offline since the 2011 tsunami. The Nuclear Regulation Authority said no irregularities were found at nuclear plants along the Sea of Japan, including five active reactors at Kansai Electric Power’s Ohi and Takahama plants in Fukui Prefecture. Hokuriku Electric's Shika plant, the closest to the epicentre, has also been idle since 2011. The company said there had been power outages and oil leaks following Monday's jolt but no radiation leakage. The company had previously said it hoped to restart the reactor in 2026. \nToshiba (OTC:TOSYY) said its local subsidiary Kaga Toshiba Electronics has stopped semiconductor production at its plant in Ishikawa to gauge the quake's impact on its facilities.  Chip equipment maker Kokusai Electric said it had found damage at its factory in Toyama and was investigating further ahead of the planned resumption of operations on Thursday."
}