{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0M0QR_L.jpg",
  "title": "Russia probing for Ukraine weaknesses as US funding stalls",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 23, 2024 03:01PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/russia-probing-for-ukraine-weaknesses-as-us-funding-stalls-3280971",
  "paragraph": "2/2\n© Reuters. FILE PHOTO: Ukrainian servicemen attend mock anti-sabotage drills near the border with Russia, amid Russia's attack on Ukraine, in Sumy region, Ukraine January 20, 2024. REUTERS/Gleb Garanich\n2/2\nWASHINGTON (Reuters) - Russia's military is carrying out probing attacks with barrages of missiles and drones in an attempt to find weaknesses in Ukraine's military as U.S. funding for security assistance is tied up in Congress, a senior Pentagon official said on Tuesday. The efforts include use of ballistic missiles, cruise missiles and drones, and Russia has also sought to force Ukraine to expend precious ammunition, and air defenses, to counter the attacks.  \"They've not succeeded so far. Ukrainians have a lot of experience over the last few years on how to cope with these kinds of Russian assaults,\" Celeste Wallander, an assistant secretary of defense, told reporters.  Earlier on Tuesday, Russia fired 41 missiles at Ukrainian cities, according to Ukraine's air force, which said it destroyed 21 of them.  Wallander's remarks came as Republicans in Congress have blocked emergency funding that President Joe Biden has requested for Ukraine and threaten to force a partial shutdown of the government in an effort to push new security policies along the U.S.-Mexico border. Biden has requested $61.4 billion in additional funding to help supply Ukraine with weapons and replenish U.S. stocks as it nears the two-year mark of its war with Russia. The funds sought for Ukraine are part of a \"supplemental\" request that also includes $14.3 billion for Israel and $13.6 billion for border protection. Asked about whether the aid was creating shortfalls for Ukraine, Wallander said that U.S. allies have stepped up to help bridge some shortfalls. But she also acknowledged concerns inside Ukraine. \"They believe that units do not have the stocks and stores of ammunition that they require,\" Wallander said.  \"And that is one of the reasons we have been focusing on the need to answer Congress' questions so that they are able to move forward on (a) decision to pass the supplemental.\" \nRussia has carried out regular air strikes on cities and civilian infrastructure far behind the front lines since its invasion of Ukraine in February 2022. Its troops, meanwhile, are attacking in several parts along the sprawling eastern front and seeking to seize the initiative, Ukraine's military says."
}