{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0B00H_L.jpg",
  "title": "Quiet streets, fuel lines follow declaration of emergency in Papua New Guinea",
  "category": "World news",
  "publisher": "Investing.com",
  "date": [
    "Published Jan 11, 2024 08:32PM ET",
    "Updated Jan 12, 2024 04:45AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/quiet-streets-fuel-lines-follow-declaration-of-emergency-in-papua-new-guinea-3272954",
  "paragraph": "© Reuters. People take part in looting and arson during protests over a pay cut for police that officials blamed on an administrative glitch, in Port Moresby, Papua New Guinea January 10, 2024 in this screen grab obtained from social media video. Leo Manuai/via REUT\nBy Lewis Jackson SYDNEY (Reuters) -Soldiers and police patrolled the quiet streets of Port Moresby on Friday as people joined long lines for fuel a day after Papua New Guinea declared a state of emergency in response to a massive outbreak of rioting and violence.  Prime Minister James Marape declared a 14-day state of emergency late on Thursday, suspending several officials and putting more than 1,000 soldiers on standby, after a police and public sector protest over pay on Wednesday descended into rioting and looting that killed at least 20 people.  The city had returned to a \"new normal\" on Friday morning, with police and soldiers on the streets and long lines at petrol stations, according to Matt Cannon, who heads the local branch of not-for-profit emergency responder service St John Ambulance. \"We're expecting the supermarkets that are functioning to reopen today and I'm hearing they have increased security to cater for potentially large numbers of people,\" Cannon said.  The unrest was sparked when police and other public servants went on strike on Wednesday over a pay cut that officials later blamed on an administrative glitch.  Within hours, thousands thronged the streets looting and rioting against a backdrop of smoke and burning buildings. A mob also tried to break through the gates outside the prime minister's office. Fifteen people were killed in the rioting in the capital city Port Moresby and five were killed in Lae, in the country's north, according to Donald Yamasombi, deputy commissioner of specialist operations with the Papua New Guinea police. The death toll was earlier reported at 16. Yamasombi said 700 police and 120 soldiers patrolled Port Moresby on Friday along with several hundred reservists. \nThings were quiet on Friday morning, said Eddie Allo, who said he took the bus to Port Moresby General Hospital, where he works. Most vehicles on the roads were government-owned and many people were short on fuel because gas stations had been closed, he said.  \"Everything is at a standstill now,\" Allo said by phone. \"Not many people are on the street and the police and army are patrolling around the areas on foot. No looting is going on.\""
}