{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0O0N5_L.jpg",
  "title": "Rampant extortion reveals 'corrosive' hole in Mexico security strategy",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 25, 2024 10:58AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/rampant-extortion-reveals-corrosive-hole-in-mexico-security-strategy-3283251",
  "paragraph": "4/4\n© Reuters. Officers of the National Guard stand in formation at an area following villagers' bloody takedown of extortionists in Texcapilla, State of Mexico, December 11, 2023. REUTERS/Stringer/File Photo\n2/4\nBy Dave Graham MEXICO CITY (Reuters) - When farmers in a tiny Mexican village last month hacked to death suspected drug cartel members who were squeezing them for protection money, it shone a harsh light on one of the country's biggest security problems: extortion. While the government has reduced murders, extortion is far higher now than when President Andres Manuel Lopez Obrador took office in 2018, making it a major risk for the economy that has drawn relatively little scrutiny. Critics say Lopez Obrador's strategy of trying to contain violence by dialing down direct confrontation with gangs has fueled the malaise because it has given them more room to prey on businesses. \"Burgeoning extortion has not grabbed the headlines, but it's been the all-the-more corrosive fallout of a security strategy that never merited the label,\" said Falko Ernst, a senior analyst at the International Crisis Group. Lopez Obrador denies his strategy has fed impunity, but said after the villagers' bloody takedown of extortionists in Texcapilla, some 75 miles (120 km) southwest of Mexico City, that Mexico must fight the problem. His office did not respond to a request for comment on this story. Registered victims of extortion jumped nearly 60% from 6,895 in 2018 to 10,971 in 2023, during which period homicides fell by 12%, official data show. Business operators that refuse to pay extortion demands are generally threatened with violence against themselves, relatives or workers, or with destruction of their property. Pursuing an approach he calls \"abrazos, no balazos\" ('hugs not bullets'), Lopez Obrador argues violence is not solved with more violence, and that the answer lies in improving living standards with welfare spending and better wages so as to root out chronic poverty and inequality that feed crime. Security frequently tops polls of voters' chief concerns ahead of the June 2 presidential election to succeed Lopez Obrador, who under Mexican law cannot run again. Even some close allies of Lopez Obrador's chosen successor, former Mexico City Mayor Claudia Sheinbaum, the strong favorite to win, say criminals have felt emboldened on his watch. \"This has been the presidency when the other side (organized crime) has been most comfortable in the last 25 years,\" said an aide to Sheinbaum. \"That, or worse.\" Sheinbaum has defended the administration, while also pledging \"zero impunity\" and highlighting her own record on security in Mexico City, where murders fell far more sharply. Ernst, who closely monitors organized crime in some of Mexico's unruliest states, said policy under Lopez Obrador had at the very least implicitly signaled to gangs they had freedom to act provided they did not derail the official narrative that \"things are getting better.\" Most extortion is not reported for fear of reprisals. A recent study by a Mexican Senate think tank said Mexico suffers some 13,000 acts of extortion daily. Impunity has encouraged cartels to engage in a growing portfolio of \"extractivism\" that increasingly impacts basic foodstuffs, threatening economic stability, Ernst argued. One senior Mexican executive, who spoke on condition of anonymity, said his businesses were being targeted far more by organized crime than under any past government and had to make regular payments to keep running in some areas. Another related how his company simply wound up operations in one state rather than accede to extortioners' demands. Concurrently, Lopez Obrador has put billions of dollars worth of public infrastructure and traditionally civilian offices into military hands, stirring concerns the armed forces are being politicized and distracted from their core duties. \n\"People are fed up feeling they can't protect themselves,\" said Carlos Heredia, a political analyst at Mexico's CIDE think tank. \"There has objectively been a deep regression in the assertion of the state's authority.\" The Army did not respond to a request for comment."
}