{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0I0QY_L.jpg",
  "title": "Ethnic killings in one Sudan city left up to 15,000 dead - UN report",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 19, 2024 04:54PM ET",
    "Updated Jan 20, 2024 09:10AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/ethnic-killings-in-one-sudan-city-left-up-to-15000-dead--un-report-3278706",
  "paragraph": "© Reuters. FILE PHOTO: A 15-year-old victim of sexual violence in El Geneina, West Darfur, is seen outside a makeshift shelter in Adre, Chad, August 1, 2023. REUTERS/Zohra Bensemra/File Photo\nBy Michelle Nichols and Maggie Michael UNITED NATIONS/CAIRO (Reuters) -Between 10,000 and 15,000 people were killed in one city in Sudan's West Darfur region last year in ethnic violence by the paramilitary Rapid Support Forces (RSF) and allied Arab militia, according to a United Nations report seen by Reuters on Friday. In the report to the U.N. Security Council, independent U.N. sanctions monitors attributed the toll in El Geneina to intelligence sources and contrasted it with the U.N. estimate that about 12,000 people have been killed across Sudan since war erupted on April 15, 2023, between the Sudanese army and the RSF. The monitors also described as \"credible\" accusations that the United Arab Emirates had provided military support to the RSF \"several times per week\" via Amdjarass in northern Chad. A top Sudanese general accused the UAE in November of backing the RSF war effort. In a letter to the monitors, the UAE said 122 flights had delivered humanitarian aid to Amdjarass to help Sudanese fleeing the war. On Saturday, a UAE official told Reuters that it extended an invitation to the UN monitors to visit a field hospital in Amdjarass \"to learn firsthand about the humanitarian efforts undertaken by the UAE to help alleviate suffering caused by the current conflict\". The United Nations says about 500,000 people have fled Sudan into eastern Chad, several hundred kilometres south of Amdjarass.  Between April and June last year El Geneina experienced \"intense violence,\" the monitors wrote, accusing the RSF and allies of targeting the ethnic African Masalit tribe in attacks that \"may amount to war crimes and crimes against humanity\". The RSF has previously denied the accusations and said any of its soldiers found to be involved would face justice. The RSF did not immediately respond to a request for comment by Reuters.  \"The attacks were planned, coordinated, and executed by RSF and their allied Arab militias,\" the sanctions monitors wrote in their annual report to the 15-member Security Council. 'SHOT TO THE HEAD' Reuters last year chronicled the ethnically targeted violence committed in West Darfur. In hundreds of interviews with Reuters, survivors described horrific scenes of bloodletting in El Geneina and on the 30-km (18-mile) route from the city to the border with Chad as people fled. The monitors' report included similar accounts. They said that between June 14 and 17, some 12,000 people fled El Geneina on foot for Adre in Chad. The Masalit were the majority in El Geneina until the attacks forced their mass exodus. \"When reaching RSF checkpoints women and men were separated, harassed, searched, robbed, and physically assaulted. RSF and allied militias indiscriminately shot hundreds of people in the legs to prevent them from fleeing,\" the monitors said.  \"Young men were particularly targeted and interrogated about their ethnicity. If identified as Masalit, many were summarily executed with a shot to the head. Women were physically and sexually assaulted. Indiscriminate shootings also injured and killed women and children,\" according to the report.  Everyone who spoke to the monitors mentioned \"many dead bodies along the road, including those of women, children and young men.\" The monitors also reported \"widespread\" conflict-related sexual violence committed by RSF and allied militia. NEW FIREPOWER  The monitors said the RSF takeover of most of Darfur relied on three lines of support - Arab allied communities, dynamic and complex financial networks, and new military supply lines running through Chad, Libya, and South Sudan.  The U.N. missions for Chad, Libya and South Sudan did not immediately respond to a request for comment.  \"Complex financial networks established by RSF before and during the war enabled it to acquire weapons, pay salaries, fund media campaigns, lobby, and buy the support of other political and armed groups,\" wrote the monitors, adding that the RSF used proceeds from its pre-war gold business to create a network of as many as 50 companies in several industries.  Since the war started \"most of the gold which was previously exported to UAE, was now smuggled to Egypt,\" the monitors said. The new firepower acquired by the RSF \"had a massive impact on the balance of forces, both in Darfur and other regions of Sudan,\" the report found.  The RSF has recently made military gains, taking control of Wad Madani, one of Sudan's major cities, and consolidating its grip on the western region of Darfur. On Saturday, a UAE official reiterated denials that the country has been involved in military support to any of Sudan's rival parties.  \"The UAE has stressed that it is not supplying arms and ammunition to any of the warring parties, and does not take sides in the current conflict,\" the unnamed official said in a written statement to Reuters. In December the United States formally determined that warring parties in Sudan committed war crimes and that the RSF and allied militias had also committed crimes against humanity and ethnic cleansing.  \nThe war has left nearly half of Sudan's 49 million people needing aid, while more than 7.5 million people have fled their homes - making Sudan the biggest displacement crisis globally - and hunger is rising. The sanctions monitors told the U.N. Security Council that \"an excess of mediation tracks, the entrenched positions of the warring parties, and competing regional interests meant that these peace efforts had yet to stop the war, bring political settlement or address the humanitarian crisis.\""
}