{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBR02K_L.jpg",
  "title": "Iran's supreme leader leads funeral prayers for senior Guards adviser",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 28, 2023 12:40AM ET",
    "Updated Dec 28, 2023 04:06AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/irans-supreme-leader-leads-prayers-during-funeral-of-senior-guards-adviser-tv-3264218",
  "paragraph": "2/2\n© Reuters. A banner with a picture of the late senior adviser for Iran's Revolutionary Guards, Sayyed Razi Mousavi, who was killed by an Israeli airstrike in Syria, hangs off a building in Tehran, Iran December 27, 2023. Majid Asgaripour/WANA (West Asia News Agency)\n2/2\n(Reuters) -Iran's Supreme Leader Ali Khamenei led prayers on Thursday at the funeral of Sayyed Razi Mousavi, a senior Revolutionary Guards (IRGC) adviser killed in what Iran said was an Israeli air strike in Syria. State television said Khamenei paid tribute \"to this martyr's tireless struggle and called for his companionship with the guardians of God.\"  Mousavi was one of the most experienced and effective commanders of the resistance front, said Major General Hossein Salami, chief commander of the Revolutionary Guards Corps (IRGC). \"Our revenge for the martyrdom of Sayyed Razi will be nothing less than the removal of the Zionist regime,\" Salami said in a televised funeral speech, adding that he had defended the Muslim nation for almost 33 years. \"I am hopeful that soon, God permitting, the great and honorable Palestinian fighters will wipe out the geographical and political name of this evil and fake regime.\" Mourners chanted \"Death to America, Death to Israel”. Musavi’s body was flown from Syria to the holy Shi'ite city of Najaf in Iraq on Wednesday before being taken for burial in Tehran. An Israeli military spokesperson declined specific comment about Mousavi's death on Monday, but said it took whatever action was necessary to defend the country. \nSince the eruption of war between Israel and the Palestinian group Hamas on Oct. 7, Iran-backed groups have mounted operations against Israel, while others, including militias in Iraq, have threatened U.S. interests. For years, Israel has carried out attacks against what it describes as Iran-linked targets in Syria, where Tehran's influence has grown since it backed President Bashar al-Assad in the civil war that erupted in 2011."
}