{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0108Y_L.jpg",
  "title": "Weight-loss drugs: Who, and what, are they good for?",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 02, 2024 11:55AM ET",
    "Updated Jan 02, 2024 12:17PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/weightloss-drugs-who-and-what-are-they-good-for-3265704",
  "paragraph": "By Michele Gershberg (Reuters) - Powerful weight-loss medicines like Novo Nordisk (NYSE:NVO)'s Wegovy leapt into public view in 2023, from social media to doctors' offices and cocktail parties, offering a new way to address record obesity rates.  But extraordinary demand, and high prices, for these drugs will keep them out of reach in the coming year for many patients who are likely to benefit. The new drugs are known as GLP-1 agonists, which mimic the activity of a hormone that slows digestion and helps people feel full for longer. In clinical trials, people lost 15% to 20% of their body weight, depending on the drug. Nearly 120 million American adults could be eligible for treatment, while Novo says its target market is more than 760 million people with obesity worldwide. Researchers have also found the treatments can protect against heart and kidney disease, and are testing them for conditions such as Parkinson's and alcohol addiction. Yet Novo Nordisk can't make enough Wegovy to meet demand, and only sells it in a few of the world's wealthiest countries. Many people have turned instead to Novo's diabetes medicine Ozempic, which contains the same active ingredient, to shed pounds. That has created shortages of Ozempic and new insurance hurdles for the diabetes patients who need it.  Eli Lilly (NYSE:LLY) and Co just launched Zepbound, another GLP-1, for weight loss. Pharma industry rivals, including  Pfizer  Inc (NYSE:PFE) and AstraZeneca (NASDAQ:AZN) Plc, are also seeking to enter the market, which is forecast to reach $100 billion within a decade. They are testing versions that may be more convenient, with fewer side effects.  WHY IT MATTERS When drugs like Wegovy work, they can be life-changing for people whose weight increases their health risks, from diabetes to heart disease and kidney disease. Many patients have struggled for years with obesity, and found that changes to diet and exercise aren't sustainable on their own.  Still, the potential costs are extraordinary, with U.S. prices for Wegovy and Zepbound set above $1,000 per month. Current data suggest patients need to keep using them long-term to maintain their weight loss. Private health insurers are finding ways to delay or deny use of the medicines. Some physicians say they find it harder to get coverage for Black and Hispanic patients with obesity who rely on government health plans and face a greater risk of diabetes and other complications.  \"Are we going to have coverage for the majority of us, or is this just going to be a medication for the elites who can pay out of pocket?\" said Dr Andres Acosta, an obesity expert at the Mayo Clinic. Regulators are looking into reports of rare side effects, including a potential link to suicidal thoughts, while any long-term risks will take years to determine.  WHAT IT MEANS FOR 2024 These trends raise profound questions for doctors trying to figure out which of their patients need the drugs the most, and how to get them access. Dr Lauren Eberly, an assistant professor of cardiovascular medicine at the University of Pennsylvania's Perelman School of Medicine, found that use of GLP-1 drugs for diabetes was lower in Black, Asian and Hispanic patients using private health insurance than their white counterparts. She is working on a new study of coverage trends for weight loss. \"We're really worried about the inequities that this will perpetuate as a direct result of inaccessibility of these medicines, especially for more marginalized groups,\" Eberly said. Dr Lauren Oshman, an associate professor in the University of Michigan Department of Family Medicine, expects many patients will find themselves unable to afford the new weight-loss drugs in 2024. Doctors should understand all of the tools to treat obesity, from counseling to older, cheaper medications that lead to a smaller percentage of weight loss, but still provide a health benefit, said Oshman.  \"In some ways we can do a better job across the board in treating obesity,\" she said. Obesity experts say they must also consider who does not need the medications. By some estimates, up to 40% of people with obesity may not have other serious health risks. \n\"These should not be put in the water, or taken by people who don't really need them,\" said Dr Susan Yanovski, co-director of obesity research at the National Institute of Diabetes and Digestive and Kidney Diseases. For those who do, research is needed on how to maintain the weight-loss long-term and whether they can reduce, or stop, use of the drugs.  \"We don't only want to impact their weight,\" Yanovski said. \"Our ultimate goal is to impact how they feel and, potentially, how long they live.\""
}