{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0B05E_L.jpg",
  "title": "Russia condemns US and UK for 'irresponsible' strikes on Yemen",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 12, 2024 05:41AM ET",
  "comments": [
    1,
    [
      [
        "Ken Roth",
        "2024-01-12 20:23:47",
        "Russian hypocracy as usual considering russian daily bombi..ng of ukraine civilians.",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/russia-condemns-us-and-uk-for-irresponsible-strikes-on-yemen-3273309",
  "paragraph": "© Reuters. An aircraft takes off to join the U.S.-led coalition operation against military targets in Yemen, aimed at the Iran-backed Houthi militia that has been targeting international shipping in the Red Sea, from an undisclosed location, in this screengrab from \nBy Guy Faulconbridge and Filipp Lebedev MOSCOW (Reuters) - Russia condemned the United States and Britain on Friday for their military strikes on Yemen, which Moscow said amounted to an irresponsible adventure that risked sowing chaos across the entire Middle East. The United States and Britain launched strikes from the air and sea against Houthi military targets in Yemen in response to the Iran-backed movement's attacks on ships in the Red Sea since the start of the Israel-Hamas war in Gaza. Russia, an ally of Iran and a partner of key Arab powers, called for an urgent meeting of the United Nations Security Council on Friday to discuss the issue. \"We strongly condemn these irresponsible actions by the United States and its allies,\" Maria Zakharova, Russia's foreign ministry spokeswoman, told reporters. \"A large-scale military escalation in the Red Sea region could strike out the positive trends that have emerged recently in the Yemeni settlement process, as well as provoke a destabilisation of the situation throughout the Middle East.\" Russia, which has been criticised for what the West says is an illegal war in Ukraine, said the attack on Yemen took place without any mandate from the United Nations and was thus an illegal \"adventure\" by the United States and its allies.  Russia and China abstained on Wednesday from a U.N. Security Council resolution that demanded the Houthis immediately cease their attacks on shipping and noted the right of U.N. member states \"to defend their vessels from attack, including those that undermine navigational rights and freedoms\". \"You know that a (U.N.) resolution was adopted, we abstained, and the countries that carried out the strike attempted to provide an international legal basis for their actions,\" Kremlin spokesman Dmitry Peskov said. \"This attempt was unsuccessful, because the adopted resolution does not provide any right to carry out strikes, and, accordingly, from the point of view of international law, they are illegitimate.\" Russia said it shared the concerns of Saudi Arabia and others in the region over the strikes. Riyadh called for restraint and \"avoiding escalation\" after the strikes and said it was monitoring the situation with great concern. \"We share the concerns expressed by our regional partners, in particular from Saudi Arabia,\" Zakharova said.  Iran has also condemned the U.S.-led strikes as illegal and escalatory.  \nThe U.S. said Australia, Bahrain, Canada and the Netherlands supported the operation, and presented the strikes as part of an international effort to restore the free flow of trade in a key route between Europe and Asia that accounts for about 15% of the world's shipping traffic. A spokesman for Yemen's Houthis said there was no justification for the U.S.-British attack and said the group will continue targeting ships heading towards Israel.  (Reporting Guy Faulconbridge in Moscow and Filipp Lebedev in Tbilisi; Editing by Alex Richardson and Timothy Heritage)"
}