{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0201O_L.jpg",
  "title": "Japan quake survivors face freezing rain, threat of landslides",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 02, 2024 09:45PM ET",
    "Updated Jan 03, 2024 12:21PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/japan-quake-survivors-face-freezing-rain-threat-of-landslides-3265826",
  "paragraph": "5/5\n© Reuters. Evacuated people rest at a green house converted as an evacuation center, in the aftermath of an earthquake, in Wajima, Ishikawa prefecture, Japan January 2, 2024, REUTERS/Kim Kyung-Hoon\n2/5\nBy Kiyoshi Takenaka and Sakura Murakami WAJIMA, Japan (Reuters) -Rescuers raced against the clock on Wednesday searching for survivors of an earthquake in western Japan that killed at least 65, while evacuees continued to wait for further aid amid freezing temperatures and heavy rain. The quake with a preliminary magnitude of 7.6 struck the Noto peninsula on New Year's Day, levelling houses and cutting off remote areas from aid. Heavy rain was forecast in the quake-hit areas on Wednesday, raising fears of landslides that could further hinder efforts to free many more people still trapped under rubble. Severed roads, damaged infrastructure, and the remote location of the hardest-hit areas have complicated rescue efforts. The full extent of damage and casualties remains unclear two days after the quake. Satellite images from Maxar Technologies (NYSE:MAXR) showed extensive damage in coastal areas, revealing destroyed buildings and capsized boats. Ishikawa prefecture has confirmed 65 deaths, up from 55 late on Tuesday, making the earthquake the deadliest in Japan since at least 2016. Some cities have reported additional deaths, putting the total number of fatalities at 73, according to Kyodo news agency. Smaller quakes continue to hit the peninsula.  Firefighters from Osaka and Nara prefectures pressed on despite the rain and aftershocks in hard-hit Wajima city, searching for a woman trapped in a wooden structure squashed by a seven-floor building that toppled over in the quake and landed on its side.  The rescuers were removing rubble to try to reach the woman, who was not showing any vital signs, a firefighter said. They dashed out from under the collapsed building as an earthquake warning alarm sounded yet again on Wednesday evening. About 500 tremors have been detected since the first quake on Monday, according to the Japan Meteorological Agency. \"I am now 65 years old and I have experienced big earthquakes many times. But this earthquake was completely different from those other earthquakes,\" said Yuko, who said she was visiting family in Wajima for the holidays. She declined to give her surname. \"It was really scary and long. The way it shook was also unusual,\" she said.  The government opened a sea route to deliver aid and some larger trucks were now able to reach some of the more remote areas, Prime Minister Fumio Kishida told a press conference following a national disaster response meeting. \"It's been over 40 hours since the initial quake. This is a battle against time, and I believe now is a crucial moment in that battle,\" he said. In Suzu, a town of about 13,000 people near the quake's epicentre, 90% of houses may have been destroyed, its mayor said on Tuesday, calling the damage \"catastrophic\". NO FOOD OR WATER More than 33,000 people have evacuated their homes and some areas have no access to water or electricity and have spotty mobile signals, according to Ishikawa prefecture. The mayors of the hardest-hit cities demanded the government clear roads and deliver aid swiftly at a regional emergency disaster meeting held on Wednesday morning. \"Even those who narrowly escaped death can't survive without food and water,\" said Masuhiro Izumiya, the mayor of Suzu. \"We haven't received a single loaf of bread.\" Shigeru Sakaguchi, mayor of Wajima city, said he was grateful for the government's efforts but had received only 2,000 meals for some 10,000 evacuees so far. \n\"We provided assistance for the East Japan and Kumamoto earthquakes, but compared to other disasters the road situation into Wajima is very bad and I feel it's slower than usual for assistance to arrive,\" said Shunsaku Kohriki, a worker for the Tokushukai Medical Assistance Team.  Many roads were severed and several areas outside of the city centre could only be reached by helicopter, he added."
}