{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0F0AS_L.jpg",
  "title": "South Korea, US to start defence cost talks early, before US elections -media",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 16, 2024 03:50AM ET",
    "Updated Jan 16, 2024 05:41PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/south-korea-us-to-start-defence-cost-talks-early-before-us-electionsmedia-3274654",
  "paragraph": "© Reuters. FILE PHOTO: U.S. Secretary of State Antony Blinken and South Korean Foreign Minister Park Jin hold a joint press conference after their meeting at the Ministry of Foreign Affairs in Seoul, South Korea, November 9, 2023. REUTERS/Jonathan Ernst/Pool/File Ph\nBy Hyonhee Shin SEOUL (Reuters) -South Korea and the United States have agreed to start early talks on how to share the cost of keeping U.S. forces in the country in a bid to reach a deal before the possible reelection of Donald Trump as president, local media reported on Tuesday. Trump, who has emerged as the undisputed frontrunner for the Republican presidential nomination in the 2024 election, had during his presidency accused key Asian ally South Korea of \"free-riding\" on U.S. military might and demanded it pay as much as $5 billion a year for the U.S. deployment. Negotiations for the Special Measures Agreement were gridlocked for months under the Trump administration, and the deal was finalised when South Korea agreed to a 13.9% increase in its contribution, the biggest annual rise in nearly two decades. The agreement is set to expire in 2025, and Yonhap news agency as well as news service Newspim quoted unnamed diplomatic sources as saying South Korea and the United States had agreed to start talks this year on extending the deal to 2026 and beyond. Talks are usually held just before the existing deal is due to end. South Korean Foreign Ministry spokesman Lim Soo-suk declined to comment on the reports, saying the government would prepare for the next negotiations in a \"systematic, strategic\" manner. A spokesperson for the U.S. State Department said a delegation from its Office of Security Negotiations and Agreements visited South Korea from Dec. 11-17, 2023, to discuss implementation of the existing 11th Special Measures Agreement (SMA). \"We will work closely with (South Korea) to prepare for the negotiations of the 12th SMA,\" the spokesperson said in an emailed response to a Reuters query, while adding: \"We have not yet made any decisions on the specifics for negotiations.\" \nAmerican troops are deployed in South Korea as part of both nations' efforts to deter North Korea, which has been accelerating its nuclear and missile programmes.  South Korea began shouldering the costs of U.S. deployments, used to fund local labour, the construction of military installations and other logistics support, in the early 1990s."
}