{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0L0NE_L.jpg",
  "title": "Brazil to share intel, technology with Amazon nations at Manaus police hub",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 22, 2024 01:39PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/brazil-to-share-intel-technology-with-amazon-nations-at-manaus-police-hub-3279950",
  "paragraph": "By Anthony Boadle and Ricardo Brito BRASILIA (Reuters) - Brazil is moving ahead with the creation of an international security center in Manaus that will bring together Amazon (NASDAQ:AMZN) nations in policing the rainforest, sharing intelligence and chasing criminals, a senior Brazilian police officer said. A building has been rented and equipment is being purchased for the center that will have police representatives from the other seven countries of the Amazon Cooperation Treaty Organization (ACTO). The center will fight drug trafficking and the smuggling of timber, fish and exotic animals, as well as deforestation and other environmental crimes, Humberto Freire, head of the Federal Police's Environment and Amazon department, said in an interview on Friday. Illegal gold mining on protected reservations of Indigenous peoples like the Yanomami, will also be a priority, he said. Uniting the Amazon countries against criminal activity in the world's largest tropical rainforest is key to President Luiz Inacio Lula da Silva's effort to restore Brazil's environmental credentials after four years of soaring deforestation under his hard-right predecessor, former President Jair Bolsonaro. The Center for International Police Cooperation (CCPI), now scheduled to be up and running in the first quarter of this year, will be financed with 9 million reais ($1.8 million) from the Amazon Fund, a multinational donation effort started by Norway to help finance sustainable development in the Amazon. Brazil will share with its Amazon neighbors the technology the Federal Police is developing to trace the origins of gold illegally extracted by wildcat miners in the rainforest, Freire said. This technology, which should establish the \"DNA of gold,\" uses radioisotopes to determine what prospect the gold comes from by checking particles of the metal, ore or dirt against samples collected from gold mining areas across Brazil, a vast mapping process that is near completion, he said. \nACTO members will be asked to do the same mapping of samples on their countries, Freire said. The police developed the technology with the University of Sao Paulo and has 50 million reais from the Amazon Fund to implement a program that will require a radioisotope scan, possibly from Japan, and handheld radioisotope identification devices to be used in ports and airports, he said."
}