{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBS0ED_L.jpg",
  "title": "Three Gaza brothers say they were beaten, mistreated in Israeli detention",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 29, 2023 01:11PM ET",
    "Updated Dec 30, 2023 02:50AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Tom Saltzman",
        "2023-12-30 10:31:09",
        "The propaganda machine is working hard this morning.",
        "https://www.investing.com/members/200520915"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/three-gaza-brothers-say-they-were-beaten-mistreated-in-israeli-detention-3264785",
  "paragraph": "© Reuters. Smoke rises over Gaza, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, as seen from southern Israel, December 29, 2023. REUTERS/Violeta Santos Moura\nBy Saleh Salem and Bassam Masoud GAZA (Reuters) -Three Palestinian brothers rounded up by Israel in the Gaza Strip said they and fellow detainees were beaten, stripped to their underwear, burnt with cigarettes and subjected to other forms of mistreatment during their detention. Sobhi Yaseen, his brothers Sady and Ibrahim were among dozens of Palestinian men sheltering in a school in Rafah in southern Gaza who spoke to Reuters about their treatment at the hands of Israeli soldiers. Reuters could not independently confirm their accounts, which were consistent with descriptions from more than 20 other former detainees who spoke on condition of anonymity. The Israeli Defence Forces spokesperson's office said in a written response that the Israeli military was operating \"to dismantle Hamas' military capabilities\" and rescue hostages captured by the Palestinian militant group.  Detainees were treated in accordance with international law, and were often required to hand over clothes to ensure they were not carrying weapons or explosives, the office said.  The Yaseen brothers said they had been taken from their homes in the north of the enclave, separated from their families and held for up to two weeks at unknown locations including a military barracks or camp. Sobhi said he and his brothers were detained in early December after the Israeli military encircled the area where they lived and worked as day labourers in Gaza City's Zeitoun neighbourhood. He said four people beat him after he was unable to climb onto a truck due to a leg injury sustained before his arrest, and that he was then taken to an open area where captors were \"smoking and putting out cigarettes on our backs, spraying sand and water on us, urinating on us\". His brothers Sady and Ibrahim gave similar accounts of mistreatment at the hands of Israeli soldiers. Reuters could not independently confirm their accounts.  TREATMENT OF CIVILIANS Israel launched its assault on the Gaza Strip in retaliation for a shock cross-border incursion by Hamas militants on Oct. 7 that Israel says left 1,200 dead. More than 21,000 Palestinians have been killed in the Israeli campaign, according to authorities in the Hamas-controlled territory. The U.N. human rights office (OHCHR) said on Dec. 16 that it had received numerous reports of mass detentions, ill-treatment and enforced disappearance of Palestinians in northern Gaza by the Israeli military. International humanitarian law requires that civilians only be detained for imperative security reasons, and torture and other ill-treatment of detainees is strictly prohibited, OHCHR said. Images of detainees stripped to their underwear in Gaza earlier this month triggered outrage from Palestinian, Arab and Muslim officials.  U.N. rights chief Volker Turk has said Hamas' attack on Oct. 7, its holding of hostages, and Israel's \"collective punishment\" and \"unlawful forcible evacuation\" of civilians, all constitute war crimes.  The prosecutor of the International Criminal Court (ICC), which has since 2021 been investigating possible war crimes and crimes against humanity in the occupied Palestinian territories, has called on Israel and Hamas to respect the international rules of war. The ICC prosecutor's office said it was using all available means to ensure accountability for alleged crimes committed in the Palestinian territories including Gaza, but could not comment on specific allegations.  SCARS The Yaseen brothers sheltering at Rafah said the Israeli military had not made specific accusations against them. They were rounded up together, then separated, as part of group arrests carried out by Israel's military in areas that it advances into.  Sady said he was placed with other detainees in a truck containing garbage. \"They were beating us, and anyone who raised their voice after the beating was beaten again. They searched us, took our IDs, money, and phones,\" he said, speaking among a group of about 20 men in a tent at the Rafah school, most wearing grey tracksuits issued by the Israeli military. Some showed large scabs and raw skin on their wrists where they said their hands had been bound or cuffed, and one showed bruised streaks and a round red scar on his back. Another showed a stitched scar on his thigh where he said he had been beaten.  The third Yaseen brother, Ibrahim, described having his hands bound and being blindfolded as he was held for interrogation.  \"They didn't let us sleep. We stood for hours, as punishment,\" he said. Captors insulted the prisoners while banning them from talking to each other or praying, Ibrahim said. \"Then there would be five soldiers who would hit you alternately in the head and body,\" he added, saying he had been beaten in the ribs and rolling up his sleeves to show circular scars and scabs from where his wrists were bound.  \nThe Israeli military dropped the brothers off at different times at the Kerem Shalom crossing between Israel and the Gaza Strip, as it has done with other batches of men detained during its ground operation but no longer suspected of links to Hamas.  From there they said they walked several kilometres to Rafah, where they relocated each other among the hundreds of thousands of people have been displaced and are now living in overcrowded buildings and tents."
}