{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "Avalanche at California ski resort kills one person, injures another",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 10, 2024 04:19PM ET",
    "Updated Jan 10, 2024 09:30PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/avalanche-hits-california-ski-resort-not-yet-clear-if-people-trapped-3271821",
  "paragraph": "By Brad Brooks (Reuters) -One skier was killed and another received minor injuries in an avalanche at the Palisades Tahoe ski resort in California on Wednesday, officials said.  The Placer County Sheriff's Office said in a written statement that Kenneth Kidd, 66, was the person killed.  Both Kidd and the injured skier were guests of the resort and not employees, resort officials said. Two other people were hit by the avalanche but not injured. \"At this point in time, all search efforts have concluded,\" said Placer County Sheriff's Office spokesperson David Smith. \"There is nobody else up on the mountain.\" Palisades Tahoe, which was formerly known as Squaw Valley and was the site of the 1960 Winter Olympics, is located about 100 miles (161 km) northeast of San Francisco.  The avalanche took place around 9:30 a.m. PT (1730 GMT) in the \"GS gully\" area of the ski resort, just off its famed KT-22 ski lift that opened for the season on Wednesday. \"This is a very sad day for my team,\" Dee Byrne, president and chief operating officer of the resort, said at a press conference. \"This is a dynamic situation, we're still undergoing an investigation.\"  It was not immediately clear what triggered the avalanche, but heavy snows and high winds have pounded the mountainous area for the past day.  Michael Gross, vice president of mountain operations at Palisades Tahoe, said at the press conference that the resort's ski patrol had been carrying out avalanche assessments in the area where the slide took place since Sunday and deemed it safe to open to the public.  He said it was normal to open a ski run amid heavy snows.  The Placer County Sheriff's Office said in a statement that the avalanche debris field was approximately 150 feet (45.7 m) wide, 450 feet long and 10 feet deep."
}