{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "Haiti's kidnapped nuns freed after week in captivity -archbishop",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 25, 2024 09:44AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/haitis-kidnapped-nuns-freed-after-week-in-captivity-archbishop-3283137",
  "paragraph": "PORT-AU-PRINCE (Reuters) - Six Catholic nuns who were kidnapped in the Haitian capital nearly a week ago have been released alongside two more hostages, the archbishop of Port-au-Prince said in a statement late Wednesday. Armed gunmen hijacked a bus in Port-au-Prince on Friday and drove off, taking all of the passengers hostage, including six nuns belonging to the order of the Sisters of Saint Anne. \"The archdiocese of Port-au-Prince thanks the Lord for the liberation of the six religious sisters and the others who were kidnapped on Jan. 19,\" Archbishop Max Leroy Mesidor said. \"This traumatising event has, once more, tested our faith, but it remains unbreakable.\"  The statement did not say whether a ransom had been paid or give any detail on who might be responsible. The Vatican's official news outlet hailed the announcement on Thursday. \"This marks a sigh of relief for the Haitian church,\" it said. Pope Francis on Sunday had called for the release of hostages and said he was praying for an end to the violence in the Caribbean nation, which the United Nations estimates has killed over 4,700 people in the past year. Haiti is facing a worsening conflict between alliances of heavily armed gangs that control most of the capital and are expanding their territory to rural areas, bringing sexual violence, lootings and indiscriminate killings. Kidnappings meanwhile almost doubled from 2022 to nearly 2,500, as gangs target people on transport routes to extract costly ransoms from their friends and relatives. The release comes a day before a Kenyan court hearing set to decide on the legality of the African country leading a long-awaited U.N.-ratified force to Haiti that has been mandated to help the country's dwindling police force fight gangs."
}