{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0P01M_L.jpg",
  "title": "White House's Sullivan, China's Wang to talk ties, Taiwan in Bangkok",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 26, 2024 04:08AM ET",
    "Updated Jan 26, 2024 12:28PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/white-houses-sullivan-chinas-wang-to-talk-ties-taiwan-in-bangkok-3283775",
  "paragraph": "WASHINGTON/BEIJING (Reuters) -U.S.-China ties and Taiwan will be topics raised at a meeting between U.S. National Security Advisor Jake Sullivan and Chinese Foreign Minister Wang Yi in Bangkok, building on a pledge by the leaders of the world's two largest economies to deepen dialogue.  \"During the new round of meetings, (Wang) will state China's position on China-U.S. relations, including the Taiwan issue, and exchange views with the U.S. side on international and regional issues of common interest,\" a Chinese foreign ministry spokesperson told reporters at a regular press conference. The officials will meet on Friday and Saturday, a little more than two months after U.S. President Joe Biden and Chinese President Xi Jinping met for about four hours on the sidelines of the Asia-Pacific Economic Cooperation (APEC) summit in San Francisco.  Biden and Xi agreed to open a presidential hotline, resume military-to-military communications, and work to curb fentanyl production, but remained at odds over Taiwan, which China claims as its own territory over the strong objections of the Taipei government. Delivering on one of those agreements, U.S. and Chinese officials are expected to meet in Beijing next week to discuss the counter-narcotics issue, a person familiar with the plans told Reuters on Friday. The White House declined to comment. After a rocky start to ties in 2023, Washington and Beijing met more often in the second half of last year, as both countries sought to stabilize ties ahead of Taiwan's presidential transition in May and a potentially caustic 2024 U.S. election campaign. China's struggling economy may also dampen Beijing's appetite for what had been more combative ties with Washington.  \"This meeting continues the commitment by both sides at the November 2023 Woodside (OTC:WOPEY) Summit between President Biden and President Xi to maintain strategic communication and responsibly manage the relationship,\" Adrienne Watson, spokesperson for the White House National Security Council, said in a statement. The Wang-Sullivan meeting is the latest between the two senior officials, who have sought in recent years to engage quietly away from reporters and cameras in an effort to lower temperatures in relations. Ryan Hass, a China expert at the Brookings Institution, said the low public profile of the meeting would allow Wang and Sullivan to discuss sensitive issues with confidence the exchange will remain private. \"Sullivan and Wang have invested considerable time together. They understand each other's constraints and priorities. This allows them to deepen their discussions with each passing exchange, rather than repeat talking points to each other,\" Hass said. \nSullivan, who reports directly to Biden, met with Thailand's Prime Minister Srettha Thavisin and Deputy Prime Minister Parnpree Bahiddha-nukara on Friday, according to a statement from the Thai foreign ministry. Both sides discussed cooperation on security, clean energy, trade and the crisis in Myanmar during the meeting."
}