{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK08038_L.jpg",
  "title": "Ecuador's president adds new questions to proposed referendum focused on crime",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 08, 2024 10:14PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/ecuadors-president-adds-new-questions-to-proposed-referendum-focused-on-crime-3269932",
  "paragraph": "© Reuters. Ecuador's President Daniel Noboa attends an interview with Reuters, in Quito, Ecuador December 15, 2023. REUTERS/Karen Toro/File Photo\nBy Alexandra Valencia QUITO (Reuters) - Ecuadoreans will be asked to weigh in on an expanded list of questions proposed by President Daniel Noboa, including a push to allow for extraditions of citizens accused of crimes in other countries, according to a government statement on Monday. Early last year, voters rejected a similar attempt at undoing the South American country's ban on extraditions. The plebiscite, which still needs approval from the country's top court, would largely focus on boosting the government's crime-fighting efforts, including allowing for asset seizures from suspected criminals and yanking illegal mining concessions implicated in other crimes such as drug trafficking. The president's proposed referendum seeks to unite the country \"in one fist that can confront the criminal element that wants to defeat the government,\" according to the statement. Other potential questions would aim at pro-business measures like allowing for arbitration to resolve contractual conflicts as well as hourly employment options. The renewed push comes as Ecuador's security situation remains delicate, with Noboa moving earlier on Monday to declare a state of emergency for two months in the wake of a disappearance and possible escape of a high-profile gang leader. Noboa took office in November after winning a special election on pledges to reduce surging violence and increase job creation.  Last week, he submitted an earlier list of draft questions for the referendum in a letter to the country's Constitutional Court, which must approve the plebiscite. \nNoboa has said he would like voters to weigh in by March. The president's earlier package of questions would have sought approval from voters on lengthening prison sentences for crimes including homicide and arms trafficking, in addition to authorization for Ecuador's military to combat criminal groups."
}