{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0A02E_L.jpg",
  "title": "China, Taiwan opposition warn of threat to peace from ruling party candidate",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 11, 2024 12:26AM ET",
    "Updated Jan 11, 2024 11:12AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/china-taiwan-opposition-warn-of-threat-to-peace-from-ruling-party-candidate-3271960",
  "paragraph": "© Reuters. Lai Ching-te, Taiwan's vice president and the ruling Democratic Progressive Party's (DPP) presidential candidate, arrives to an election campaign event in Kaohsiung, Taiwan December 22, 2023. REUTERS/Ann Wang/File Photo\nBy Ryan Woo and James Pomfret BEIJING/TAIPEI (Reuters) -China and Taiwan's largest opposition party, the Kuomintang (KMT), warned on Thursday of the danger Taiwan's ruling party presidential candidate Lai Ching-te could pose to peace if he wins election this weekend. Taiwan will hold a pivotal presidential and parliamentary election on Saturday, which is being closely watched internationally amid geopolitical tensions. China claims Taiwan as its own territory, to the objections of Taiwan's government. China has not publicly named a preferred candidate or specified what the right choice is, but has framed the vote as a decision between war and peace. China and the KMT have said the Democratic Progressive Party's Lai is a dangerous supporter of the island's formal independence. Lai has repeatedly offered talks with China but has been rebuffed.  He says only Taiwan's people can decide their future. China's Taiwan Affairs Office said in a statement that Lai is an \"obstinate Taiwan independence worker\" and that if he came to power he would further promote separatist activities. \"I sincerely hope the majority of Taiwan compatriots recognise the extreme harm of the DPP's 'Taiwan independence' line and the extreme danger of Lai Ching-te's triggering of cross-Strait confrontation and conflict, and to make the right choice at the crossroads of cross-Strait relations,\" it said. Taiwan's Foreign Ministry responded by condemning China for \"once again blatantly intimidating the Taiwanese people and the international community\" and seeking to affect the election.  China has never renounced the use of force to bring Taiwan under its control and has during the past four years stepped up military activity around the island, regularly sending warplanes and warships into the Taiwan Strait. The KMT, which traditionally favours closer ties with China but denies being pro-Beijing, has also denounced Lai as an independence supporter. Speaking to foreign reporters in Taipei's sister city, New Taipei, on Thursday, KMT vice presidential candidate Jaw Shaw-kong said that if Lai won, tensions would most likely rise even before May 20, when President Tsai Ing-wen hands over power to her successor. \"Tsai Ing-wen is more low key, not shouting every day about 'I'm for Taiwan independence' and the Taiwan Strait is already so tense. If Lai Ching-te wins, do you think the cross-strait situation will be better than it is now?\" Lai's campaign team said Jaw was aligning with China's interests and parroting its positions, as well as \"spreading fear of war\".  \"All Jaw Shaw-kong is thinking about is unification\" with China, said DPP spokesperson Tai Wei-shan. Speaking at a Thursday evening rally that drew more than 200,000 supporters, Lai said Taiwan was already a fortress of democracy and freedom, and that people should choose the right person and the right democratic path. \"Peace depends on strength. It is not based on the goodwill of the aggressor,\" he told the cheering crowds. He also promised to \"maintain the status quo without being humble or arrogant, to protect the country's survival and development.\" Lai has previously said he does not seek to change Taiwan's formal name, the Republic of China. The republican government fled to the island in 1949 after losing a civil war with Mao Zedong's Communists, who established the People's Republic of China. The DPP has portrayed the KMT and its presidential candidate, Hou Yu-ih, as pro-Beijing. \nHou, sitting next to Jaw, said he wouldn't touch the issue of \"unification\" with China during his term in office if elected, while maintaining the status quo and encouraging communication with China but also opposing the \"one country, two systems\" autonomy model Beijing has offered to Taiwan. \"I firmly uphold Taiwan's democratic and free system; this is the middle path that Taiwan should take,\" Hou said, pledging to ensure strong defences to give China pause if it were considering an attack. \"When the Taiwan Strait is stable, Taiwan is safe, and the world can be at ease.\""
}