{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK080QV_L.jpg",
  "title": "US congressional panel seeks documents from Harvard in antisemitism probe",
  "category": "General",
  "publisher": "Reuters",
  "date": [
    "Published Jan 09, 2024 02:34PM ET",
    "Updated Jan 09, 2024 03:01PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/general/us-congressional-panel-seeks-documents-from-harvard-in-antisemitism-probe-3270609",
  "paragraph": "© Reuters. FILE PHOTO: Harvard University sits as leaders of various universities, including Harvard President Claudine Gay, have taken heat from both Jewish communities, which have said they are tolerating antisemitism, and Pro-Palestinian groups, which have accuse\nBy Kanishka Singh WASHINGTON (Reuters) - A U.S. House of Representatives panel on Tuesday asked Harvard University for a list of documents in relation to a probe on antisemitism at the school, and gave Harvard two weeks to produce the records. Republican Representative Virginia Foxx, who chairs the House Education and the Workforce Committee, sent a letter to Harvard Corporation Senior Fellow Penny Pritzker and interim President Alan Garber requesting the documents. Harvard and other U.S. colleges have simmered with tension over responses to the Oct. 7 Hamas attack on Israel and Israel's subsequent offensive in Gaza. Foxx said the panel, which last month also opened a review of Harvard's handling of allegations of plagiarism by its then-president, wanted documents on all reports of antisemitic incidents on campus since January 2021, disciplinary processes to address allegations of hate and bias, and Harvard's response to recent pro-Palestinian protests and activities.  The documents requested include any list of \"posts by Harvard students, faculty, staff, and other Harvard affiliates on Sidechat and other social media platforms targeting Jews, Israelis, Israel, Zionists, or Zionism.\"  A Harvard University spokesperson said the university was reviewing the letter and will be in touch with the committee over its request. The House committee, in its letter, cited the oversight powers of Congress \"derived from the U.S. Constitution. \"Under House Rule X, the Committee has legislative and oversight jurisdiction over 'education or labor generally,'\" the letter said. The committee, in its letter to Harvard last month over its plagiarism probe, had noted that \"federal funding to Harvard is conditioned upon the school’s adherence to the standards of a recognized accreditor,\" and the need to show that it \"works to prevent cheating and plagiarism.\" Some critics of Israel, its occupation of territory internationally recognized as Palestinian, and its isolation of the Gaza Strip, have said they risk being unfairly branded if criticism of Israel's policies were labeled antisemitic. Others like the World Jewish Congress argue that anti-Zionism is antisemitic because it seeks to deny Jewish people \"the right to self-determination in their ancestral homeland.\"  Claudine Gay resigned as president of Harvard last week following the allegations of plagiarism and backlash over her congressional testimony on antisemitism. Gay and two other university presidents who also testified had declined to give a definitive \"yes\" or \"no\" answer to a question on whether calling for the genocide of Jews would violate their schools' codes of conduct regarding bullying and harassment, saying it would have to be balanced against free-speech protections. University of Pennsylvania President Liz Magill also resigned following the congressional hearing. \nRights advocates note that antisemitism and Islamophobia have risen sharply in the U.S. since Oct. 7 when Palestinian Islamist group Hamas attacked Israel, killing 1,200 people, according to Israeli tallies.  Israel's subsequent assault on Gaza has killed more than 22,000 Palestinians, according to Gaza's health ministry."
}