{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0T0D9_L.jpg",
  "title": "Belgian farmers block roads to Zeebrugge port as French protests spill over",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 30, 2024 08:56AM ET",
    "Updated Jan 30, 2024 06:27PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/belgian-farmers-to-block-zeebrugge-port-as-french-protests-spill-over-3287065",
  "paragraph": "5/5\n© Reuters. Belgian farmers use their tractors to block the Brussels ring as they protest over price pressures, taxes and green regulation, grievances shared by farmers across Europe, in Halle, Belgium January 29, 2024. REUTERS/Yves Herman\n2/5\nBRUSSELS (Reuters) -Belgian farmers angry about rising costs, EU environmental policies and cheap food imports plan blocked access roads to the Zeebrugge container port on Tuesday.  Farmers organising the protest told Reuters they planned to bar access to the North Sea port, the country's second-largest, for at least 36 hours. They said the port was targeted because they feel it receives economic support at the expense of farmers. A port authority spokesman said protesters had blocked five roads to trucks, but were letting cars through. He said it was not yet clear what the consequences on the operations of the port would be, and the port was indirectly in touch with the organisers through the police. The Algemeen Boerensyndicaat (ABS, General Farmers Syndicate) union has called on its members to join the protest. \"The farmers are desperate, really desperate. We've warned the government for years that this would happen,\" ABS policy officer Mark Wulfrancke said. Wulfrancke urged policymakers to ensure the price of food reflects the additional costs European farmers face to comply with Europe's rising environmental standards. \"We want respect from our government, the European government. The only way to show that respect is to make a policy that is farmer friendly, food friendly. We need a correct price,\" he told Reuters. The Belgian protest movement has been boosted by similar action in France, where farmers have set up dozens of roadblocks and disrupted traffic around Paris, putting the government under pressure.  Belgian farmers also disrupted traffic during the morning rush hour on Tuesday. One of the blockades was close to the Dutch border on the E19 highway, media said. Prime Minister Alexander De Croo is set to meet with farmers' associations on Tuesday. \"It is important that they are listened to,\" De Croo told reporters, referring to the challenges farmers face. He said Belgium, which currently holds the six-month presidency of the Council of the EU, will discuss a number of European agricultural rules with the European Commission. A group of farmers blocking a square in central Brussels with tractors said they would stay put until at least Thursday, when EU government leaders meet in the city. \"We are asking them to review their laws,\" said Nicolas Fryers, a farmer at the protest. \"They talk about being greener but if that happens then there will be land which isn't worked any more and it's difficult enough as it is.\" \nThe European Commission appeared poised to offer some policy changes in response, by proposing an exemption on Thursday on rules requiring farmers to leave part of their land fallow if they apply for EU subsidies. The rules on fallow land were part of the grievances that led to protests in France and elsewhere in recent weeks."
}