{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0P0O7_L.jpg",
  "title": "Alabama will help bring nitrogen asphyxiation executions to other states",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 26, 2024 01:24PM ET",
    "Updated Jan 27, 2024 04:15AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/alabama-will-help-bring-nitrogen-asphyxiation-executions-to-other-states-3284516",
  "paragraph": "2/2\n© Reuters. Vehicles are inspected by law enforcement at the Holman Correctional Facility gate before the scheduled execution by asphyxiation using pure nitrogen, of Kenneth Smith who is convicted for a murder-for-hire committed in 1988, in Atmore, Alabama, U.S. Janu\n2/2\nBy Jonathan Allen (Reuters) -Alabama offered assistance on Friday to other U.S. states seeking to carry out executions using asphyxiation by nitrogen gas, a few hours after pioneering the new method to kill Kenneth Smith, a prisoner condemned for a 1988 murder. The state also promised more to come in Alabama: Attorney General Steve Marshall said 43 other people on death row had chosen asphyxiation over lethal injections since lawmakers approved the method in 2018.  Alabama called the new method \"humane,\" while human rights groups condemned it as cruel and torturous. A spokesperson for U.S. President Joe Biden, a Democrat who campaigned on a promise he has not fulfilled of abolishing the federal death penalty, said the execution was \"troubling.\" \"Alabama has done it, and now so can you, and we stand ready to assist you in implementing this method in your states,\" Marshall, a Republican, told reporters on Friday.  Oklahoma and Mississippi lawmakers have added nitrogen asphyxiation to their states' allowed execution methods, but have not yet used it. Alabama has provided the Oklahoma Department of Corrections with an unredacted version of its new protocol, an Oklahoma spokesperson said. Marshall said asphyxiation by nitrogen, the first new execution method since lethal injections began in the U.S. in 1982, is \"no longer an untested method.\"  \"It is a proven one,\" he said.  Nearly half of U.S. states have abolished the death penalty, but for other states the main method remains lethal injections. Some states have found lethal injections increasingly difficult, struggling to find either the required drugs or a suitable vein in a prisoner, forcing them to contemplate other methods. There were diverging accounts as to how violent the aspyhxiation method was between state officials and some who witnessed Thursday evening's public execution of Smith, who, unusually, survived a first execution attempt in 2022 when executioners struggled to insert an intravenous line for a lethal injection. Alabama had predicted in court filings that, under its new method, Smith would slip into unconsciousness within about 30 seconds and die soon after. Executioners strapped a commercial industrial-safety respirator mask, made by a Canadian-owned safety product manufacturer called Allegro Industries, over the man's face and connected it to a canister of pure nitrogen. Five journalists allowed to watch the execution through a window as media witnesses said he remained conscious for several minutes after the nitrogen flowed, and then began shaking and writhing on the gurney for about two minutes. The Rev. Jeff Hood, who stood besides Smith as his spiritual adviser, said Smith repeatedly threw his head forward as he struggled for life. Alabama officials said everything went as expected. They said Smith appeared to hold his breath for as long as he could, and suggested the writhing could have been \"involuntary movements.\" \"What occurred last night was textbook,\" Marshall said. The Oklahoma Department of Corrections said officials had been discussing the method with their Alabama counterparts, according to spokesperson Kay Thompson. Under Oklahoma law, lethal injections using the sedative drug midazolam remain the primary execution method, and it would turn to an alternative only if a court rules that lethal injection cannot be used on a prisoner or if drugs become unavailable. The state can then turn to nitrogen asphyxiation, an electric chair or a firing squad, in that order, but the scenario has yet to arise, the department said. \"We don't have a protocol, we don't have any equipment, and it would probably be two years before we would definitely be ready to move forward with that method,\" said Thompson, the department spokesperson, referring to nitrogen asphyxiation. Oklahoma does not have an electric chair either, although it is also a method allowed by state law, she added. Mississippi's Department of Corrections did not respond to questions. Alabama's Department of Forensic Sciences will perform an autopsy on Smith's body, prison officials said. Smith was convicted of murdering Elizabeth Sennett after accepting $1,000 to kill her with accomplices at the behest of her husband, a preacher who later killed himself. The jury voted 11-1 to sentence him to life in prison but an Alabama judge overruled their decision under a law that was later scrapped. Sennett's relatives witnessed the execution, and told reporters afterwards they had forgiven her killers and were glad the execution was over. \nThe American Civil Liberties Union, Amnesty International USA and other rights groups condemned the execution. \"The whole purpose of these methods is to hide pain,\" said Maya Foa, joint executive director of the rights advocacy group Reprieve. \"How many more prisoners must die agonizing deaths before we see executions for what they really are: the state violently taking a human life?\""
}