{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0E07M_L.jpg",
  "title": "Iceland volcano recedes after 'black day' of town fires",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 15, 2024 04:29AM ET",
    "Updated Jan 15, 2024 10:07PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/iceland-volcano-recedes-after-black-day-of-town-fires-3274313",
  "paragraph": "© Reuters. A volcano spews lava and smoke as it erupts in Reykjanes Peninsula, Iceland, January 14, 2024. Iceland Civil Protection/Handout via REUTERS \nREYKJAVIK (Reuters) - A volcano that erupted in southwest Iceland for the second time in less than a month appeared to be significantly less active on Monday despite indications of magma still flowing underground. \"A black day\" read the front page headline of Icelandic daily Morgunbladid across an image of bright-orange lava fountains and houses burning in the town of Grindavik, some 40 kilometres (25 miles) southwest of the capital Reykjavik. Although volcanic activity has eased since Sunday, the eruption centres is a high-risk area and new fissures could open without warning, the Icelandic Metrological Office said. \"It is difficult to estimate how long this eruption will last,\" it said in a statement.  Molten lava flows reached the outskirts of Grindavik around noon on Sunday, setting three houses alight, although the town had been evacuated earlier and there was no immediate danger to people. The crack in the earth's surface that opened close to Grindavik on Sunday was no longer active on Monday, and lava production from the larger fissure north of the town was decreasing, vulcanologist Rikke Pedersen told Reuters. \"Activity has dropped significantly overnight,\" she said. GPS measurements showed that magma continued to move in a southern area of the corridor beneath the town, the Metrological Office said, adding that new cracks might appear within Grindavik in the next few days.  It was the second eruption on the peninsula of Reykjanes in four weeks and the fifth since 2021. Live video footage on Monday showed glimpses of orange lava still flowing to the surface but in smaller volumes, and further away from the town. \"Unfortunately (the lava) went a little bit more south than we had hoped for,\" Vidir Reynisson, head of Iceland's Civil Protection and Emergency Management, told a press conference late on Sunday. Nevertheless, defensive barriers built to the north of Grindavik had helped divert the flows of lava to the west, away from the town, Reynisson said. Residents of Grindavik, a town of some 4,000 people before it was evacuated in November, said it was difficult to watch televised images of the fires. \"This is serious, it's basically as bad as it can possibly get. Although it might get even worse, who knows?\" evacuated resident Jon Gauti Dagbjartsson said late on Sunday. \n\"I actually live in the house that I was born in and it's a tough thought to think that this town might be over, and I would have to start all over somewhere else. But if that's the case, then that's exactly what we'll do.\" The Icelandic government was to meet on Monday to decide on support for the people of Grindavik. \"We need to put a lot of extra efforts into finding more housing, suitable housing,\" Prime Minister Katrin Jakobsdottir said."
}