{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0J06Y_L.jpg",
  "title": "Protesters in Tel Aviv call for change to Netanyahu government",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 20, 2024 02:30PM ET",
    "Updated Jan 20, 2024 04:54PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/protesters-in-tel-aviv-call-for-change-to-netanyahu-government-3278895",
  "paragraph": "5/5\n© Reuters. A person takes a picture of a banner, during a protest against Israeli Prime Minister Benjamin Netanyahu's government in Tel Aviv, Israel, January 20, 2024. REUTERS/Alexandre Meneghini\n2/5\nTEL AVIV (Reuters) - Thousands of Israelis gathered in Tel Aviv on Saturday to protest against Prime Minister Benjamin Netanyahu's government, accusing the veteran leader of mishandling the nation's security and calling for a new election. Anti-government protests that shook the nation for much of 2023 ceased after the attacks by Hamas in southern Israel on Oct. 7. Political rifts were set aside as Israelis rallied behind the military and the families of those killed or taken hostage. But with the devastating war in Gaza in its fourth month and opinion polls showing lagging support for Netanyahu, calls for leadership changes are growing stronger, though there is no indication that his position is under any imminent threat. This was reflected in Saturday night's turnout in a central Tel Aviv square where many of last year's protests took place. While the crowd was much smaller than those seen last year, it still comprised several thousand people, with many banging on drums, yelling their dismay and waving Israeli flags. \"The government that abandoned us on Oct. 7 continues to abandon us every day since - those evacuated from the northern and southern (borders), the families of the victims, the reservists, the hostages,\" said Noam Alon, whose brother, a soldier, was killed trying to clear an Israeli town from Hamas gunmen. \"The power is in our hands to change and repair,\" she said from the stage. \"This government needs to go home. Now!\" And the crowd answered her, shouting: \"Now! Now!\" \nWhile divisions have emerged among members of his wartime cabinet, Netanyahu is intent on staying in power.  Opposition leaders have offered to form a unity government not led by Netanyahu, but no moves have gained traction."
}