{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0E09Q_L.jpg",
  "title": "US agency powers back on Supreme Court's hook in fishing dispute",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 15, 2024 06:10AM ET",
    "Updated Jan 16, 2024 05:06AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-agency-powers-back-on-supreme-courts-hook-in-fishing-dispute-3274373",
  "paragraph": "By John Kruzel WASHINGTON (Reuters) - The U.S. Supreme Court this week is set to hear a bid by commercial fishermen to avoid costs associated with a government-run fish conservation program in a dispute that gives its conservative justices another chance to curb the regulatory powers of federal agencies. The two cases being argued on Wednesday involve a challenge by fishing companies that argue that Congress did not authorize the National Marine Fisheries Service to establish an industry-funded program to monitor for overfishing of herring off New England's coast. More broadly, the companies have asked the court, with its 6-3 conservative majority, to rein in or overturn a precedent established in 1984 that calls for judges to defer to federal agency interpretation of U.S. laws, a doctrine called \" Chevron  (NYSE:CVX) deference.\" The bid by the commercial fishermen, supported by a raft of conservative and corporate interest groups, is part of what has been called the \"war on the administrative state,\" a conservative effort to weaken the federal agency bureaucracy that interprets laws, crafts federal rules and implements executive action. The Supreme Court in recent years has signaled skepticism toward expansive regulatory power, issuing rulings powered by its conservative justices to rein in what they viewed as governmental overreach by the Environmental Protection Agency (EPA) and other agencies. Some legal scholars have said that if the court were to limit or eliminate Chevron deference, it would likely harm Democratic presidential administrations more than Republican ones. One reason is that Democrats tend to rely on federal agency rules to advance ambitious regulatory agenda items that Congress is typically unable or unwilling to pass. \"Chevron can help either party, but overall Democrats have more to lose than Republicans from its demise,\" said law professors Gregory Elinson of Northern Illinois University and Jonathan Gould of the University of California Berkeley Law School, who wrote in a 2022 law review article on the topic. CHEVRON UNDER FIRE The fishing companies - led by New Jersey-based Loper Bright Enterprises and Rhode Island-based Relentless Inc - are appealing lower court rulings siding with the federal government. The conservation program overseen by the National Marine Fisheries Service was begun in 2020 under Republican former President Donald Trump and is being defended by Democratic President Joe Biden's administration.  The regulation at issue called for certain fishermen to carry aboard their vessels U.S. government contractors and pay for their at-sea services while they monitored the catch. The New England herring fishing regulations were issued by the fisheries service, part of the U.S. Commerce Department. Amid concerns about overfishing and fishery management, the program aimed to monitor 50 percent of declared herring fishing trips in the regulated area, with program costs split between the federal government and the fishing industry. The monitors assess the amount and type of catch including species inadvertently caught. The cost of paying for the monitoring services was an estimated $710 per day for 19 days a year, which could reduce a vessel's income by up to 20 percent, according to government figures. The Biden administration said in court papers that the monitoring program was suspended for the fishing year starting in April 2023 due to insufficient federal funding. The companies sued the government in 2020 in federal court, claiming the industry-funded monitoring program exceeded the agency's authority under existing law. The administration has argued that the fisheries service program is authorized under a 1976 U.S. law called the Magnuson-Stevens Act to protect against overfishing in U.S. coastal waters. The Washington-based U.S. Court of Appeals for the District of Columbia Circuit and the Boston-based 1st U.S. Circuit Court of Appeals both ruled in favor of the government. The courts found that the regulation was entitled to deference under the Supreme Court ruling, Chevron v. Natural Resources Defense Council, that directed judges to defer to a federal agency's interpretation of laws that may be ambiguous. \nThe administration urged the justices to uphold the lower court rulings and preserve Chevron deference, saying among other things that the doctrine \"gives due weight to the expertise that agencies bring to bear\" and promotes national uniformity in the administration of federal law. An attorney for the commercial fishermen said Chevron deference \"incentivizes a dynamic where Congress does far less than the Framers (of the U.S. Constitution) anticipated, and the executive branch is left to do far more by deciding controversial issues via regulatory fiat.\""
}