{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0K09R_L.jpg",
  "title": "Netanyahu rejects Hamas conditions for hostage deal which include 'outright surrender'",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 21, 2024 01:08PM ET",
    "Updated Jan 21, 2024 07:06PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Me comment",
        "2024-01-21 23:23:41",
        "Neanyahu is doing to the Palestinian people what Hitler did to the Jewish people. It is not how the Bible represents how Isreal should act.",
        "https://www.investing.com/members/207721649"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/israels-netanyahu-rejects-hamas-conditions-for-hostage-deal-which-include-outright-surrender-3279008",
  "paragraph": "© Reuters. Israeli Prime Minister Benjamin Netanyahu speaks during the weekly cabinet meeting at the Defence Ministry in Tel Aviv, Israel, January 7, 2024. REUTERS/Ronen Zvulun/Pool/File Photo\nBy Emily Rose JERUSALEM (Reuters) -Israeli Prime Minister Benjamin Netanyahu on Sunday rejected conditions presented by Hamas to end the war and release hostages that would include Israel's complete withdrawal and leaving Hamas in power in Gaza. As Israeli planes resumed bombing Khan Younis in the southern Gaza Strip, senior Hamas official Sami Abu Zuhri told Reuters the Israeli leader's refusal to end the military offensive in Gaza \"means there is no chance for the return of the (Israeli) captives.\" \"In exchange for the release of our hostages, Hamas demands the end of the war, the withdrawal of our forces from Gaza, the release of all the murderers and rapists,\" Netanyahu said in a statement. \"And leaving Hamas intact.\" \"I reject outright the terms of surrender of the monsters of Hamas,\" Netanyahu said. Under a deal brokered in late November by the United States, Qatar and Egypt, more than 100 of the estimated 240 hostages taken captive to Gaza during an attack by Hamas militants on Oct. 7 were freed in exchange for the release of 240 Palestinians held in Israeli prisons. Since then, Netanyahu has faced mounting pressure to secure the release the 136 hostages who remain in captivity. The Hostages and Missing Persons Families Forum demanded in a statement that Netanyahu \"clearly state that we will not abandon civilians, soldiers, and others kidnapped in the October debacle.\" \"We must advance the deal now,\" it said. \"If the prime minister decides to sacrifice the hostages, he should show leadership and honestly share his position with the Israeli public.\" Relatives of the hostages at a protest outside Netanyahu's residence demanded action. \"We need the government to now fix the problem that they have created and get these hostages home immediately, said Jon Polin, father of Hersh Goldberg-Polin. Netanyahu also took a stronger line on the issue of Palestinian statehood than before. \"I will not compromise on full Israeli security control of all territory west of the Jordan River,\" he said. U.S. President Joe Biden said on Friday he spoke with Netanyahu about possible solutions for creation of an independent Palestinian state, suggesting one path could involve a non-militarized government. Netanyahu appeared on Saturday to push back against Biden's remarks about Palestinian statehood after the war against Hamas in Gaza ends as the two men do not see eye-to-eye on Palestinians having a state, a solution Biden has advocated to achieve long-term peace. In the statement on Sunday, Netanyahu repeated that he would insist upon \"full Israeli security control over all the territory west of Jordan.\" \nNetanyahu said he had firmly stood up to \"international and internal pressures\" to change this position and would continue to do so. \"My insistence is what prevented for years the establishment of a Palestinian state that would have posed an existential danger to Israel,\" he said."
}