{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0902X_L.jpg",
  "title": "Taiwan to vote in what China calls 'peace and war' election",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 09, 2024 10:05PM ET",
    "Updated Jan 10, 2024 12:35AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/taiwan-to-vote-in-what-china-calls-peace-and-war-election-3270832",
  "paragraph": "© Reuters. People on motorbikes ride during morning rush hour in Taipei, Taiwan January 10, 2024. REUTERS/Ann Wang\nBy Yimou Lee and Ben Blanchard TAIPEI (Reuters) - Taiwan goes to the polls on Saturday to elect a new president and parliament under the shadow of an increasingly assertive China which has called the vote a choice between \"peace and war\". But no matter who wins the elections, Beijing's military and economic pressure on Taiwan could continue and may even increase, say Taiwan security officials. China claims Taiwan as its own territory despite strident objections from the government in Taipei and has never renounced the use of force to bring it under Beijing's control. Besides its territorial significance to Beijing, Taiwan is also a global semiconductor powerhouse and home to the world's largest contract chipmaker TSMC. At stake in the elections will be the future of Taiwan's fraught ties with its giant neighbour, with both major parties supporting Taiwan's sovereignty but offering different views on the island's relations with China. Vice President Lai Ching-te, the ruling Democratic Progressive Party's (DPP) presidential candidate, has urged people not be swayed by China's threats, while offering talks with China and pledging not to upset the status quo. \"Taiwan stands on the front line of the confrontation between democracy and totalitarianism,\" Lai told a campaign rally on Tuesday. The DPP alleges Beijing is trying to interfere in the vote by spreading fake news and exerting military and economic pressure. China has labelled those accusations DPP \"dirty tricks\" and a ploy to win votes by \"hyping up\" a threat. Over the past year-and-a-half China has staged two rounds of major war games close to Taiwan, including in August of 2022 firing missiles into waters off the island, as Beijing asserts its sovereignty claims over the democratic island. Taiwan's largest opposition party the Kuomintang (KMT) has attacked the DPP as separatists and pledged strong opposition to Taiwan independence, while saying they will seek dialogue with China and keep boosting the island's defences. \"Hou Yu-ih opposes Taiwan independence, will allow cross-strait peace, restart dialogue and exchanges, strengthen national defence and let everyone live in peace in Taiwan,\" the KMT's presidential candidate Hou said on Monday. FUTURE CHINA RELATIONS In 1949 the defeated Republic of China government fled to Taiwan after losing a civil war with Mao Zedong's communists who founded the People's Republic of China. The Republic of China remains Taiwan's formal name.  While both major parties say Taiwan is already a sovereign country they have different views on ties with China. The KMT argues that both Taipei and Beijing belong to one single China but each can interpret what that means under something called the \"1992 consensus\", a tacit understanding reached between the then-KMT government and China in 1992.  The DPP rejects Beijing's sovereignty claims, saying Taiwan's future should be decided by its people. If the DPP wins the presidential election it will be the first time the same the party has stayed in power for a third consecutive term since direct presidential voting started in 1996. How China, where President Xi Jinping is carrying out a new anti-corruption purge of the military and faces entrenched economic problems, reacts to the election outcome will be key. Taiwan officials have repeatedly warned voters that Beijing is trying to sway election results with a \"multifront\" campaign, from clandestine influence operations in temples and trade sanctions to sponsoring cut-price trips to China for local politicians and pressuring an influential rock band. One Taiwan security official, speaking on condition of anonymity given the sensitivity of the situation, said it was possible China could stage more drills between the election and May 20 when the new president takes office. \"But certainly we must consider China's own problems, including its tolerance for international criticism,\" the official said. Since late December, Xi has twice stressed the importance of \"reunification\" with Taiwan in public comments, though not mentioned either the election or using force. A second Taiwan security official said no matter who is elected Beijing could add pressure on the new leader before May 20, perhaps economically by putting anti-dumping tariffs on imports from Taiwan, having last month accused Taiwan of erecting unfair trade barriers. Taiwan's security units believe China is likely to continue to whittle away at the handful of countries having formal diplomatic ties with Taipei - now only 13 - and boost its economic coercion including trade probes, according to an internal security assessment of possible scenarios after the vote. LAWMAKER ELECTION  There is a third presidential candidate too - former Taipei mayor Ko Wen-je of the small Taiwan People's Party (TPP) which was founded in 2019.  The party currently only has five out of 113 seats in the legislature, but Ko's focus on bread and butter issues like the high cost of housing has won him a passionate support base among many young Taiwanese who have packed his campaign rallies. \nThe parliamentary election is equally important, and the DPP and KMT have both stressed on the campaign trail the need to win a majority. The DPP has had more than 50% of lawmakers over the past four years meaning it could easily pass legislation. President Tsai Ing-wen, of the DPP, is constitutionally barred from running again after two four-year terms in office."
}