{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0U04U_L.jpg",
  "title": "Pakistan ex-PM Imran Khan jailed for 14 years a day after 10-year sentence",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 31, 2024 12:58AM ET",
    "Updated Jan 31, 2024 01:02PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/pakistan-expm-imran-khan-wife-jailed-for-14-years-in-graft-case-his-party-says-3287716",
  "paragraph": "© Reuters. FILE PHOTO: Pakistan's former Prime Minister Imran Khan, gestures as he speaks to the members of the media at his residence in Lahore, Pakistan May 18, 2023. REUTERS/Mohsin Raza/File Photo\nBy Asif Shahzad and Ariba Shahid ISLAMABAD (Reuters) -A Pakistani anti-graft court jailed former Prime Minister Imran Khan and his wife Bushra Khan for 14 years each on charges of illegally selling state gifts, his party said on Wednesday, a day after Khan was jailed for 10 years in another case. The sentence, after the third conviction handed down to the embattled ex-cricket star in the last few months, also included a 10-year disqualification from holding public office, his party, the Pakistan Tehreek-e-Insaf (PTI), said. Bushra Khan, commonly known as Bushra Bibi, has, however, been allowed by authorities to serve her sentence at Khan's Islamabad hilltop mansion, the party's media team confirmed. Khan is already in a prison in the garrison city of Rawalpindi. Khan was jailed for 10 years on Tuesday on charges of revealing state secrets as Pakistan prepares for a general election on Feb. 8. It was not immediately clear if the two sentences for Khan would run concurrently. \"Another sad day in our judicial system history, which is being dismantled,\" Khan's media team said, repeating his denial of the charges. \"No cross-questioning allowed, no final argument concluded and decision pops up like a pre-determined process in play ... this ridiculous decision will also be challenged.\" Khan's lawyer, Intezar Panjutha, told Reuters: \"It is a sham verdict.\"  Khan and his wife were charged with illegally selling gifts, worth more than 140 million rupees ($501,000) and received during his 2018-2022 premiership, from a state treasury known locally known as the \"Toshakhana\". Government officials have alleged Khan's aides sold the gifts in Dubai. A list of these gifts shared by a former information minister included perfumes, diamond jewellery, dinner sets and seven watches, six of them Rolexes - the most expensive being a \"Master Graff limited edition\" valued at 85 million rupees ($304,000). Khan was also handed a three-year prison sentence in August for the same charge by another court, but that sentence had been suspended on appeal.  VERDICT 'KARMA', SAY OPPONENTS Wednesday's verdict followed an investigation by the country's top anti-graft body, the National Accountability Bureau (NAB). Bushra's conviction was an attempt to pressurise Khan further, PTI's acting chairman and lawyer, Gohar Ali Khan, said in a television interview. \"Bushra Bibi has no link to this case,\" he said. The two were married in 2018, months before Khan ascended to premiership for the first time. It was Khan's third marriage after two divorces.  A prosecution team member, speaking to Reuters on the condition of anonymity, confirmed the verdict. A detailed verdict would be released soon, he said. Local broadcaster Geo News reported that the verdict also came with a hefty fine.  Khan's earlier conviction on the selling of state gifts charge resulted in a five-year ban from holding public office, ruling him out of the Feb. 8 election. Wednesday's verdict, however, means that he will be ineligible to hold office until he is 81. His rival parties - the Pakistan Muslim League-Nawaz (PML-N) of three-time former Prime Minister Nawaz Sharif and the Pakistan Peoples' Party (PPP) of the late former premier Benazir Bhutto - hailed the ruling. Bhutto's son, Bilawal-Bhutto Zardari, who now leads the PPP, termed Khan's convictions \"karma\" in a public rally on Wednesday.  Khan's political opponents and some rights activists have accused him of using the same anti-graft body when in power to throw opponents in jail and getting critical journalists fired, a charge his PTI party denies. Sharif's daughter, Maryam Nawaz, who is considered his political heir, also said the verdict \"was nothing but karma\". CRACKDOWN  Following the verdict against Khan and his wife police were deployed outside his party's offices in Islamabad and Lahore.  Khan has been fighting dozens of cases since he was ousted from power in a parliamentary vote of no-confidence in 2022. He says his ouster was backed by the powerful military with whom he fell out with when he was in office. He and his party say that since his ouster, they have been faced with a military-backed crackdown, including arrests of hundreds of supporters, party members and key aides. The military, which has for decades held sway over Pakistan's politics, denies the charges. NAB, the anti-graft agency that tried Khan, has at various times investigated, tried and jailed all prime ministers to have served since 2008, including Sharif, whose party is considered the frontrunner in next week's election. \nViolence has also risen ahead of the polls.  A national assembly candidate claiming to be backed by Khan's party was shot and killed in a tribal district along Afghan border on Wednesday, police said."
}