{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0G0RY_L.jpg",
  "title": "US court will reconsider forcing Texas to remove Rio Grande migrant barrier",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 17, 2024 01:57PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-court-will-reconsider-forcing-texas-to-remove-rio-grande-migrant-barrier-3276586",
  "paragraph": "3/3\n© Reuters. FILE PHOTO: Workers assemble a string of buoys, to deter migrants from crossing the Rio Grande river, at the international border with Mexico in Eagle Pass, Texas, U.S. July 27, 2023. REUTERS/Adrees Latif/File Photo\n2/3\nBy Daniel Wiessner (Reuters) - A U.S. appeals court on Wednesday said it would reconsider a recent decision requiring Texas to remove a 1,000-foot-long (305-meter) floating barrier it had placed in the Rio Grande river to deter migrants from illegally crossing the border with Mexico. The decision by the full 5th U.S. Circuit Court of Appeals in New Orleans sets aside a divided three-judge panel's December ruling, which had sided with the Biden administration and said that the state could not install the string of buoys without permission from the federal government. That ruling was a setback for Texas Governor Greg Abbott, a Republican, who has strongly criticized Democratic President Joe Biden's handling of record numbers of migrants crossing the border illegally.  The 5th Circuit said it would hear arguments in the case in May. Most of the court's 17 active judges are appointees of Republican presidents, but two of the three judges who decided the case in December were appointed by Democrats. Abbott's office, the office of Republican Texas Attorney General Ken Paxton, and the U.S. Department of Justice did not immediately respond to requests for comment.  The floating barrier is part of Abbott's broader effort to deter and punish illegal border crossings, collectively known as Operation Lone Star.  \nTexas has placed concertina wire fencing on private property along the border, flown or bussed tens of thousands of migrants to Democrat-led cities and states, and recently passed a law authorizing state officials to arrest, prosecute and deport people who cross the border illegally.  All of those initiatives have spawned court battles between Texas and the Biden administration and civil rights groups."
}