{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0N0ND_L.jpg",
  "title": "Ukraine says Russia did not ask it to ensure air space security where Russian plane crashed",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 24, 2024 11:46AM ET",
    "Updated Jan 24, 2024 12:19PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/ukraine-says-russia-did-not-ask-it-to-ensure-air-space-security-where-russian-plane-crashed-3282041",
  "paragraph": "5/5\n© Reuters. An Orthodox priest conducts a service for those killed in the crash of the Russian Ilyushin Il-76 military transport plane, in a church in the village of Yablonovo in the Belgorod Region, Russia January 24, 2024. REUTERS/Stringer\n2/5\n(Reuters) - Ukraine military intelligence said Kyiv was not asked to ensure air space security on Wednesday around the Belgorod area in southern Russia as had been the case during previous prisoner of war swaps with Moscow. In a post on Telegram, it said Russia's accusations that Kyiv on Wednesday shot down a military transport plane in the Belgorod area carrying 65 Ukrainian PoWs to a prisoner exchange could be \"a planned action to destabilise the situation in Ukraine and weaken international support for our state\".  The agency also said it had no reliable information on who was onboard the crashed Russian military transport plane.  Video posted on Telegram by Baza, a channel linked to Russian security services, and verified by Reuters, showed a large aircraft falling towards the ground near the village of Yablonovo in the Belgorod region and exploding in a fireball.  Russia said 74 people in all died, including six Russian crew members and three Russian soldiers.  \nIn its statement on Telegram, the Ukrainian military intelligence agency said a swap of Ukrainian and Russian prisoners of war was indeed planned and Kyiv had met all the terms, but it was not informed by Russia about the number of planes carrying prisoners and their routes. \"At the same time, the Ukrainian side was not informed about the need to ensure the security of the air space in the area of the city of Belgorod at a certain period of time, as has been repeatedly done in the past,\" the agency added."
}