{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0F0P4_L.jpg",
  "title": "Putin says Ukraine's statehood at risk if pattern of war continues",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 16, 2024 09:37PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/putin-says-ukraines-statehood-at-risk-if-pattern-of-war-continues-3275669",
  "paragraph": "© Reuters. Russian President Vladimir Putin attends a meeting with the heads of municipalities during the all-Russian municipal forum in the town of Odintsovo in Moscow region, Russia, January 16, 2024. Sputnik/Sergei Savostyanov/Pool via REUTERS\nMOSCOW (Reuters) - Russian President Vladimir Putin said on Tuesday that Ukraine's statehood could suffer an \"irreparable blow\" if the pattern of the war continued, and Russia would never be forced to abandon the gains it had made. Putin made his televised comments a day after Switzerland agreed to host a global summit at the request of Ukrainian President Volodymyr Zelenskiy. Putin dismissed \"so-called peace formulas\" being discussed in the West and Ukraine and what he called the \"prohibitive demands\" they entailed. \"Well, if they don't want (to negotiate), then don't!\" he said. \"Now it is quite obvious, not only (Ukraine's) counter-offensive failed, but the initiative is completely in the hands of the Russian armed forces. If this continues, Ukrainian statehood may suffer an irreparable, very serious blow.\" Putin's statements about the course of the war have become increasingly confident and aggressive in recent months, with the failure of Ukraine's counter-offensive to deliver any substantial gains against well entrenched Russian forces. Russia currently controls 17.5% of the territory of Ukraine. Putin said talk of negotiation was \"an attempt to motivate us to abandon the gains that we have realized over the past year and a half. But this is impossible. Everyone understands that this is impossible.\" \nA peace formula put forward by Zelenskiy calls for the restoration of Ukraine's territorial integrity, cessation of hostilities and withdrawal of Russian troops, among other points. Russia says any negotiation would have to take account of the \"new realities\" created by its forces on the ground."
}