{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK140EL_L.jpg",
  "title": "Trump heads to US Supreme Court with a familiar claim: he is untouchable",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 05, 2024 06:03AM ET",
    "Updated Feb 05, 2024 12:16PM ET"
  ],
  "comments": [
    8,
    [
      [
        "Charles Manson",
        "2024-02-06 14:40:33",
        "Thanks to all for the response to my \"Teflon Don\" comment. If Biden were loyal to enforcing the laws, I would support him. America is at the Precipous of a Big Change. My apologies for leaving out the Bureau of Prisons regarding his List. They need to be prepared. Make your Bets. Trump or Biden. Not Rocket Science. A President with only four years to serve has nothing to lose. Anyway, stay safe on the streets of your immigrant occupied Sanctuary Cities. More Buses on the way. Love to,All, Charles.",
        "https://www.investing.com/members/249519852"
      ],
      [
        "Tre Hsi",
        "2024-02-06 16:24:38",
        "\"A President with only four years to serve has nothing to lose.\"  - of course you know both Biden and Trump has only four years to serve after 2024 election, so that point is basically, pointless",
        "https://www.investing.com/members/203741693"
      ],
      [
        "Barry Nickerson",
        "2024-02-06 11:56:39",
        "I haven't seen any references or comparisons in this case to Diplomatic Immunity, (remember that?).  I know they are not the same, but there are similarities that could be discussed.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Charles Manson",
        "2024-02-05 22:09:35",
        "The New \"Teflon Don\". After he gets in the White House, he will give the DOJ, FBI, & the Homeland Security folks his list of names of those who participated in Treason against the United States. Make no mistake, the list is getting larger everyday. May give it to the IRS too. Those with BMMPDQ, not to be mistaken for the LGBQT whatever folks, will be on the top of the list. BMMPDG: BETA Male MAGA Phobe Draq Queen. Love to All, Charles.",
        "https://www.investing.com/members/249519852"
      ],
      [
        "Adrian White",
        "2024-02-06 00:37:07",
        "Charles, sorry to say, but that's not how it works in the USA, or democracies, in general. The president does not initiate investigations, nor hand over personal lists of enemies for the various agencies to go after. If you want a Sadam-era Iraq style of government, OK. But that's not what most Americans want. ",
        "https://www.investing.com/members/202315569"
      ],
      [
        "Ac Tektrader",
        "2024-02-06 02:55:45",
        "but apparently what Charles wants. Charles is loyal to trump. and his treason and mostly hate the idea of a real democracy and America's Constitution. like most of his kind, they w.ill support Trump's fascist remake of America if he is elected president.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Billy Foos",
        "2024-02-05 21:09:10",
        "So SCOTUS has already granted presidential immmunity to civil cases. Why wouldnt it be granted to criminal cases? I do agree a president should be immune to laws during their presidency. This whole idea of having utilizing the justice department to indict former presidents is rediculous. America is better than this.. We are not a banana republic. ",
        "https://www.investing.com/members/208442913"
      ],
      [
        "Ac Tektrader",
        "2024-02-06 04:00:16",
        "you can't have it both ways John. ether a president is immune from legal prosecution or he isn't. trump is saying he is immune from legal prosecution for the felonies and crimes against America he's being charged with. that he is above the law.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ac Tektrader",
        "2024-02-06 04:05:49",
        "John with Trump's attempt ti circumvent the American justice system its Trump that's attempting to turn America unto a banana republic.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ac Tektrader",
        "2024-02-06 04:25:04",
        "but John you said a president should be immune from prosecution for crimes he commuted while in office. so which is it. you can't have both ways John.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ac Tektrader",
        "2024-02-06 04:34:05",
        "with your post Billy you want trump to be above the law which is the kind of axtions that takes place in banana republics. so you support Trump's attempts to destroy the rule of law in America, and turn America into a banana republic, is that right billy.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Brad Albright",
        "2024-02-06 13:12:57",
        "Its sad, isn't it the contortions on display? The fact is, the Trump ducks are not operating from any starting principles. Instead, the craft a paradigm that fits only Trump's current circumstances, and try to pretend American law and the Constitution can be interpreted to fit them. It should be the other way around, but they've been completely snowed. Mental weakness meets situational ethics.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Ken Roth",
        "2024-02-05 19:42:17",
        "Yes you sure sound cuckoo Mark",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Mark Jannetty",
        "2024-02-05 14:46:17",
        "you mention Trump and all the cuckoo clocks sound off 🤣",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Evan Williams",
        "2024-02-05 14:30:46",
        "Typical Reuters rag sheet nonsense. What about the Constitution? Don't you think we should run through the 5th, 6th, and 8th Amendment before administering the 14th amendment via rag tag wantobe smear outlets? Trump has been convicted of NOTHING! So Colorado case is moot, no other choice but to overturn.",
        "https://www.investing.com/members/255256591"
      ],
      [
        "Ken Roth",
        "2024-02-05 19:39:48",
        "Off couse a sentence to pay 88 mill usd is nothing",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Mark Jannetty",
        "2024-02-05 20:53:45",
        " when was the President arrested for rape? you can not be convicted if you are never charged 🤡",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Ac Tektrader",
        "2024-02-06 02:24:54",
        "the satute of limitations has prevented a felony charge of rape against him. so the charges of sex molester was brought to civil court were he was found guilty. there are other pending charges in civil court of sex molester pending against molester. your little tin god is sex pervert mark.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ac Tektrader",
        "2024-02-06 02:28:13",
        "trump brags about molesting women mark. and you support him. what does that make you mark.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Mark Jannetty",
        "2024-02-06 10:19:37",
        " so you are saying he was never convicted? good to know. now go rant on CNN about something that never happened ",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Ken Roth",
        "2024-02-05 11:44:20",
        "If trump wins immunity claim, Biden should immediately issue an order to seal team six and hunt down all republican traitors of US values including their leader trump",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Mark Jannetty",
        "2024-02-06 01:41:22",
        " Adrian, US is the reserve currency and effects all global markets. we are also the largest consumer in the world. US moves markets. Biden passed 3 massive spending bills in non pandemic times, as well as his policies on oil, set the fire. sorry but this was 100% Biden ",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Brad Albright",
        "2024-02-06 02:54:33",
        "Mark Jannetty",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Ac Tektrader",
        "2024-02-06 05:25:44",
        " yes mark and under Trump we had most of that 19% inflation as well as an economy in shambles, handed to Biden by the trump administration in the first yeat of Biden's presidency.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Tre Hsi",
        "2024-02-06 16:28:49",
        "Mark Jannetty",
        "https://www.investing.com/members/203741693"
      ],
      [
        "Mark Jannetty",
        "2024-02-06 17:35:22",
        " wow. is that what the view has taught you. now do reality. start with researching Bidens bills and work down",
        "https://www.investing.com/members/241633026"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/trump-heads-to-us-supreme-court-with-a-familiar-claim-he-is-untouchable-3292491",
  "paragraph": "© Reuters. FILE PHOTO: Former U.S. President and Republican presidential candidate Donald Trump gestures as he attends a rally in advance of the New Hampshire primary election in Laconia, New Hampshire, U.S. January 22, 2024. REUTERS/Mike Segar/File Photo\nBy Andrew Chung and John Kruzel WASHINGTON (Reuters) - Donald Trump will try to persuade the U.S. Supreme Court this week to reverse a judicial decision to kick him off the ballot in Colorado over his actions concerning the Jan. 6, 2021, Capitol attack, arguing that the constitutional provision his opponents cite does not apply to him as a former president. It may not be the only time Trump makes this type of assertion to the justices. As he fights four criminal cases and civil litigation in lower courts, Trump has repeatedly advanced a bold argument: that he is formally immune or otherwise not subject to these legal challenges. \"Trump appears obsessed with trying to place himself above the law. The theme running throughout these claims is that he cannot be held liable at law for anything he has done,\" said constitutional law expert Michael Gerhardt, a University of North Carolina law professor. \"No president or former president has made such outlandish, self-serving claims.\" The Supreme Court, whose 6-3 conservative majority includes three Trump appointees, on Thursday is scheduled to hear Trump's appeal of a ruling by Colorado's top court that disqualified him from the state's Republican primary ballot under the U.S. Constitution's 14th Amendment for engaging in insurrection. He is the frontrunner for his party's nomination to challenge Democratic President Joe Biden in the Nov. 5 U.S. election. While Trump has not asserted sweeping presidential immunity as a defense in that case, the Supreme Court still may have to confront the issue, including in criminal and civil actions over his attempts to overturn his 2020 election loss and defamation claims by a woman who accused him of rape.  Trump in the past has shown contempt for constraints on his actions. He famously said during his successful 2016 presidential campaign that he \"could stand in the middle of Fifth Avenue and shoot somebody, and I wouldn't lose any voters.\" In his effort to escape federal criminal charges involving his efforts to overturn his 2020 loss to Biden, a lawyer for Trump indicated to appellate judges that a president could order Navy commandos to assassinate a political rival and still be immune from prosecution unless first being impeached by the House of Representatives and convicted by the Senate. IMMUNITY CLAIM Asked to comment on his immunity assertions, a Trump campaign spokesperson pointed to his Jan. 10 social media post stating that a president could not function without \"COMPLETE IMMUNITY.\" In a post nine days later, Trump said presidents need immunity even for \"events that 'cross the line.'\" The Supreme Court will confront novel questions when it reviews the Colorado Supreme Court's decision that Trump is disqualified from the presidency under Section 3 of the 14th Amendment, which bars any \"officer of the United States\" who \"engaged in insurrection\" from holding public office. In that case, Trump contends that he is not subject to Section 3 because the president is not an \"officer of the United States.\" Trump is advancing claims of immunity in other cases that could reach the Supreme Court, which historically has held that presidential immunity, while it exists, cannot be absolute.  In cases involving former Presidents Richard Nixon in 1982 and Bill Clinton in 1997, the court found that presidents have absolute immunity from civil lawsuits for acts undertaken in their official capacity, but not from suits concerning personal and unofficial conduct. It has never ruled directly on whether presidents are immune from criminal prosecution. Trump's fight against federal criminal charges involving his efforts to undo his election defeat is now pending before the U.S. Court of Appeals for the District of Columbia Circuit after a federal judge rejected his immunity assertion.  University of California, Berkeley, law professor John Yoo, who served in President George W. Bush's administration, said he expects the Supreme Court would reject Trump's claim.  \"His lawyers are pressing unprecedented arguments that are likely to fail in court, but they are not frivolous,\" Yoo said. Trump has similarly claimed presidential immunity as a defense in a Georgia criminal case concerning election interference, civil lawsuits involving the Capitol riot, and in writer E. Jean Carroll's lawsuit accusing him of defaming her by denying in 2019 that he raped her in the 1990s. The Supreme Court in 2020 rejected Trump's claim of immunity from a subpoena that then-Manhattan District Attorney Cyrus Vance Jr. issued as part of an investigation into hush money paid by Trump's then-lawyer to a porn star before the 2016 election.  \nSome legal experts expressed doubt that Trump will prevail at the Supreme Court on the immunity issue, but warned of the consequences if he does. It would \"send the dangerous message that presidents can disregard the Constitution and federal law with impunity,\" said Brianne Gorod, chief counsel at the Constitutional Accountability Center, a liberal legal group.  \"A win for Trump in the immunity case,\" Gorod said, \"would be profoundly troubling regardless of who wins the election this November.\""
}