{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0A0RZ_L.jpg",
  "title": "U.S. FDA finds no evidence yet linking weight-loss drugs to suicidal thoughts",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 11, 2024 12:35PM ET",
    "Updated Jan 11, 2024 01:51PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-fda-finds-no-evidence-yet-linking-weightloss-drugs-to-suicidal-thoughts-3272753",
  "paragraph": "By Bhanvi Satija and Mariam Sunny (Reuters) -The U.S. Food and Drug Administration said on Thursday its preliminary review did not find evidence that weight-loss drugs such as Novo Nordisk (NYSE:NVO)'s Wegovy were tied to suicidal thoughts and the agency will continue to study the issue. Still, the FDA, which has listed suicidal thoughts as a potential safety signal for such drugs, said it could not definitively rule out that a small risk may exist due to the limited data available. Wegovy and Eli Lilly (NYSE:LLY)'s Zepbound belong to a class of drugs known as GLP-1 agonists, originally designed for type 2 diabetes. In addition to helping control blood sugar levels, they trigger a feeling of fullness. The idea of warnings regarding suicide ideation for weight loss treatments comes from older studies of drugs that worked differently than GLP-1s, said Dr. Robert Kushner, professor at Northwestern (NASDAQ:NWE) University Feinberg School of Medicine. \"It's kind of a legacy effect that is now applied to all medications for obesity,\" Kushner said. A large U.S. study last week found no evidence that taking Novo Nordisk's Ozempic or Wegovy is tied to an increase in suicidal thoughts. Concerns over reports of suicidal thoughts associated with semaglutide, the active ingredient in Wegovy and Ozempic, triggered an investigation by the European Medicines Agency last year. The European regulator had asked for more information from Novo Nordisk in December.  The FDA said its months-long evaluation of clinical trials, and its public dashboard called the FDA Adverse Event Reporting System (FAERS) did not show a clear relationship between the drugs and suicidal thoughts or actions. Kushner added that it was prudent to continue monitoring people on GLP-1 medicines and that data from long-term use of the drugs could help alleviate any concerns.  \nHealthcare providers like doctors should monitor their patients for new or worsening depression, suicidal thoughts, or any unusual changes in mood or behavior, consistent with the prescribing information for the drugs, the FDA said. The agency will announce its final recommendations after completing its review."
}