{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBT022_L.jpg",
  "title": "For Palestinians arrested under Israeli occupation, a childhood disrupted",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 30, 2023 03:02AM ET",
    "Updated Dec 30, 2023 02:11PM ET"
  ],
  "comments": [
    4,
    [
      [
        "Ken Roth",
        "2023-12-30 19:31:48",
        "The children are paying the price for their parents sins and support of Hamas",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Labib Rabboh",
        "2023-12-31 02:06:37",
        "Shame on you. You cant occupy and suprpress people’s inalienable rights for decades and expect them not to support the resistance. RESISTANCE IS JUSTIFIED WHEN PEOPLE ARE OCCUPIED. ",
        "https://www.investing.com/members/202260593"
      ],
      [
        "P Lance Sheldon",
        "2023-12-30 16:50:44",
        "Almost all guilty offenders lie about their crimes. However, given the extremely high rate of violence coming from Arab Palestinians, it's a certainty that innocents will be occasionally arrested for crimes they didn't commit. If only Palestinians would reject hatred, the mistaken incarceration rate would fall as the offense rates of their communities become more manageable.",
        "https://www.investing.com/members/255854011"
      ],
      [
        "Linda Davis",
        "2023-12-30 11:22:17",
        "Abd al-Rahman had a Molotov cocktail in his hand and threw it.",
        "https://www.investing.com/members/243205604"
      ],
      [
        "Tom Saltzman",
        "2023-12-30 10:32:04",
        "The propaganda machine is working hard this morning.",
        "https://www.investing.com/members/200520915"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/for-palestinians-arrested-under-israeli-occupation-a-childhood-disrupted-3264874",
  "paragraph": "2/2\n© Reuters. 14-year old Palestinian Abdelrahman Zaghal sits next to his mother Najah as she talks, after a hostages-prisoners swap deal between Hamas and Israel, in their house in Jerusalem, December 6, 2023. REUTERS/Sinan Abu Mayzer\n2/2\nBy Henriette Chacar JERUSALEM (Reuters) - Fourteen-year-old Abdelrahman al-Zaghal was one of the youngest Palestinians released by Israel in exchange for hostages seized during the Oct. 7 Hamas-led raid on Israel.  Weeks later, his life still bears little resemblance to that of a normal teenager - he is recovering from serious injuries sustained the day of his arrest, and said his school is still awaiting Israel's permission for him to attend. He was shot in August, when he said he left home to buy bread, only to wake up cuffed to a hospital bed, flanked by two police officers and with bullet wounds to the head and pelvis. Israel charged Zaghal with hurling a petrol bomb, which he denies. His mother Najah said he was shot by a man guarding a Jewish settlement near their home in East Jerusalem. A police statement released the night Zaghal was shot said Border Police officers shot at and critically wounded an unnamed teen after they sensed their lives were in danger. As a Jerusalem resident, Zaghal's case went to an Israeli civil court. The judge ordered him placed under house arrest, but outside his neighbourhood, until the end of his trial. The day of his release, Zaghal said he jumped for joy. But the celebrations were muted as he was about to undergo surgery for brain damage caused by the shooting, his mother said.     Among the 240 Palestinians released by Israel during a November pause in the Gaza war, Zaghal is one of 104 under the age of 18. In exchange, Hamas released 110 women, children and foreigners abducted on Oct. 7.  More than half the Palestinians released as part of the deal were detained without charge, Israel's records showed. Since 2000, the Israeli military has detained some 13,000 Palestinian children, almost all boys between the ages of 12 and 17, said Defense for Children International-Palestine (DCIP). \"Everywhere a Palestinian child turns, there is the Israeli military to exert some kind of control over their life,\" said DCIP advocacy officer Miranda Cleland. Israel says it arrests Palestinians on suspicion of attacking or planning attacks against its citizens. Its military said enforcement agencies in the occupied West Bank \"work to protect the rights of minors throughout all administrative and criminal proceedings\". In the West Bank, Palestinians and Israelis are subjected to different legal systems. Palestinians, including minors, are prosecuted in a military court.  Based on collected affidavits from 766 children detained between 2016 and 2022, DCIP found about 59% were abducted by soldiers at night. Some 75% of children were subjected to physical violence and 97% were interrogated without a family member or lawyer present. One in four are placed in solitary confinement for two or more days even before the beginning of a trial, said Cleland.  Lawyers work on getting children plea deals, she said, because the conviction rate is above 95%. One of the challenges in post-release counselling is that teens expect to be re-arrested – and many are, said Dr. Samah Jabr, a psychiatrist who heads the Palestinian Health Ministry's mental health unit.  Zaghal said he had been detained by Israeli forces twice before. The first time, at 12, he said soldiers beat him with their rifles while he was playing with his cousin in Jericho. He said they accused him of hurling rocks, which he denied. Throwing stones is the most common charge against Palestinian minors detained in the West Bank, punishable by up to 20 years in prison under Israeli military law, said Palestinian rights group Addameer. Zaghal remembers going to swim at a Tel Aviv pool with his late father on the weekends, and wants to become a lifeguard. He said he loved school and was eager to go back.  \nIsrael's Education Ministry said Palestinians released from Israeli detention would not attend its schools until January 2024 and would instead be visited by assigned officers.  It did not respond to Reuters questions on the reason for this decision.  (Aditional reporting by Latifa Abdellatif and Sinan Abu Mayzer; Writing by Henriette Chacar; Editing by Tom Perry and Jan Harvey)"
}