{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0A0UH_L.jpg",
  "title": "Tens of thousands protest in Poland against ex-ministers' imprisonment",
  "category": "World news",
  "publisher": "Investing.com",
  "date": [
    "Published Jan 11, 2024 01:00PM ET",
    "Updated Jan 11, 2024 03:18PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/thousands-protest-in-poland-against-media-reform-exministers-imprisonment-3272767",
  "paragraph": "5/5\n© Reuters. A woman shouts slogans as supporters of the Law and Justice (PiS) party gather in protest against state media overhaul and arrest of former interior minister and his deputy in Warsaw, January 11, 2024. REUTERS/Aleksandra Szmigiel\n2/5\nBy Marek Strzelecki and Justyna Pawlak WARSAW (Reuters) -Tens of thousands of opposition supporters massed outside Poland's parliament on Thursday to protest against the new government's changes to state media and the imprisonment of two former ministers convicted of abuse of power. The march reflects mounting tensions in the country as the new pro-European Union coalition government led by Donald Tusk tries to undo the policies of the previous nationalist Law and Justice (PiS) party administration. It also came as President Andrzej Duda, a PiS ally, said on Thursday he had started proceedings to pardon the two ministers in the last government who were jailed this week for abuse of power, escalating his own stand-off with the new government. \"We have to win this great battle for a sovereign, independent Poland,\" PiS leader Jaroslaw Kaczynski told the crowd. A sea of red and white Polish flags stretched back from the parliament, interspersed with placards with slogans such as \"Tusk=5th column\" and \"We survived the Russians, we'll survive Tusk\". Some chanted Duda's name and \"We will win!\" State-run news agency PAP cited Warsaw city hall as putting the number of people in the crowd at around 35,000, while a PiS spokesman put the figure at almost 200,000.  Protesters listened to speeches from PiS lawmakers before they started their march to the offices of state TV. The new government has changed the leadership of state media in what it says is a bid to restore balance to outlets that had become platforms for PiS propaganda during the party's eight-year rule. News channel TVP Info, which had subjected former EU Council President Tusk to incessant attacks since his return to domestic politics in 2021, was taken off air before returning in a much altered format. \"How can people cut off the TV signal, everyone has the right to choose what they want,\" said Ela, 60, who declined to give her full name. \"Moreover, people were arrested... I'm terrified of what's happening, that's why I came here.\" PARDON The former PiS government introduced reforms that critics say undermined the independence of the courts and threw the judicial system into disarray. Tusk's new government is trying to undo those reforms to unblock billions in funds that the European Union froze in reaction to the last government's policies. The announcement by Duda that he would pardon the two ex-ministers was the latest twist in a saga that has left the country in political turmoil since power passed to Tusk's coalition after October's election. Former Interior Minister Mariusz Kaminski and his deputy Maciej Wasik were arrested on Tuesday in a high-profile raid on the presidential palace and taken to prison.  After the arrests, Duda said he was outraged and \"would not rest\" until Kaminski and Wasik were freed. \"I decided to initiate pardon proceedings,\" the president told a press conference on Thursday. He said he was applying to the prosecutor general to suspend the men's sentences. A member of Tusk's cabinet said the government would not stand in the way of any legal move to pardon the two.  \"The courts decide, and such convicts are no different from thousands of other convicts every month in Poland,\" Tomasz Siemoniak, who is also the coordinator of Poland's special services, told Reuters. \"If they are legally pardoned, of course no one will oppose it.\"  It is the second time Duda had moved to pardon the pair over the same case. Kaminski and Wasik were first convicted of abuse of power in 2015 for allowing agents under the former's command to use entrapment in an investigation. They denied wrongdoing and were pardoned by Duda, allowing them to take up their government posts. In that case, lawyers questioned whether Duda had the power to pardon Kaminski before an appeals court had issued a final ruling. \nLast year, after Tusk came to power, the Supreme Court said the case should be reopened and Kaminski and Wasik were sentenced by a lower court in December to two years in prison.  They were not immediately sent to prison as a legal dispute played out over whether they had lost their immunity to prosecution as members of parliament."
}