{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBP08R_L.jpg",
  "title": "Canada ready to pay settlements to two men imprisoned in China in 2018 - report",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 26, 2023 09:33AM ET",
    "Updated Dec 26, 2023 12:12PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/canada-ready-to-pay-settlements-to-two-men-imprisoned-in-china-in-2018--report-3263595",
  "paragraph": "2/2\n© Reuters. An image of Canadian Michael Spavor, charged with espionage in June 2019, is projected on a screen at the Canadian embassy in Beijing, China August 11, 2021. REUTERS/Florence Lo/File Photo\n2/2\n(Reuters) - Canada's government is willing to sign off on multimillion-dollar settlement packages for Canadians Michael Spavor and Michael Kovrig to compensate them for the near three years they were incarcerated in Chinese prisons, the Globe and Mail reported on Tuesday, citing government sources. Federal lawyers are in compensation talks with the two men, who were detained in 2018, and are hoping to conclude financial settlements early in the new year, the media outlet said, adding that Canada was concerned by a potential lawsuit from Spavor that could put a spotlight on a government security reporting program. The Canadian government has offered around C$3 million ($2.27 million) to each but Spavor's lawyer sought C$10.5 million, alleging gross negligence on how Ottawa handled security reporting operations in China, the report added.  The Globe and Mail said the government was not prepared to offer C$10.5 million and that it was going to make the same offer to both men.  The government did not immediately respond to a request for comment. The two Canadian men could not immediately be reached. Spavor and Kovrig were taken into custody in China shortly after Canadian police detained Meng Wanzhou, the chief financial officer of Chinese telecoms equipment giant Huawei Technologies Co Ltd, on a U.S. warrant.  China had detained the two Canadian men for more than 1,000 days in a step that was at the center of Ottawa and Washington's dispute with Beijing. The men were released in 2021 on the same day the U.S. Justice Department dropped its extradition request for Meng and she returned to China. \nCanada and the United States say that the detention of the Canadian men - dubbed by Canadian media as \"the two Michaels\" in a case followed closely - was illegal and arbitrary, an accusation Beijing denies. ($1 = 1.3213 Canadian dollars)"
}