{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBP0E2_L.jpg",
  "title": "Trump shares poll showing voters associate potential second term with \"revenge\"",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Dec 26, 2023 06:00PM ET",
  "comments": [
    2,
    [
      [
        "Brad Albright",
        "2023-12-27 13:16:23",
        "Yes, because retribution against those who held Trumpo responsible for his crimes is an America First agenda. How people still continue to be duped by this narcissistic conman is beyond comprehension.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Michael McDonough",
        "2023-12-27 10:29:39",
        "Not true..Border invasion and Bidrn Crime ",
        "https://www.investing.com/members/240309369"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/trump-shares-poll-showing-voters-associate-potential-second-term-with-revenge-3263739",
  "paragraph": "© Reuters. FILE PHOTO: Former U.S. President and Presidential Republican candidate Donald Trump arrives to speak to his supporters during the Florida Freedom Summit held at the Gaylord Palms Resort & Convention Center in Kissimmee, Florida, U.S., November 4, 2023. \nBy Gram Slattery WASHINGTON (Reuters) - Republican presidential contender Donald Trump posted a poll on Truth Social on Tuesday, highlighting that the word voters most associate with a potential second term under his command is \"revenge.\" With campaigning ramping up ahead of the first Republican nomination contest, the post followed a separate Truth Social message on Christmas Day, in which the former president called on his political opponents to \"rot in hell.\" The fact Trump re-posted the poll, presented in the form of a word cloud with \"revenge\" placed centrally in bright red capital letters, suggests his self-described \"retribution\" agenda is very much on his mind as the United States heads into an election year. The poll was conducted by British pollster J.L. Partners. Trump and many of his allies have been pledging to investigate, incarcerate and otherwise take revenge on his political opponents if he wins the 2024 presidential election in a likely re-match against Democratic President Joe Biden. Facing dozens of federal charges, many related to his attempts to overturn his 2020 election loss, Trump claims he is himself the victim of a revenge campaign orchestrated by Biden and his Justice Department.  Trump, 77, the clear frontrunner for the Republican presidential nomination, denies any wrongdoing. Earlier in December, former Trump advisers Steve Bannon and Kash Patel, both of whom are still close to the former president, said on a podcast that Trump was \"dead serious\" about exacting revenge against perceived enemies. Trump himself has repeatedly promised retribution against his political opponents during a potential second term, suggesting he would direct federal law enforcement agencies to investigate foes. In an interview with conservative media personality Sean Hannity earlier in December, Trump pledged not to abuse his power or become a dictator \"except on day one.\" Taken together, Trump's comments portend a rough-and-tumble election season. The Iowa caucus, which kicks off the Republican presidential nominating contest, is set for Jan. 15, and Trump and his allies will be hosting a slew of campaign events in the state starting Jan. 3. Trump's main rivals for the Republican nomination, Florida Governor Ron DeSantis and former United Nations Ambassador Nikki Haley, will also be campaigning hard in Iowa and the second nominating state of New Hampshire in coming days. In the Tuesday social media post, Trump shared the results of a poll commissioned by DailyMail.com, in which voters were asked to provide a word they most associate with Trump's plans for a second term. The results, presented in the form of a word cloud, indicated that \"revenge\" was the most popular choice. \"Power,\" \"dictatorship,\" \"economy\" and \"America\" rounded off the top five. In the Dec. 25 Truth Social post, Trump directed his attacks toward those who disagreed with him politically, whom he called \"thugs\". \"MAY THEY ROT IN HELL,\" Trump wrote. \"AGAIN, MERRY CHRISTMAS!\" A representative for the Biden campaign did not immediately respond to a request for comment. \nIn a Dec. 21 memo, Biden campaign manager Julie Chavez Rodriguez portrayed Trump's candidacy as a threat to democracy. \"He is running a campaign on revenge and retribution – and at the expense of Americans' freedoms,\" she wrote."
}