{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0A0OC_L.jpg",
  "title": "Russia's Medvedev warns of nuclear response if Ukraine hits missile launch sites",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 11, 2024 09:50AM ET",
    "Updated Jan 11, 2024 09:56AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Ken Roth",
        "2024-01-11 17:53:23",
        "Sure! We are so scared medvedev !he should be more concerned that moscow or st. Petersborg is not obliterated from the world map",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/russias-medvedev-warns-of-nuclear-response-if-ukraine-hits-missile-launch-sites-3272602",
  "paragraph": "© Reuters. FILE PHOTO: Russia's Deputy head of the Security Council Dmitry Medvedev, accompanied by Deputy Defence Minister Nikolay Pankov, visits the Prudboi military training ground in Volgograd region, Russia June 1, 2023. Sputnik/Yekaterina Shtukina/Pool via REU\nMOSCOW (Reuters) - A senior ally of President Vladimir Putin warned on Thursday that any Ukrainian attacks on missile launch sites inside Russia with arms supplied by the United States and its allies would risk a nuclear response from Moscow. Former Russian President Dmitry Medvedev, now deputy chairman of Russia's Security Council, said that some Ukrainian military commanders were considering hitting missile launch sites inside Russia with Western-supplied long-range missiles. He did not name the commanders or disclose more details of the alleged plan and there was no immediate reaction from Ukraine to his threat.  \"What does this mean? It means only one thing – they risk running into the action of paragraph 19 of the fundamentals of Russia's state policy in the field of nuclear deterrence,\" Medvedev wrote on the Telegram messaging app.  \"This should be remembered,\" Medvedev said. Paragraph nineteen of Russia's 2020 nuclear doctrine sets out the conditions under which a Russian president would consider using a nuclear weapon: broadly as a response to an attack using nuclear or other weapons of mass destruction, or to the use of conventional weapons against Russia \"when the very existence of the state is put under threat.\" Medvedev made specific mention of point \"g\" of paragraph nineteen which deals with the nuclear response to a conventional weapons attack. Putin is the decision-maker when it comes to Russia's vast nuclear arsenal, but diplomats say Medvedev's views give an indication of hawkish thinking at the top of the Kremlin which has cast the war as an existential struggle with the West. Kremlin critics have dismissed some of Medvedev's nuclear threats in the past as attempts to grab attention or to dissuade the West from supplying Ukraine with more weapons. The United States and its allies have pledged nearly $250 billion in military and other support to Kyiv. The risk of nuclear escalation has hung over the Ukraine war since Russia sent thousands of troops into its neighbour in February 2022.  Washington feared a Russian nuclear escalation in late 2022 and Jake Sullivan, the White House national security adviser, that year communicated concerns to Moscow about any steps towards the use of a nuclear device.  \nRussia and the United States are by far the world's biggest nuclear powers: Putin controls 5,889 nuclear warheads while U.S. President Joe Biden controls about 5,244 nuclear warheads, according to the Federation of American Scientists.  Medvedev cast himself as a liberal moderniser when he was president from 2008-2012, but now presents himself as one of the fiercest anti-Western Kremlin hawks."
}