{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK1102P_L.jpg",
  "title": "Plane crashes into Florida mobile home, killing pilot, two others",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 01, 2024 10:09PM ET",
    "Updated Feb 02, 2024 01:45PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/small-plane-crash-demolishes-home-in-florida-mobile-home-park-3290705",
  "paragraph": "© Reuters. A plume of smoke rises after a small plane crashes in a trailer park in Clearwater, Florida, U.S., February 1, 2024, in this screen grab obtained from a social media video. Steven Ascari/via REUTERS\nBy Daniel Trotta and Kanishka Singh (Reuters) -A pilot and two people on the ground were killed after a small plane crashed into and demolished a mobile home in Clearwater, Florida, the Federal Aviation Administration (FAA) said on Friday.  A Beechcraft Bonanza V35B, a six-seat single engine aircraft, slammed into a large mobile home park on the east side of the city at about 7:10 p.m. local time on Thursday, causing a fire with smoke billowing from the scene. Clearwater is a city of about 117,000 people on the Gulf Coast about 24 miles (40 km) west of Tampa. \"A mobile home doesn't withstand much in the first place, so the aircraft pretty much demolished it. The fire consumed the rest,\" Clearwater fire Chief Scott Ehlers said, adding that three other mobile homes were damaged.  The pilot had radioed in a distress call to the St. Pete-Clearwater International Airport. The airfield tower then lost contact with the plane that was about three miles north of the runway, Ehlers said.  The pilot reported an engine failure, an FAA spokesperson was quoted as saying by CNN on Thursday.  On Friday, the FAA said on its website that a pilot and two people on the ground were killed in the crash.  \nNeighbor Steven Ascari, who posted video of the scene on social media, said first responders arrived quickly and put out the flames within half an hour.  \"We heard an explosion outside that shook the entire apartment and next thing you know a giant pillar of smoke was seen,\" Ascari said."
}