{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0N0I4_L.jpg",
  "title": "Explainer-Plane crash in western Russia - what we know so far",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 24, 2024 08:55AM ET",
    "Updated Jan 25, 2024 11:31AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/plane-crash-in-western-russia--what-we-know-and-dont-know-3281831",
  "paragraph": "© Reuters. A Russian military transport plane crashes near Yablonovo, Belgorod Region, Russia, January 24, 2024, in this screen grab from a social media video obtained by REUTERS\n(Reuters) - Russia has accused Ukraine of shooting down a military transport plane carrying 65 captured Ukrainian soldiers to a prisoner exchange. Ukraine has neither confirmed nor denied the accusation but has challenged details of Russia's account and has demanded an international investigation. Here's a summary of what we know so far.         WHAT WAS THE PLANE AND WHO WAS ON BOARD?    The aircraft was an Ilyushin Il-76, a large military transport plane designed to carry troops, cargo or weapons. Russia said that beside the 65 Ukrainian PoWs there were six Russian crew members and three Russian soldiers on board. The plane crashed in a huge fireball, killing all 74 people on board, the Russian defence ministry said.    Ukrainian military intelligence said it had no reliable information about who was aboard the crashed plane. Ukraine's human rights commissioner told Reuters on Thursday that a list shared in Russian media of the PoWs said to have been on board had discrepancies and had included the names of prisoners who had already been exchanged.         WHERE DID IT HAPPEN?    The crash took place just northeast of Belgorod in western Russia, close to the border with Ukraine. Belgorod region has been the target of cross-border attacks by Ukraine but this, if the toll is confirmed, would be by far the deadliest single incident of its kind in the almost two-year-old war to take place inside Russia's internationally recognised territory.            WHAT CAUSED THE CRASH?    Russia's defence ministry accused Ukrainian forces of shooting down the plane, saying Russian radar had detected the firing of two Ukrainian missiles from Ukraine's Kharkiv region. Earlier, Russian lawmaker and former general Andrei Kartapolov had spoken of three missiles and said they were either U.S. Patriots or German-made IRIS-Ts. He said investigators would determine exactly what kind of missiles were used when they recovered fragments from the crash site. Kartapolov said on Thursday that Ukrainian military intelligence had been given a 15-minute warning that the plane carrying the PoWs was about to enter the area where it was then shot down. Kyiv denied this assertion, saying on Thursday it had received neither verbal nor written requests from Moscow to refrain from attacks in the area.    Ukrainian military intelligence said Russia's accusations could be \"a planned action to destabilise the situation in Ukraine and weaken international support for our state\". Its spokesperson Andriy Yusov also cited a Russian defence ministry report that said its forces had shot down a Ukrainian drone in the region before the reports of a plane crashing emerged on social media.  \nYusov said Ukraine had been using reconnaissance drones in the area, and that Russia had launched attack drones to try to bring down the Ukrainian drones. There was no confirmed information that Ukraine had hit any targets, he said.         WHAT WAS THE PRISONER EXCHANGE THAT WAS PLANNED?    Russia's defence ministry said an exchange had been due to take place at the Kolotilovka checkpoint on the border between Russia and Ukraine. It said the plane that was shot down had been flying from the Chkalovsky airbase near Moscow to Belgorod, in which case it would have been in the final stage of its flight.    Ukrainian military intelligence confirmed a swap was planned for Wednesday and said Kyiv had met all the terms for it, but it was not informed by Russia about the means of transport for the prisoners of war, and their routes. It said that unlike in previous exchanges, Ukraine had not been asked to guarantee the security of airspace over Belgorod at a specific time.  Russian lawmaker Kartapolov said the plane had not been escorted by Russian fighter planes because the flight had been agreed with the Ukrainians in advance. He said a second Il-76 transport plane carrying around 80 more Ukrainian soldiers to the exchange had managed to turn around.    Russia and Ukraine have carried out several big prisoner swaps in the course of the war."
}