{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0N050_L.jpg",
  "title": "Taiwan president-elect signals desire to join US-led trade framework",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 24, 2024 01:25AM ET",
    "Updated Jan 24, 2024 02:20AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/taiwan-presidentelect-signals-desire-to-join-usled-trade-framework-3281244",
  "paragraph": "© Reuters. FILE PHOTO: Taiwan President-elect Lai Ching-te, of Democratic Progressive Party's (DPP) gestures as he attends a rally following the victory in the presidential elections, in Taipei, Taiwan January 13, 2024. REUTERS/Ann Wang/File Photo\nTAIPEI (Reuters) -Taiwan's president-elect, Lai Ching-te, signalled on Wednesday his desire for Taipei to join the U.S.-led Indo-Pacific Economic Framework, considering the island's key role in the global economy. The United States excluded chip powerhouse Taiwan from the framework, part of the Biden administration's effort to counter what it says is Beijing's increasing economic and military coercion in the region, when it was set up in 2022. But the United States then set up the U.S.-Taiwan Initiative on 21st Century Trade, which joins the U.S.-Taiwan Economic Prosperity Partnership Dialogue and Technology Trade and Investment Collaboration Framework the two sides have. Taiwan plays a key role in the global economy and the three existing structures \"echo the issues valued by the Indo-Pacific Economic Framework\", Lai told the U.S.-Taiwan Business Council at a meeting in Taipei. \"I very much hope that this can become an important basis for Taiwan to join the Indo-Pacific Economic Framework in the future,\" a statement from the presidential office cited Lai as saying. Lai, who takes over as Taiwan's new president on May 20, is now its vice president. Taiwan is a major producer of chips used in everything from microwaves to iPhones and fighter jets, and is home to TSMC, the world's largest contract chipmaker. In a separate statement, the Foreign Ministry said two U.S. lawmakers, Mario Diaz-Balart and Ami Bera of the Congressional Taiwan Caucus, would visit Taiwan from Wednesday to Friday, meeting both Lai and President Tsai Ing-wen.  Taiwan has previously sought to join the Indo-Pacific Economic Framework. In November, U.S. negotiators pressed hard to complete trade talks on the Indo-Pacific Economic Framework initiative, but failed to reach a deal in time for a summit of the Asia Pacific Economic Co-operation, at which Biden had hoped to showcase it as an alternative to deeper trade ties with China.  \nChina, which claims Taiwan as its own territory despite the objections of the government in Taipei, has condemned the U.S. Indo-Pacific push, saying Washington is creating \"exclusive clubs\". Any Taiwan participation in the Indo-Pacific Economic Framework would probably further strain Sino-U.S. ties, with Beijing angered by any show of support from Washington for the island."
}