{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0500W_L.jpg",
  "title": "Taiwan slams Chinese balloons as safety threat, psychological warfare",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 05, 2024 09:37PM ET",
    "Updated Jan 06, 2024 08:06PM ET"
  ],
  "comments": [
    4,
    [
      [
        "Ac Tektrader",
        "2024-01-07 07:37:06",
        "the Chinese totalitarian state, unlike the democratic west, terriorize their own citizens and bullies the Chinese living in other countries, when they refuse to say or spy for them, and they will lie and steal to get what they want.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "john wick",
        "2024-01-07 07:19:15",
        "As if taiwanese dont spy. As if cia and fbi dont spy. Cia is the world's biggest spy agency, spying around the world and on american citizens. ",
        "https://www.investing.com/members/256103011"
      ],
      [
        "Luke InTx",
        "2024-01-06 19:09:40",
        "bully of the day by CPC. ",
        "https://www.investing.com/members/211337029"
      ],
      [
        "Stoxer One",
        "2024-01-06 19:05:27",
        "They don't want to hide, mor/on. They just want to protect their democracy and freedom from communist, totalitarian China. ",
        "https://www.investing.com/members/200770726"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/taiwan-says-chinese-balloons-threaten-aviation-safety-3268512",
  "paragraph": "© Reuters. FILE PHOTO: Chinese and Taiwanese flags are seen through broken glass in this illustration taken, April 11, 2023. REUTERS/Dado Ruvic/Illustration/File Photo\nBy Ben Blanchard TAIPEI (Reuters) -Taiwan's defence ministry accused China on Saturday of threatening aviation safety and waging psychological warfare on the island's people with a recent spate of balloons spotted near or over the island, days before key Taiwanese elections. The potential for China to use balloons for spying became a global issue in February when the United States shot down what it said was a Chinese surveillance balloon. China said the balloon was a civilian craft that accidentally drifted astray. Taiwan is on high alert for Chinese military and political activity ahead of the Jan. 13 presidential and parliamentary elections. It says China is exerting military and economic pressure in an attempt to interfere in the elections. China views the island as its own territory, a claim Taiwan's government rejects. Since last month Taiwan's defence ministry has reported several instances of Chinese balloons flying over the sensitive Taiwan Strait. It has said over the past week some balloons had flown over Taiwan island near major air bases. In a statement on Saturday, the ministry said the balloons were a \"serious threat\" to international aviation safety given their flight paths. \"We also express our condemnation of the Chinese communists' disregard for aviation safety and its disregard for the safety of passengers on cross-Taiwan Strait and international flights,\" it said. The ministry said its analysis was that the balloons were part of China's \"grey zone\" tactics against Taiwan \"in an attempt to use cognitive warfare to affect the morale of our people\". This was stronger than Taiwan's previous assertions that the balloons appeared to be mostly for weather monitoring, driven by prevailing winds at this time of year. China's Taiwan Affairs Office referred Reuters to previous comments stating that Taiwan's ruling Democratic Progressive Party (DPP) was \"hyping up the threat from the mainland as the election approaches\" and inciting confrontation. China's defence ministry declined to comment on the balloons at a monthly news conference in December. Taiwan Vice President Lai Ching-te, the DPP's presidential candidate, told a campaign event on Saturday that China was using its warships, warplanes and fake news to \"divide Taiwan\". \"I urge you all with your sacred votes to tell the world that Taiwan will not surrender to an authoritarian regime but will continue to choose democracy and freedom,\" Lai said, according to his campaign team.  STRONGER WORDING In a separate statement on Saturday, Taiwan's defence ministry said that during the previous 24 hours it had detected two more Chinese balloons, one of which briefly flew over the far northern tip of the island. Taiwan has complained for four years of stepped-up Chinese military action such as fighter jets regularly flying over the strait as part of a \"grey zone\" strategy attempting to wear down Taiwan with offensive actions that stop short of full-blown conflict. The United States, Taiwan's most important international backer and arms supplier, has watched with alarm as tensions over the semiconductor powerhouse island have risen. Asked about the balloons at a news conference in Washington on Thursday, White House national security spokesman John Kirby (NYSE:KEX) said he could not comment. \"We obviously support the democracy and the democratic institutions of Taiwan, and we want to see free, fair, open, transparent elections there.\" he said. \"And we're certainly mindful that outside actors could try to interfere.\" China says the Taiwan government's repeated accusations of election interference are \"dirty tricks\" aimed at boosting the chances of the ruling Democratic Progressive Party, which Beijing detests, calling them separatists. \nA Western security source, speaking on condition of anonymity as they were not authorised to speak to the media, said China was sending a very simple pre-election message to Taiwan with the balloons. \"We are watching you closely and you can't hide,\" the source said."
}