{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0H0BR_L.jpg",
  "title": "Israeli forces pound Khan Younis near major Gaza hospital",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 18, 2024 05:20AM ET",
    "Updated Jan 19, 2024 05:27AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/battle-of-khan-younis-threatens-biggest-hospital-still-functioning-in-gaza-3277054",
  "paragraph": "5/5\n© Reuters. A woman looks on at the site of an Israeli strike on a house, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, in Rafah in the southern Gaza Strip, January 18, 2024. REUTERS/Mohammed Salem\n2/5\nBy Bassam Masoud, Nidal al-Mughrabi and Dan Williams GAZA/DOHA/JERUSALEM (Reuters) -Israeli forces advanced into the southern Gaza Strip's main city on Thursday, pounding areas near the enclave's biggest functioning hospital, as Prime Minister Benjamin Netanyau vowed \"many more months\" of fighting until total victory is achieved. The heaviest battle of the year was under way in Khan Younis, sheltering hundreds of thousands of people who fled the north earlier in the war, now in its fourth month. Residents described heavy fighting and intense bombardment in the north and east of the city and, for the first time, in the west, where they said tanks had advanced to carry out a raid before withdrawing. Khan Younis residents said on Thursday the fighting had come within a whisker of Nasser Hospital, the biggest hospital still working in the enclave. It has been receiving hundreds of wounded patients a day, crammed into wards and treated on the floors since the fighting shifted to the south last month. \"What is happening in Khan Younis now is complete madness: the occupation bombards the city in all directions, from the air and the ground too,\" said Abu El-Abed, 45, now living in Khan Younis after being displaced several times with his family of seven since leaving Gaza City in the north earlier in the war. Israeli officials have accused Hamas fighters of operating from Nasser Hospital, which staff deny.  In an update on progress, Netanyahu said the Israel Defense Forces had destroyed \"16 or 17\" out of 24 of Hamas' organised combat regiments, adding the next step would be \"clearing the territory\" of militants.  \"The first action is usually shorter, the second usually takes longer,\" Netanyahu said at a news briefing. \"Victory will take many more months but we are determined to achieve it.\"  The Israeli military said a brigade in Khan Younis, now operating further south than troops had ventured before, had \"eliminated dozens of terrorists in close-quarters combat and with the assistance of tank fire and air support\". It said it had killed 60 fighters in the previous 24 hours, including 40 in Khan Younis.  The charity Medecins Sans Frontieres, which has doctors at the city's Nasser Hospital, said patients and displaced people sheltering there were fleeing in panic. In Rafah, further south, where more than half of Gaza's 2.3 million people are now crammed into a small city by the Egyptian border, 16 bodies were laid out on the bloodstained cobbles outside a morgue, most in white shrouds, a few in body bags. A branch of the Zameli family had been wiped out in a strike that destroyed their home overnight. Half the bundles were tiny, holding the bodies of small children. A grey-haired man howled in sorrow as he clung to one of the bodies, burying his face in the face of the shrouded corpse. A woman in a pink headscarf keened and stroked one of the shrouds. At the scene of the bombing, a tattered schoolbag lay in the rubble. Tears rolled down the cheeks of 10-year-old cousin Mahmoud al-Zameli, who lived next door and had escaped. \"Yesterday, I was playing with the children over there. They have all died,\" he sobbed. \"I'm the only one still alive.\" TOO MANY CIVILIANS DYING Gaza health authorities said on Thursday the war's death toll had risen to 24,620 with many more feared buried under the rubble. More than 170 were killed in the past 24 hours. Israel claims it has killed 9,000 Hamas fighters. The U.S. again warned there had been too many civilian casualties in Gaza and vowed to keep working for a two-state solution. \"There will be a post-conflict Gaza, no reoccupation of Gaza,\" White House national security adviser John Kirby (NYSE:KEX) told reporters aboard Air Force One.  Reiterating his plans for a post-conflict Gaza, Netanyahu said the enclave must be demilitarized and run by a civil administration that does not preach the destruction of Israel.  Israel has said it is planning to wind down its ground operations and shift to smaller-scale tactics. But it appeared determined to first capture all of Khan Younis, which it says is now the principal base for the Hamas fighters who stormed across the border on Oct. 7, killing 1,200 people and seizing 253 hostages. In central Gaza, the Israeli military said it had destroyed facilities that were the \"heart of Hamas' weapons manufacturing industry\". Reuters could not independently verify the assertion. HOSPITALS Two-thirds of Gaza's hospitals have now ceased functioning and losing Nasser would curtail the limited trauma care still available. In a statement on Thursday, Hamas denied claims aired by released Israeli hostage Sharon Aloni in an interview on CNN that she and other prisoners had been detained in rooms in Nasser Hospital.  The group \"considers this to be in line with the lies of Israel and its old and new incitement against hospitals to justify its destruction of them\". In November, Israel stormed Al-Shifa hospital in northern Gaza and showed what it said were Hamas weapons and equipment found on the premises.  MSF Head of Mission for Palestine Leo Cans, who reached Nasser Hospital, said fighting had come \"very close\". \"The wounded people that we take care of, many of them lost their legs, lost their arms. There are really complex wounds that require a lot of surgery. And we don't have the capacity to do this now.\" \nIsraelis marked the first birthday of the youngest hostage, baby Kfir Bibas, who was not among scores of women and children freed during a truce in November. Hamas says it is no longer holding children, and that Kfir and his family were killed in an Israeli air strike, though it has released no images confirming their deaths. \"His whereabouts are unknown,\" Israeli President Isaac Herzog said at the World Economic Forum in Davos, sitting next to a photograph of the baby. \"I call upon the entire universe to work endlessly to free Kfir and all the hostages.\""
}