{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0G0HF_L.jpg",
  "title": "From an Arctic prison, Navalny says Putin's Russia will one day crumble",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 17, 2024 08:28AM ET",
  "comments": [
    1,
    [
      [
        "Ken Roth",
        "2024-01-17 14:18:09",
        "We all hope Navalnys vision come true as soon as possible so we can be friends with the russian people again.",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/from-an-arctic-prison-navalny-says-putins-russia-will-one-day-crumble-3276283",
  "paragraph": "© Reuters. FILE PHOTO: Russian opposition leader Alexei Navalny is seen on a screen via video link from a penal colony in the Vladimir Region during a hearing at the Basmanny district court in Moscow, Russia April 26, 2023. REUTERS/Yulia Morozova\nBy Guy Faulconbridge MOSCOW (Reuters) - Russia's most famous opposition politician, Alexei Navalny, said on Wednesday that President Vladimir Putin's state would one day crumble along with the post-Soviet elite which he cast as venal, power-hungry and duplicitous. Navalny, 47, a former lawyer who rose to prominence more than a decade ago by lampooning Putin's elite and voicing allegations of vast corruption, is currently in a jail about 60 km (40 miles) north of the Arctic Circle. \"The polygamists have become conservatives in our country. The members of the CPSU (Communist Party of the Soviet Union) are now Orthodox (Christian). The owners of 'golden passports' and offshore accounts are now aggressive patriots,\" Navalny said in a social media post facilitated by his supporters. \"Lies, lies and nothing but lies,\" Navalny said. \"It will collapse and crumble. Putin's state is not viable. One day we will look at his place and he won't be there.\" Navalny, who has been sentenced to stay in jail until he is 74, has repeatedly warned that Putin's Russia is a state run by \"thieves and criminals\" and that one day there will be seismic change via revolt.  Ever since Putin rose to the Kremlin's top job on the last day of 1999, opponents have more than once predicted his political demise and been wrong.  Russian authorities dismiss Navalny's criticism as nonsense and say that he and his supporters are extremists with links to the U.S. CIA intelligence agency intent on sowing discord in Russia.  Navalny is in jail, his movement is outlawed and most of his key supporters have fled abroad.  He earned admiration from the divided Russian opposition for voluntarily returning to Russia in 2021 from Germany where he underwent treatment for what Western laboratory tests showed was an attempt to poison him with a nerve agent in Siberia. On his return he was jailed. Russia denies Navalny's claims that Russia's secret police poisoned him with Novichok. Navalny said that fellow prisoners repeatedly asked him \"Why did you return?\" He said that modern Russia had been instilled with \"cynicism and conspiracy\" to such an extent that many people no longer believed in simple motivations, suspecting instead that he was part of some secret Kremlin intrigue. \n\"I have my country and my convictions. And I don't want to give up my country or my beliefs,\" Navalny said. \"And I cannot betray either the first or the second.\"  \"If your beliefs are worth anything, you should be ready to stand up for them. And if necessary, make sacrifices.\""
}