{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0P0CF_L.jpg",
  "title": "Brazil Indigenous group's crisis persists after 308 deaths in 2023, report says",
  "category": "Commodities news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 26, 2024 06:15AM ET",
    "Updated Jan 26, 2024 06:41AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/commodities-news/brazil-indigenous-groups-crisis-persists-after-308-deaths-in-2023-report-says-3283907",
  "paragraph": "By Anthony Boadle BRASILIA (Reuters) - The Brazilian government's effort to evict illegal gold miners from the Yanomami Indigenous reservation in the northern Amazon (NASDAQ:AMZN) has stalled with outsiders increasingly invading the vast territory, Yanomami leaders said on Friday. The Hutukara Yanomami Association released a report on the year since President Luiz Inacio Lula da Silva declared a humanitarian emergency and sent military and police to expel the miners. It said the situation remains bleak for the 30,000 Yanomami nation who live in the rainforest on the border with Venezuela, with malnutrition, disease and violence plaguing their communities. The report said 308 Yanomami died in 2023, of which 129 deaths were due to infectious diseases and parasitic and respiratory diseases. At least seven Indigenous people died from gunshot wounds in clashes with wildcat miners, it said. \"Authorities must do more. I ask them to go after and jail the bosses behind the illegal mining who have never been arrested,\" said Yanomami chief and shaman Davi Kopenawa. \"They must be put in prison, because the miners leave but then come back. Their machines destroy everything, knock down the forest and poison the river and the fish we live off,\" he said in a video issued with the report. \"Enough is enough.\" The report said illegal mining and deforestation have slowed, but the continued presence of armed miners makes it impossible for intimidated health workers to care for the Yanomami who have not been vaccinated properly. The presence of security forces in the first half of last year reduced the number of invaders by 80%, according to the report, but after the military scaled back operations, the miners soon started returning. An elite special forces unit of the environmental protection agency Ibama told Reuters in December they have been left to chase the miners on their own with no military support. In a meeting with environmental and Indigenous protection agencies and the commander of the armed forces earlier this month, Lula decided on a renewed task-force operation with the military involved again to restore the presence of the state. \nThe Federal Police have reinforced investigations to track the financial backers and suppliers of precursor substances like mercury, after 13 such operations in 2023 that seized 590 million reais ($120 million) worth of goods, mainly gold, Humberto Freire, director of the police's Environment and Amazon department, told Reuters. ($1 = 4.9240 reais)"
}