{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0704P_L.jpg",
  "title": "Ecuador's 'most-wanted' criminal disappears from prison",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 07, 2024 11:51PM ET",
    "Updated Jan 08, 2024 04:54PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/ecuadors-mostwanted-criminal-disappears-from-prison-3268745",
  "paragraph": "© Reuters. Members of Ecuadorean Armed Forces stand guard outside the Zonal prison number 8 after the transfer of the criminal leader Jose Adolfo Macias Villamar, known as \"Fito\",from the prison, in Guayaquil, Ecuador August 14, 2023. REUTERS/Vicente Gaibor del Pino\nBy Alexandra Valencia QUITO (Reuters) - Ecuador's \"most-wanted prisoner\", the leader of the Los Choneros criminal group, disappeared from the jail where he was being held, authorities said on Sunday and launched an operation to locate him. General Cesar Zapata, the national commander of police, told a press conference that the country's armed forces had determined that one of the inmates in the Guayaquil prison was missing.  While Zapata did not mention the inmate by name, the prosecutor's office said it would investigate \"the alleged escape\" of Jose Adolfo Macias, the leader of Los Choneros. Macias, whose alias is \"Fito\", was sentenced in 2011 to 34 years in prison for various crimes including drug trafficking and murder. Los Choneros is a criminal organization authorities have linked to extortion, murder and drug trafficking, among other crimes, and accused of controlling the country's main prisons. \n\"We're grateful for the courage and commitment of the law enforcement forces, who, in an operation involving more than 3,000 people, have intervened in the prison in search of the most-wanted prisoner,\" said presidential spokesman Roberto Izurieta at the press conference. Rival criminal organizations frequently clash in Ecuador's overcrowded prisons and official numbers show more than 400 inmates have died since 2021."
}