{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0P0AI_L.jpg",
  "title": "Analysis-North Korea signals confrontation, no signs of war preparation",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 26, 2024 05:11AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/analysisnorth-korea-signals-confrontation-no-signs-of-war-preparation-3283827",
  "paragraph": "© Reuters. Ballistic missile, said to be solid-fuel and hypersonic, launches during a test at an unspecified location in North Korea in this picture released by the Korean Central News Agency on January 14, 2024. KCNA via REUTERS ATTENTION EDITORS - THIS IMAGE W\nBy Josh Smith SEOUL (Reuters) - North Korea is stepping up confrontation with the United States and its allies, but officials in Washington and Seoul say they have spotted no signs Pyongyang intends to take imminent military action. Kim Jong Un's government is likely to continue or even increase provocative steps, officials and analysts say, after it made strides in ballistic missile development, bolstered cooperation with Russia and scrapped its decades-long goal of peacefully reuniting with South Korea. Analysts at a prominent think tank said in a report this month that Kim \"has made a strategic decision to go to war\", just as his grandfather did in 1950, taking advantage of a U.S. distracted by wars in Ukraine and the Middle East, and doubts caused by its withdrawal from Afghanistan. But U.S. and South Korean officials do not sense a looming war. \"While we are not seeing indications of a direct military threat at this time, we continue to monitor for the risk of (North Korea) military action against (South Korea) and Japan,\" a U.S. official said.  South Korean Defence Minister Shin Won-sik this month rejected as an \"excessive exaggeration\" claims by some U.S. experts that the likelihood of war on the Korean Peninsula was the highest since the Korean War, which ended in an armistice in 1953 - leaving the North and South still technically at war. Such arguments play into the hands of North Korea's psychological warfare, Shin told a radio station. Japan is closely following Pyongyang's rhetoric and actions, a foreign ministry spokesperson said, declining to specify whether Tokyo believed North Korea was planning some kind of military action. 'NOT LOOKING AT WAR' \"I can rest pretty darn assured we're not looking at war,\" said Sydney Seiler, who retired as national intelligence officer for North Korea at the U.S. National Intelligence Council last year. \"North Korea just is not ready for it. It's not postured for it.\" Adding uncertainty to the outlook, Donald Trump is polling strongly against U.S. President Joe Biden ahead of a likely rematch in November's election. As president, Trump threatened to withdraw U.S. troops from South Korea and engaged in both fiery brinkmanship and unprecedented diplomacy with Kim, at one point saying \"we fell in love\" after the two exchanged letters. Trump has denied a report that, if elected again, he would consider a deal with Kim that would let North Korea keep its nuclear weapons while offering it financial incentives to stop making bombs. Whoever occupies the White House next year will face a Pyongyang emboldened by its unchecked ballistic missile and nuclear weapons arsenal, and increased backing from Russia and China that has fractured a tenuous international sanctions regime against Pyongyang. North Korea could further increase pressure on the allies around South Korean parliamentary elections in April, as well as the U.S. vote, Shin acknowledged. \"Before the U.S. presidential election, the North could try to tip the strategic environment in its favour with high-intensity provocations such as the launch of spy satellites and intercontinental ballistic missiles or a seventh nuclear test, aimed at influencing the withdrawal of hard-line North Korea policies,\" the defence minister told Yonhap news agency. 'MILITARY SOLUTION'? The report stirring the war debate was by two longtime Korea watchers: U.S. former intelligence analyst Robert Carlin and nuclear scientist Siegfried Hecker. They warned of \"wreckage, boundless and bare\" if Washington, Seoul and Tokyo failed to heed warning signs. \"The North’s view that the global tides were running in its favour probably fed into decisions in Pyongyang about both the need and opportunity - and perhaps the timing - toward a military solution to the Korean question,\" they wrote in an article for the 38 North project at the Stimson Center think tank in Washington. North Korea has fundamentally changed its strategic thinking, abandoning the goal of eventually improving ties with Washington after failed Kim-Trump summits, improving ties with China and Russia, and drastically hardening its stance toward the South, they argued. But many other observers say the greater risk is border clashes or other small if deadly incidents. North Korea could take an \"adventurous act\" such as firing artillery near a disputed maritime border, as it did this month, or sinking a South Korean warship, as it did in 2010, said a Japanese former government security adviser. From Kim's perspective, he is responding in a \"very rational and understandable\" way to changes such as heightened cooperation by the U.S., South Korea and Japan to check North Korea, he said. Seiler, the U.S. former intelligence official who now works with the Center for Strategic and International Studies, said Kim's near-term domestic priority seems to be addressing economic disparities in the provinces. \"We know that Kim is looking at economic objectives,\" he said. \"This is not a country that is going to a war footing.\" \nAn Atlantic Council report in November concluded that allied deterrence was \"crumbling\", and while all-out war was very unlikely, North Korea might feel emboldened to make more active military moves to improve its leverage or weaken connections between the United States and its Asian allies. \"Pyongyang’s regime almost certainly knows it cannot survive if it triggers an all-out nuclear exchange, but it will probably see greater viability for limited nuclear employment in the next five to ten years,\" the report said."
}