{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBO079_L.jpg",
  "title": "Gaza war to last months, Israel army chief says; escalation alarms UN",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 25, 2023 06:44PM ET",
    "Updated Dec 27, 2023 12:56AM ET"
  ],
  "comments": [
    2,
    [
      [
        "Maximus Maximus",
        "2023-12-26 18:41:01",
        "stop the genocide.",
        "https://www.investing.com/members/204570756"
      ],
      [
        "Ken Roth",
        "2023-12-26 17:01:34",
        "Isreal will need to hunt down hamas leaders living the good life far away from Gaza in other countries, like they did with the na…zis after ww2",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/netanyahu-vows-no-letup-in-war-but-un-worker-says-gazans-have-no-place-to-go-3263269",
  "paragraph": "5/5\n© Reuters. An armoured personnel carrier (APC) is seen silhouetted as the sun sets, amid the conflict between Israel and the Palestinian Islamist group Hamas, near the Israel-Gaza border, in Southern Israel, December 25, 2023. REUTERS/Violeta Santos Moura\n2/5\nBy Nidal al-Mughrabi, Bassam Masoud and Maayan Lubell CAIRO/GAZA/JERUSALEM (Reuters) -Israel's war on Hamas will last for months, Israel's military chief said on Tuesday while the United Nations voiced alarm over an escalation of Israeli attacks that killed more than 100 Palestinians over two days in part of the Gaza Strip. Israel's Chief of Staff Herzi Halevi told reporters in a televised statement on the Gaza border that the war would go on \"for many months\".  \"There are no magic solutions, there are no shortcuts in dismantling a terrorist organization, only determined and persistent fighting,\" Halevi said. \"We will reach Hamas' leadership too, whether it takes a week or if it takes months.\"  Israeli actions intensified around Christmas, particularly in a central area just south of the seasonal waterway that bisects the Gaza Strip. The Israeli army told civilians to leave the area, though many said there was no safe place left to go. \"We are gravely concerned about the continued bombardment of Middle Gaza by Israeli forces, which has claimed more than 100 Palestinian lives since Christmas Eve,\" said U.N. Human Rights Office spokesperson Seif Magango. \"Israeli forces must take all measures available to protect civilians. Warnings and evacuation orders do not absolve them of the full range of their international humanitarian law obligations.\" The U.N. on Tuesday said Sigrid Kaag, the outgoing Dutch finance minister, will be coordinator for humanitarian relief shipments into Gaza as part of a U.N. Security Council resolution adopted on Friday. Israel is determined to destroy Hamas despite global calls for a ceasefire in the 11-week-old war and new concerns the conflict could spread, with U.S. and Iran-aligned forces attacking each other elsewhere in the region. Since Hamas killed 1,200 people and captured 240 hostages on Oct. 7 in the deadliest day in Israeli history, Israeli Prime Minister Benjamin Netanyahu has responded with an assault that has laid much of Hamas-ruled Gaza to waste. Palestinian health authorities said nearly 21,000 people had been killed in Israeli strikes, with thousands more feared buried under rubble. Nearly all of the enclave's 2.3 million people have been driven from their homes, many several times. Israel says it is doing what it can to protect civilians, and blames Hamas for putting them in harm's way by operating among them, which Hamas denies. But even Israel's closest ally the United States has said it should do more to reduce civilian deaths from what President Joe Biden has called \"indiscriminate bombing\". ISRAELI MINISTER IN WASHINGTON In Washington, Israeli Minister of Strategic Affairs Ron Dermer was due to meet U.S. Secretary of State Antony Blinken and national security adviser Jake Sullivan on Tuesday for talks on the war and the return of hostages, the White House said. Washington has openly pressed Israel in recent weeks to scale down its war from a full-blown military assault to a more targeted operation of raids on Hamas leaders. Israel says it will not stop fighting until Hamas is completely destroyed. Netanyahu adviser Mark Regev told CNN on Tuesday that destroying Hamas, which has ruled Gaza since 2007, was \"a prerequisite for a better future both for Israelis and Palestinians\". \"You won't have a demilitarized and deradicalized Gaza without first destroying Hamas. You can't have reconstruction in Gaza, rebuilding the lives of people without first getting rid of Hamas.\" In a further sign of regional volatility, Yemen's Iran-backed Houthi militia said it had fired a drone toward Eilat, southern Israel, but the Israeli military said one of its fighter jets intercepted what it called the \"hostile aerial target\" in the Red Sea area before it could reach Israel. The Houthis have been attacking ships they say have links to Israel in the entrance to the Red Sea, one of the world's busiest shipping lanes. U.S. forces, meanwhile, have come under attack by Iran-backed militants in Iraq and Syria over Washington's backing of Israel. The U.S. military carried out retaliatory airstrikes on Monday in Iraq after a drone attack by Iran-aligned militants on a U.S. base in Erbil left one U.S. service member in critical condition and wounded two.  The airstrikes killed \"a number of Kataib Hezbollah militants\" and destroyed multiple facilities used by the group, the U.S. military said. On Monday an Israeli airstrike killed a senior leader of Iran's Revolutionary Guards in Syria. And on the Lebanon border on Tuesday, Israel said that Hezbollah fired anti-tank missiles at a church, wounding a civilian and nine Israeli soldiers, after which it fired rockets from near a mosque, drawing retaliatory airstrikes.  \"We are in a multi-front war and are coming under attack from seven theatres: Gaza, Lebanon, Syria, Judea and Samaria (the West Bank), Iraq, Yemen and Iran,\" Israeli Defence Minister Yoav Gallant told lawmakers, listing six places where Iran-backed militants are active, as well as Iran itself. \n\"We have already responded and taken action in six of these theatres,\" he said, without specifying the one that had yet to see Israeli action. In India, there was an explosion near the Israeli embassy in New Delhi. Authorities said no staff were hurt."
}