{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK030KC_L.jpg",
  "title": "Las Vegas judge attacked by felon during sentencing",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 04, 2024 10:18AM ET",
    "Updated Jan 04, 2024 10:37AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/las-vegas-judge-attacked-by-felon-during-sentencing-3267487",
  "paragraph": "© Reuters. Deobra Redden, who is attending his sentencing hearing for a charge of attempted battery with substantial bodily harm, lunges at Judge Mary Kay Holthus as she hands down the sentence at a court in Las Vegas, Nevada, U.S. January 3, 2024 in this still imag\nBy Brendan O'Brien (Reuters) - A Nevada man convicted of attempted assault vaulted over a judge's bench in a Las Vegas courtroom and attacked her as she was about to sentence him to prison, in chaotic scenes captured on courtroom video. The violence unfolded in Clark County District Court on Wednesday after Judge Mary Kay Holthus denied probation to Redden, 30, in a felony assault case and was preparing to hand down a prison sentence.  Moments before the attack, Redden had asked the court for leniency, saying he did not deserve jail time. Video shows Redden jumping head first over the judge's bench as she attempted to scramble out of the way. Two men and a uniformed court officer tackled and punched Redden, as he yelled expletives and hurled punches before being dragged away. Holthus looked stunned as she emerged from behind the bench. She sustained injuries and was being monitored, a court spokesperson told the Las Vegas Review-Journal. The nature of her injuries were not specified. A courtroom marshal was hospitalized after suffering non-life-threatening injuries, the Review-Journal reported. Court officials and lawyers involved in the case were not immediately available for comment.  Redden was in custody in the Clark County jail on Thursday. He faces several battery and intimidation of a public officer charges related to Wednesday's attack, online jail records showed.  \nHe was in court on Wednesday for sentencing in a previous case in which he pleaded guilty to one count of attempted battery with substantial bodily harm.  Redden served prison time after he was found guilty of attempted theft in 2019 and then in 2021 for domestic battery, online court records showed."
}