{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK040GJ_L.jpg",
  "title": "US FDA to allow Florida to import cheaper drugs from Canada",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 05, 2024 11:27AM ET",
    "Updated Jan 05, 2024 05:16PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-fda-to-allow-florida-to-import-cheaper-drugs-from-canada-3268356",
  "paragraph": "© Reuters. FILE PHOTO: Signage is seen outside of the Food and Drug Administration (FDA) headquarters in White Oak, Maryland, U.S., August 29, 2020. REUTERS/Andrew Kelly/File Photo\nBy Khushi Mandowara and Deena Beasley (Reuters) - Florida on Friday won authorization from the U.S. Food and Drug Administration (FDA) to directly import prescription drugs from Canada, the first state to get such approval for a strategy that could lower prices for medicines. Drug costs in the U.S. are higher than in Canada and other countries where government-run healthcare systems negotiate prices for individual prescription drugs. But importation faces challenges. In the past, Canada's government has opposed any U.S. plans to buy Canadian prescription drugs, citing threats to the country's drug supply or higher costs for its own citizens. The pharmaceutical industry opposes the plan and has long fought such schemes. Drug pricing experts said it would be difficult to put into place. The U.S. population is nearly 10 times the size of Canada, said Dan Ollendorf, chief scientific officer at the Institute for Clinical and Economic Review. \"This is probably another area of leverage as opposed to anything that will materially make an impact,\" he said. \"Just the idea that a state could bring in drugs from Canada might help with negotiations over discounts and rebates.\" Health Canada told the New York Times importation will not solve high drug prices in the U.S., but did not immediately respond to a Reuters request for comment. For years, supporters of importation policy have said buying drugs from another country could help lower costs in the U.S., where more than half of Americans are covered by private health plans. The U.S. government has taken steps to start negotiating prices. Under President Joe Biden's Inflation Reduction Act, the government's Medicare health program for people over 65 will be authorized to negotiate prices with drugmakers, but only for a limited number of medications, starting in 2026.  The pharmaceutical industry has said the plan will not lead to lower costs for consumers and will put the safety of the U.S. drug supply at risk.  Pharmaceutical Research and Manufacturers of America (PhRMA), the industry's leading trade group, said it was deeply concerned about the plan and looking at its options. \"The importation of unapproved medicines, whether from Canada or elsewhere in the world, poses a serious danger to public health,\" PhRMA CEO Stephen Ubl said in an emailed statement.  Former U.S. President Donald Trump in 2020 finalized a plan allowing states to submit import proposals. President Joe Biden followed with a 2021 order for the FDA to work with states on the plans. Florida first submitted its proposal to the FDA in November of 2020. FDA Commissioner Robert Califf said other states seeking similar approvals \"must demonstrate the programs would result in significant cost savings to consumers without adding risk of exposure to unsafe or ineffective drugs.\"  \nFlorida still needs to submit drug-specific information for FDA review and approval as well as evidence that the drugs it seeks to import have been tested to comply with FDA standards, the agency said.  Florida must also submit a quarterly report that includes information about the imported drugs, cost savings and any potential safety and quality issues, the FDA said."
}