{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK05014_L.jpg",
  "title": "Bangladesh poll booths burn on election eve, as train arson kills four",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 06, 2024 10:33AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/bangladesh-poll-booths-burn-on-election-eve-as-train-arson-kills-four-3268569",
  "paragraph": "5/5\n© Reuters. Firefighters try to extinguish a fire caught on a passenger train, ahead of the general election in Dhaka, Bangladesh, January 5, 2024. REUTERS/Mohammad Ponir Hossain CORRECTING INFORMATION FROM \"A FIRE SET TO A PASSENGER TRAIN\" TO \"A FIRE CAUGHT ON A PAS\n2/5\nBy Ruma Paul and Sudipto Ganguly DHAKA (Reuters) -Polling booths were set ablaze in Bangladesh on the eve of Sunday's general elections, while four people, including two children, were killed in a train fire that the government described as arson targeting democratic values. Friday's fire broke out at about 9 p.m. (1500 GMT), injuring eight passengers as it spread to four compartments of the Benapole Express headed for the capital, Dhaka. The main opposition Bangladesh Nationalist Party (BNP) has asked people to shun the poll and called a two-day nationwide strike from Saturday. \"The timing of this tragedy, just a day before the election ... shows an absolute intention to hinder the festivity, safety and security of the democratic processes of the country,\" Foreign Minister A K Abdul Momen said.  \"This reprehensible incident, undoubtedly orchestrated by those with malicious intent, strikes at the very heart of our democratic values,\" he added in a statement, vowing that authorities would bring the perpetrators to justice. Police said they had arrested a senior BNP leader from Dhaka and seven others from the party's youth wing in connection with the arson. Eight educational institutions and one Buddhist monastery have been torched among 14 arson incidents since Friday evening, fire and civil defence services said. Chief Election Commissioner Kazi Habibul Awal lamented BNP's absence from the election and said their participation would have made the poll \"more competitive\". \"When a major political party is boycotting and resisting election, it's inevitable that conducting a poll peacefully becomes difficult,\" Awal told reporters, adding that the reports of violence were a cause for concern. Those injured in the train blaze were being treated in hospital, officials said. \"All eight, including two children, have burnt their respiratory tracts,\" said Samanta Lal Sen, a senior physician at a state-run specialist burn hospital in the capital. \"We are closely monitoring them,\" he told reporters. Seven firefighting teams took an hour to subdue the fire in the Wari area of Dhaka, fire official Shahjahan Sikder said. SECOND BOYCOTT  The BNP's boycott is its second in three elections. The party says Prime Minister Sheikh Hasina's Awami League is trying to legitimise a sham vote to gain a fourth straight term. Hasina, who has refused BNP demands to resign and allow a neutral authority to run the election, accuses the opposition of instigating anti-government protests that have rocked Dhaka since late October and killed at least 10 people. A senior BNP official, Ruhul Kabir Rizvi, said Friday's train fire was \"undoubtedly an act of sabotage and cruelty\" for which he blamed the ruling party. Four people died last month in a train blaze set by protesters during a countrywide strike called by the opposition. On Saturday, Dhaka's usually busy roads were largely deserted, although security forces patrolled in armoured vehicles. About 800,000 security officials will guard polling booths on Sunday, while some of the armed forces have fanned out nationwide to help keep the peace. Police said unidentified arsonists set fire to at least five primary schools, including four polling booths. They are investigating fires in Gazipur, on the outskirts of Dhaka, suspected to have been set to disrupt the election. \"We have intensified patrolling and remain on high alert,\" said Gazipur police chief Kazi Shafiqul Alam. Arsonists also attacked polling booths in the northeastern districts of Moulavibazar and Habiganj, police said, with similar incidents reported elsewhere in the past two days. \nPolice in the coastal district of Khulna arrested two people on Thursday accused of trying to set fire to a school. The following day, another bid to set fire to a primary school nearby was averted, said district police chief Saidur Rahman."
}