{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK000FP_L.jpg",
  "title": "US Navy ending aircraft carrier's Middle East deployment",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 01, 2024 12:52PM ET",
  "comments": [
    1,
    [
      [
        "Roger Miller",
        "2024-01-01 21:35:41",
        "The level of international turmoil and conflict the Democrat White House regime has created compared to the relative peace the world was experiencing under President Trump is unprecedented.",
        "https://www.investing.com/members/205083859"
      ],
      [
        "Brad Albright",
        "2024-01-02 00:17:23",
        "Trump was negligent in dealing with belligerent nations. A real ignorant wuss.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Mark Gesswein",
        "2024-01-02 01:12:09",
        "You’re an ignorant fool, NotBright.",
        "https://www.investing.com/members/245851936"
      ],
      [
        "Donald Hart",
        "2024-01-02 20:45:01",
        " - u are the ignorant one - Open your eyes!!",
        "https://www.investing.com/members/202080276"
      ],
      [
        "Donald Hart",
        "2024-01-02 20:46:13",
        "not Mark - Brad is blind",
        "https://www.investing.com/members/202080276"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/us-navy-ending-aircraft-carriers-middle-east-deployment-3265144",
  "paragraph": "By Ahmed Aboulenein WASHINGTON (Reuters) - The Gerald R. Ford (NYSE:F) aircraft carrier will return to its home port, the U.S. Navy said on Monday, ending its deployment to the eastern Mediterranean, which started in support of Israel after the Oct. 7 attack by Hamas militants. The nuclear-powered Ford, the Navy's newest carrier with over 4,000 personnel and eight squadrons of aircraft, became a powerful symbol of American support by rushing closer to Israel after the Palestinian militant group's attack. The attacks triggered a war in Gaza with Israeli forces reducing much of the territory to rubble, killing thousands and plunging its 2.3 million people into a humanitarian disaster.  Israel says the Hamas attack killed 1,200 people. Palestinian health authorities in Hamas-run Gaza say Israeli forces have killed nearly 22,000 people. \"Immediately following Hamas' brutal attack on Israel, the USS Gerald R. Ford Carrier Strike Group was ordered to the eastern Mediterranean to contribute to our regional deterrence and defense posture,\" the Navy said in a statement.  U.S. Defense Secretary Lloyd Austin had extended the Ford's deployment three times in hopes that its presence would deter Iran and Iran-aligned groups, particularly Lebanon's Hezbollah, from attacking Israel. U.S. troops in Iraq and Syria have endured drone and rocket attacks by Iran-backed militia. Iran-aligned Houthis in Yemen have disrupted global trade by attacking commercial tankers and container ships in the Red Sea with drones and missiles. \n\"DoD (Department of Defense) will continue to leverage its collective force posture in the region to deter any state or non-state actor from escalating this crisis beyond Gaza,\" the Navy said. The Ford will return to its home base in Virginia."
}