{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0L0SM_L.jpg",
  "title": "Haiti's police force shrinks amid gang crisis -union",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 22, 2024 06:17PM ET",
    "Updated Jan 22, 2024 06:22PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/haitis-police-force-shrinks-amid-gang-crisis-union-3280112",
  "paragraph": "© Reuters. FILE PHOTO: People huddle in a corner as police patrol the streets after gang members tried to attack a police station, in Port-au-Prince, Haiti April 25, 2023. REUTERS/Ralph Tedy Erol\nPORT-AU-PRINCE (Reuters) - Haiti's national police has lost nearly 3,300 officers in three years, according to data from the force's main trade union, as under-gunned security officials battle powerful gangs estimated to control most of the capital. Nearly nine in 10 of those were sacked for abandoning their posts, according to a report which SYNAPOHA trade union's general coordinator Lionel Lazarre shared with Reuters on Monday, while 123 more resigned.  Lazarre estimated some 80 police officers were killed in action, died in accidents or disappeared last year. Police need significantly higher incentives to justify the dangers, the report said, amid a shrinking force and lack of equipment, training and infrastructure.  It highlighted needs for armored vehicles, helicopters, guns and drones. \"The government should assume responsibility. It's not just about purchasing equipment, the police need to be supplied with the financial means to plan operations, for cops working day in, day out in areas controlled by bandits,\" Lazarre said. Lazarre said the situation was difficult but police had made progress, recovering control of six neighborhoods and coming close to recovering another. Around 200,000 people have been displaced as alliances of violent gangs expand their control beyond the capital to rural areas, bringing indiscriminate killings, sexual violence and threatening already precarious food supplies. Last November, the United Nations estimated some 3,960 had been killed through the year and 2,951 kidnapped. Haiti's government called for international reinforcements in October 2022 and the United Nations ratified sending a force composed of voluntary contributions late last year. Kenya, the only country which has offered to lead the force, has sent officials to meet with Haitian security forces ahead of a court hearing this Friday set to decide whether it is legal for it to deploy to the Caribbean state.  \nDespite worsening humanitarian conditions, countries are wary of backing Prime Minister Ariel Henry's unelected government and repeating abuses committed by past interventions. Haiti's armed forces were disbanded in 1995 and reinstated in 2017, but the national police remains the main security force."
}