{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0T0K9_L.jpg",
  "title": "Biden says he has decided how to respond to attack on US troops in Jordan",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 30, 2024 11:10AM ET",
    "Updated Jan 30, 2024 01:01PM ET"
  ],
  "comments": [
    5,
    [
      [
        "Tre Hsi",
        "2024-01-31 14:00:14",
        "I remembered back in 2016 when Trump declared he had a secret plan to defeat ISIS but he just can't tell anyone until he was elected president.......",
        "https://www.investing.com/members/203741693"
      ],
      [
        "Mark Grube",
        "2024-01-31 01:49:08",
        "let me guess. no soup for you",
        "https://www.investing.com/members/204635067"
      ],
      [
        "Brandon King",
        "2024-01-31 00:30:11",
        "He decided, and then promptly forgot moments later after falling off the stage.",
        "https://www.investing.com/members/246977513"
      ],
      [
        "Charles Manson",
        "2024-01-30 19:28:08",
        "Cash would be good. I bet he will send a letter to the UN and say if this happens again, the US will get really, really, really mad. Bidens a tough old coot. Maybe Irans afraid of him? Nah .... Anyone heard from Bradley Boy, Benny or Tre? We need some good old Leftist perspective to keep up a good argument. Anyway, got a telemarketer on the line. Love to All, Charles.",
        "https://www.investing.com/members/249519852"
      ],
      [
        "Mark Jannetty",
        "2024-01-30 19:56:07",
        "maybe he will even threaten to take them behind the barn🤣",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Mark Jannetty",
        "2024-01-30 18:57:26",
        "probably same method as Obama. pallets of cash ",
        "https://www.investing.com/members/241633026"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/biden-says-he-has-decided-how-to-respond-to-attack-on-us-troops-in-jordan-3287294",
  "paragraph": "By Jeff Mason and Trevor Hunnicutt WASHINGTON (Reuters) -U.S. President Joe Biden said on Tuesday he has made up his mind on how to respond to a drone attack that killed U.S. service members in Jordan, as he weighs punishing Iran-backed militias without triggering a wider war. Biden, speaking to reporters as he left the White House on a campaign trip to Florida, did not elaborate on his decision, which came after consultations with top advisers at the White House. But John Kirby (NYSE:KEX), the White House national security spokesperson, told reporters aboard Air Force One as Biden flew to Florida that the United States could respond more than once. \"It's fair for you to expect that we will respond in an appropriate fashion and it is very possible that what you'll see is a tiered approach here, not just a single action, but essentially multiple actions,\" he said. Biden said the United States does not need a wider war in the Middle East, echoing comments from other officials on Tuesday that the United States does not want a war with Iran. Biden has been weighing his options and the expectation has been that there will be retaliatory strikes, but the timing of the response has been unclear. \"I don't think we need a wider war in the Middle East. That's not what I'm looking for,\" said Biden. Biden replied \"yes\" when asked if he had decided how to respond to the attacks. Asked if Iran was responsible, Biden added: \"I do hold ... them responsible in the sense that they're supplying the weapons\" to those who carried out the attacks. \nThree U.S. service members were killed and at least 34 wounded in a drone attack by Iran-backed militants on U.S. troops in northeastern Jordan near the Syrian border, officials said on Sunday. Biden is under pressure for a strong response with Republicans accusing the Democratic president of letting American forces become sitting ducks."
}