{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK020MZ_L.jpg",
  "title": "US 'not seeing acts of genocide' in Gaza, State Dept says",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 03, 2024 03:34PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-not-seeing-acts-of-genocide-in-gaza-state-dept-says-3266619",
  "paragraph": "© Reuters. Palestinian picks up debris on the site of an Israeli strike at Maghazi refugee camp in the central Gaza Strip, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, January 3, 2024. REUTERS/Mohammed Al-Masri\nBy Daphne Psaledakis and Simon Lewis WASHINGTON (Reuters) - The U.S. has not observed acts in Gaza that constitute genocide, State Department spokesperson Matthew Miller said on Wednesday, after South Africa launched genocide proceedings at the International Court of Justice over Israel's military operation in the Palestinian enclave. \"Those are allegations that should not be made lightly ... we are not seeing any acts that constitute genocide,\" Miller said at a regular news briefing. \"That is a determination by the State Department,\" he added. He had been asked about South Africa's request on Tuesday that the World Court issue an urgent order declaring that Israel was in breach of its obligations under the 1948 Genocide Convention. The court has scheduled public hearings for Jan. 11 and 12 on South Africa's request. Israel said it would defend itself from the charges. Israel's crackdown has killed more than 22,000 Palestinians, laid waste to much of the enclave and engulfed its 2.3 million residents in a humanitarian disaster.  Miller said he did not have any assessment to share on whether war crimes or crimes against humanity have been committed. Washington on Tuesday slammed two Israeli ministers for advocating resettlement of Palestinians outside of Gaza, but said Israel had assured U.S. officials that their statements do not reflect its policy. U.S. officials have said too many Palestinians have been killed in the conflict. They have urged Israel - which Washington provides with weapons - to do more to protect civilians. The war was triggered by a cross-border Hamas assault on Israeli towns on Oct. 7 in which Israel says 1,200 people were killed and some 240 hostages taken back to Gaza. \nThe total recorded Palestinian death toll from Israel's offensive had reached 22,313 by Wednesday, the Gaza health ministry said. Israel has called the genocide case \"baseless\" and says Hamas is using Palestinians as human shields and stealing aid from them, accusations Hamas denies."
}