{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "US marks anniversary of Myanmar coup with further sanctions",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 31, 2024 10:37AM ET",
    "Updated Jan 31, 2024 03:37PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-targets-myanmar-with-further-sanctions-ahead-of-coup-anniversary-3288610",
  "paragraph": "By Simon Lewis and Daphne Psaledakis WASHINGTON (Reuters) -The United States on Wednesday slapped further sanctions on Myanmar, marking the three-year anniversary of the coup as Washington targeted two entities and several people it said were closely associated with the junta. Wednesday's sanctions were the latest aimed at the fuel the junta uses to conduct aerial bombings in its war with anti-coup forces that have often targeted civilians, as well as the military's ability to produce arms. The U.S. Treasury Department in a statement said it targeted the Shwe Byain Phyu Group of Companies, its owner Thein Win Zaw, his wife and two adult children.  Treasury said the company imports and distributes petroleum for the military and has a profit sharing relationship with military conglomerate Myanmar Economic Holdings Ltd, which Washington imposed sanctions on in 2021. Washington also targeted MEHL-owned shipping company Myanmar Five Star Line, which it said ships material for domestic weapons production for the military. The Treasury Department said the two entities have enabled the purchase of foreign currency and the import of petroleum and other materials on behalf of the junta. \"We are taking this action to target the regime’s sources of revenue which support military activities against civilians,\" State Department spokesperson Matthew Miller said in a statement, reiterating Washington's call for the military to change course. Myanmar has been locked in conflict since the military seized power in a coup in 2021 that sparked nationwide chaos and abruptly ended a decade of tentative democracy and economic reform. The sanctions, which freeze any U.S. assets of those targeted and generally bar Americans from dealing with them, come as junta leader Min Aung Hlaing is under pressure after a series of battlefield defeats that have seen rebel groups take control of at least 35 towns since October. The generals are facing their biggest challenge since first taking power of the former British colony in 1962, with a youth-led pro-democracy uprising morphing into an armed resistance movement after a lethal crackdown on a wave of protests and post-coup dissent. The junta has deployed heavy artillery and fighter jets to try to suppress militias allied with a shadow government and ethnic minority armies, several of which launched a coordinated offensive in October that stunned the military and has dented its battlefield credibility. \nAbout 2.3 million people have been displaced, according to the United Nations, while efforts by Myanmar's Southeast Asian neighbors to initiate dialogue have seen no progress, with the junta refusing to negotiate with what it calls \"terrorists.\" “The United States, along with our allies and partners, will continue to hold accountable those who seek to profit from, and provide support for, the violent oppression of the people of Burma,\" Treasury's Under Secretary for Terrorism and Financial Intelligence Brian Nelson said in a statement."
}