{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0U00Q_L.jpg",
  "title": "Taiwan angered at 'unilateral' China change to Taiwan Strait flight path",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 30, 2024 09:47PM ET",
    "Updated Jan 31, 2024 03:06AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/taiwan-angered-at-unilateral-china-change-to-taiwan-strait-flight-path-3287597",
  "paragraph": "© Reuters. Chinese and Taiwanese flags are seen through broken glass in this illustration taken, April 11, 2023. REUTERS/Dado Ruvic/Illustration/ File photo\nBy Ben Blanchard TAIPEI (Reuters) -Taiwan's government expressed anger after China \"unilaterally\" changed a flight path close to the sensitive median line in the Taiwan Strait, saying it appeared to be a deliberate attempt to change the status quo for possible military means. China's civil aviation administration said in a short statement late Tuesday that from Thursday it was cancelling an \"offset measure\" for the southbound operation of the M503 flight route, which is just west of the strait's median line. The median line had for years served as an unofficial barrier between Chinese-claimed Taiwan and China, but China says it does not recognise its existence and Chinese warplanes now regularly fly over it as Beijing seeks to pressure Taipei to accept its sovereignty claims. China also said it was opening routes from west to east - in other words in the direction of Taiwan - on two flight paths from the Chinese cities of Xiamen and Fuzhou which are close to the Taiwanese-controlled island groups of Kinmen and Matsu, which have regular flights to Taiwan. Taiwan's civil aviation administration and China-policy making Mainland Affairs Council both labelled the moves as \"unilateral\" and that they strongly protested it. The Mainland Affairs Council said China was ignoring flight safety, disrespecting Taiwan and trying to \"package\" civil aviation for political or military considerations to potentially change the status quo in the strait. \"If the mainland side clings obstinately to its course, it must bear any serious consequences affecting cross-strait relations,\" it said. Chieh Chung, a military researcher at Taiwan's National Policy Foundation, said the new route would be about 7 km (4.3 miles) from the median line, which would squeeze the pre-warning and reaction time for Taiwan's air defences.  \"It is trying to completely eliminate and deny the existence of the median line,\" he said. Taiwan's defence ministry said China's \"rude and unreasonable\" actions can easily lead to an increase in tensions. \"For unknown aircraft entering our air defence identification zone (ADIZ), they will be dealt with in accordance with operating procedures and emergency handling regulations to ensure the safety of our airspace,\" it added. CHINA CALLS CHANGES 'ROUTINE' The ADIZ is a broad area Taiwan monitors and patrols to give its forces more time to respond to threats, and Chinese military aircraft have not so far entered territorial Taiwanese air space. China has downplayed the furore. Its Taiwan Affairs Office described the changes as \"routine\" to help alleviate pressure on air space, and that China had no need to discuss this first with Taiwan. Speaking at a regular news conference in Beijing on Wednesday, Chen Binhua, a spokesperson for the office, said the \"so-called median line does not exist\". \"The M503 route is for civil aviation and is in the Shanghai flight information region. It is to alleviate congestion for the related airspace and routes, and ensure aviation safety,\" he said. Taiwan's civil aviation administration said the flight paths to and from Xiamen and Fuzhou were dangerously close to those to Taiwan's Kinmen and Matsu islands. China should open talks with Taiwan on the route changes as soon as possible, it added.  The M503 route is mostly used by Chinese airlines and also by foreign airlines going to and from cities like Shanghai to Southeast Asia. \nFlights to and from Taiwan and China's Xiamen and Fuzhou take a circuitous route skirting the median line, rather than flying directly across the strait. Taiwan has complained about the M503 route before, in 2018, when it said China opened the northbound part of it without first informing Taipei in contravention of a 2015 deal to first discuss such flight paths."
}