{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0B007_L.jpg",
  "title": "US, Britain carry out strikes across Yemen in retaliation for Houthi attacks",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 11, 2024 07:49PM ET",
    "Updated Jan 12, 2024 06:43AM ET"
  ],
  "comments": [
    1,
    [
      [
        "haitharu Ss",
        "2024-01-12 01:44:01",
        "imagine going to war over israel",
        "https://www.investing.com/members/233405603"
      ],
      [
        "Stoxer One",
        "2024-01-12 07:12:37",
        "over international shipping routes, f o o l",
        "https://www.investing.com/members/200770726"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/us-britain-carry-out-strikes-against-houthis-in-yemen-officials-3272946",
  "paragraph": "© Reuters. FILE PHOTO: Houthi military helicopter flies over the Galaxy Leader cargo ship in the Red Sea in this photo released November 20, 2023. Houthi Military Media/Handout via REUTERS/File Photo\nBy Phil Stewart, Idrees Ali and Mohammed Ghobari WASHINGTON/ADEN, Yemen (Reuters) - U.S. and British warplanes, ships and submarines struck across Yemen overnight in retaliation against Iran-backed Houthi forces for attacks on Red Sea shipping, a widening of regional conflict triggered by Israel's war in Gaza. Witnesses confirmed explosions throughout Yemen, saying raids targeted a military base adjacent to Sanaa airport, a military site near Taiz airport, a Houthi naval base in Hodeidah and military sites in Hajjah governorate. \"These targeted strikes are a clear message that the United States and our partners will not tolerate attacks on our personnel or allow hostile actors to imperil freedom of navigation,\" U.S. President Joe Biden said. The Houthis said five of their fighters had been killed in a total of 73 air strikes and said they would retaliate for the strikes and continue their attacks on shipping, which they describe as intended to support Palestinians against Israel. A U.S. official said more than a dozen locations were targeted in strikes that were not just symbolic but intended to weaken the Houthis' military capabilities. \"We were going after very specific capability in very specific locations with precision munitions,\" the official said. Kheloud, a resident of the capital Sanaa who gave just her first name, awoke to loud explosions from the direction of the airport to the north: \"We saw a large fire from where the attack took place. It was half an hour of terror.\" In a country only just emerging from nearly a decade of war that brought millions of people to the brink of famine, morning brought long queues at petrol stations from people fearing an extended new conflict with the West. \"There is a lot of worry that the fuel shortages will repeat themselves and food supplies will be scarce,\" said Ali Ahmad, 52. \"We are rushing to fuel our car and we bought flour and rice in case of any emergency because we are expecting the Houthis to respond and an escalation to take place.\" In Yemen's main Red Sea port Hodeidah, a resident who gave only his first name Mahmoud said troops were spreading through the streets and military vehicles were leaving barracks with security escorts. Britain's defence ministry said early indications were that \"the Houthis' ability to threaten merchant shipping has taken a blow\". James Heappey, a junior defence minister no further action was planned for now. The price of oil rose sharply on concern that supplies could be disrupted. Brent crude rost $2. The Houthis, an armed movement that took control of most of Yemen over the past decade, have been attacking shipping lanes at the mouth of the Red Sea, where 15% of the world's seaborne trade passes on routes between Europe and Asia. The United States and allies had deployed a naval task force to the area in December, and the situation had escalated in recent days. U.S. helicopters directly struck Houthi forces for the first time on New Year's Eve, sinking three boats and killing fighters attempting board a ship. On Tuesday this week the United States and Britain shot down 21 missiles and drones in what they described as the biggest Houthi attack yet, which they said had directly targeted their warships. Iran, which supports armed groups around the Middle East including both the Houthis and the Hamas militants that control Gaza, condemned the U.S. and British attacks. U.S. Defense Secretary Lloyd Austin, who is in hospital due to surgery complications, said in a statement that the strikes targeted Houthi drones, ballistic and cruise missiles, costal radar and air surveillance.  FEARS OF ESCALATION Houthi attacks on commercial ships have forced shipping lines to send vessels on a longer, costlier route around Africa, creating fears of a new bout of inflation and supply chain disruption derailing the global economic recovery. Tesla (NASDAQ:TSLA) said on Thursday it was shutting its factory in Germany for two weeks because of delays to parts supplies arriving from Asia as a result of Red Sea unrest, the first big manufacturer to make such an announcement. But Washington has had to weigh its determination to keep the shipping lane open against the risk of spreading war in the region. The strikes were the first by the United States on Yemeni territory since 2016, and the first time it has attacked the Iran-backed Houthis at any such scale. \"The concern is that this could escalate,\" said Andreas Krieg at King's College in London. Saudi Arabia called for restraint and \"avoiding escalation\". The Saudis have backed the opposing side in a war against the Houthis for nearly a decade, which has lately been in a delicate state of U.N.-backed peace negotiations. The United States also accused Iran of being involved operationally in the Houthi attacks, providing the military capabilities and intelligence to carry them out. \"We believe that they have been certainly involved in every phase of this,\" a senior U.S. official told reporters. Violence has escalated in Lebanon, the Israeli-occupied West Bank, Syria and Iraq in the three months since Israel mounted a military assault on Gaza.  \nIsrael has killed more than 23,000 Palestinians during its operation to eradicate Hamas, whose fighters attacked Israel on Oct. 7, killing 1,200 people and seizing 240 hostages.  The United States has troops on the ground in Syria and Iraq, and has previously retaliated for attacks there by Iran-backed groups. Iraq's state news agency quoted an advisor to its prime minister as saying the West was expanding the conflict."
}