{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK1307L_L.jpg",
  "title": "Israel's Netanyahu cautious on hostage deal amid coalition rifts",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 04, 2024 02:05PM ET",
    "Updated Feb 04, 2024 02:50PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Rick Sberk",
        "2024-02-04 19:24:00",
        "I believe most can acknowledge the complexity in identifying and navigating an end and long term solution to the problem. Is it possible to navigate with reduced politics and increased adherence to objective moral principles. ",
        "https://www.investing.com/members/201065742"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/israels-netanyahu-cautious-on-hostage-deal-amid-coalition-rifts-3292093",
  "paragraph": "© Reuters. FILE PHOTO: Israeli Prime Minister Benjamin Netanyahu speaks during the weekly cabinet meeting at the Defence Ministry in Tel Aviv, Israel, January 7, 2024. REUTERS/Ronen Zvulun/Pool/File Photo\nJERUSALEM (Reuters) - Prime Minister Benjamin Netanyahu said on Sunday Israel was not ready to accept a deal at any price to release hostages held by Hamas amid rifts in his coalition over a U.S. push to get more aid into Gaza. The comments came during the latest episode in a rumbling coalition row between religious nationalist parties opposed to any concessions to the Palestinians and a centrist group including former army generals. \"The efforts to free the hostages are continuing at all times,\" Netanyahu said in comments ahead of a cabinet meeting that were released to the media. \"As I also emphasized in the Security Cabinet – we will not agree to every deal, and not at any price.\" He also appeared to deliver a rebuke to his far-right National Security Minister Itamar Ben-Gvir, who wants Jewish settlers to return to Gaza, and who criticised U.S. President Joe Biden, Israel's staunchest ally, for pressing for humanitarian aid deliveries to the enclave. \"Instead of giving us his full backing, Biden is busy with giving humanitarian aid and fuel [to Gaza], which goes to Hamas,\" Ben-Gvir said in an interview with the Wall Street Journal, during which he openly backed Donald Trump, Biden's likely rival in the November U.S. presidential election. \"If Trump was in power, the U.S. conduct would be completely different,\" he said. Without naming Ben-Gvir directly, Netanyahu, who has had a sometimes tense relationship with Biden, rejected the comment, which came as U.S. Secretary of State Antony Blinken headed to the region. \"I am not in need of any assistance in navigating our relations with the U.S. and the international community, while steadfastly upholding our national interests,\" he said at Sunday's cabinet meeting. In response to Ben-Gvir's interview, former opposition politician Benny Gantz, who joined the emergency unity government last year, tweeted a message of thanks to Biden, saying: \"The people of Israel will forever remember how you stood up for the right of Israel in one of our most difficult hours.\" The spat highlighted the tense political climate in Israel four months after the devastating attack by Hamas gunmen in October, in which around 1,200 people were killed, according to Israeli tallies, and some 240 dragged to Gaza as hostages. In response, Israel has flattened large swathes of Gaza in a relentless campaign that has killed more than 27,000 people, according to Palestinian health authorities, and forced most of the 2.3 million population to flee their homes. White House national security adviser Jake Sullivan said the United States would continue trying to get more aid into Gaza, which is facing an acute humanitarian crisis. \n\"And that means pressing Israel on issues related to humanitarian assistance that we have helped unlock and get into the Gaza Strip and there needs to be much more of it,\" he told CBS television's \"Face the Nation\" programme.  (This story has been refiled to add the full name of Benny Gantz in paragraph 9)"
}