{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK110RR_L.jpg",
  "title": "US Supreme Court won't halt West Point from considering race in admissions",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 02, 2024 05:23PM ET",
    "Updated Feb 02, 2024 06:01PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-supreme-court-wont-halt-west-point-from-considering-race-in-admissions-3291818",
  "paragraph": "© Reuters. FILE PHOTO: Cadets salute while U.S. Vice President Kamala Harris arrives to attend the 2023 graduation ceremony at the United States Military Academy (USMA), at Michie Stadium in West Point, New York, U.S., May 27, 2023. REUTERS/Eduardo Munoz\nBy John Kruzel WASHINGTON (Reuters) -The U.S. Supreme Court on Friday declined to block the U.S. Military Academy at West Point, the prestigious Army school, from considering race as a factor in admissions decisions while a legal battle over the practice proceeds in lower courts. The justices denied a request from Students for Fair Admissions, a group founded by affirmative action opponent Edward Blum, after lower courts refused to halt the practice. The group was behind a successful Supreme Court challenge to race-conscious collegiate admissions policies in cases involving Harvard University and the University of North Carolina. No justice publicly dissented from the court's brief order. \"The record before this court is underdeveloped, and this order should not be construed as expressing any view on the merits of the constitutional question,\" the decision stated.  The lawsuit said West Point's admissions practices discriminated against white applicants and violated the U.S. Constitution's principle of equal protection. West Point, located in New York state, educates cadets for commissioning into the U.S. Army, counting among its graduates former U.S. Presidents Dwight Eisenhower and Ulysses Grant and current Defense Secretary Lloyd Austin.  Students for Fair Admissions, a Virginia-based nonprofit, had asked the Supreme Court to decide the request by the academy's application deadline for the class of 2028, which was on Wednesday.  The U.S. Justice Department told the Supreme court in a filing that it strengthens U.S. national security to have a more diverse corps of officers, many of whom begin their Army careers at West Point. West Point graduates comprise roughly one in five Army officers, one in three generals and nearly half of current four-star generals, the department said. 'MORE LEGITIMATE' \"Diversity, including racial and ethnic diversity, makes a more effective fighting force - more cohesive and lethal, better able to attract and retain top talent, and more legitimate in the eyes of the nation and the world,\" the department said in its brief. Many U.S. colleges and universities, including the nation's military service academies, used affirmative action policies that considered race as one of numerous factors in admissions to increase their enrollment of Black, Hispanic and certain other minority students. \"It is disappointing that the young men and women who apply to West Point for the foreseeable future will have their race used as a factor to admit or reject them,\" Blum, who for years has pursued lawsuits challenging affirmative action policies, said of Friday's decision.  West Point and the Justice Department did not immediately respond to requests for comment.  U.S. District Judge Philip Halpern in White Plains, New York, rejected a request by Blum's group for a preliminary injunction on Jan. 3 and rebuffed its request for an emergency injunction the next day. The group appealed Halpern's decisions to the New York-based 2nd U.S. Circuit Court of Appeals, which denied the group's emergency request on Monday.  The merits of the case are still being contested before Halpern, who has issued a preliminary finding in favor of West Point but not a final decision.  Blum's group sued last September, challenging West Point's admissions process on behalf of two Students for Fair Admissions members - a high school student applying for the first time and a first-year college student applying for the second time. Both of the male students, whose names were withheld due to what they said was a fear of reprisal by West Point, \"are fully qualified but white,\" the group said. In invalidating admissions policies at Harvard and UNC last year as a violation of the Constitution's equal protection protections, the Supreme Court did not address race in admissions at military academies. President Joe Biden's administration, in defending the race-conscious admissions policies used by the military service academies, said that senior military leaders long have recognized that a scarcity of minority officers can create distrust within the armed forces. \"The Army learned that lesson the hard way when decades of unaddressed racial tension and disparities fundamentally threatened the military's ability to protect national security during the Vietnam (war) era,\" the Justice Department wrote in its brief, noting that the Army was \"plagued by accusations that white officers were using minority servicemembers as 'cannon fodder.'\" \nThe other military service academies are: the Naval Academy in Maryland, the Air Force Academy in Colorado, the Coast Guard Academy in Connecticut and the Merchant Marine Academy in New York. Students for Fair Admissions has also sued the Naval Academy over its race-conscious admissions policy. A federal judge in Maryland has scheduled the case to go trial in September."
}