{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK140HN_L.jpg",
  "title": "US envoy piles pressure on Orban to ratify Sweden's NATO entry",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 05, 2024 07:57AM ET",
    "Updated Feb 05, 2024 09:21AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-envoy-piles-pressure-on-orban-to-ratify-swedens-nato-entry-3292705",
  "paragraph": "2/2\n© Reuters. Hungary's Prime Minister Viktor Orban attends a European Union summit in Brussels, Belgium February 1, 2024. REUTERS/Johanna Geron/files\n2/2\nBy Krisztina Than and Boldizsar Gyori BUDAPEST (Reuters) -The U.S. envoy, along with ambassadors from other NATO allies including Poland, Denmark and Slovakia, attended the Hungarian parliament on Monday in a surprise show of pressure on Budapest to approve Sweden's bid to join the alliance. The extraordinary meeting of parliament was called by the opposition to vote on ratification on Monday, but lawmakers from the ruling Fidesz party boycotted the session, meaning it lacked quorum and the ratification will be further delayed.  Fidesz lawmakers say they want Swedish Prime Minister Ulf Kristersson to visit Budapest before they ratify the bid. Hungary is the only NATO country not to ratify Stockholm's membership application, a process that requires the backing of all members, souring relations with the United States and raising concerns among its allies. Sweden's NATO accession is an issue that directly affects the United States' national security and also the security of the alliance as a whole, U.S. Ambassador David Pressman said after leaving parliament. \"The Prime Minister pledged to convene parliament, to urge parliament to act at its earliest opportunity, today was an opportunity to do that,\" Pressman said. \"We look forward to watching this closely, and to Hungary acting expeditiously.\" Sweden applied to join NATO in May 2022 in a historic shift in its security policy prompted by Russia's invasion of Ukraine.  Prime Minister Viktor Orban, who has better ties with Russia than other EU states and most NATO members, says his government backs Sweden joining the alliance but the relevant bill has been stranded in parliament since mid-2022.  Sweden's NATO bid could be ratified when Hungary's parliament reconvenes for a normal session, the Fidesz party's parliamentary group said earlier on Monday. Parliament is due to reconvene in late February after a winter break.  \"If this is an important issue for the Swedes, then obviously the Swedish prime minister will come to Budapest,\" Fidesz said in an emailed reply to Reuters questions. \nThe office of Kristersson and his foreign minister did not immediately reply to requests for comment. Hungarian Foreign Minister Peter Szijjarto said late on Friday that it would be \"fair\" if Kristersson visited Budapest before the ratification, just as the Swedish leader had also gone to Turkey before the Turkish ratification."
}