{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBS0A5_L.jpg",
  "title": "Putin's spy chief vows to prevent foreign meddling in presidential election",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Dec 29, 2023 08:03AM ET",
  "comments": [
    1,
    [
      [
        "Ken Roth",
        "2023-12-29 16:21:24",
        "Medling? Putin is already elected what a joke",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/putins-spy-chief-vows-to-prevent-foreign-meddling-in-presidential-election-3264675",
  "paragraph": "© Reuters. Russian Foreign Intelligence Service (SVR) Director Sergey Naryshkin attends a meeting of President Vladimir Putin with members of Security Council and the government and the heads of law enforcement agencies, at the Novo-Ogaryovo state residence outside \nMOSCOW (Reuters) - President Vladimir Putin's foreign intelligence chief said in a video released on Friday that Russia's spies should make every effort to prevent any foreign meddling in the March presidential election.  Putin announced this month, in comments made to soldiers, that he would run in the election - a step that is certain to allow him to stay in power for at least another six years. Putin, who was handed the presidency by Boris Yeltsin on the last day of 1999, has already led the country for longer than any other ruler since Josef Stalin, beating even Leonid Brezhnev's 18-year tenure. \"An important political event will take place in the New Year - the election of the President of the Russian Federation,\" Sergei Naryshkin, head of Russia's Foreign Intelligence Service (SVR), said in the video clip. \"We must make every effort to prevent possible attempts at external interference.\" \nOpposition politicians say the election represents just a fig leaf of democracy to cover up what they see as a corrupt dictatorship in Putin's Russia. Supporters of Putin dismiss that analysis, pointing to some independent polling that shows he enjoys approval ratings of above 80%. They say that Putin has restored order and some of the clout Russia lost during the chaos that accompanied the collapse of the Soviet Union in 1991."
}