{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK080OA_L.jpg",
  "title": "Q&A: Dean Phillips says Biden 'likely to lose' election to Trump",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 09, 2024 12:49PM ET",
    "Updated Jan 09, 2024 02:06PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/qa-dean-phillips-says-biden-likely-to-lose-election-to-trump-3270570",
  "paragraph": "© Reuters. Democratic presidential candidate U.S. Representative Dean Phillips (D-MN) answers a question during an interview with Reuters at his campaign office in Manchester, New Hampshire, U.S., January 8, 2024. REUTERS/Brian Snyder\nBy Jarrett Renshaw MANCHESTER, New Hampshire (Reuters) -Congressman Dean Phillips, a wealthy Democrat from Minnesota who is running for president in 2024, is betting it all on New Hampshire's Democratic primary on Jan. 23, where incumbent Joe Biden will not officially be on the ballot. Phillips, 54, shelved a potential fourth term in Congress for a self-funded challenge to Biden, 81. He lags far behind Biden in national and New Hampshire polls. Biden is skipping the New Hampshire primary after the Republican-run state refused his demand to give up its first in nation primary spot to South Carolina. But Biden's supporters are mounting a write-in campaign to avoid an embarrassing loss. Phillips and his campaign declined to say how much of the vote he hopes to capture in New Hampshire. Reuters sat down with him at his campaign headquarters in Manchester this week: Q: You are a three-term congressman, and were considered a rising star in the Democratic Party. Why risk all of that with a long-shot presidential bid? A: \"I know it's counterintuitive and it's certainly unusual for a member of Congress to torpedo their career, knowingly, but I'll tell you that I had a couple of epiphanies. One was in 2016. I had a wonderful life in Minnesota, running a business, and my daughters were in tears the morning after (Donald Trump was elected) and it jarred me. I promised them I would do something. It was not about my career. It was about public service. And I did it.\" \"Then I went to Vietnam for the first time in late March, and I got to go to the site where my dad was killed. And it really affected me, the fact he died serving in a unnecessary war. And I thought to myself, you know, he literally gave his life for us, and here I am serving in Congress.\" \"The least I can do is what I think is necessary. And that is not to be quiet and not just get in line. That's what happened during the Vietnam War. Everyone got quiet and got in line and look what it got us. I wish there were more people in Congress willing to torpedo their career in pursuit of principle, rather than self preservation.\" Q: What do you say to critics who say your run damages Biden's chances against Trump? A: \"President Biden is a man I respected but is not a viable candidate. And it is not an attack from Dean Phillips, who is right now positioned as a meaningless candidate in this race. I'm not the one that's done this to him. I'm pointing out the truth. And anybody who's willing to pay attention will recognize it.\" Q: You argue Biden is actually supporting Trump's threat to democracy. What you do you mean? A: \"That's why I’m calling for competition. I think he should have passed the torch. That was my first call, then I called others to join the stage. They wouldn't do it. That's why I ultimately decided to do it myself. But that invitation is still out there.\" \"Whether he passes the torch or not, the unwillingness of others to join the stage, that is a threat to democracy. His unwillingness to open the stage, I would argue, now is a threat, because his numbers are so horrifyingly poor. And yes, it not the direct threat to democracy that Donald Trump is, but I believe you're complicit if you knowingly go into a race where you're likely to lose and you suppress the potential of other candidates.” Q: You have highlighted the age difference between yourself and Biden. What are the other areas where you differ? A: \"His relative inactivity on the southern border, I think, is tragic for the Democratic Party and for the country. The first order of business for a president is to provide security and there's just no perspective whatsoever that anybody can make that is manifest at the southern border.\" \"I've been there twice. It's a disaster. There's no question. It has to be hardened. And we have to create buffer zones on each side. And we have to reform our asylum law and we have to work together to do it.\" Q: You have mentioned a strong relationship with Liz Cheney, who was ousted by the Republican party after she challenged Trump on his role in the January 6 Capital attacks. Where did that come from? A: “She's a Republican I admire because she was the only one I've ever known who literally put principle over self preservation in, I think, the most profound way I've ever seen. And, in no small part, inspired me to do this. I did see what happened to her. I knew what would happen to me. And I've stayed in touch with her. I did an ad for her. I think what she's doing, on a mission to prevent Donald Trump from returning to the presidency, is so very aligned with me.\" Q: Could we see a Phillips-Cheney ticket, perhaps as a third party? \nA: \"I wouldn't say that's even discussed right now. But I never say never. I mean, this is about preservation of democracy. We are certainly different, politically. But we do have the same principle. And that is protecting the Constitution, ensuring our systems of governance work and restoring some degree of sensibility and common sense to Washington. So I want to help her do that. And I think she wants to help me.\" This interview has been edited and condensed for clarity. Read Reuters full coverage of the U.S. election:"
}