{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0F0MO_L.jpg",
  "title": "Freed Gaza hostages mark birthday of baby still in captivity",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 16, 2024 10:17AM ET",
    "Updated Jan 16, 2024 10:24AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/freed-gaza-hostages-mark-birthday-of-baby-still-in-captivity-3275301",
  "paragraph": "7/7\n© Reuters. A birthday cake for Kfir Bibas, who is a hostage held in Gaza by Palestinian Islamist group Hamas, is set up by Hostages and Missing Families Forum, to call for his release at a kindergarten, during a media tour, amid the ongoing conflict between Israel a\n2/7\nBy Leonardo Benassatto NIR OZ, Israel (Reuters) - Israelis released from captivity in Gaza reconvened in their ravaged border village on Tuesday to hold a solemn first-birthday ceremony for the infant of a family still held hostage. Kfir Bibas was eight-months-old when Hamas-led Palestinian gunmen stormed Kibbutz Nir Oz on Oct. 7 as part of a cross-border killing spree in southern Israel, and became the youngest of some 240 people taken back to the Gaza Strip as captives. Hamas has said that Kfir, his four-year-old brother Ariel and their mother Shiri were killed in the Israeli offensive that ensued, while their father, Yarden, survived. But in the absence of Israeli corroboration, relatives and friends back home have refused to let hope die for the whole family's safe recovery. A bower of ginger balloons - a nod to Kfir's hair colour - stood in the abandoned Nir Oz kindergarten, and his pictures signalled places at a table where celebrants should have sat. \"We're marking a birthday to a kid who's not here. We make him a cake, we put balloons, pictures, and blessings and everything and he's not here,\" Shiri's cousin, Yosi Shnaider, told Reuters. \"It's crazy.\" Kfir would turn one-year-old on Thursday, at which point he would have spent a third of his life as a hostage. Meanwhile, Nir Oz has been frozen in time and trauma, with more than a quarter of residents either killed or taken captive, and survivors fleeing. Israel recovered around half of the hostages in a November truce, among them Nir Oz resident Sharon Alony Cunio and her three-year-old twin daughters Emma and Julie. Cunio's husband remains incommunicado in Gaza, however, with 131 other hostages.  Worry for their fate grips a country that, after the worst attack in its history, has settled into the grim resolve of war - especially as Israeli officials, based on various sources of information, say at least 25 hostages have died in captivity. \"I can't sleep. I suffer from nightmares. The girls ask about their father constantly,\" said Cunio, who visited her now-burned out home in the formerly placid agricultural collective. \"I wake up in the morning with one purpose only - David made me promise him that I will fight for him. That I will scream his despair to the world as he is unable to do so.\" \nHamas on Monday aired video purporting to show the bodies of two other hostages who it said were killed in an Israeli strike. Without immediately confirming their deaths, Israel disputed the Hamas account in the video it deemed \"psychological torture\".  Qatari and Egyptian mediators have been trying to cobble together a new truce that might free some more hostages, even as Israel presses on with its devastating offensive to destroy Hamas and the Palestinian militants vow to fight on."
}