{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK1103D_L.jpg",
  "title": "North Korea fires cruise missiles off west coast -Seoul",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Feb 02, 2024 12:12AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/north-korea-fires-cruise-missiles-off-west-coast-seoul-3290754",
  "paragraph": "© Reuters. FILE PHOTO: The North Korean flag flutters at the North Korea consular office in Dandong, Liaoning province, China April 20, 2021. REUTERS/Tingshu Wang/File Photo\nSEOUL (Reuters) -North Korea fired multiple cruise missiles off its west coast on Friday, South Korea's military said, marking the fourth time in just over a week that Pyongyang has launched such missiles off both coasts. The South's military said the launch took place around 11 a.m. (0200 GMT) but did not provide further details.  North Korea has said since last week that it had tested \"strategic\" cruise missiles, implying they may be designed to carry nuclear warheads. Earlier this week, state media reported the country had tested its new submarine-launched cruise missiles (SLCM). Leader Kim Jong Un was on site to supervise the launch, which used missiles with the same identifying markings as the land-launched missiles.  South Korea's military has said the North appeared to be testing the missiles to upgrade their capabilities. The latest launch comes after the North said early on Friday that Kim had inspected a shipyard in the port city of Nampho on the west coast and stressed the importance of a strong naval force in \"war preparations\", according to state media. \"Strengthening naval force is the most important issue in pushing ahead with war preparations\", KCNA cited Kim as saying during his visit to the dockyard, a military shipbuilding base also referred to as Nampo. Kim was briefed on the construction of various warships under a new \"huge plan\" decided by the North Korean leadership, KCNA said, without elaborating. KCNA said on Monday that Kim had inspected the construction of a nuclear submarine and discussed issues related to the manufacturing of other types of new warships, but gave no details. At a major ruling party meeting in 2021, Kim has laid out a plan to develop and upgrade the country's military capabilities, including the construction of nuclear submarines and underwater drones that can mount nuclear attacks. In recent months, the North has tested an array of weapons including ballistic missile systems that are under development and an underwater drone. \nNorth Korea has accused the United States and South Korea of escalating tensions with large-scale military drills, leaving it with no choice but to step up preparations for a nuclear war. On Friday, the U.S. Special Operations Command said it had completed training with South Korea's special operations forces."
}