{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "Minnesota trooper charged with shooting murder of Black motorist",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 24, 2024 05:39PM ET",
    "Updated Jan 24, 2024 05:50PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/minnesota-trooper-charged-with-shooting-murder-of-black-motorist-3282328",
  "paragraph": "By Brad Brooks (Reuters) - A state trooper in Minnesota was charged with unintentional murder and manslaughter for shooting and killing Black motorist Ricky Cobb II last year in Minneapolis, prosecutors said Wednesday. Hennepin County Attorney Mary Moriarty said during a press conference that trooper Ryan Londregan, 27, will face those charges, along with an assault charge, because the circumstances of the case did not justify his use of deadly force.  Moriarty said that state troopers engage drivers everyday and they receive extensive training on how to do so safely. \"Trooper Londregan did not follow this training,\" Moriarty said.  Londregan's attorneys as listed in the criminal complaint did not reply to a request for comment. Mike LeDoux, head of the Minnesota State Patrol Troopers Association, said in a written statement that the union \"stands resolutely in defense\" of all the troopers involved in the Cobb stop and that the situation \"necessitated the use of deadly force.\" Cobb's killing took place in the same city where George Floyd was murdered at the hands of police in 2020, which set off global racial justice protests and put a spotlight on police killings of innocent Black citizens across the U.S.  Two unnamed troopers had pulled over Cobb, 33, just before 2 a.m. on July 31, 2023, because he was driving without his lights, prosecutors said in a criminal complaint against Londregan. Londregan arrived 20 minutes later.  During the traffic stop, troopers learned that Cobb was \"wanted for violation of a protective order\" in nearby Ramsey County, though there was no warrant out for his arrest, according to the complaint. Troopers told Cobb he was under arrest after he repeatedly refused a request to leave his vehicle.  When Londregan opened the passenger-side door, Cobb put the car into gear and it began to slowly roll forward. Another trooper reached in on the driver's side, apparently trying to unhook Cobb's seatbelt. Londregan then fired two rounds into Cobb's torso. Cobb's car rolled about a quarter mile down the road and crashed. The troopers attempted first aid but Cobb died at the scene."
}