{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0D06N_L.jpg",
  "title": "Israelis wear dog tags in solidarity with hostages and each other",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 14, 2024 07:14AM ET",
    "Updated Jan 14, 2024 12:02PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/israelis-wear-dog-tags-in-solidarity-with-hostages-and-each-other-3274096",
  "paragraph": "6/6\n© Reuters. Yael Yolovitch, a member of Kibbutz Nir Oz, shows her military-style dog tag with a slogan calling for the return of Omri Miran, an Israeli hostage who has been held in the Gaza Strip since he was seized by Hamas gunmen on October 7, near Sderot in southe\n2/6\nBy Estelle Shirbon JERUSALEM (Reuters) - On Israeli city streets and on television, in shops and in cafes, one symbol of solidarity with hostages held in Gaza has become ubiquitous in the 100 days since Hamas abducted them: military-style dog tags worn on neckchains. The small metal rectangles, similar to those soldiers carry for identification, are typically inscribed with two slogans in Hebrew, \"our hearts are held hostage in Gaza\" and \"together we will win\", and one in English, \"bring them home now\". \"Everyone wants to show their support one way or another,\" said Shayna Roth, 36, a digital marketing specialist and mother of three from Modi'in, near Tel Aviv. \"It just makes you feel that no matter where you go, no matter who you meet or talk to, we're all a nation, undivided.\" Israel says Hamas killed 1,200 people during its assault on southern Israel on Oct. 7, the worst loss of Jewish life in a single day since the Holocaust and the deadliest day in Israel's 75-year history. Vowing to destroy Hamas, it has responded with a military offensive on Gaza that has so far killed close to 24,000 Palestinians, according to Gaza health officials, displaced most of the population and caused widespread hunger and disease. Israel faces an international outcry over the death, destruction and suffering in Gaza, including accusations brought by South Africa at the United Nations' top court that it is conducting a genocide there. It has rejected this as a false and grossly distorted accusation.  Of the 240 hostages who were kidnapped on Oct. 7, more than 130 are still held captive in Gaza. Their plight, and the anguish of their families, are deeply felt across Israeli society. \"Wearing these dog tags really allows us to connect to the families that have been directly affected,\" said Roth, who also has pictures of hostages by her Shabbat candles, which in Jewish tradition are lit on Friday evenings to usher in the Sabbath. 'BEYOND WORDS' Roth's mother, Marilee Crowell, was visiting from California and was wearing a dog tag as the two women visited the Mahane Yehuda market in Jerusalem. Nestled among the food stalls and bakeries in the warren of alleyways, a souvenir shop had several displays of dog tags. It was here that Roth had bought a batch of them to send to her mother and other relatives living in the United States. Crowell, 78, said she was wearing hers to show her deep empathy with the hostages, their families, and Israelis in general, following the Oct. 7 killings. \"I stand with you in your suffering and yes, we want the hostages back, yes, it's beyond words. I stand with you, I hold your hand in your grief. That's what it means to me,\" she said. Her daughter had tears in her eyes as she listened. A steady stream of customers stopped at the souvenir shop and bought dog tags. Among them, Judith, who did not wish to give her family name, bought several, including an unusual model with a religious blessing on it, \"God bless you and keep you\". \"Everybody is hurting. Everybody knows somebody who is a soldier, or knows somebody who lives in (the southern) area, so everybody's involved, it's one big family. So it's just showing that we care, that we're standing together,\" she said. Steven Winston, a visitor from Britain where he runs a pro-Israel group called the National Jewish Assembly, was wearing a dog tag he had bought at \"Hostages Square\", in Tel Aviv, where hostages' families and supporters have been campaigning. \nWinston gave similar reasons for wearing the symbol, adding that he would not hesitate to wear it in London, where police reported a surge in hate crimes after Oct. 7, including acts of antisemitism as well as Islamophobia. \"If someone tried to take it off me, then let them try, but I’m not going to shy away from my identity and my feelings. I'm proud to wear it,\" said Winston."
}