{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK040F5_L.jpg",
  "title": "Finland's extreme cold freezes even boiling water thrown in the air",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 05, 2024 08:49AM ET",
    "Updated Jan 06, 2024 08:05AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/finlands-extreme-cold-freezes-even-boiling-water-thrown-in-the-air-3268219",
  "paragraph": "© Reuters. A person throws boiling water into the air, which turns into steam, following cold weather, in Pyhatunturi, Finland January 1, 2024, in this screen grab obtained from social media video. Lauri Untamo/via REUTERS/File Photo\nBy Anne Kauranen HELSINKI (Reuters) - Finland's record low temperatures this week inspired a tourist on a trip to the Arctic to try a trick that had long intrigued him: throwing boiling water in the air when it's extremely cold outside and seeing it turn into an instant cloud of icy dust. This is not something to try unless the temperatures are at a level of cold that most places on earth rarely, or never, see. Lauri Untamo, a 49-year-old sales manager from southern Finland, was on holiday in Finnish Lapland with friends when the temperature fell to minus 30 degrees Celsius (-22°F) on New Year's Day. \"I had seen videos of the trick on social media or YouTube that it was possible to perform but had never had a suitable frost to give it a try at minus 30 degrees or more,\" Untamo told Reuters. He said he boiled water in his cabin, quickly brought it outside and threw it in an arc over his head - surviving the attempt without burns as the water immediately turned into an icy cloud that drifted away. The Nordic countries have seen extremely cold weather for the past few days, with the lowest temperature in 25 years at minus 44.3 C (-47.74°F) recorded on Friday in Enontekio, further north in the Arctic from Pyhatunturi where Untamo was staying. \nDespite the icy weather, Untamo and his group of friends have been enjoying outdoor activities such as Nordic skiing and walking in the snow-clad forests. \"We even saw the Northern Lights on a few nights so Lapland has really given its best to us this week,\" he said."
}