{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBT041_L.jpg",
  "title": "Albania's former PM placed under house arrest in corruption probe",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 30, 2023 09:59AM ET",
    "Updated Dec 30, 2023 07:20PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/albanias-former-pm-placed-under-house-arrest-in-corruption-probe-3264896",
  "paragraph": "© Reuters. FILE PHOTO: Albanian opposition leader Sali Berisha gestures during a protest after the parliament voted to lift his immunity so he can face corruption charges, in Tirana, Albania, December 21, 2023 REUTERS/Florion Goga/File Photo\nPRISTINA (Reuters) -A court in Albania on Saturday ordered that former president and prime minister Sali Berisha be placed under house arrest following investigation on a corruption case relating to his time in office. Prosecutors accuse Berisha, 79, of using his influence while premier between 2005 and 2009 to favor his daughter's husband in the privatization of a state land. Berisha has denied any wrongdoing. Berisha now heads Albania's largest opposition party, the Democratic Party.  \"The court has accepted the prosecution's request by changing a previous measure and has now ordered house arrest (for Berisha) without the possibility of leaving the country,\" Berisha's lawyer Genc Gjokutaj said after the court's decision. Gjokutaj said Berisha will appeal the verdict, which came after a court found he violated an order to appear twice a week in front of authorities. The former PM has denied the prosecution's claims, accusing current Prime Minister Edi Rama of carrying out a political attack to silence the opposition. The prosecution has still to present its final indictment. \"With or without house arrest, with or without police at the door, nothing will be able to separate me from you,\" Berisha told his supporters in a Facebook (NASDAQ:META) message soon after the decision. \"With the motto 'now or never' I invite you to continue the battle without return, even stronger and more determined.\" A day earlier Berisha said the opposition will hold protests in the streets in January \"until the day that Rama is brought down.\" Berisha served as president from 1992 to 1997 after the tumultuous collapse of communism in the poor southwestern Balkan country, and as prime minister from 2005 to 2013. \nIn 2021 the U.S. barred entry to Berisha and his family, with the State Department accusing him of having been involved while prime minister in \"corrupt acts\" that included using his power for his own benefit and to enrich relatives and political allies.  Berisha denied the accusations."
}