{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0H0C9_L.jpg",
  "title": "In Greenland, love for Denmark's royals clashes with independence dream",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 18, 2024 05:25AM ET",
    "Updated Jan 18, 2024 05:37AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/in-greenland-love-for-denmarks-royals-clashes-with-independence-dream-3277061",
  "paragraph": "6/6\n© Reuters. Denmark's King Frederik, Queen Mary and Crown Prince Christian visit the Parliament Hall for the first time in their new official roles, together with former Queen Margrethe, Prince Joachim and Princess Benedikte, at Christiansborg Palace in Copenhagen, D\n2/6\nBy Johannes Birkebaek COPENHAGEN (Reuters) - While many people in Greenland were glued to TV screens on Sunday to watch Denmark's new king take the throne, younger generations dreaming of independence from the former colonial ruler have mixed emotions about the royal family.  King Frederik X took the throne on Sunday, succeeding his mother, Queen Margrethe II, becoming head of state not only in Denmark but also in two former colonies, Greenland and the Faroe Islands, both sovereign territories in the kingdom. The royal family remains hugely popular in Greenland, despite strained relations with Denmark in recent years. In the capital Nuuk, a cultural centre organised a big screen viewing that was attended by jubilant Greenlanders. \"I feel like I'm standing outside a bubble looking in at a lot of Greenlanders cheering and being extremely happy and proud that Frederik has become king,\" said Qupanuk Olsen, 38, a Greenland native living in Nuuk. Greenland, which was a Danish colony until 1953, was granted broad self-governing autonomy in 2009, including the right to declare independence from Denmark.  An independence movement has gained traction in recent years in part due to several revelations of misconduct by Danish authorities during the 20th century, including a 1950s experiment in which children from Greenland were taken to Denmark. Last year, Greenland's government presented its first draft constitution.  \"Some are dissatisfied with many things that Denmark have done, but they still like the royal family. It's a bit of a double standard,\" said Sasha Blidorf, 23, owner of a jewellery firm in Greenland, adding that she also watched the royal succession live on TV. The royal family has traditionally made visits to the Arctic island each year, often disembarking their royal yacht wearing Greenland's national dress which has contributed to the royals' popularity. \"The royal family has stayed above the political opposition and helped keep the kingdom together,\" said Michael Bregnsbo, a historian at the University of Southern Denmark. King Frederik himself has spent extended periods of time in Greenland, including a four-month expedition on the ice sheet.  \"He knows Greenland well, which should help him continue to be a unifying figure. This is something the new royal couple should give high priority to,\" said Bregnsbo. \nQupanuk Olsen said she wants Greenland eventually to be independent. \"I can't see the king remaining the head of state over Greenland in the future,\" she said. \"I want us to have our own president.\""
}