{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0908V_L.jpg",
  "title": "Ukraine under no pressure from allies to stop fighting - Zelenskiy",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 10, 2024 09:58AM ET",
    "Updated Jan 10, 2024 10:49AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/ukraine-under-no-pressure-from-allies-to-stop-fighting--zelenskiy-3271678",
  "paragraph": "© Reuters. FILE PHOTO: Ukraine's President Volodymyr Zelenskiy addresses Ukrainian people on the New Year's eve in this handout picture released on December 31, 2023. Ukrainian Presidential Press Service/Handout via REUTERS/File Photo\nBy Andrius Sytas VILNIUS (Reuters) -Ukrainian President Volodymyr Zelenskiy said on Wednesday Kyiv was under no pressure from allies to stop fighting Russia as he began a tour of Baltic states intended to shore up support for the war effort. On his trip to Lithuania, Latvia and Estonia, Zelenskiy hopes to stop war fatigue among Ukraine's Western allies, secure more financial and military aid, and discuss Kyiv's bids to join NATO and the European Union. But shortly before the Ukrainian leader started talks with Lithuanian President Gitanas Nauseda in Vilnius, Italy's defence minister said in Rome that the time had come for diplomacy to pave the way for peace. Asked in Vilnius whether Ukraine's partners were now urging Kyiv to stop fighting, Zelenskiy said: \"There is no pressure from partners to stop our defence. There is no pressure to freeze the conflict, not yet.\" \"There are various voices in the media, I have read them all,\" he told a joint press conference with Nauseda. \"But I think that our partners are not yet officially ready to give us such signals. At least I haven't heard them personally.\"  The three Baltic states are among Kyiv's staunchest supporters in the EU and the NATO military alliance, and provided Ukraine with military aid even in the weeks leading up to Russia's full-scale invasion on Feb. 24, 2022. All three, as well as Moldova, would be next in Russia's sights if it ends up victorious in Ukraine, Zelenskiy said. With the prospects of a protracted war growing after a Ukrainian counteroffensive last year failed to provide the breakthrough Kyiv had hoped for, Ukraine has been appealing to its Western allies for more financial and military assistance.  Those appeals have become more urgent since EU and U.S. aid packages worth tens of billions of dollars were stalled late last year. \"That uncertainty of the partners' financial and military support to Ukraine only builds up the bravery to the Russian Federation. Therefore we should not prolong this process any more\", Zelenskiy told reporters. He said Ukraine faced an acute lack modern air defence systems against Russian missile and drone strikes.  \"INTENSIVE DIPLOMACY\", Italian Defence Minister Guido Crosetto told Italy's parliament the Ukrainian counteroffensive had not produced the desired result, and the military situation had to be viewed with realism. \"From this perspective ... it would seem that the time has come for incisive diplomacy, alongside military support, because there are a number of important signals coming from both sides,\" Crosetto said.  Russia is progressively showing willingness to negotiate and safeguard its economy, while Ukraine's stance appears less uncompromising than before, he said. \"All of this must be taken into consideration on the path towards negotiations to stop the conflict and the subsequent process of normalisation of relations, not only of Russia with Ukraine, but also with Western countries,\" he said. Russia has said it is ready for peace talks if Ukraine takes account of \"new realities\", suggesting an acknowledgement that Russia controls about 17.5% of Ukrainian territory. \nZelenskiy has rejected any notion that Russia is interested in talks under President Vladimir Putin, and has suggested Moscow would agree to a pause in fighting only if it needed a break to replenish its army. Addressing a crowd of several thousand in central Vilnius, some of them waving Ukrainian or Lithuanian flags, Zelenskiy said defiantly: \"There will never be 'the day after Ukraine'. There will the day after the war, and there will be the day after Putin.\""
}