{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBQ02E_L.jpg",
  "title": "Russia to deploy newest howitzers against Ukrainian forces - Rostec",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 26, 2023 11:34PM ET",
    "Updated Dec 27, 2023 04:35AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Ken Roth",
        "2023-12-27 18:07:05",
        "Will look forward to watch this blow up in future video clips.",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Sean Bean",
        "2023-12-27 22:02:55",
        "Better watch for Leopards and Abrams",
        "https://www.investing.com/members/252323143"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/russia-to-deploy-newest-howitzers-close-to-finlands-border--rostec-3263791",
  "paragraph": "© Reuters. FILE PHOTO: Coalition-SV class self-propelled howitzers drive during a rehearsal for the Victory Day parade, which marks the anniversary of the victory over Nazi Germany in World War Two, in Red Square in central Moscow, Russia May 7, 2021. REUTERS/Evgeni\n(Reuters) - Russia will soon deploy its newest howitzers against Ukrainian forces as part of what Moscow calls its \"special military operation,\" the head of the Rostec state defence conglomerate said in remarks published on Wednesday. The testing of the new Coalition-SV self-propelled artillery units has been completed and their mass production has already started, Sergei Chemezov, the head of Rostec told the state RIA news agency in an interview. The first pilot batch will be delivered by the end of 2023, he said.  \"I think they will appear there (on the battlefield in Ukraine) soon, since howitzers of this class are needed to provide an advantage over Western artillery models in terms of firing range,\" Chemezov said. Russia's TASS state news agency reported earlier this month that single Coalition-SV howitzers had already been deployed to the frontline in Ukraine.  \nThe howitzers, with a range of up to 70 kilometres (44 miles), are equipped with a modern 2A88 cannon of 152 mm caliber with a firing rate of more than 10 rounds per minute, as well as a modern system for automating the processes of gun pointing, target selection and navigation, according to TASS.  (This story has been corrected to clarify that the new howitzers are intended to be deployed in the conflict against Ukraine, and not to the Finnish border)"
}