{
  "image": "https://i-invdn-com.investing.com/news/international_newspapers_69x52._800x533_L_1419494241.jpg",
  "title": "Ohio woman will not be prosecuted for mishandling of fetus",
  "category": "General",
  "publisher": "Investing.com",
  "date": [
    "Published Jan 11, 2024 05:39PM ET",
    "Updated Jan 11, 2024 06:15PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/general/ohio-woman-will-not-be-prosecuted-for-mishandling-of-fetus-3272908",
  "paragraph": "(Reuters) - A grand jury in Ohio declined to bring charges against a 34-year-old Black woman on Thursday for mishandling her fetus after having a miscarriage at home, a reproductive rights group said. Brittany Watts was arrested in October and charged with abuse of a corpse, but a Trumbull County grand jury hearing the case voted against indicting, avoiding a trial. Her case had been closely watched for its implications in the wider U.S. divide over abortion rights, which are no longer guaranteed in every state after the U.S. Supreme Court struck down the landmark Roe v. Wade precedent last year. \"The grand jury's decision is a firm step against the dangerous trend of criminalizing reproductive outcomes,\" Dr. Marcela Azevedo, president of Ohio Physicians for Reproductive Rights, said in a statement. \"This practice must be unequivocally halted. It not only undermines women's rights but it also threatens public health by instilling fear and hesitation in women seeking necessary medical care.\" The office of Trumbull County Prosecutor Dennis Watkins did not respond to requests for comment. Watts was 21 weeks pregnant when her water broke last September, and twice left the hospital against the advice of her doctors, according to media reports citing a coroner's report. Two days later she delivered the fetus over a toilet, where the remains were found stuck inside, the reports said. Forensic pathologist Dr. George Sterbenz testified the fetus had died before passing through the birth canal and there was no injury to it, WKBN television reported."
}