{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK1103B_L.jpg",
  "title": "Protests expected over NZ indigenous policies on national day holiday",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Feb 02, 2024 12:08AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/protests-expected-over-nz-indigenous-policies-on-national-day-holiday-3290752",
  "paragraph": "© Reuters. FILE PHOTO: Maori performers before a rugby game in New Zealand REUTERS/David Rowland/File Photo\nBy Lucy Craymer WELLINGTON (Reuters) - Crowds at this weekend's anniversary of New Zealand’s founding document signing in the town of Waitangi are expected be their biggest in 30 years as indigenous Maori plan to discuss and protest proposed policies that some say will disadvantage them.  The main celebrations will be held on Feb. 6, marking the day in 1840 when the Treaty of Waitangi was first signed between the British Crown and more than 500 Maori chiefs. Politicians, Maori leaders and members of the public are set to start arriving in the small seaside town in the north of the North Island on Saturday.  Pita Tipene, chairman of the Waitangi National Trust board which organises the event, said they expected upwards of 60,000 people to attend Waitangi Day events. That would make it the largest such gathering, which includes concerts and stalls as well as political meetings and speeches, since at the least 1990. \"It is a place of discourse. There will be increased numbers because people want to come and listen. People also want to come and express their frustration and anger at what they see coming out of government policies,\" he said. New Zealand's centre-right coalition, which took office late last year, is promising to undo policies of previous governments, particularly those promoting the official use of the Maori language and seeking to enhance Indigenous living standards and rights. The government has also said it will introduce, but are not committed to passing, a bill that would reinterpret the Treaty of Waitangi. Critics say the moves are the most significant step backward for Maori rights in decades, and some have taken legal action against the government in an effort to stop the policy changes.  Prime Minister Christopher Luxon has in recent weeks tried to soothe fears the document will be reinterpreted or is under threat. \n“We are incredibly proud about it (the treaty) and there is no change to the treaty coming,” he told media on Friday. Protest has long been part of Waitangi celebrations and in 1995 official events had to be cancelled due to anger over government policies. In 2016, a minister was struck in the face by a dildo thrown by a woman protesting a trade agreement."
}