{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "US-Mexico immigration coordination producing results, official says",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 20, 2024 07:51PM ET",
    "Updated Jan 20, 2024 08:00PM ET"
  ],
  "comments": [
    2,
    [
      [
        "Tom Saltzman",
        "2024-01-21 11:07:26",
        "Remain in Mexico was working until Biden completely opened the borders. Even the looney tunes know this to be true.",
        "https://www.investing.com/members/200520915"
      ],
      [
        "First Last",
        "2024-01-21 18:19:15",
        "Tom Saltzman",
        "https://www.investing.com/members/200601457"
      ],
      [
        "First Last",
        "2024-01-21 18:21:26",
        "It was never completely opened nor completely closed.  Not sure why you used the word \"completely\".",
        "https://www.investing.com/members/200601457"
      ],
      [
        "First Last",
        "2024-01-21 18:23:06",
        "Let's not pretend illegal immigration is a Biden-only problem.",
        "https://www.investing.com/members/200601457"
      ],
      [
        "Tom Saltzman",
        "2024-01-22 01:54:44",
        "First Last",
        "https://www.investing.com/members/200520915"
      ],
      [
        "Tom Saltzman",
        "2024-01-22 02:02:47",
        "First Last",
        "https://www.investing.com/members/200520915"
      ],
      [
        "First Last",
        "2024-01-21 02:21:20",
        "Compared to that rusting Swiss cheese border wall, more effective & cheaper and less drama.",
        "https://www.investing.com/members/200601457"
      ],
      [
        "Mark Jannetty",
        "2024-01-21 12:12:41",
        "🤡",
        "https://www.investing.com/members/241633026"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/usmexico-immigration-coordination-producing-results-official-says-3278913",
  "paragraph": "By Mike Stone WASHINGTON (Reuters) - A high-level U.S. State Department meeting with Mexican officials on Friday lauded progress following a crackdown on illegal immigration, a State Department spokesman said on Saturday.  A crackdown on migrant smuggling networks, train and bus routes has produced results, Matthew Miller, a State Department spokesman, said in a statement.  \"Our coordinated efforts with Mexico are demonstrating positive results at our shared border,\" the statement said. U.S. Secretary of State Antony Blinken met with Mexican Foreign Secretary Alicia Bárcena on Friday at the U.S. Department of State in Washington. Top-level officials from other government agencies involved in immigration coordination also attended The U.S. also made a commitment to support Guatemala, a source of some migrants.  \"The United States stands ready to support the people of Guatemala and their new government on a wide range of issues including economic development and hemispheric migration management,\" the statement said. \nRepublicans in the U.S. Congress have blocked emergency funding for Ukraine in an effort to push new security policies along the U.S.-Mexico border. They blame Biden's policies for an influx of immigrants into the United States. U.S. President Joe Biden signaled on Friday that he is hopeful a deal over the U.S.-Mexico border could be worked out next week - at least in the Senate."
}