{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0C01Y_L.jpg",
  "title": "Tibetan issues not in focus, but repression persists - exiled former leader",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 13, 2024 02:22AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/tibetan-issues-not-in-focus-but-repression-persists--exiled-former-leader-3273899",
  "paragraph": "© Reuters. Lobsang Sangay, former head of the Tibetan government in exile, the Tibetan Central Administration, poses for a picture in Taipei, Taiwan January 13, 2024. REUTERS/Ben Blanchard\nTAIPEI (Reuters) - The plight of Tibet has become less discussed internationally but repression continues and China is applying what it did there to other regions, a former head of the Tibetan government-in-exile said on Saturday. China seized control of Tibet in 1950 in what it describes as a \"peaceful liberation\" from feudalistic serfdom. International human rights groups and exiles routinely condemn what they call China's oppressive rule in Tibetan areas. Speaking to Reuters during a visit to Taiwan to observe the island's elections, Lobsang Sangay, the leader of the India-based Central Tibetan Administration until 2021, said Tibet had somewhat fallen off the international agenda. \"I think Tibet is not current,\" said Sangay, who remains an influential figure in the exile community and close to exiled spiritual leader and Nobel laureate the Dalai Lama, who he met with in India just before arriving in Taipei. Tibet went through mass protests in 2008 before Beijing held the Olympics, and then a series of self-immolations by Tibetans in protest against Chinese rule, but then what China was doing to Uyghurs in Xinjiang followed by the security crackdown in Hong Kong took more attention, he added. \"On the one hand, yes, there is less coverage about Tibet. That doesn't mean the situation in Tibet is less serious,\" Sangay said. China's Foreign Ministry did not immediately respond to a request for comment. China does not recognise the exiled government, and has defended its rule in Tibet as bringing much needed development to what was a backward and feudal society. Sangay said other ethnic minorities in China had very similar experiences to the Tibetans. \"I always say, if you close your eyes and listen to a Mongolian speaking, a Uyghur speaking, a Tibetan speaking, the situation is very similar.\" \nIn the 1990s and early 2000s problems in Tibet were viewed as an \"isolated, more peripheral issue\", and people who visited China thought engagement would make the country \"more like us\", Sangay said. \"But when it happened to the Uyghurs, to Hong Kong and potentially Taiwan, people thought hey, this is a system you are dealing with. This is an expansionist power.\""
}