{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0O0ON_L.jpg",
  "title": "Biden to host Japan PM Kishida for official visit in April",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 25, 2024 11:58AM ET",
    "Updated Jan 25, 2024 05:12PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/biden-to-host-japan-pm-kishida-in-april-white-house-3283335",
  "paragraph": "© Reuters. Japanese Prime Minister Fumio Kishida listens to U.S. President Joe Biden during a joint press conference with South Korean President Yoon Suk Yeol (not pictured) at the trilateral summit at Camp David near Thurmont, Maryland, U.S., August 18, 2023. REUTE\nBy Jeff Mason and David Brunnstrom ABOARD AIR FORCE ONE (Reuters) -U.S. President Joe Biden will host Japanese Prime Minister Fumio Kishida for an official visit to the United States on April 10, the White House said on Thursday. The formal event, which will include a lavish state dinner and a policy meeting, follows a promise by Biden to host the closely allied nation key to the United States' strategy toward China, North Korea and other Asian security issues. Biden and Kishida will discuss \"efforts to strengthen our political, security, economic, and people-to-people ties\" to improve Indo-Pacific security, White House spokesperson Karine Jean-Pierre said. The visit comes at a challenging time for both leaders, who have low public approval ratings at home. Biden is likely facing a close-fought November election against Republican Donald Trump and Kishida is managing the fallout from a fundraising scandal, economic difficulty and a major earthquake this month. \"2024 will be a pivotal year for Japan-U.S. relations,\" Japan's ambassador to Washington, Shigeo Yamada, said in pre-recorded remarks to an event hosted by the Wilson Center think tank on Thursday. \"The Japan-alliance is indispensable to the peace, stability and prosperity, not only of our two countries, but also of the international community,\" he said.  Mieko Nakabayashi, a professor at Japan's Waseda University, told Washington's Wilson Center there was growing concern in the Japan about the prospect of second presidency for Trump, who has questioned the value of alliances and complained about cost of U.S troop deployments in Japan and South Korea. \"We are very, very worried, and we are thinking about a variety of scenarios of whoever becomes the president of the United States,\" she said Nakabayashi also said factional rivalries inside Japan's ruling Liberal Democratic Party raised questions about whether Kishida could hold on to power long enough to make the visit. Frank Jannuzi, president and CEO of Washington’s Maureen and Mike Mansfield Foundation, told the think tank the U.S.-Japan alliance was long-standing, but not unbreakable. \"The easiest way to break it … would be for the United States to in the future somehow compromise the extent of our commitment to the security of our allies in Northeast Asia,\" he said. U.S. deputy national security adviser Jon Finer said the Biden administration took a \"very different\" view to that of Trump. \"America's network of alliances ... are a force multiplier for U.S. interests,\" he told an Asia Society event. \"They are a unique advantage that the United States has among our nearest peer competitors, not a burden on the country.\" While the security relationship between the U.S. and Japan has been growing ever stronger and they are looking to make a deal for Japanese shipyards to overhaul and maintain U.S. Navy warships, Nippon Steel's proposed purchase of U.S. Steel is a source of controversy. \nDemocratic and Republican U.S. senators have criticized the deal, citing national security concerns or raising questions about why the companies did not consult U.S. Steel's main union ahead of the announcement. Brian Deese, a key player in Biden's re-election bid, said last month the proposed purchase was concerning and the administration should look closely at it."
}