{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0H103_L.jpg",
  "title": "Factbox-Key takeaways from the federal report on the Uvalde massacre",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 18, 2024 06:55PM ET",
    "Updated Jan 18, 2024 07:02PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/factboxkey-takeaways-from-the-federal-report-on-the-uvalde-massacre-3277838",
  "paragraph": "© Reuters. Memorial crosses line a fountain in the town square, as U.S. Attorney General Merrick Garland announces the results of a review into the law enforcement response to a 2022 mass shooting at Robb Elementary in Uvalde, Texas, U.S., January 18, 2024. REUTERS/\nBy Brad Brooks (Reuters) - The U.S. Justice Department on Thursday released its report on the 2022 Robb Elementary school shooting in Uvalde, Texas, that saw 19 young students and two teachers killed.  Here are some of its key findings:  ACTIVE SHOOTER The report found that \"the most significant failure was that responding officers should have immediately recognized the  incident as an active shooter situation\" and not treat it as a \"barricaded subject\" scenario.  Ever since the 1999 Columbine High Shooting in Colorado, officers have been taught that \"the first priority must be to immediately neutralize the subject,\" the report stated.  \"This did not occur during the Robb Elementary shooting response, where there was a 77-minute gap between when officers first arrived on the scene and when they finally confronted and killed the subject,\" the report read. The report says the gunman fired off 45 shots in the presence of officers - making it clear that he was an ongoing and active threat.  LEADERSHIP FAILURE The report found there to be \"cascading failures of leadership\" on the scene, as at least 380 law enforcement officers from 24 local, county, state and federal agencies arrived.  Despite the size of that force, \"none of the law enforcement leaders at the scene established an incident command structure to provide timely direction, control, and coordination to the overwhelming number of responders who arrived on the scene.\"  That meant arriving officers didn't know what was actually happening inside the school, the report found.  Many arriving officers incorrectly believed the shooter had been killed by the time they got there, based on \"inaccurate information on the scene and shared over the radio or from observing the lack of urgency toward entering classrooms.\"  'WEAK COMMUNICATION'  Families of the victims have long complained over what they say has been a lack of transparency on the part of local, county and state officials about what took place during the shooting.  The report rebuked authorities for inaccurate information, weak communication, and conflicting messages that led to \"misinformation, rumors, and a lack of trust and confidence in the relevant authorities.\"  FALSE HOPES, SCATTERED HELP The report also found that after the shooting, some families \"received incorrect information suggesting their family members had survived when they had not.\" \"In the days, weeks, and months following the tragedy, survivors, families, and responders received varying levels of support services,\" the report found.  \nA flood of organizations arrived immediately after the shooting to help Uvalde.  But since that initial response, help has been waning, and \"difficulties with tracking victims and transitioning service providers have meant that some victims, family members, and community members have not received services.\""
}