{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0U0BY_L.jpg",
  "title": "The logistics of war: How Washington is preparing for a Chinese invasion of Taiwan",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 31, 2024 05:06AM ET",
    "Updated Jan 31, 2024 06:01PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/the-logistics-of-war-how-washington-is-preparing-for-a-chinese-invasion-of-taiwan-3287914",
  "paragraph": "By Phil Stewart and Idrees Ali WASHINGTON (Reuters) -When U.S. and Australian troops practiced amphibious landings, ground combat and air operations last summer, they drew headlines about the allies deepening defense cooperation to counter China's growing military ambitions. But for U.S. war planners preparing for a potential conflict over Taiwan, the high-profile Talisman Sabre (NASDAQ:SABR) exercises had a far more discreet value: They helped create new stockpiles of military equipment that were left behind in Australia after the drills ended in August, U.S. officials told Reuters. The United States and its allies are increasingly worried that in the coming years Chinese President Xi Jinping could order his military to seize Taiwan, the democratically governed island China considers its own territory. So, the U.S. military is taking a hard look at its own military readiness and trying to play catch-up in a critical area: its logistics network. The equipment from Talisman Sabre included roughly 330 vehicles and trailers and 130 containers in warehouses in Bandiana, in southeastern Australia, the Army says.  The amount of equipment, which the United States military has not previously acknowledged, is enough to supply about three logistics companies, with as many as 500 or more soldiers, focused on ensuring supplies reach warfighters. It's the kind of materiel that's needed for a future drill, a natural disaster, or in a war. \"We're looking to do this more and more,\" Army General Charles Flynn, the top Army commander in the Pacific, told Reuters in an interview. \"There's a number of other countries in the region where we already have agreements to do that,\" he added, without naming specific countries.  Reuters interviews with more than two dozen current and former U.S. officials found that American military logistics in the Pacific is one of the greatest U.S. vulnerabilities in any potential conflict over Taiwan. U.S. war games have concluded that China would likely try to bomb jet fuel supplies or refueling ships, crippling U.S. air and sea power without having to battle heavily armed fighter jets or sink America's fleet of surface warships, according to current and former officials and experts. In response, the United States is trying to spread its military logistics hubs across the region - including warehouses in Australia, officials told Reuters.  Asked about Reuters' conclusions, the Pentagon said that the Department of Defense is working with allies to make U.S. forces more mobile and distributed.  The Chinese embassy in Washington did not directly address the Reuters report, but a spokesperson said the United States should \"stop enhancing military contact with the Taiwan region\" and \"stop creating factors that could heighten tensions in the Taiwan Strait.\" The Australian embassy in Washington referred questions to the Ministry of Defense, which did not immediately respond to a request for comment.  Critics say Washington's network is still too concentrated and that the government hasn't put enough money or urgency toward the effort.  \"When you really dig down a couple of layers, the intel community is blinking red as far as for the next five years. And yet some of these timelines (to address the risks) are 10, 15, 20 years long,\" said Congressman Mike Waltz, a Republican who leads the House subcommittee overseeing military logistics and readiness. \"There's a mismatch there.\" RISKS FOR THE U.S.  The U.S. military's logistics arm, U.S. Transportation Command (TransCom), has had a major success: funneling more than 660 million pounds of equipment and over 2 million rounds of artillery to the Ukrainian military in its war with Russia.  Supporting Taiwan, roughly 100 miles from the coast of China, would be orders of magnitude harder, U.S. officials and experts acknowledge. The U.S. has not formally said it would intervene if China were to attack Taiwan but President Joe Biden has repeatedly suggested he would deploy U.S. troops to defend the island.  Xi has ordered his military to be ready to take Taiwan by 2027, U.S. officials say. But many analysts see that as an attempt to galvanize his military rather than a timeline for invasion.      A senior U.S. military official, speaking on the condition of anonymity, said supplies of ammunition are at the top of the list of priorities in the Indo-Pacific, followed by fuel, food and spare parts for equipment.     \"If we run out of the things to shoot ... that's going to be an immediate problem,\" the official said, adding planning for a Taiwan contingency was already well underway. U.S. officials warn that in a major conflict Navy ships could quickly run out of missile defenses. In a war game run for Congress in April, China prepared for an amphibious assault on Taiwan with massive air and missile strikes against U.S. bases in the region. That included the U.S. naval base on the Japanese island of Okinawa and the Yokota Air Base in western Tokyo. The potential impact of attacks on U.S. logistics hubs, refueling ships and aerial refueling tankers, was a \"wake up call\" for many lawmakers, said Becca Wasser at the Center for a New American Security (CNAS) think tank, which ran the war game. \"China is going to purposely go after some of the logistics nodes to make it difficult for the United States to sustain operations in the Indo-Pacific,\" Wasser said. To address such vulnerabilities, the U.S. military is looking to places like Australia as more secure locations to stockpile equipment, even as it expands cooperation with the Philippines, Japan and other partners in the Pacific. The Biden administration announced in July the United States would also create an interim logistics center in Bandiana, Australia, with the aim of eventually creating an \"enduring logistics support area\" in Queensland. According to an internal U.S. military document seen by Reuters, the facilities in Bandiana could hold more than 300 vehicles and had 800 pallet positions.      In July, the U.S. Air Force carried out Mobility Guardian 23, an exercise in the Indo-Pacific with Australia, Canada, France, Japan, New Zealand and the United Kingdom that included practicing air refueling and medical evacuations.      The military used the opportunity to leave behind equipment, including in Guam. That gear helped forces there deal with fallout from the recent Typhoon Mawar but would also be useful in any future conflict, said Air Force Major General Darren Cole, the director of operations at Air Mobility Command.     Cole noted his command was responsible not just for disaster relief but contingencies \"all the way up to full combat operations, full scale major war.\"  FROM 'JUST IN TIME' TO 'JUST IN CASE' There has been a shift in the United States military's thinking. For decades, the United States has not had to worry about a foreign power targeting its logistics bases. That allowed planners to focus on efficiency, adopting the \"just-in-time\" logistics model common among private-sector manufacturers.  That approach led to the cost-saving decision to create mega-bases, like Ramstein Air Base in Germany. Ramstein was safe from Taliban and Islamic State attacks. But a conflict with China could make mega bases, which include Camp Humphreys near Seoul, prime targets. This risk is prompting the switch to a more costly approach to logistics that includes dispersing U.S. stockpiles and pre-positioning supplies around the region. \"Instead of planning for efficiency, you probably (need) to plan for effectiveness, and move from 'Just in time' to 'Just in case,'\" said Rear Admiral Dion English, one of the Pentagon's top logistics officers.  The U.S. did this in Europe after Russia annexed Crimea in 2014, pre-positioning stocks and investing in bases and airfields that deploying U.S. troops could use if needed. In the five years leading up to Russia's 2022 invasion of Ukraine, the Pentagon requested $11.65 billion in funding from Congress to preposition equipment in Europe. By contrast, a Reuters analysis of the Pentagon's budget request found that the military currently plans to only ask for $2.5 billion from fiscal year 2023 to 2027 to preposition equipment and fuel and improve logistics in Asia. The Pentagon has an annual budget of about $842 billion currently.  Another costly problem is the aging fleet of U.S. transport ships. The average age of the ships designed to carry heavy cargo, like tanks, into a conflict zone is 44 years with some older than 50 years.  One blistering analysis by CNAS concluded: \"The Department of Defense has systematically underinvested in logistics in terms of money, mental energy, physical assets, and personnel.\" \nSenator Roger Wicker, the top Republican on the Senate Armed Services Committee, said the Pentagon and Congress needed far more focus on Pacific bases and logistics. \"Our ability to deter conflict in the Western Pacific over the next five years is not close to where it needs to be,\" he told Reuters."
}