{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "Heavy rains in Australia's east bring more pain to storm-hit residents",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 01, 2024 01:31AM ET",
    "Updated Jan 01, 2024 01:55AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Barry Nickerson",
        "2024-01-02 11:30:59",
        "Won't be recharging the Range Rover for a week or more......",
        "https://www.investing.com/members/249373719"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/heavy-rains-in-australias-east-bring-more-pain-to-stormhit-residents-3265029",
  "paragraph": "SYDNEY (Reuters) - Heavy rains lashed parts of Australia's east on Monday, triggering flash flooding, inundating roads and bringing more pain for some residents reeling after the intense thunderstorms that hit the region over the Christmas holidays. The northeastern New South Wales and southeastern Queensland regions were pounded by a wild weather system overnight, with several towns taking roughly a month's rainfall over 24 hours to Monday morning. More heavy rain is forecast until Tuesday morning, with totals set to exceed 250 mm (9.8 inches), more than the January average. \"This situation continues to be dangerous and dynamic,\" Miriam Bradbury, a forecaster at the Bureau of Meteorology, said in a video message on social media platform X. \"This locally intense rainfall is most likely with thunderstorms through the day today and potentially could lead to life-threatening flash flooding.\" The popular Gold Coast tourist spot in Queensland is among the worst affected, with footage on social media showing vehicles stuck in flooded roads and low-lying areas under water. \"If you don't have to go out today, stay home,\" Gold Coast City Mayor Tom Tate said during a press briefing. Thousands of residents in Queensland are still without power after thunderstorms on Dec. 25 and 26 uprooted trees and knocked down power lines. Authorities said the latest storms could delay reconnection efforts. A family of four, trapped after rapidly rising rivers submerged their caravan park in northern New South Wales, were successfully rescued."
}