{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK1102R_L.jpg",
  "title": "Trudeau condemns mosque attack, says Islamophobia 'has no place' in Canada",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 01, 2024 10:15PM ET",
    "Updated Feb 01, 2024 10:21PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/trudeau-condemns-mosque-attack-says-islamophobia-has-no-place-in-canada-3290713",
  "paragraph": "© Reuters. Canada's Prime Minister Justin Trudeau speaks during Question Period in the House of Commons on Parliament Hill in Ottawa, Ontario, Canada January 29, 2024. REUTERS/Blair Gable\nBy Kanishka Singh (Reuters) - Canadian Prime Minister Justin Trudeau on Thursday condemned an attack against a mosque in the city of Mississauga in Ontario province, which is being probed as a hate crime and which rights advocates described as being part of a rise in Islamophobia. Police said someone threw two rocks through the window of a Mississauga mosque on Sunday, on the eve of the anniversary of a mosque attack in Quebec city that killed six people in 2017. CBC News said no one was injured in the incident. \"Islamophobia has no place in any of our communities,\" Trudeau said on X, formerly called Twitter.. \"The attack against a Mississauga mosque earlier this week – on the National Day of Remembrance of the Quebec City Mosque Attack and Action Against Islamophobia – is cowardly, disturbing, and unacceptable. I condemn it in the strongest terms possible,\" he said. The National Council of Canadian Muslims said the attack was \"part of an alarming rise in Islamophobic hate across the country.\" In November, authorities in Toronto said the number of antisemitic and anti-Muslim hate crimes in Canada's largest city had spiked significantly since the start of the Gaza conflict. \nRights advocates have noted a rise in antisemitism and Islamophobia in many parts of the world since Oct. 7 when Palestinian Islamist group Hamas attacked Israel and killed 1,200, according to Israeli tallies.  Since then, Israel has militarily assaulted the Hamas-governed Gaza Strip, killing 27,000, according to Gaza's health ministry, and flattening most of the densely populated enclave where nearly all of the 2.3 million population is displaced."
}