{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0I0R5_L.jpg",
  "title": "Harvard urges judge to toss families' lawsuits over morgue scandal",
  "category": "Stock market news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 19, 2024 05:03PM ET",
    "Updated Jan 19, 2024 05:10PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/stock-market-news/harvard-urges-judge-to-toss-families-lawsuits-over-morgue-scandal-3278709",
  "paragraph": "© Reuters. FILE PHOTO: A general view of the Harvard Medical School in the Longwood Medical Area in Boston, Massachusetts, U.S., May 15, 2022. Picture taken with a drone. REUTERS/Brian Snyder/File Photo\nBy Nate Raymond BOSTON (Reuters) - Harvard University on Friday urged a judge in Boston to dismiss lawsuits by families accusing it of mishandling the bodies of loved ones that were donated to its medical school and whose organs and parts were then sold on the black market by the former manager of its morgue. Martin Murphy, a lawyer for the school, told a state court judge that Harvard Medical School was \"deeply sorry for the uncertainty and pain\" families suffered as a result of the alleged conduct of its ex-morgue manager, Cedric Lodge, who has been indicted for selling body parts on the black market. But Murphy said that under a Massachusetts law that governs the donation of bodies to medical schools, Harvard enjoyed broad immunity from lawsuits unless the families can show it failed to act in \"good faith.\" \"None of them make any kind of factual allegations that plausibly suggest that anyone other than Mr. Lodge was involved in the conduct that's at issue here,\" Murphy told Suffolk County Superior Court Judge Kenneth Salinger. But lawyers for the families said nothing in the state's Uniform Anatomical Gift Act supported shielding Harvard from liability for allowing donor bodies in its possession to be unlawfully displayed, dismembered, and trafficked.  Lawyer Kathryn Barnett said the families were \"devastated by the shocking discoveries of what went on at Harvard\" and hoped through the lawsuits to understand how Harvard could have turned a blind eye to Lodge's years-long conduct. \"These are families who are desperate now for answers,\" she said. Salinger said he would issue a ruling as quickly as possible in the \"very troubling and difficult case.\" The 12 lawsuits were filed after federal prosecutors brought charges in June against Lodge and five others accused of buying and selling human remains stolen from Harvard Medical School and an Arkansas mortuary. Prosecutors said Lodge from 2018 through 2022 would at times let potential buyers into the school's morgue to examine cadavers and select what parts to buy. The buyers mostly resold the body parts, prosecutors said. \nThey said Lodge also transported stolen remains to his home in New Hampshire, where he and his wife sold them to others. They also shipped stolen remains to people out of state, prosecutors said. The Lodges have pleaded not guilty to conspiracy and interstate transport of stolen goods charges. They and two other defendants are slated to face trial in federal court in Williamsport, Pennsylvania, on April 1."
}