{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK15009_L.jpg",
  "title": "Mexico's president seeks broad constitutional reforms ahead of June elections",
  "category": "Commodities news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 05, 2024 07:07PM ET",
    "Updated Feb 05, 2024 07:56PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Michael Benson",
        "2024-02-06 01:02:07",
        "The yield curve is closely monitored by investors.",
        "https://www.investing.com/members/246214947"
      ],
      [
        "Michael Benson",
        "2024-02-06 01:03:26",
        "Commodities play a significant role in the global economy.",
        "https://www.investing.com/members/246214947"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/commodities-news/mexicos-president-lays-out-constitutional-reforms-3293313",
  "paragraph": "© Reuters. FILE PHOTO: Mexico's President Andres Manuel Lopez Obrador speaks during his daily press conference, in Acapulco, Mexico December 20, 2023. REUTERS/Daniel Becerril\nMEXICO CITY (Reuters) -Mexico's president proposed sweeping constitutional reforms in a speech on Monday, including measures to overhaul the judiciary, electoral law, pensions, and environmental regulations, just months before a presidential election. \"The reforms that I propose seek to establish constitutional rights and strengthen ideals and principles related to humanism, justice, honesty, austerity and democracy,\" President Andres Manuel Lopez Obrador said in a speech in the capital, Mexico City, on Mexico's Constitution Day, a national holiday. The leftist Lopez Obrador and his allies do not have the two-thirds super majority in Congress needed to change the constitution, but the proposed reforms are expected to shape the political debate ahead of the June presidential vote. Former Mexico City mayor and ruling party candidate Claudia Sheinbaum is currently leading in the polls to succeed Lopez Obrador, who by law can only serve one six-year term. The 20 constitutional reforms Lopez Obrador announced included cutting the number of lawmakers in the Lower House of Congress and Senate, electing judges by direct vote, and reducing spending for political campaigns and political parties. They would also mandate annual increases in minimum wage above inflation, outlaw fracking and open-pit mining, limit water concessions in areas of the country grappling with water shortages, and increase scholarships for impoverished children.  \nHe said the aim of the reforms are to \"reorient the state to put it at the service of the people.\" The proposed constitutional reforms would be handed to the Lower House of Congress for discussion later on Monday, he said."
}