{
  "image": "https://i-invdn-com.investing.com/news/indicatornews_4_800x533_L_1413112066.jpg",
  "title": "US strikes another Houthi anti-ship missile",
  "category": "Commodities news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 20, 2024 12:20PM ET",
    "Updated Jan 20, 2024 04:45PM ET"
  ],
  "comments": [
    4,
    [
      [
        "Cristina Blanco",
        "2024-01-21 00:23:50",
        "The best time to invest is when you have money. PATRICIA Stated This quote emphasizes the importance of taking advantage of opportunities when they arise, rather than waiting for the perfect moment. It's a reminder that investing is a long term process, and that it's never too late to start. So don't wait for the perfect time to invest start today and you'll be surprised at what you can achieve.",
        "https://www.investing.com/members/256460122"
      ],
      [
        "昱旻 何",
        "2024-01-20 23:51:51",
        "how about US dollar",
        "https://www.investing.com/members/212723984"
      ],
      [
        "Prabu Madurai",
        "2024-01-20 20:19:42",
        "gold up or down",
        "https://www.investing.com/members/219647686"
      ],
      [
        "Uttam Maheshwari",
        "2024-01-20 18:09:33",
        "crudeoil down every news ",
        "https://www.investing.com/members/251296092"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/commodities-news/us-strikes-another-houthi-antiship-missile-3278883",
  "paragraph": "By Kanishka Singh and Enas Alashray WASHINGTON/CAIRO (Reuters) -U.S. Central Command forces on Saturday struck a Houthi anti-ship missile that was aimed into the Gulf of Aden and prepared to launch, the U.S. military said, with the latest round of strikes coming hours after the United States struck three other Houthi anti-ship missiles. \"U.S. forces determined the missile presented a threat to merchant vessels and U.S. Navy ships in the region, and subsequently struck and destroyed the missile in self-defense,\" the U.S. Central Command said in a statement on X. The incident, the latest amid growing tensions in the Red Sea and Gulf of Aden that have disrupted global trade and raised fears of supply bottlenecks, took place around 0400 Yemen time (0100 GMT), the U.S. Central Command added.  Hours earlier on late Friday, U.S. Central Command forces conducted strikes against three Houthi anti-ship missiles that they said were aimed into the southern Red Sea. Attacks by the Iran-aligned Houthi militia on ships in and around the Red Sea for the past several weeks have slowed trade between Asia and Europe and alarmed major powers in an escalation of the war in Gaza. The Houthis, who control most of Yemen, say their attacks are in solidarity with Palestinians under attack from Israel in Gaza.  Since last week, the United States has been launching strikes on Houthi targets in Yemen, and this week returned the militia to a list of \"terrorist\" groups.  President Joe Biden said on Thursday that air strikes would continue even as he acknowledged they may not be halting the Houthi attacks. The confrontation risks an expansion of the conflict beyond Hamas-governed Gaza, where the local health ministry says over 24,000 people have been killed in Israel's assault.  Israel launched its offensive following Oct. 7 attacks on Israel by the Palestinian Islamist group, which Israeli officials say killed 1,200 people and took more than 200 hostages. Saudi Arabia's foreign minister expressed concern that tensions in the Red Sea amid attacks by the Houthis and U.S. strikes on Houthi targets could spiral out of control and escalate the conflict in the region. \"I mean, of course, we are very worried. I mean, you know, we are in a very difficult and dangerous time in the region, and that's why we are calling for de-escalation,\" Prince Faisal bin Farhan told CNN 'Fareed Zakaria GPS' in an interview that will be aired on Sunday. Saturday's strikes were the fifth in the past week by the U.S. against Houthi missile launchers that were prepared to launch attacks. The Houthis launched two anti-ship ballistic missiles at a U.S.-owned tanker ship late on Thursday that hit the water near the vessel but caused no injuries or damage, according to the U.S. military."
}