{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0I0AQ_L.jpg",
  "title": "Ireland launches legal case against UK over Northern Ireland amnesty law",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 19, 2024 05:45AM ET",
    "Updated Jan 19, 2024 05:50AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/ireland-launches-legal-case-against-uk-over-northern-ireland-amnesty-law-3278046",
  "paragraph": "© Reuters. FILE PHOTO: General view of the European Court of Human Rights building in Strasbourg, December 3, 2013. REUTERS/Vincent Kessler/File Photo\nLONDON (Reuters) -The European Court Of Human Rights said on Friday that Ireland had launched a legal challenge against Britain over a new law that gives conditional amnesties to former soldiers and militants involved in decades of violence in Northern Ireland. The law has been condemned by victims' families, human-rights groups and all major political parties on the island of Ireland, including British unionist and Irish nationalist. It came into force last September.  The Irish government, which submitted the case on Jan. 17, argues that certain provisions of the law are not compatible with the European Convention, the ECHR statement said.  Britain has halted prosecutions of those involved in the \"Troubles\" period, saying they are unlikely to succeed and an independent body should be set up instead. Britain argues that prosecutions linked to the events of up to 55 years ago are increasingly unlikely to lead to convictions and that the legislation is needed to draw a line under the conflict.  When announcing its decision to take the British government to court over the law last month, Dublin had said it had no other recourse but to take legal action as London had shut off any possibility of a political resolution.  \nBritain called the Irish government's challenge \"unnecessary.\"  Around 3,600 people died in three decades of confrontation between Irish nationalist militants seeking a united Ireland, pro-British \"loyalist\" paramilitaries and the British military. The conflict largely ended with a 1998 peace deal."
}