{
  "image": "https://i-invdn-com.investing.com/news/LYNXMPECB60NB_L.jpg",
  "title": "Oil prices in weekly slump as Gaza ceasefire hopes, stronger dollar bite",
  "category": "Commodities news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 01, 2024 08:44PM ET",
    "Updated Feb 02, 2024 04:23PM ET"
  ],
  "comments": [
    4,
    [
      [
        "zhongmin du",
        "2024-02-04 14:55:08",
        "we will see oil price big jump up on Monday.",
        "https://www.investing.com/members/213264820"
      ],
      [
        "zhongmin du",
        "2024-02-04 14:53:38",
        "where and when is the cease fire? IT just is a conspiracy to close lower on last Friday.",
        "https://www.investing.com/members/213264820"
      ],
      [
        "zhongmin du",
        "2024-02-03 14:42:51",
        "cease fire?where and when?",
        "https://www.investing.com/members/213264820"
      ],
      [
        "Ok Crude",
        "2024-02-02 15:03:32",
        "The arti le says oil retreats on strong jobs, to me that would b more people with jobs buying more gas which n turn would be oil being turned into fuel, B.S.",
        "https://www.investing.com/members/211341364"
      ],
      [
        "Teena Marie",
        "2024-02-03 01:09:22",
        "Storage increases costs when buying is low. Higher volume sales lowers costs. It's a numbers game that revolves around volume. Same with refining.",
        "https://www.investing.com/members/242916302"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/commodities-news/oil-prices-rise-but-still-set-for-weekly-loss-amid-gaza-ceasefire-chatter-3290648",
  "paragraph": "Investing.com -- Oil prices fell Friday, to end the week deep in the red as growing optimism over an extended ceasefire in the Israel-Hamas war cooled the supply risks premium baked into prices.\nBy 14:30 ET (19.30 GMT), the U.S. crude futures settled 2.1% lower at $72.28 a barrel and the Brent contract dropped 1.9% to $77.19 a barrel. the crude benchmarks fell more than 7% this week. \nTalk of Israel/Hamas ceasefire deflates supply risk premium\nMultiple media reports suggest Israeli and Hamas leaders were considering a ceasefire that many expect to mark a severe de-escalation in military tensions in the Middle East, which have been a key point of support for oil prices in recent months. \nAttacks by the Iran-aligned, Yemeni Houthi group on vessels in the Red Sea had disrupted shipping activity in the region. After U.S.-led forces recently struck back against the Houthis, the conflict saw several shipping operators steer clear of the Suez Canal, which in turn pointed to potential oil delivery delays in Europe and Asia. \nBut given that the Houthis’ main point of contention was the Israel-Hamas war, any de-escalation in the conflict is expected to wind down tensions in the Red Sea, lifting any disruptions to oil supplies.\nStrong jobs data boosts dollar to pile on crude price woes\nThe US Dollar Index jumped Friday following U.S. monthly jobs data showing the economy created 353,000 last month, from an upwardly revised total of 333,000 in December, and significantly above the expected 187,000.\nA stronger dollar makes oil, priced in the U.S. dollars, more expensive and less attractive to foreign buyers.\nThese strong numbers followed the Federal Reserve downplaying expectations for early interest rate cuts in 2024, during a meeting earlier this week.\nKeeping interest rates at elevated levels could further cool economic activity, hitting crude demand in the world’s largest consumer.\n(Peter Nurse, Ambar Warrick contributed to this article.)"
}