{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK040AS_L.jpg",
  "title": "Iran arrests 11 suspects over bomb blasts, mourners demand revenge - state TV",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 05, 2024 06:35AM ET",
    "Updated Jan 05, 2024 12:36PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/iran-mourns-bomb-attack-victims-crowds-demand-revenge-3268033",
  "paragraph": "5/5\n© Reuters. Iran's President Ebrahim Raisi visits the grave of Iranian military commander General Qassem Soleimani, in Kerman, Iran, January 5, 2024. Iran's Presidency/WANA (West Asia News Agency)/Handout via REUTERS \n2/5\nDUBAI (Reuters) -Iranian authorities said on Friday that security forces had arrested 11 people suspected of involvement in two bomb blasts  that killed nearly 100 people at a memorial service for a slain military commander. The Islamic State militant group has claimed responsibilty for the attacks in Kerman, southeastern Iran, on Wednesday. Iran's intelligence ministry said in a statement security forces detained two people for providing support to the two suicide bombers in Kerman and nine others based in other parts of Iran who were suspected of links to the incident. The bombings were the deadliest such attacks in Iran since the 1979 Islamic Revolution.  As victims were buried on Friday, mourners wept over their coffins and crowds chanted \"revenge, revenge,\" state TV showed. Nearly 100 people were killed in the blasts at a memorial service for military commander General Qassem Soleimani, who was assassinated in Iraq in 2020 by a U.S. drone.  The explosions took place amid a tense mood in the region as Israel's war against Hamas in Gaza neared the three-month mark. The Intelligence Ministry said its agents seized explosive devices and raw material, explosive vests, remote-control devices, detonators and thousand of pellets used in explosive vests. One of the suicide bombers was identified as a Tajik national, it said. Islamic State said on Thursday two of its members had detonated explosive belts in the crowd that had gathered for Soleimani's memorial. \"We will find you wherever you are,\" Revolutionary Guards commander Major-General Hossein Salami said at the funeral in Kerman's Imam Ali religious centre. \nPresident Ebrahim Raisi said in a televised address. \"Our forces will decide on the place and time to take action\". In 2022, Islamic State claimed responsibility for an attack on a Shi'ite shrine in Iran that killed 15 people, while earlier attacks claimed by Islamic State include twin bombings in 2017 that targeted Iran's parliament and the tomb of the Islamic Republic's founder, Ayatollah Ruhollah Khomeini. (dubai.newsroom@thomsonreuters.com; Editing by Ros Russell, Andrew Heavens and Angus MacSwan)"
}