{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "Chinese ex-Navy chief, with South China Sea background, named defence minister",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 29, 2023 09:33AM ET",
    "Updated Dec 29, 2023 04:40PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/chinese-exnavy-chief-with-south-china-sea-background-named-defence-minister-3264725",
  "paragraph": "By Yew Lun Tian and Laurie Chen BEIJING (Reuters) - China named former Navy chief Dong Jun as its new defence minister on Friday to replace the last minister who disappeared from public view four months ago. The appointment by Chinese lawmakers comes as President Xi Jinping upgrades the military as part of his push to make China a dominant world power, a goal that has alarmed many neighbours, especially its assertiveness towards self-ruled Taiwan and in the disputed South China Sea. The role of China's defence minister is to be the public face of the People's Liberation Army in its engagement with the media and with other armed forces. A crucial element of his job is to engage with the United States military to lower the risk of conflict over Taiwan and the South China Sea, two flashpoints to which Dong, 62, is no stranger. Before becoming the People's Liberation Army Navy chief and made a full general in 2021, he was vice commander of the East Sea Fleet, the backbone of what is now the Eastern Theatre Command - the main force responsible for fighting over Taiwan, a self-ruled island China considers its own. He also served as vice commander of the Southern Theatre Command which operates in the South China Sea, most of which is claimed by China. \"Dong would be familiar with managing near-encounters between Chinese and U.S. military. This is useful when he has to manage crises between both militaries,\" said Li Mingjiang, international relations scholar at the Rajaratnam School of International Studies in Singapore. Wen-Ti Sung, political scientist and non-resident fellow at the Atlantic Council's Global China Hub, said the selection of Dong could be a sign that purges are ongoing in the Rocket Force and Equipment Development Department.  The two preceding defence ministers, who came from these two forces, have since disappeared from public view. Dong replaces Li Shangfu, who had headed the department in charge of equipment procurement and research before taking up the defence post in March. Li has not been seen in public since Aug. 25. Reuters cited sources to report that Li was under investigation for corruption related to equipment procurement and development. WIDER PURGE In a possible sign of a wider purge, nine senior military officials were removed from China's top legislative body, Xinhua reported, citing a separate Friday announcement from the Standing Committee of the National People's Congress. These include former PLA Rocket Force chief Li Yuchao who was abruptly replaced in July, his predecessor Zhou Yaning, two other Rocket Force officials, two officials from the PLA Equipment Development Department, deputy chief of the Joint Staff Department Zhang Zhenzhong and ex-Air Force Commander Ding Laihang.  Zhou headed the Rocket Force between 2017 and 2022. Zhang was deputy commander of the PLA Rocket Force between 2016 and March 2022, where he overlapped with Li Yuchao. He previously held commander or deputy commander roles at two satellite launch sites and a space launch site. Three executives at state-owned missile defence firms were also stripped of their membership of a ceremonial political advisory body on Wednesday. China's defence ministry vowed to \"crack down on every corrupt official\" in August when asked about the whereabouts of Li's predecessor, Wei Fenghe - its first reference to corruption probes among top military leaders following a major shake-up of the armed force overseeing China's nuclear and conventional missile arsenal.  Beijing has not explained Li's disappearance but stripped him of his title as defence minister and state councillor in October. During his brief tenure as minister, Li did not meet his U.S. counterpart - Defense Secretary Lloyd Austin. The ministry explained that Washington would have to first remove the sanctions it placed on Li on 2018 over his role in purchasing Russian aircraft and equipment. Dong would face no such constraint, as he is not known to be under U.S. sanctions. When President Joe Biden and Xi met in San Francisco last month, both leaders agreed to resume senior military talks that were suspended following then-House of Representatives Speaker Nancy Pelosi's visit to Taiwan in August 2022. The U.S. Department of Defense has been in touch with China at the working level about a sequence of upcoming engagements, Pentagon spokesperson John Supple said on Friday, adding the two sides are working to implement what Biden and Xi announced in November. \"These kinds of engagements take time to schedule and prepare for on both sides so that defense and military leaders from our two countries – including at the senior-most levels – can have substantive conversations with their appropriate counterparts,\" Supple said. Defense Policy Coordination Talks in January and Military Maritime Consultative Agreement talks in early 2024 are in the planning stages, he added."
}