{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "China-U.S. cooperation 'no longer an option ... but an imperative' - Wang Yi",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 05, 2024 06:54AM ET",
    "Updated Jan 05, 2024 08:30AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/chinaus-cooperation-no-longer-optional-but-imperative-for-both-and-the-world--wang-yi-3268085",
  "paragraph": "By Liz Lee and Ethan Wang BEIJING (Reuters) -Chinese Foreign Minister Wang Yi said on Friday the most urgent task for Sino-U.S. relations is to establish a correct understanding and cooperation between the two sides, stressing it is \"no longer an option ... but an imperative\" for the world. Cooperation is the \"most correct choice for China and the United States to get along\", Wang said in a keynote speech at an event to mark the 45th anniversary of the establishment of diplomatic relations between China and the U.S. \"It can be said that China-U.S. cooperation is no longer an option for the two countries and even for the world, but an imperative that must be seriously addressed,\" Wang said. Relations between the United States and China have been tense over a range of issues, including national security, global conflicts, trade curbs, climate change and Taiwan. The diplomatic rift deepened last year as both accused each other of flying high-altitude balloons in their respective air spaces. This past week, the two superpowers held competing military drills in the South China Sea as run-ins intensify in the region over disputed territory. Wang said China hopes the U.S. will relax its mindset and \"in an attitude of equality and inclusiveness\" respect the choices made by the Chinese people and China's development path, including when defending its national sovereignty and territorial integrity. \"We are willing to commit ourselves to building a stable, healthy and sustainable China-U.S. relationship on the basis of mutual respect,\" he said. Wang also said China's development and revitalisation has a \"strong endogenous momentum\", which he said meant that China will assume greater responsibility for the world's peace and development. \"We have no intention of replacing anyone, overriding anyone, and have no intention of seeking hegemony,\" he added. The U.S. and its allies have often said they are concerned about an increasing alignment between China and Russia.  China's top diplomat travelled to the United States recently as both countries sought to manage their differences to avoid conflict. Wang said that while both nations were built on different backgrounds, the differences should not lead to confrontation, and that the \"big stick of sanctions\" should not be used at every turn to exercise power or hegemony. \"We must insist on peaceful coexistence, and the most important thing is to effectively manage differences,\" Wang said. \nObservers fear new turbulence could rattle the relationship as the year begins. David Meale, U.S Deputy Chief of Mission for the Embassy of the U.S. in Beijing, who attended the event with Wang, said \"as we look ahead to 2024, my colleagues in the U.S. Embassy and in our four consulates general look forward to working with our counterparts to continue to responsibly manage our bilateral relationship.\""
}