{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0S0C6_L.jpg",
  "title": "Slovakia looks to buy Patriot air defence system from United States",
  "category": "Economy",
  "publisher": "Reuters",
  "date": "Published Jan 29, 2024 06:57AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/economy/slovakia-looks-to-buy-patriot-air-defence-system-from-united-states-3285734",
  "paragraph": "© Reuters. FILE PHOTO: U.S. long range air defence systems Patriot (R) and British radar Giraffe AMB are displayed during Toburq Legacy 2017 air defence exercise in the military airfield near Siauliai, Lithuania, July 20, 2017. REUTERS/Ints Kalnins/File Photo\n(Reuters) - Slovakia wants to discuss buying a Patriot missile defence system from the United States as part of longer-term plans to defend its airspace, Defence Minister Robert Kalinak said. Kalinak, speaking on state broadcaster RTVS's Sunday debate show, said Slovakia would seek to use a discount for the possible purchase of attack helicopters that it received from the U.S. last year. The discount came after Bratislava sent its retired MiG-29 fighter jets and a S-300 air defence system to Ukraine. \"We have opened the debate whether it would be possible to use this discount as well for the Patriot (system),\" Kalinak said. Bratislava received the U.S. offer last year for 12 new Bell AH-1Z Viper helicopters at a two-thirds discount, with part of the price covered under the U.S. Foreign Military Financing programme after it sent its old fighter jets to Ukraine. The offer came before the new government that includes Kalinak took power in October 2023. Prime Minister Robert Fico's government has halted supplies of military aid to Ukraine from officials stockpiles. Kalinak said that while the helicopters under discussion were for offensive purposes, Slovakia's priority should be on defence and specifically air defence. The country borders Ukraine and has been part of NATO efforts to bolster its eastern flank. \nSlovakia currently has a Patriot system from Italy stationed in the country set to stay until April. Kalinak said Slovakia was also in talks with Poland and Israel about short- to medium-range air defence systems."
}