{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0B0GW_L.jpg",
  "title": "Erdogan accuses U.S., Britain of trying to turn Red Sea into 'sea of blood'",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 12, 2024 07:55AM ET",
    "Updated Jan 12, 2024 08:01AM ET"
  ],
  "comments": [
    3,
    [
      [
        "Ken Roth",
        "2024-01-12 20:21:35",
        "Erdogan plays politics as usual to ensure that he has friends ",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Charles Manson",
        "2024-01-12 14:04:48",
        "Jack Muslim. Boo HooHoo. Cut off oil to his country.",
        "https://www.investing.com/members/249519852"
      ],
      [
        "tomas michalek",
        "2024-01-12 13:15:53",
        "erdogan is full of it",
        "https://www.investing.com/members/201024636"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/erdogan-accuses-us-britain-of-trying-to-turn-red-sea-into-sea-of-blood-3273513",
  "paragraph": "© Reuters. Turkish President Tayyip Erdogan speaks to announce Murat Kurum as his ruling Justice and Development Party (AK Party) candidate in Istanbul's mayoral election in March, in Istanbul, Turkey January 7, 2024. REUTERS/Murad Sezer/ File Photo\nANKARA (Reuters) - Turkish President Tayyip Erdogan on Friday slammed the U.S. and British strikes on Houthi targets in Yemen as a disproportionate use of force and accused the two countries of trying to turn the Red Sea into a \"sea of blood\". Turkey, a NATO member, has strongly criticised Israel for its war in Gaza aimed at wiping out Palestinian militant group Hamas, and has repeatedly slammed Western countries for supporting Israel's campaign. Asked by reporters about the overnight air and sea strikes by U.S. and British forces across Yemen in retaliation against Iran-backed Houthi forces for attacks on Red Sea shipping, the Turkish president said these were not proportionate. \"All that has been done is a disproportionate use of force,\" Erdogan said after Friday prayers in Istanbul.  \"At the moment, they are trying to turn the Red Sea into a sea of blood and Yemen, with the Houthis and by using all of its force, says it is and will give the necessary response in the region to the United States, Britain,\" he added. Turkey generally supports Yemen's internationally recognized government, and backs the United Nations-led process aimed at bringing about peace between it and the Houthis who have gained control of much of the country. Ankara has previously condemned Houthi missile attacks on Saudi Arabia. Erdogan said Ankara had heard from various channels that the Houthis were carrying out a \"very successful defence, response\" against the United States and Britain, while adding that Iran was looking at \"how it can protect itself against all that is happening\". \nThe Houthis have been attacking shipping lanes at the mouth of the Red Sea, saying this is to support Palestinians against Israel. Unlike its Western allies and some Arab states, Ankara does not consider Hamas, which controls Gaza and launched a deadly attack on southern Israel on Oct. 7, a terrorist organisation."
}