{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK000GG_L.jpg",
  "title": "Israel signals tactics shift, troop pullback as US carrier heads home",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 01, 2024 04:10PM ET",
    "Updated Jan 01, 2024 11:12PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Donald Hart",
        "2024-01-01 22:26:24",
        "Gaza is a $@it hole!",
        "https://www.investing.com/members/202080276"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/israel-signals-tactics-shift-troop-pullback-as-us-carrier-heads-home-3265149",
  "paragraph": "By Dan Williams, Nidal al-Mughrabi and Arafat Barbakh JERUSALEM/CAIRO/GAZA (Reuters) - Israel pulled tanks out of some Gaza City districts on Monday, residents said, as it announced plans to shift tactics and cut back on troop numbers, but fighting raged elsewhere in the Palestinian enclave along with intense bombardment.  Israel says the war in Gaza, which has reduced much of the territory to rubble, killing thousands and plunging its 2.3 million people into a humanitarian disaster, has many months to go.  But it also signaled a new phase in its offensive, with an official saying on Monday the military would draw down forces inside Gaza this month and shift to a months-long phase of more localised \"mopping up\" operations.  A U.S. official said the decision appeared to indicate the start of a shift to lower-intensity operations in the north of the Palestinian enclave. The hints at a lowered tempo in Gaza came as the U.S. Navy announced that the Gerald R. Ford (NYSE:F) aircraft carrier was returning to its home port in Virginia after being to deployed to the Eastern Mediterranean following the outbreak of hostilities. The Israeli official said the troop reduction would allow some reservists to return to civilian life, shoring up Israel's war-battered economy, and free up units in case of a wider conflict in the north with Lebanon's Iran-backed Hezbollah.  Artillery fire between Hezbollah and Israel has rattled the border since the start of the Gaza conflict, with Israel's military saying it carried out an air strike on Monday.  Residents and security sources said Israeli raids targeted houses in the Lebanese village of Kafr Kila near the border, killing three people. They identified them as rescuers, but Lebanon's Hezbollah movement later said on its Telegram account on Monday that the three were fighters with the movement. The Israeli official said the situation on the Lebanese border \"will not be allowed to continue. This coming six-month period is a critical moment.\" Any new escalation carries risks for a wider regional war. Tehran-backed fighters in Yemen have attacked Red Sea shipping, drawing a U.S. military response, and an Iranian warship has sailed into the waterway, Iranian media reported on Monday.  The Gaza war was triggered by a surprise Hamas attack on Israeli towns on Oct. 7 that Israel says killed 1,200 people. Palestinian health authorities in Hamas-run Gaza say Israel's offensive there has killed more than 21,978 people. SHELTER IN ZOO The scale of suffering in Gaza, where the bombardment has driven almost all inhabitants from their homes, has led Israel's Western allies, including the U.S., to urge it to scale down its offensive.  \"My wish for 2024 is not to die ... Our childhood is gone. There is no bathroom, no food and no water. Only tents,\" 11-year-old Layan Harara said in Gaza's Rafah. In the city's zoo, people camped out between cages holding starving animals.  Residents of Sheikh Radwan district in Gaza City, in the northern part of the enclave that Israel's offensive focused on first, said tanks had withdrawn after what they described as the most intense 10 days of warfare since the conflict began.  \"The tanks were very near. We could see them outside the houses. We couldn't get out to fill water,\" said Nasser, a father of seven living in Sheikh Radwan.  Tanks also pulled out of Gaza City's al-Mina district and parts of Tel al-Hawa district, while retaining some positions in the suburb controlling the enclave's main coastal road, residents said.  However, tanks remained in other parts of northern Gaza and health officials said some people trying to return to their homes in a southern district of Gaza City had been killed by Israeli fire on Sunday. On Monday, Hamas' armed wing claimed to have killed 15 Israeli soldiers after triggering an explosive minefield east of the Tuffah neighborhood in Gaza city. Fighting in central parts of the enclave continued unabated, residents there said, with tanks pushing into al-Bureij and air strikes targeting al-Nusseirat, al-Maghazi and the southern city of Khan Younis. Strikes killed at least 10 people in al-Maghazi, and seven in a house in Deir Al-Balah, health officials said. Hamas showed its continued ability to target Israel after more than 12 weeks of the war, launching a barrage of rocket fire at Tel Aviv overnight. GUERRILLA AMBUSHES Israel's move to a new stage in the conflict comes after its initial bombardment and a ground invasion that began on Oct. 27. Air and artillery strikes have continued to pound the entire enclave during that time, leaving much of it in ruins.  With Israeli tanks and troops having overrun most of northern Gaza, while still pushing into the centre and parts of the south, Hamas is responding with guerrilla-style ambushes from tunnels and bunkers in the enclave's narrow streets.  Hamas seized 240 hostages on Oct. 7 and Israel believes 129 are still held in Gaza after some were released during a brief truce and others killed during air strikes and rescue or escape attempts. Qatar and Egypt are seeking to negotiate a new truce and hostages deal.  Avi Dichter, a member of Israel's security cabinet, said on Kan Radio that hostages could only be freed by putting \"massive\" pressure on Hamas and allied groups. \"Without Hamas' terrorist infrastructure being destroyed and its governance capabilities toppled, the war will not end,\" he said.  On Saturday Israeli Prime Minister Benjamin Netanyahu said the country must retake control of Gaza's border with Egypt, an area now crammed with civilians who have fled the carnage across the rest of the enclave. Retaking the border could also constitute a de facto reversal of Israel's 2005 withdrawal from Gaza, raising new questions over the future of the enclave and prospects for a Palestinian state. \nWashington said Israel should allow a Palestinian government to control Gaza when the conflict is over.  In the Israeli-occupied West Bank, 2023 was the deadliest year on record for Palestinians with 307 killed since the war in Gaza began on Oct. 7, the U.N. said."
}