{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0I0GD_L.jpg",
  "title": "Japan's SLIM moon craft short on power after successful lunar landing",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 19, 2024 08:36AM ET",
    "Updated Jan 19, 2024 07:22PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/japan-starts-precision-landing-of-moon-sniper-slim-spacecraft-3278354",
  "paragraph": "3/3\n© Reuters. A journalist wearing a VR device tries a simulation of Smart Lander for Investigating Moon (SLIM)'s moon landing, at Japan Aerospace Exploration Agency (JAXA)'s facility, in Sagamihara, south of Tokyo, Japan, January 19, 2024. REUTERS/Kim Kyung-Hoon\n2/3\nBy Kantaro Komiya and Joey Roulette TOKYO (Reuters) -Japan on Saturday became the fifth country to put a spacecraft on the moon, but solar power issues threatened to cut short the nation’s mission to prove a \"precision\" landing technology and revitalise a space programme that has suffered setbacks. The Japan Aerospace Exploration Agency (JAXA) said its Smart Lander for Investigating Moon (SLIM) landed the moon's surface at around 12:20 a.m. (1520 GMT Friday), but its solar panels were not able to generate electricity, possibly because they are angled wrong.  JAXA prioritised the transfer of SLIM's data to earth as the probe relied only on its battery, which would last for \"a few hours\" despite \"life-sustaining treatments\" such as turning off its heater, Hitoshi Kuninaka, the head of JAXA's research centre, told a press conference. JAXA will maintain the status quo rather than take risky actions and hopes a shift in the sunlight's angle will hit the panels in a way that can restore its functions, he added.  \"It takes 30 days for the solar angle to change on the moon,\" Kuninaka said. \"So when the solar direction changes, and the light shines from a different direction, the light could end up hitting the solar cell.\" Signal from the SLIM was lost, data from NASA's Deep Space Network showed. It was not immediately clear whether the signal loss was temporary or a power-saving measure.  Dubbed the \"moon sniper\", SLIM attempted to land within 100 metres (328 feet) of its target, versus the conventional accuracy of several kilometres, a technology JAXA says will become a powerful tool in future exploration of hilly moon poles seen as a potential source of oxygen, fuel and water. \"Looking at the trace data, SLIM most certainly achieved a landing with 100-metre accuracy,\" Kuninaka said, although adding it will take about a month to verify it. Japan is increasingly looking to play a bigger role in space, partnering with ally the United States to counter China. Japan is also home to several private-sector space startups and the JAXA aims to send an astronaut to the moon as part of NASA's Artemis program in the next few years. But the Japanese space agency has recently faced multiple setbacks in rocket development, including the launch failure in March of its new flagship rocket H3 that was meant to match cost-competitiveness against commercial rocket providers like SpaceX.  The failure caused widespread delays in Japan's space missions, including SLIM and a joint lunar exploration with India, which in August made a historic touchdown on the moon's south pole with its Chandrayaan-3 probe. JAXA has twice landed on small asteroids, but unlike with an asteroid landing, the moon's gravity means the lander cannot pull up for another try, its scientists said. Three lunar missions by Japanese startup ispace, Russia's space agency and American company Astrobotic have failed in the past year. In Sagamihara, a Tokyo suburb where JAXA's control centre is located, about 80 people gathered at a city hall for the public viewing of the midnight landing.  \"There has been a series of launch failures (of JAXA’s rockets) so I really wanted this to succeed,\" said Toshie Yamamoto, an office worker in her 50s. There was a tense atmosphere during the descent sequence, but they broke into applause when SLIM's landing on the moon was announced.  SOFT LANDING Only four nations - the former Soviet Union, the United States, China and India - and no private company had achieved a soft landing on the moon's surface. The 2.4m by 1.7m by 2.7m (7ft x 6ft x 9ft) vehicle includes two main engines and 12 thrusters, surrounded by solar cells, antennas, radar and cameras. Keeping it lightweight was another objective of the project, as Japan aims to carry out more frequent missions in the future by reducing launch costs. SLIM weighed 700 kg (1,540 lb) at launch, less than half of India's Chandrayaan-3. As the probe descended onto the surface, it was designed to recognise where it was flying by matching its camera's images with existing satellite photos of the moon. This \"vision-based navigation\" enables a precise touchdown, JAXA has said.  The precision landing \"won't be a game changer\", but the cost-reduction effects of it and the lightweight probe manufacturing might open up moonshots to space organisations worldwide, Bleddyn Bowen, a University of Leicester associate professor specialising in space policy, said ahead of the touchdown. Shock absorbers make contact with the lunar surface in what JAXA calls new \"two-step landing\" method - the rear parts touch the ground first, then the entire body gently collapses forward and stabilizes. \nOn landing, SLIM successfully deployed two mini-probes - a hopping vehicle as big as a microwave oven and a baseball-sized wheeled rover - that would have taken pictures of the spacecraft and were slowly sending them to the earth, JAXA said. Tech giant  Sony  (NYSE:SONY) Group, toymaker Tomy and several Japanese universities jointly developed the robots. SLIM was launched on Japan's flagship H-IIA rocket in September and has taken a fuel-efficient four-month journey to the moon."
}