{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK01025_L.jpg",
  "title": "China calls on Taiwan's people to promote 'peaceful reunification'",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 01, 2024 10:25PM ET",
    "Updated Jan 02, 2024 02:19AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/china-calls-on-taiwans-people-to-promote-peaceful-reunification-3265182",
  "paragraph": "© Reuters. FILE PHOTO: Chinese and Taiwanese flags are seen in this illustration, August 6, 2022. REUTERS/Dado Ruvic/Illustration/FILE PHOTO\nTAIPEI (Reuters) - The head of China's Taiwan Affairs Office on Tuesday called on Taiwan's people to promote the process of \"peaceful reunification\", saying it was the common desire of people on both sides of the Taiwan Strait. Song Tao's message, which comes less than two week's before Taiwan holds presidential and parliamentary elections on Jan. 13, follows President Xi Jinping's remarks in his New Year Eve's address that China's \"reunification\" with Taiwan was inevitable. \"The motherland will eventually be reunified, and it will inevitably be reunified,\" Song said in his New Year's message on his office's website. This is the common desire and common mission of people on both sides of the Taiwan Strait, Song added. Taiwan's people should \"promote cross-strait relations to return to the right track of peaceful development, and promote the process of peaceful reunification of the motherland\", he said. Taiwan's government rejects China's sovereignty claims. Both the ruling Democratic Progressive Party and largest opposition party, the Kuomintang, say only Taiwan's people can decide their future. China has offered Taiwan a \"one country, two systems\" model of autonomy, but no mainstream Taiwanese party supports that idea.  Song reiterated China's support for \"one country, two systems\" and opposition to Taiwan's formal independence or \"interference by external forces\". \nHis message made no mention of the election, which the Taiwan Affairs Office has cast as a choice between war and peace. China has continued military pressure around the island, ended some tariff cuts for Taiwan and threatened further economic measures as the vote has neared."
}