{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK070G1_L.jpg",
  "title": "Tales and play-tents sustained Israeli mother and daughter in Gaza captivity",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 08, 2024 08:17AM ET",
    "Updated Jan 08, 2024 02:09PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/tales-and-playtents-sustained-israeli-mother-and-daughter-in-gaza-captivity-3269519",
  "paragraph": "© Reuters. FILE PHOTO: Three Israeli women, identified by Israeli Prime Minister Benjamin Netanyahu as Yelena Trupanob, Danielle Aloni and Rimon Kirsht, who are held captive by Islamist Hamas in Gaza after being abducted from Israeli homes on October 7, give a state\nBy Dan Williams JERUSALEM (Reuters) - When the Hamas gunmen stormed in, smashing and setting fire to the country home where Danielle Alony was spending a holiday weekend with her daughter Emilia, she hugged the five-year-old close and said: \"I'm sorry, my love. We're going to die.\"  But they ended up dragged into Gaza after Alony persuaded her sister, with whom she was staying, that it was better to go out and risk being shot than to succumb to the smoke and flames. Finding themselves among some 240 people abducted by the Palestinian Islamist group in the Oct 7 cross-border killing spree that unleashed war, the women and their three children were freed in a partial hostage release seven long weeks later. Interviewed on Israel's Channel 13 TV, Alony described the ordeal as a supreme test of parenting. Separated from her sister and nieces, she and Emilia were carted past jeering Palestinian mobs and into a Hamas tunnel that had iron-barred holding cells. \"My darling, do whatever they say. Stay next to me,\" Alony recalled telling her dumb-struck daughter. During three days underground with a group of hostages, Alony says she suffered a panic attack. The other captives felt it necessary to keep Emilia from seeing this, and took the girl aside. After that, Alony decided such episodes would not recur. \"She drew all her strength from me,\" Alony said. \"A child mustn't get depressed. A child mustn't experience hopelessness.\"  She, Emilia and a few hostages were moved between two safe houses, where they were watched by armed guards around the clock and needed permission for every function, like using the toilet. \"It was forbidden to speak - only whispers,\" Alony said. \"How any adult could get through that is a question in itself. But how do you pass 10 or 12 waking hours with a child? That's something entirely different.\" She and Emilia fashioned tents out of their mattresses, and played catch with a toy left in their room by the homeowner's children. Another woman held there retold their abduction as a folk tale, which the girl delighted in hearing again and again.  Sometimes Emilia would blame her mother for their captivity. Alony recalled kissing the girl's hands and responding: \"It's true. I'm to blame. But you'll see that every day we spend here brings us closer to leaving. For every day that you spend here, you will get to choose a present.\" When her daughter noticed that she was downcast, Alony would play this down, saying: \"Mom's a bit sad. And this will pass.\" It was caring for Emilia that kept Alony going, she said. Still, the boredom and inactivity were so onerous that Alony would encourage Emilia to sleep during the daytime hours, too.  Then, Alony said, \"I would weep. I felt like bashing my head against the wall, like I wanted to take a sleeping pill and not wake. I thought we would not get out.\" The sound of Israel's military assault on Gaza reached them, giving Alony some reassurance they would be rescued eventually: \"But the time - the time is something very, very significant.\" \nThough free now, Emilia carries the mark of captivity still. Alony said the girl cringes and covers her ears at any loud noise, plays make-believe games of \"let's defend ourselves\" and, when visiting any new place, asks: \"Are there bad people here?\"  (This story has been refiled to fix the spelling of Emilia in the references after paragraph 1)"
}