{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBN06C_L.jpg",
  "title": "Russia, Ukraine exchange claims over downed military aircraft",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 24, 2023 04:50PM ET",
    "Updated Dec 24, 2023 04:55PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/russia-ukraine-exchange-claims-over-downed-military-aircraft-3263127",
  "paragraph": "© Reuters. FILE PHOTO: A Russian Sukhoi Su-34 fighter-bomber fires missiles during the Aviadarts competition, as part of the International Army Games 2021, at the Dubrovichi range outside Ryazan, Russia August 27, 2021. REUTERS/Maxim Shemetov/File Photo\nMOSCOW (Reuters) -Russian and Ukrainian military officials both reported downing enemy aircraft on Sunday in different areas of the 1,000-km-long (621-mile) front of their 22-month-old war. The commander of Ukraine's air force, Mykola Oleshchuk, said Ukrainian anti-aircraft units had struck a Russian Su-34 fighter bomber near the Russian-occupied city of Mariupol on the Sea of Azov in southern Ukraine. Oleshchuk, writing on the Telegram messaging app, said the aircraft had not returned to its base, but gave no further details. Russia's Defence Ministry said earlier that its air defence systems had shot down four Ukrainian military aircraft over the past 24 hours -- just two days after Ukrainian President Volodymyr Zelenskiy said Kyiv had downed three Russian aircraft. In its daily dispatch, the Russian Defence Ministry said its air defence shot down three Su-27 fighter aircraft and one Su-24 tactical bomber in the Zaporizhzhia and Dnipropetrovsk regions of southeastern Ukraine. The dispatch provided no further details. On Friday, Zelenskiy said the country's forces shot down three Russian Su-34 fighter-bomber aircraft on the southern front, hailing it as a success in the conflict. \nAir Force commander Oleshchuk also said the planes had been downed. Reuters was not immediately able to corroborate the battlefield reports from either side."
}