{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBP0BX_L.jpg",
  "title": "UN names Gaza humanitarian relief coordinator after aid vote",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 26, 2023 01:32PM ET",
    "Updated Dec 26, 2023 06:30PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/un-appoints-gaza-humanitarian-relief-coordinator-following-aid-vote-3263657",
  "paragraph": "© Reuters. Sigrid Kaag, Dutch minister for foreign trade and development cooperation, speaks during a debate over remarks Prime Minister Mark Rutte made during talks to form a new government following the March 17 national elections, in The Hague, Netherlands April \nWASHINGTON (Reuters) -The United Nations on Tuesday named a coordinator to oversee humanitarian relief shipments into Gaza as part of a U.N. Security Council resolution adopted on Friday to boost humanitarian aid. Sigrid Kaag, the Netherlands' outgoing finance minister, will be the senior humanitarian and reconstruction coordinator for Gaza starting on Jan. 8, the U.N. said in a statement.  \"In this role she will facilitate, coordinate, monitor and verify humanitarian relief consignments for Gaza,\" the U.N. said. She will also establish a \"mechanism\" to accelerate aid into Gaza through countries not involved with the conflict.  A veteran U.N. diplomat, Kaag previously headed an international team of weapons experts charged with overseeing the elimination of Syria's chemical stockpile. In July she announced she would leave government because of the increasingly \"toxic\" environment for politicians in the Netherlands. \"We look forward to coordinating closely with Ms. Kaag and the UN Office for Project Services on efforts to accelerate and streamline the delivery of live-saving humanitarian relief to Palestinian civilians in Gaza,\" U.S. State Department spokesman Matthew Miller said in a written statement.  Friday's Security Council resolution stopped short of calling for a ceasefire after a week of vote delays and intense negotiations to avoid a United States veto. It calls for \"urgent steps to immediately allow safe, unhindered, and expanded humanitarian access and to create the conditions for a sustainable cessation of hostilities.\" Amid global outrage over a rising Gaza death toll in 11 weeks of war between Israel and Hamas and a worsening humanitarian crisis in the Palestinian enclave, the U.S. abstained to allow the 15-member council to adopt a resolution drafted by the United Arab Emirates. The U.S. and Israel oppose a ceasefire, believing it would only benefit Hamas. Washington instead supports pauses in fighting to protect civilians and free hostages taken by Hamas. \nAfter Hamas killed 1,200 people and captured 240 hostages on Oct. 7, Israeli Prime Minister Benjamin Netanyahu responded with an assault that has laid much of Gaza to waste. Palestinian health authorities in Hamas-ruled Gaza say nearly 21,000 people have been killed in Israeli strikes, with more feared buried under rubble. Nearly all of Gaza's 2.3 million people have been driven from their homes, many several times."
}