{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0202I_L.jpg",
  "title": "Indonesia vote watchdog says president's son broke rules",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 04, 2024 06:36AM ET",
    "Updated Jan 04, 2024 06:41AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/indonesia-vote-watchdog-says-presidents-son-broke-rules-3267066",
  "paragraph": "© Reuters. FILE PHOTO: The eldest son of Indonesian President Joko Widodo, vice presidential candidate Gibran Rakabuming Raka, gestures during a televised debate at the Jakarta Convention Center in Jakarta, Indonesia, December 22, 2023. REUTERS/Ajeng Dinar Ulfiana/F\nJAKARTA (Reuters) -Indonesia's vote watchdog ruled on Thursday the president's son - the leading candidate's running mate in coming elections - had broken rules during his campaign, a breach that one expert said could leave him facing a reprimand but not disqualification. Gibran Rakabuming Raka, who is seeking to become vice-president in the vote scheduled for Feb. 14, denied any wrongdoing. The watchdog, known by the abbreviation Bawaslu, said 36-year-old Gibran had violated a Jakarta gubernatorial regulation when he handed out free milk to people at a public \"car-free day\" in December. A 2016 Jakarta gubernatorial order bars \"events for the interests of political parties\" during car-free days, when vehicles are banned from major thoroughfares as part of an environmental push. The watchdog said it did not have the power to penalise him itself for breaking an order imposed by authorities in the capital. Jakarta Governor Heru Budi Hartono did not respond to a Reuters request for comment. Bawaslu made the announcement a day after calling Gibran in for hours of questioning. He later told reporters his actions had not had any links to any political party. Titi Anggraini, an analyst from the Association of Elections and Democracy, told Reuters the most Gibran could face would be a reprimand for what was considered a light violation. She said the watchdog did have the power to reprimand Gibran directly for breaching other regulations that required him to seek permission for campaigning at the car-free day. But that sanction would also fall short of a disqualification. President Joko Widodo's eldest son is running with presidential candidate Prabowo Subianto, the current defence minister. \nMost polls suggest the pair command a solid lead over rival presidential candidates Anies Baswedan and Ganjar Pranowo - though there has been an uptick in popularity for Anies, and two surveys in December by independent pollsters had him overtaking Ganjar.  Gibran's candidacy has been divisive because it was only allowed after the constitutional court ruled a minimum age requirement of 40 for candidates need not apply in all cases."
}