{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0N0OU_L.jpg",
  "title": "US signs up record 21.3 million people for 2024 Obamacare plans",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 24, 2024 12:30PM ET",
    "Updated Jan 24, 2024 12:35PM ET"
  ],
  "comments": [
    2,
    [
      [
        "Mark Jannetty",
        "2024-01-24 18:24:43",
        "I guess you can say bidenomics is working, when a record number of people need government assistance ",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Brad Albright",
        "2024-01-24 17:40:17",
        "I can't wait until Trump is re-elected so that he can kick these people to the curb and replace their care with his beautiful secret plan.",
        "https://www.investing.com/members/236251128"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/us-signs-up-record-213-million-people-for-2024-obamacare-plans-3282045",
  "paragraph": "© Reuters. A sign on an insurance store advertises Obamacare in San Ysidro, San Diego, California, U.S., October 26, 2017. REUTERS/Mike Blake/File Photo\n(Reuters) - A record 21.3 million Americans have so far enrolled for coverage under Obamacare health insurance for 2024, a 31% jump over the year earlier, and the highest since its inception, the U.S. government said on Wednesday. The Affordable Care Act (ACA), also known as Obamacare, was signed in 2010 and was former U.S. President Barack Obama's signature piece of domestic legislation which helps low and middle-income Americans who do not have access to affordable health insurance coverage through an employer. More than 5 million people who have signed up for 2024 plans are new enrollees, according to data from the Centers for Medicare & Medicaid Services, a division of the U.S. Department of Health and Human Services (HHS). The open enrollment continues in four states and Washington, D.C., through Jan. 31, the agency said. \n\"For decades, when it came to federal programs we could depend on to keep Americans covered, three were always top of mind — Medicare, Medicaid and Social Security, but now it's crystal clear that we need to add a fourth — the Affordable Care Act,\" said HHS Secretary Xavier Becerra.  The government-backed insurance provides income-based subsidies to those enrolled."
}