{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK1306O_L.jpg",
  "title": "Atmospheric river pounds California but worst yet to come",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 04, 2024 12:06PM ET",
    "Updated Feb 04, 2024 11:09PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/california-braces-for-another-powerful-storm-threatening-floods-and-mudslides-3292075",
  "paragraph": "2/2\n© Reuters. Palm trees blow in the wind and rain as the first of two back to back storms brings heavy rain to southern California in Encinitas, California, U.S., February 1, 2024. REUTERS/Mike Blake\n2/2\nBy Daniel Trotta and Maria Caspani CARLSBAD, Calif. (Reuters) -Heavy rainfall and hurricane-force winds pounded much of California on Sunday, knocking out power for 900,000 customers and threatening serious floods as forecasters expect the storm to stall over major cities for the next day or two. The storm is the second Pineapple Express weather system, or atmospheric river storm, to hit the state in the past week and arrived just as Los Angeles welcomed celebrities for the music industry's Grammy awards, where the red carpet was tented but other attendees were forced to slog through heavy rain in glitzy cocktail attire, some with only a handbag for an umbrella.  The severe conditions prompted the National Weather Service's (NWS) Bay Area office to issue a rare hurricane-force wind warning for Big Sur and nearby areas. The rain canceled the final round of the professional golf tournament at Pebble Beach in Northern California's Monterey County. Because heavy rain was forecast for Monday, the PGA Tour ended the event after only three days, naming Wyndham Clark the winner. California Governor Gavin Newsom declared a state of emergency in eight counties with a combined population of more than 20 million people, and flash flood warnings were issued for parts of Los Angeles, Santa Barbara and San Luis Obispo counties. \"This has the potential to be a historic storm, severe winds, thunderstorms, and even brief tornadoes,\" Los Angeles Mayor Karen Bass told a news conference. The San Francisco Bay Area and Los Angeles County were not only getting drenched but the storm was expected to stall or reverse course over some areas into Tuesday, creating severe risk of flooding and mudslides. \"The Monday evening commute is going to be a complete disaster to say the least. In fact, it's going to be bad enough that I would recommend everybody stay home in L.A. if we possibly can,\" Daniel Swain, a climate scientist at the University of California Los Angeles, said in a live-stream on Sunday.  The NWS recorded peak wind gusts of 80 mph (129 kph) or higher in some places.  More than 900,000 homes and businesses lacked electricity on Sunday afternoon, according to PowerOutage.us.  Near Los Angeles, the port city of Long Beach could get more rain this week than it does during an entire year, said Mayor Rex Richardson, who is expecting 5-7 inches (13-18 cm) starting Sunday through Tuesday.  California's southern and central coasts are bracing for an inch of rain an hour and totals of 3-6 inches (7-15 cm), the U.S. National Weather Service said. As much as 6-12 inches are expected in the foothills and lower-elevation mountains.  \nThe Los Angeles and Santa Barbara areas were both at high risk for excessive rainfall on Sunday and Monday, with forecasters anticipating \"near continuous rainfall\" for 48 hours.  Evacuation orders were issued for some of those counties' residents, as well as people in the San Jose region, Ventura County and two areas of Los Angeles County that previously suffered wildfires, making the denuded terrain more vulnerable to mudslides."
}