{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK1203C_L.jpg",
  "title": "Trump-focused Texas border rally blends politics and religion",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 03, 2024 06:04AM ET",
    "Updated Feb 04, 2024 05:39PM ET"
  ],
  "comments": [
    8,
    [
      [
        "Charles Manson",
        "2024-02-05 22:26:41",
        "Anping Enzar Metal Products Co., Ltd, a great company for those contemplating investing in Razor Wire. Trumps strategy to go after Bidens failures is Brilliant. Pure Genius. Lots more Border Building product companies out there. Lots of my neighbor's here in Little Rock are buying up Razor Wire. Just the site of it make MAGAPhobes feel so uneasy. Good. Not like there are any MAGAPhobes around anyway.  Love to All, Charles. ,",
        "https://www.investing.com/members/249519852"
      ],
      [
        "Ac Tektrader",
        "2024-02-04 23:31:30",
        "the deranged snake oil salespeople of the Republican Maga party and there hate speech against Biten are at it again.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ac Tektrader",
        "2024-02-04 23:21:57",
        "Donald Trump has a history of serving himself and standing for the billionaire class. And that’s contrary to everything that working-class people stand forsp truer words spoken by a true leader... trump with a reputation of screwing the working class when ever he can get away with it.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ken Roth",
        "2024-02-04 23:08:21",
        "When will the MAGA nuts understand that the reason immigrants is comming is because american farmers, construction companies, restaurants, hotels, cleaning companies and housewives hires illegal immigrants as cheap labour. If no americans would hire them there would be no need to go to USA. However our GDP would drop significantly if we actually closed the border and let no one in.",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Andre FU",
        "2024-02-04 23:34:43",
        "Why bring simple logic to this topic? You are asking too much from them, brain hurts.",
        "https://www.investing.com/members/203521488"
      ],
      [
        "Barry Nickerson",
        "2024-02-05 10:42:46",
        "I actually agree with most of what you are saying. BUT!!, where are the Americans that should be doing these jobs?  Time to dump all welfare checks and make people go back to work doing these tasks. Though,  I'm sure you'd hear much more yelling and revolting if this were to happen.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Roger Miller",
        "2024-02-04 22:41:11",
        "Wasn't Biden speaking in an actual church just last week?",
        "https://www.investing.com/members/205083859"
      ],
      [
        "Ac Tektrader",
        "2024-02-05 20:48:48",
        "Roger, the difference is Trump and his followers want to force all Americans to suffer in a religious Republic and a one party state... the Republican( maga) party..",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Saul Goodman",
        "2024-02-04 00:16:15",
        "Mainstream media mixes politics with a leftist agenda",
        "https://www.investing.com/members/249494160"
      ],
      [
        "Brad Albright",
        "2024-02-04 01:07:17",
        "IT'S A CONSPIRACY!!!",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Ac Tektrader",
        "2024-02-04 23:28:00",
        "well Saul the right wing media has been proven to sell lies and misinformation and debunked conspiracy to its viewers. it cost fox news. the mainstream tells the new as it is reported when they get it wrong the they report it. the right wing media seldom does.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ac Tektrader",
        "2024-02-03 23:17:46",
        "more brainwashed Maga cult members.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ken Roth",
        "2024-02-03 20:04:33",
        "These MAGA mo..rons dont even know its Trump that blocks a solution so that he can get votes….",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Mark Jannetty",
        "2024-02-04 12:02:43",
        "giving work visas to illegals as they cross is a solution? anything but.",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Tom Saltzman",
        "2024-02-04 12:33:58",
        "The borders been wide open for the last 3 years and now we're supposed to be grateful for a crappy border deal that won't stop immigration. Not going to happen.",
        "https://www.investing.com/members/200520915"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/trump-looms-over-texas-border-rally-targeting-illegal-immigration-3291877",
  "paragraph": "© Reuters. A participant of 'Take Back Our Border' rally against migrants crossing from Mexico, rides a motorcycle before the event starts at Cornerstone Children's Ranch in Quemado, Texas, U.S., February 2, 2024. REUTERS/Go Nakamura\nBy Ted Hesson and Maria Alejandra Cardona QUEMADO, Texas (Reuters) -Hundreds of protesters from around the U.S. flocked to a Texas border town on Saturday to vent over illegal immigration and show support for former President Donald Trump at a rally that blended border politics with religious rhetoric. At the rally in Quemado, Texas, vendors sold shirts, flags and hats promoting the Republican former president while conservative speakers touted conservative Christian values and criticized the border policies of President Joe Biden, a Democrat.  \"Folks, this is serious stuff, this is evil stuff\" U.S. Representative Keith Self said of Biden's policies. \"We are in a spiritual battle for the survival of our Republic.\" Immigration has become a potent political issue in the run-up to Nov. 5 elections that will likely pit Biden versus Trump, reprising the 2020 contest.  Trump has motivated his voting base with calls for more restrictive border practices. His critics worry such policies and events such as a convoy that preceded the rally could stoke tensions. Eagle Pass, 20 miles (32 km) south of Saturday's rally, has achieved national prominence in recent months. Texas Governor Greg Abbott, a Republican, has clashed with Biden over the state's aggressive tactics to deter crossers, including troops, concertina wire and a floating buoy barrier in the Rio Grande. Abbott and 14 other Republican governors plan to hold a press conference in the city on Sunday to defend the approach. Reuters witnesses saw small groups of migrants on Friday and Saturday who crossed the Rio Grande near Eagle Pass trapped by concertina wire on the riverbank as they waited for help. While Saturday's rally proceeded peacefully, the FBI identified a threat to a migrant processing center in Eagle Pass, leading U.S. border officials to evacuate it in recent days, two sources familiar with the matter said, requesting anonymity to discuss internal information. \"Any threat like that is a significant concern,\" a U.S. Customs and Border Protection (CBP) official told Reuters. The agency was able to relocate the migrants with relative ease since border apprehensions have fallen sharply in the area over the past month, the official said. The FBI declined to comment, referring the matter to CBP. Biden on Saturday afternoon discussed border challenges with Mexican President Andres Manuel Lopez Obrador and committed to continuing \"joint efforts to counter transnational criminal organizations involved in the illicit trafficking of drugs, guns, and people,\" the White House said in a statement. The \"Take Our Border Back\" protest began with a vehicle convoy from Virginia that rolled into Quemado on Friday night.  Dennis Barnd, 61, drove with his wife from Ohio to Texas to link up with a convoy in part because of its conservative Christian message. \"I live in a remote part of the country where there's not a lot of activism and whatnot, and it's moving to see so many people come together with a good common cause,\" he said. Adam Chavin, 39, donning a shirt bearing Trump's likeness, flew in from Nashville, Tennessee. \"I'm actually trying to do stuff,\" he said. \"I'm not just someone talking, someone posting comments on the internet.\" Anna Gabriela Derbez, a 56-year-old Eagle Pass resident at the border event, said immigration was one of several issues - including COVID-19 vaccines, artificial intelligence and LGBTQ education - that were part of \"a fight of good versus evil.\" \"We're for immigration,\" said Derbez, whose grandparents came to the U.S. from Mexico. \"Legal immigration, you know, good immigration, people that are coming and want to work and better a place.\" Smaller events were planned in Yuma, Arizona, and San Ysidro, California. On Thursday, conservative personalities Sarah Palin, a former Republican vice presidential candidate, and Ted Nugent, a rock musician and outspoken gun rights proponent, joined the protest as the convoy overnighted further north in Dripping Springs, Texas. Nugent called Biden a \"devil-scum snake\" in a caustic speech before performing the U.S. national anthem on guitar. Minnesota-based pastor Doug Pagitt tried to enter the rally site on Friday after stopping in the area as part of a tour to combat what he calls \"Christian nationalism,\" but was denied entry as participants told him \"you're not wanted.\" \"We want to engage,\" Pagitt said afterward. The number of migrants arrested trying to cross the U.S.-Mexico border has climbed to record highs since Biden took office in 2021. While migrant arrests spiked in December, they have dropped steeply in the past month. \nInternal CBP statistics reviewed by Reuters showed 216 migrant arrests on Tuesday across the entire Del Rio Sector, which covers a 245-mile (400-km) stretch of the Rio Grande and encompasses Eagle Pass. In mid-December, that figure at times topped 4,000 per day, internal figures show. U.S. officials have cautioned the slowdown could be seasonal although the Mexican government also increased enforcement."
}