{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK040KX_L.jpg",
  "title": "Exclusive-US intelligence confirms Islamic State's Afghanistan branch behind Iran blasts -sources",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 05, 2024 01:42PM ET",
    "Updated Jan 05, 2024 03:01PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/exclusiveus-intelligence-confirms-islamic-states-afghanistan-branch-behind-iran-blasts-sources-3268397",
  "paragraph": "© Reuters. People attend the funeral ceremony of the casualties of the Islamic State attack in Kerman, Iran, January 5, 2024. Iran's Presidency/WANA (West Asia News Agency)/Handout via REUTERS/File Photo\nBy Jonathan Landay and Steve Holland WASHINGTON (Reuters) -Communications intercepts collected by the United States confirmed that Islamic State’s (ISIS) Afghanistan-based branch carried out twin bombings in Iran that killed nearly 100 people, two sources familiar with the intelligence told Reuters on Friday. \"The intelligence is clear-cut and indisputable,\" one source said.  That source and a second, both of whom requested anonymity to discuss the sensitive issue, said the intelligence comprised communications intercepts, without providing further details. The collection of the intercepts has not been previously reported. Wednesday's bombings, the deadliest of their kind in Iran since the 1979 Islamic Revolution, added to regional tensions over the Israel-Hamas war in Gaza and attacks by Yemen's Tehran-aligned Houthi group on commercial shipping in the Red Sea. ISIS on Thursday claimed responsibility for the bombings, saying two operatives wearing explosive suicide belts staged the attack during a memorial service for Qassem Soleimani, a senior military commander assassinated in Iraq in a 2020 U.S. drone strike. The Sunni Muslim militant group, however, did not specify that its Afghanistan-based affiliate, known as ISIS-Khorasan (ISIS-K), was responsible for the bombings in the southeastern Iranian city of Kerman. “The U.S. has pretty clear intel” that ISIS-K conducted the attack, the first source said. The Central Intelligence Agency declined to comment. ISIS harbors a virulent hatred for Shi'ites -- Iran's dominant sect and targets of its affiliate's attacks in Afghanistan -- who it views as apostates.  ISIS claimed responsibility for a 2022 attack on a Shi'ite shrine in Iran that killed 15 people and 2017 bombings that hit the parliament and the tomb of the Islamic Republic's founder, Ayatollah Ruhollah Khomeini. \nIran on Friday said security forces had arrested 11 people suspected of involvement in Wednesday's attack and had seized explosive devices and vests. While Taliban crackdowns have weakened ISIS-K and prompted some members to leave Afghanistan for neighboring countries, the affiliate has continued focusing on plotting foreign operations, U.S. officials say."
}