{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0I07S_L.jpg",
  "title": "Russian parliament to challenge French assembly over 'French mercenaries' in Ukraine",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 19, 2024 03:11AM ET",
    "Updated Jan 19, 2024 07:16AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Ken Roth",
        "2024-01-21 11:29:01",
        "So what? Any foreign fighter willing to help the ukrainians are all heroes.",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/russian-parliament-to-ask-french-counterpart-if-it-knew-of-french-mercenaries-in-ukraine--official-3277946",
  "paragraph": "© Reuters. Russia's Prime Minister Mikhail Mishustin delivers a speech during a session of the State Duma, the lower house of parliament, in Moscow, Russia April 7, 2022. Sputnik/Alexander Astafyev/Pool via REUTERs/file photo\nMOSCOW (Reuters) -The lower house of the Russian parliament, the State Duma, plans to formally ask France's National Assembly if it is aware that French mercenaries have been fighting on Ukraine's side, the Duma's chairman said on Friday. Vyacheslav Volodin, an ally of President Vladimir Putin, made the statement after the Russian Defence Ministry said on Wednesday that its forces had killed more than 60 foreign mercenaries, mostly French citizens, in a strike on a building in Kharkiv. It did not provide evidence to back the assertion.  France rejected the allegations, saying it was helping Ukraine defend its sovereignty, independence and territorial integrity but had no mercenaries in Ukraine \"unlike certain others\". \"In France, the mercenary trade is forbidden by law,\" Volodin wrote on the Telegram messaging app. \"It is important for us to know whether they (French lawmakers) are aware that someone, violating the law, is sending fighters to fight in Ukraine.\" French officials said the allegations were part of a Russian campaign to discredit France. \"It's a disinformation plot conducted by Russia,\" a senior aide to Thomas Gassilloud, head of the National Assembly's defence committee, told Reuters. A French diplomatic source told reporters: \"It's Russian propaganda, unhealthy and unfounded, that we have denied. More than anything it gives you a taste of what the Russians are preparing.\"  \"You will see many more insidious acts over the months to come,\" the diplomatic source added. \nThe Duma would consider its address to the French parliament at the next meeting of the lower chamber of parliament which is scheduled for Jan. 23, its chairman said. Russia, which sent troops into Ukraine on Feb. 24, 2022, announced on Thursday it had summoned the French ambassador to the Foreign Ministry over the mercenary allegations."
}