{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK140ED_L.jpg",
  "title": "Analysis-Emerging market debt sales hit January record despite elusive flows",
  "category": "Economy",
  "publisher": "Reuters",
  "date": [
    "Published Feb 05, 2024 05:59AM ET",
    "Updated Feb 05, 2024 12:12PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/economy/analysisemerging-market-debt-sales-hit-january-record-despite-elusive-flows-3292476",
  "paragraph": "By Karin Strohecker and Jorgelina do Rosario LONDON (Reuters) -Sovereign debt sales from developing nations scaled an all-time record for January at $47 billion led by major and less risky emerging markets but a lack of investor flows into dedicated funds could curtail a nascent recovery for riskier issuers. The start of the year - generally a busy time for debt sales of all sorts - has seen Saudi Arabia, Mexico, Hungary, Romania and a raft of others deliver some big ticket bond issuance.  At the same time, flows into dedicated emerging market debt funds remained in the doldrums.  Year-to-date, investors pulled about $1.6 billion out of dedicated emerging market hard-currency funds, according to Morgan Stanley data. That follows outflows of around $80 billion in 2022 and around half of that again last year.  \"Usually at this stage you would have seen money starting to come in\", said Paul Greer, portfolio manager of emerging markets debt and foreign exchange at Fidelity International.  \"I think there's still a bit of an allocation towards equity markets. That money will eventually come back into fixed income and emerging markets would benefit. It's just taking longer than I thought,\" Greer added.  While the early days of the year were dominated by higher-rated issuers, January also saw a reopening of some corners of the fixed income primary markets that had recently been dormant: Ivory Coast became the first Sub-Saharan nation to tap international capital markets in almost two years. Benin is in the process of following suit.  But this might turn out to be an exception.  Thys Louw, portfolio manager for emerging markets hard currency debt strategy at Ninety One, said that the main concern of the divergence between issuance and flows into these dedicated funds means that high yield issuers won't be tapping the markets anytime soon.  \"There's some cash on the sidelines ... but I am still cautious. You will need to see inflows to say 'Kenya, you can go, Nigeria you can go',\" Louw added. DEPLETED CASH  According to JPMorgan calculations, adding coupons to maturities and comparing to gross issuance should have left dedicated emerging markets hard currency funds with a $78 billion cash pile to invest over the past two years. But taking into account outflows, that would have shrunk to just $8 billion, the bank said in a recent note to clients. Demand for recent issuance, especially from higher-rated governments, would have also come from crossover funds, JPMorgan added. Crossover investors do not necessarily invest in emerging markets but are permitted by their mandates to do so. Lower-rated issuers hold less appeal for those asset managers. \"If you split the emerging markets into two halves, the higher quality emerging market debt is traded very similar to Europe,\" said Dan Farrell, head of International Short Duration,  Northern Trust  (NASDAQ:NTRS) Asset Management. \"But then if you look at the lower end of the emerging markets, they're in a very different fiscal space and it's not actually an attractive option for investors.\" Analysts at Morgan Stanley estimate almost $165 billion of EM sovereign debt will be issued this year, a roughly 20% increase on 2023. The bank predicts that high-yield issuers Oman, Serbia, Turkey, Bahrain, Uzbekistan and Colombia could all be tapping markets this year.  \nMuch will also hinge on when and how fast the U.S. Federal Reserve, the European Central Bank and other G10 central banks will start cutting interest rates.  \"We have not yet seen a return of stability in rates and macro environment due to still-prevailing uncertainty on the timing of central banks' policy rates cut for the rest of the year,\" said Alexis Taffin de Tilques, head of CEEMEA DCM at BNP Paribas (OTC:BNPQY). \"Markets will focus on the higher-grade issuers.\""
}