{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0J06M_L.jpg",
  "title": "Congolese President Tshisekedi sworn in for second term after disputed vote",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 20, 2024 01:39PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/congolese-president-tshisekedi-sworn-in-for-second-term-after-disputed-vote-3278886",
  "paragraph": "3/3\n© Reuters. Democratic Republic of Congo President Felix Tshisekedi arrives to be sworn in for a second term as a president during the inauguration ceremony at Martyrs Stadium in Kinshasa, Democratic Republic of Congo January 20, 2024. REUTERS/Justin Makangara\n2/3\nBy Ange Kasongo KINSHASA (Reuters) -Democratic Republic of Congo President Felix Tshisekedi was sworn in for a second five-year term on Saturday after a landslide victory his opponents have refused to recognise due to widespread irregularities over the December general election. Authorities have acknowledged there were issues but dismissed allegations the vote was stolen. The fractious standoff echoes previous electoral disputes that fuelled unrest in Africa's second-largest country, with protests breaking out in two eastern cities. Tshisekedi took the oath of office in a stadium in the capital Kinshasa packed with flag-waving supporters, government officials, African heads of state and foreign envoys including from the United States, China, and France. In a speech, he acknowledged the nation's hopes of better living conditions and economic opportunities. Around 62% of Congo's 100 million people live on less than a dollar a day.  \"I am aware of your expectations,\" he said. \"A goal of this new five-year term is to create more jobs.\" He also promised \"a profound restructuring of our security and defence apparatus\" and further diplomatic efforts to address Congo's long-running security crisis in eastern provinces. Choirs signing the Hallelujah chorus from Handel's Messiah, marching military bands, and a 21-cannon salute marked his inauguration. \"ELECTORAL CATASTROPHE\" With armed military police deployed throughout the capital, there was no immediate sign opposition supporters were heeding a call from two of Tshisekedi's main opponents to protest his re-election across the country. In the eastern city of Beni, protesters set up makeshift barricades in the early hours and burned tyres - a demonstration that police dispersed without major incident. Similar small-scale protests broke out in the eastern city of Goma and other urban centres, but were contained by the mass deployment of security forces, Reuters reporters said. Congo's largest election-monitoring group CENCO this week called the presidential and legislative polls an \"electoral catastrophe\", citing its own observations of fraud, mishandling of election materials, parallel voting, and other issues. The CENI election commission has said such infractions were limited in scale and did not affect the outcome of the elections, which they say were ultimately free and fair. Many African and Western countries, wary that the dispute could further destabilise a globally important mineral exporter, have recognised Tshisekedi's victory since Congo's highest court dismissed official challenges. \n\"We deplore the indifference and astonishing complacency of international diplomacy,\" said opposition presidential candidate and Nobel Peace Prize-winning gynaecologist Denis Mukwege in a statement on Saturday. He and Tshisekedi's main challengers, including Moise Katumbi and Martin Fayulu, have refused to contest the results in court over the alleged lack of independence of state institutions. The government has rejected their demand for a full re-run of the vote."
}