{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0F01B_L.jpg",
  "title": "US military to deploy helicopters to Japan's earthquake-hit peninsula",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 15, 2024 08:03PM ET",
    "Updated Jan 16, 2024 01:27AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-military-in-japan-to-deploy-to-earthquakehit-area--sources-3274530",
  "paragraph": "© Reuters. FILE PHOTO: Police officers search for victims in a snow covered residential area which was devastated by a tsunami following an earthquake, in Suzu, Ishikawa Prefecture, Japan, January 9, 2024. Mandatory credit Kyodo via REUTERS/File Photo\nTOKYO (Reuters) -The United States will deploy two military helicopters in Japan to the earthquake-hit Noto peninsula on the country's west coast to aid relief efforts in communities cut off by the disaster, the U.S. Ambassador to Japan said on Tuesday. \"Two Blackhawk helicopters will supplement Japan's fleet assisting to move supplies and personnel,\" U.S. Ambassador to Japan Rahm Emanuel said on social media platform X, formerly known as Twitter. The U.S. aircraft will begin relief operations on Wednesday, Japan's Minister of Defense Minoru Kihara said at a press briefing. The powerful Jan. 1 quake destroyed roads linking the isolated peninsula to the rest of Japan and with evacuations by sea difficult, some vulnerable people can only be moved by air, a source with knowledge of the plan said earlier. The scale of the U.S. assistance could expand over the coming days, the source added, asking to remain anonymous because they are not authorised to speak to the media.  More than 220 people are confirmed to have died in the quake that destroyed thousands of homes, vital infrastructure and knocked out power in the area. Relief efforts have been hampered by strong aftershocks that could trigger fresh landslides and further damage weakened structures.  Authorities have been warning survivors, many of whom are living in evacuation centres, to guard against freezing temperatures with heavy snow hitting the area in recent days.  \nThe quake is Japan's deadliest since 2016 when quakes in the southwestern region of Kumamoto claimed 276 lives.  U.S. forces, which provided aid for that disaster and in 2011 helped survivors of the quake that killed nearly 20,000 people and triggered the Fukushima nuclear disaster, have been stationed in Japan since World War II, marking the country's biggest military presence abroad."
}