{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK070F4_L.jpg",
  "title": "Pakistan court ruling allows ex-PM Sharif to run for fourth time",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 08, 2024 08:31AM ET",
    "Updated Jan 08, 2024 09:58AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/pakistan-court-lifts-life-election-ban-on-expm-sharif-3269553",
  "paragraph": "© Reuters. FILE PHOTO: A view of the Supreme Court of Pakistan building during sunset hours in Islamabad, Pakistan October 3, 2023. REUTERS/Akhtar Soomro/File Photo\nISLAMABAD (Reuters) -Pakistan's Supreme Court on Monday scrapped lifetime bans on contesting elections for people with criminal convictions, paving the way for Nawaz Sharif to run for prime minister for a fourth time. Sharif's party, Pakistan Muslim League-Nawaz (PML-N), is considered a front runner to win elections scheduled for Feb. 8, with Sharif's main rival, former prime minister Imran Khan, in jail and barred from contesting for five years. In his ruling, Chief Justice Qazi Faez Isa, who headed a seven-member panel of judges, said the life bans \"abridge the fundamental right of citizens to contest elections\". The court's decision was six to one in favour of overruling a previous 2018 decision that imposed life bans on politicians convicted under certain provisions of the constitution. Sharif, 74, was found guilty in 2017 of dishonest practices, which qualified for a ban under the 2018 ruling. Last year, the courts overturned the two convictions.  While Sharif was not an applicant in the latest Supreme Court case, which was filed by other politicians, the ruling makes him eligible to contest the polls as more than five years have elapsed since 2017. Khan, 71, whose party won the last elections in 2018, will not benefit from the ruling as it abolishes only life bans, which means the cricketer-turned-politician remains disqualified until 2028. \"Alhamdulillah (praise be to God), today the dark chapter of judicial injustice of lifelong disqualification to make Nawaz Sharif a target of political revenge has finally ended,\" Marriyum Aurangzeb, a PML-N leader, said in a post on social media platform X. One of Khan's lawyers, Intazar Hussain Panjutha, described the scrapping of the ban as the \"death of law and the constitution\". Sharif was removed from the premiership in 2017 and then convicted on the corruption charges. He spent time in jail before leaving for London in 2019, where he remained in self-imposed exile until October 2023. In previous stints as prime minister, Sharif has favoured policies focused on rapid economic growth, including the inauguration of the mutli-billion-dollar China-Pakistan Economic Corridor development.  \nHis push for closer ties with neighbour and arch rival India is cited as a reason behind his clashes with the country's powerful military, which sees India as a threat. Nuclear powers Pakistan and India have fought three wars and currently have limited diplomatic ties. Sharif blames the military for being behind his removal from office in 2017, which it denies. A standoff between Khan and the military afforded Sharif the political space to mount a bid to return to Pakistan's top office."
}