{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "US man charged for attempt to aid al Shabaab after Oct 7 attack on Israel",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Dec 29, 2023 08:17PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-man-charged-for-attempt-to-aid-al-shabaab-after-oct-7-attack-on-israel-3264865",
  "paragraph": "By Kanishka Singh WASHINGTON (Reuters) - A New Jersey man arrested in Kenya has been charged for trying to aid militant Islamist group al Shabaab, the U.S. Justice Department said, alleging he was motivated by Hamas' Oct. 7 attack on Israel to wage violence. The arrest comes amid heightened incidents of antisemitism and Islamophobia in the wake of the Israel-Gaza war, which have raised terror threat levels in the United States. Karrem Nasr, a U.S. citizen who moved from New Jersey to Egypt around July, was taken into custody in Nairobi on Dec. 14 and brought to the United States on Thursday, the Justice Department said in a statement on Friday. The 23-year-old has been charged with \"attempting to provide material support to a designated foreign terrorist organization,\" which carries a maximum sentence of 20 years in prison, according to prosecutors. The United States designates al Shabaab as a \"foreign terrorist organization.\" \"As alleged, Karrem Nasr, motivated by the heinous terrorist attack perpetrated by Hamas on October 7, devoted himself to waging violent jihad against America and its allies,\" U.S. Attorney Damian Williams said. Nasr traveled from Egypt to Kenya \"bent on joining and training with al Shabaab,\" prosecutors said. In communications exchanged with an FBI confidential source and postings online, Nasr stated that he had been thinking about \"engaging in jihad for a long time, and he was particularly motivated to become a jihadi by the October 7, 2023 Hamas terrorist attack in Israel,\" prosecutors added. Nasr took steps to join and receive training from al Shabaab, planning to meet members of the organization in Kenya for further travel to Somalia to join the group, the Justice Department said. He was taken into custody by Kenyan authorities. It was not clear whether Nasr had legal representation. The Justice Department has said it was monitoring rising threats against Jews and Muslims in the United States due to soaring levels of antisemitism and Islamophobia linked to the war in the Middle East. In early December, FBI Director Christopher Wray said the threat level was so elevated that he saw \"blinking lights everywhere.\""
}