{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0300W_L.jpg",
  "title": "US education official resigns over Biden's Israel-Gaza policy",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 03, 2024 07:54PM ET",
    "Updated Jan 03, 2024 09:21PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-education-official-resigns-over-bidens-israelgaza-policy-3266758",
  "paragraph": "© Reuters. FILE PHOTO: U.S. President Joe Biden departs a Biden Victory Fund campaign fundraising event in the Kalorama neighborhood, in Washington, U.S., October 27, 2023. REUTERS/Anna Rose Layden/File Photo\nBy Kanishka Singh WASHINGTON (Reuters) - A senior official in the U.S. Education Department stepped down on Wednesday, citing President Joe Biden's handling of the conflict in Gaza, the latest sign of dissent in the administration as deaths continue to grow in the war.  Also on Wednesday, 17 Biden re-election campaign staffers issued a warning in an anonymous letter that Biden could lose voters over the issue. Tariq Habash, special assistant in the Education Department's Office of Planning, Evaluation and Policy Development, in a letter to Education Secretary Miguel Cardona, said: \"I cannot stay silent as this administration turns a blind eye to the atrocities committed against innocent Palestinian lives, in what leading human rights experts have called a genocidal campaign by the Israeli government.\" Habash, a Palestinian-American and an expert on student debt, was appointed early in Biden's presidency as part of a build-out of the Education Department's student loan expertise.  The 17 anonymous Biden re-election campaign staffers, in their letter, published on Medium, urged Biden to call for a ceasefire in Gaza. \"Biden for President staff have seen volunteers quit in droves, and people who have voted blue for decades feel uncertain about doing so for the first time ever, because of this conflict,\" the staffers wrote in the letter. Biden's campaign did not immediately respond to a request for comment.  State Department spokesman Matthew Miller earlier on Wednesday said that the U.S. has not observed acts in Gaza that constitute genocide. His remarks were in response to proceedings launched by South Africa at the International Court of Justice over Israel's military operations in Gaza. Israel also has denied claims of genocide in Gaza. Josh Paul, a former State Department official, resigned from the Biden administration in October in protest over what he called the administration's \"blind support\" for Israel. In November, more than 1,000 officials in the U.S. Agency for International Development (USAID), part of the State Department, signed an open letter urging the Biden administration to call for an immediate ceasefire.  After at least three cables criticizing the administration's policy were filed with the State Department's internal \"dissent channel,\" Secretary of State Antony Blinken acknowledged disagreements in a November letter.  In December, some staff in the Biden administration held a vigil near the White House to demand a ceasefire in Gaza.  Palestinian Islamist group Hamas' Oct. 7 attack on Israel killed 1,200 people, according to Israeli tallies. Some 240 hostages were also taken back to Gaza. The total recorded Palestinian death toll from Israel's retaliatory offensive had reached 22,313 by Wednesday, almost 1% of Gaza's 2.3 million population, the Gaza health ministry said. \nIsraeli bombardments have flattened much of the densely populated enclave, leaving most Gazans homeless, with food shortages threatening famine. The United States has publicly slammed the rhetoric of some Israeli ministers and pushed Israel to curb civilian deaths in Gaza. Critics argue that Washington is not using its leverage as a major supplier of arms and aid to influence Israeli policy."
}