{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK030KM_L.jpg",
  "title": "Explainer-Ukraine considers changing mobilisation rules as war with Russia drags on",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 04, 2024 10:26AM ET",
    "Updated Jan 05, 2024 05:10AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/explainerukraine-considers-changing-mobilisation-rules-as-war-with-russia-drags-on-3267496",
  "paragraph": "2/2\n© Reuters. FILE PHOTO: Servicemen of a combat UAVs company of the Ukrainian 92nd Ivan Sirko Separate Assault Brigade warm up inside a dugout as they fly with a Vampire combat drone over positions of Russian troops near the frontline town of Bakhmut, amid Russia's at\n2/2\nBy Yuliia Dysa (Reuters) - A Ukrainian parliamentary committee met on Thursday to review proposed changes to the rules on army mobilisation that would enable Kyiv to call up more people and tighten sanctions against draft evasion as the war with Russia drags on. The proposals have faced criticism from the public and some politicians. Parliament's human rights commissioner says some of the proposals are unconstitutional. Below are details of the proposed changes and the approval process, during which changes could be made to the proposals. PARLIAMENTARY PROCESS Once the parliamentary committee has approved a version of the legislation, it will be debated and can change over two or three readings in parliament, whose approval is required. It then requires the signature of President Volodymyr Zelenskiy. Lawmakers and a senior presidential official have said the initial version of the bill, which was published online in December, will be modified before it is discussed by parliament in a first reading, perhaps as early as next week. The changes set out in the draft legislation were submitted by the government to parliament in late December following discussion with the military.  WHY HAVE THE PROPOSALS BEEN MADE? Ukraine began mobilising civilians into the army after declaring martial law in February, 2022 when Russia launched its full-scale invasion. An influx of volunteer fighters helped at first, but their number has dwindled. Nine thousand criminal cases have been opened into cases of draft evasion, according to the interior minister.  Zelenskiy said last month the military had proposed mobilising 450,000-500,000 more people. Army Chief Valeriy Zaluzhnyi has said the figure takes into account military plans and projections of possible losses. Military analysts say the half a million figure would be for the whole year. PUNISHMENTS FOR DRAFT EVASION The bill sets out a series of sanctions for those who flout the law on mobilisation, which governs how civilians are conscripted into the army during martial law.  People who don't abide by the law on mobilisation would be placed on a registry and face restrictions on conducting operations involving property, be banned from travelling abroad and denied loans. They could also be suspended from state benefits and services, and restricted from using a car and obtaining a driving licence.  Another draft bill submitted simultaneously proposes substantially increasing fines for failing to register at draft offices, flouting mobilisation rules and legislation on military duty. It also proposes introducing three- to five-year jail terms for those who refuse a military medical examination.  MOBILISATION AGE  The draft bill proposes lowering the age people can be mobilised for combat duty to 25 from 27. Such a move would allow Ukraine to call up more people to replenish its reserves. The figures have not been made public for security reasons.  Parliament approved this change last spring, but it did not come into force because Zelenskiy did not sign it. He has said he will support such a change if arguments are presented in its favour.  ONLINE CALL-UPS  Draft offices would be able to issue online call-ups to people by email or via some other electronic platform. Such a step would likely make it harder to evade draft officers who currently issue call-up papers to civilians in the street or send them to people's known home address.  DEMOBILISATION  The bill proposes discharging soldiers who have served continuously for 36 months during martial law. This is a highly sensitive issue for families of soldiers who have been fighting Russia for almost two years and are exhausted. There is currently no time limit on wartime military service.  Zaluzhnyi has said such a step will be possible only if there is no escalation on the battlefield and Ukraine has enough reserves ready by 2025 to replace troops.  MILITARY REGISTRATION FOR THOSE ABROAD  Martial law prohibits men of military age from leaving the country and those who are already abroad cannot currently be called up.  \nThe bill proposes tracking people who are abroad and requiring them to have up-to-date military registration, something that is currently obtained at draft offices.  The bill says that consular services such as the issue of passports would require citizens to present their military registration documents."
}