{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0Q072_L.jpg",
  "title": "More pensions, fewer weapons: New party pitches to save Germany from AfD",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 27, 2024 10:10AM ET",
    "Updated Jan 27, 2024 02:07PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Ac Tektrader",
        "2024-01-27 16:17:05",
        "Germans demonstrating the inability to learn from their own history.",
        "https://www.investing.com/members/224473057"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/more-pensions-fewer-weapons-new-party-pitches-to-save-germany-from-afd-3284969",
  "paragraph": "5/5\n© Reuters. Delegates vote during the founding convention of Germany’s new party Alliance Sarah Wagenknecht BSW in Berlin, Germany, January 27, 2024. REUTERS/Liesa Johannssen\n2/5\nBy Thomas Escritt BERLIN (Reuters) - Promising to rescue Germany from the far right, a new leftist party offered up a populist recipe of high pensions, low defence spending and an end to expensive climate policies in its first outing ahead of regional and European elections this year. The Sahra Wagenknecht Alliance (BSW), named after its leader, a popular former leader of the Left party, held its first national congress on Saturday, with delegates turning their fire on the entire political spectrum from left to right. With the far-right Alternative for Germany (AfD) gaining around 20% support in national opinion polls as it lures some voters away from the traditional parties that dominate government and opposition, many analysts speculate the BSW, on 8% in polls in one eastern state, could burst the AfD bubble. The AfD remains behind the opposition conservatives on 31% but is still well ahead of all the three parties in Chancellor Olaf Scholz's centre-left coalition, who together were polling 32%.  \"We fear for democracy, we fear that the anger and disagreement in the country will be seized upon by the AfD,\" Wagenknecht told Reuters on Saturday. \"We don't think people think radical right. They just want a voice that they don't have with other parties.\" In some policy areas, little distinguishes it from the AfD: it, too, wants to end weapons deliveries to Ukraine, arguing that they prolong a conflict about whose origins in a Russian invasion nothing was said on stage at the congress. In a former cinema on East Berlin's Karl-Marx-Allee, she and party colleagues also railed against Chancellor Olaf Scholz's centre-left coalition for being more preoccupied with identity politics than people's material concerns. The party has a strong base in the former East Germany, where its message of high social spending and a baseline level of financial security despite hard economic times resonates among many.  Wagenknecht, born in eastern Germany to an Iranian father and German mother, cast government and opposition as the agents of the comfortable and wealthy, portraying Robert Habeck and Annalena Baerbock - the Green economy and foreign ministers - as ignorant, urban scolds pursuing harebrained, expensive schemes. \"Maybe Robert Habeck thinks everyone lives in modern houses or well-insulated lofts, so he thinks it a great idea to make everyone install a heat pump,\" said Wagenknecht. The party's first electoral test will come later this year in three state elections in the East, where the AfD is on as much as 31% in opinion polls, making it almost impossible to circumvent in any coalition talks. \nWagenknecht has ruled out working with the AfD, yet while a strong BSW performance could solve one governance conundrum, her foreign policy positions may turn out to be no more palatable to other parties.  (This story has been refiled to correct grammar in paragraph 8)"
}