{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0B0BT_L.jpg",
  "title": "Mass killer Breivik still dangerous and should stay isolated in Norway jail, court hears",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 12, 2024 05:21AM ET",
    "Updated Jan 12, 2024 11:11AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Ken Roth",
        "2024-01-12 20:20:18",
        "Good verdict he should never see the light of day or talk to anyone for the rest of his life.",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/mass-killer-breivik-still-dangerous-and-should-stay-isolated-in-norway-jail-court-hears-3273281",
  "paragraph": "© Reuters. FILE PHOTO: Norwegian mass killer Anders Behring Breivik arrives to hear the verdict in his trial at a courtroom in Oslo August 24, 2012. REUTERS/Stoyan Nenov/File Photo\nBy Gwladys Fouche OSLO (Reuters) -Anders Behring Breivik, the far-right fanatic who killed 77 people in twin attacks in Norway in 2011, remains \"very dangerous\" and should be kept in isolation in prison, a court heard on Friday. The 44-year-old is suing the Norwegian state in a bid to end his years of isolation in prison and lift restrictions on his correspondence with the outside world. The five-day hearing ends on Friday.  He has been held in isolation ever since he killed eight people with a car bomb in Oslo and gunned down 69 others, most of them teenagers, on Utoeya island.  Andreas Hjetland, representing the Justice Ministry, said in his closing argument on Friday \"there is no ground for the allegation that Breivik's human rights are being violated\". \"Breivik remains very dangerous,\" he told the court. \"There is still a great danger he can commit violence or that he can inspire others (to commit violence).\" As in previous days, Breivik shook his head in disagreement at several of the points Hjetland made. Breivik had the possibility to make short remarks at the close of the hearing. He chose not to. Lisbeth Roeyneland, whose 18-year-old daughter, Synne, was murdered by Breivik at Utoeya and who followed the hearing this week, said she expected Breivik to lose his case.  \"He has shown no regret,\" she told Reuters, speaking at an Oslo courtroom where the case was broadcast. For security reasons, the hearing took place in Breivik's prison. \"He whispered that he was sorry for what he did without feelings nor empathy. But when he talks about himself, the body language is in place and he can press out a few crocodile tears.\" She said she wished the case had not happened, but at the same time, Breivik had that right under Norwegian law and that had to be respected. \"He will use every option he has,\" she said.  'DOING VERY WELL'  On Tuesday, Breivik said in a tearful testimony that isolation was a \"nightmare\" and that he considered suicide every day. His lawyer said on Monday his client suffered from \"deep depression\".  On Thursday, Breivik's psychiatrist said she did not think Breivik was severely depressed.  \"His conditions weigh on him and he feels lonely. It is burdensome but I don't think he is severely depressed,\" Janne Gudim Hermansen told the court, according to daily Aftenposten. Judge Birgitte Kolrud asked the psychiatrist what she thought of Breivik's tearful testimony. She said she had never seen Breivik cry. \"I think it is his way to show his despair. So I am a little uncertain about how credible it is,\" she said, according to Aftenposten. A psychologist who co-wrote a new risk assessment about Breivik testified on Thursday he was neither depressed nor suicidal.  \"Our very clear impression is that he is doing very well\" and wants to live a long time, Inni Rein told the court, according to news agency NTB.  Breivik had said he was suicidal on \"a couple of occasions\" she had met him, she said, but she had concluded it was not an expression of a \"real death wish\" but rather attempts to obtain something from prison authorities, she said, according to NTB.  Breivik's lawyers argue Norway is breaching the European Convention on Human Rights, including sections saying no one should be subject to \"torture or to inhuman or degrading treatment or punishment\".  \nHis isolation for more than a decade has left him in a \"locked world\" with only guards and other prison professionals whose duty is to maintain their distance, his lawyer Oeystein Storrvik told the court on Monday. Judge Birgitte Kolrud said it would take a \"few weeks\" to issue her ruling."
}