{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "Mexican authorities free 31 kidnapped migrants",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 03, 2024 11:03AM ET",
    "Updated Jan 03, 2024 06:17PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/mexico-tracing-phone-signals-in-search-for-31-kidnapped-migrants-3266556",
  "paragraph": "MEXICO CITY (Reuters) -Mexican authorities have rescued 31 migrants, including women and children, who were kidnapped over the weekend in the northern Mexican state of Tamaulipas, officials announced on Wednesday. Presidential spokesperson Jesus Ramirez confirmed the rescue on social media platform X, formerly Twitter. \"They are already in the hands of the authorities and are undergoing the appropriate medical examinations,\" he added, along with a photo that showed men, women and children, including one holding a stuffed animal. The migrants were \"safe and sound,\" Mexican Interior Minister Luisa Alcalde wrote on X, citing information from the state's governor. Gunmen snatched the migrants on Saturday from a bus on a highway in the municipality of Reynosa, close to Mexico's border with the United States. The bus was destined for Matamoros, across from Brownsville, Texas. Mexican Security Minister Rosa Icela Rodriguez said earlier on Wednesday that the kidnapped migrants were from Venezuela, Ecuador, Colombia, Honduras and Mexico. Honduran Foreign Minister Enrique Reina later posted on X that there were six Hondurans among the group, including three teenage girls, whose statements were being taken by Mexican authorities. Colombia's consulate in Mexico City said four Colombian nationals were also part of the group. Asylum seekers and human rights activists have for months been warning of an escalating kidnapping crisis in the Tamaulipas border region, especially in Reynosa.  The area is the site of an ongoing conflict between two factions of the powerful Gulf Cartel, known as the Metros and the Scorpions, according to a former security official who spoke on the condition of anonymity. He said migrant smuggling and trafficking has become the most lucrative illicit industry in the region. Earlier in the day, Rodriguez said the kidnapping was \"unusual\" due to the large number of victims, although it's not uncommon for migrants to be pulled off buses and kidnapped in Mexico. Usually, the migrants are forced to beg their relatives to pay ransom money.  She added that authorities were tracking the cell phones of the migrants in efforts to find them. \nIn May last year, 49 migrants, including 11 minors, were released after being kidnapped in the south of Mexico while traveling by bus to the U.S. border.  A record number of migrants traveled across Central America and Mexico in 2023 aiming to reach the United States, fleeing poverty, violence, climate change and conflict."
}