{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "Polish priest arrested, charged with sex crimes after alleged orgy",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 11, 2024 09:37AM ET",
    "Updated Jan 11, 2024 09:43AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/polish-priest-arrested-charged-with-sex-crimes-after-alleged-orgy-3272592",
  "paragraph": "WARSAW (Reuters) - A Polish priest was arrested and charged with sex and drug crimes as well as failure to assist a person at medical risk after media reports that a man collapsed at a sex party at his home, state news agency PAP said on Thursday. The diocese in southwest Poland has been engulfed in scandal since reports emerged last September of an orgy at the home of a priest in the town of Dabrowa Gornicza. The priest, referred to as Tomasz Z due to Polish privacy laws, was placed in pre-trial detention after his arrest on Monday. He could face up to 10 years in prison.  \"Three of [the charges] concern crimes described in the law on counteracting drug addiction and are related to providing drugs, one of these is additionally related to... crimes against sexual freedom and decency,\" a spokesman for the local prosecution told PAP. The fourth charge concerns the failure to assist someone facing a threat to their life or health.  According to Polish media reports, a man collapsed at the party after taking too many erectile dysfunction pills. One of the partygoers called an ambulance, but when paramedics arrived they were refused entry and were only able to attend to the man after police were called, according to the reports. The media reports said the man was a male prostitute but the prosecutor's office denied that. It said three men had taken part in the event - the man who collapsed, Tomasz Z and a man who called for help.  The bishop of the diocese stepped down last year, the Vatican said at the time, without giving a reason for his resignation. Tomasz Z was discharged from the clergy last year after the media reported on the alleged sex party. Parallel to the work of the prosecutor's office, the church will also conduct its own trial in the case of Thomasz Z, the results of which will be forwarded to the Vatican, the press office of the Sosnowiec diocese told Reuters."
}