{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK040NA_L.jpg",
  "title": "Myanmar rebels take control of key town near Chinese border",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 05, 2024 04:02PM ET",
    "Updated Jan 06, 2024 12:55AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/myanmar-rebels-claim-control-of-key-town-near-chinese-border-3268428",
  "paragraph": "© Reuters. FILE PHOTO: A general view shows Laukkai, the capital of Myanmar's Kokang region, September 8, 2009. REUTERS/Khin Maung Win/Pool/File Photo\n(Reuters) - A Myanmar rebel alliance has gained control of a key town along the country's volatile northern border with China after weeks of fierce fighting with junta troops, the alliance and the junta said. The Three Brotherhood Alliance, as the group is known, said on Friday it had taken took over Laukkai town after the military's regional headquarters located there surrendered. The fall of Laukkai is the rebels' latest victory in a sweeping offensive that began in October and has become the most significant threat to Myanmar's military government since it seized power in a 2021 coup. \"All Kokang (Laukkai) region has become a land with no Myanmar Military Council anymore,\" the rebels said in a statement. Junta spokesman Zaw Min Tun told local media Popular News on Saturday that the military had decided to surrender after \"great consideration.\" The alliance comprises three groups with extensive fighting experience - the Myanmar National Democratic Alliance Army (MNDAA), the Ta'ang National Liberation Army and the Arakan Army. They were accompanied by people from the loosely organised People's Defence Force, supported by Myanmar's parallel National Unity Government, suggesting that the rebellion is taking on an increased level of coordination and planning. Armed conflict between the military and rebel groups has surged in Myanmar's north since late October. Neighbouring China, which has facilitated dialogue between the two sides, has called for a ceasefire.  The capital of Myanmar's restive Kokang region, Laukkai has a reputation as a gambling den and a hub for online scam operations. China, a key junta ally that also has close relations with some ethnic Chinese militias along the frontier, has grown increasingly frustrated in recent months by the Myanmar's junta lack of action on closing down the scam centres. At the start of the offensive, the Three Brotherhood Alliance said its key objectives included cleaning up the scam centres. In late December, China urged its nationals to leave the Laukkai area, citing security risks. Laukkai is a former headquarters of the MNDAA. \nThe surrender of Laukkai \"marks the first Regional Operation Command to fall,\" political analyst Ye Myo Hein said in a post on social media platform X. Myanmar's military has over a dozen regional operation commands spread across the country."
}