{
  "image": "https://i-invdn-com.investing.com/news/international_newspapers_69x52._800x533_L_1419494241.jpg",
  "title": "US Supreme Court to hear Oklahoma death row inmate Glossip's appeal",
  "category": "General",
  "publisher": "Reuters",
  "date": [
    "Published Jan 22, 2024 09:49AM ET",
    "Updated Jan 22, 2024 03:34PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/general/us-supreme-court-to-hear-oklahoma-death-row-inmate-glossips-appeal-3279783",
  "paragraph": "By John Kruzel WASHINGTON (Reuters) -The U.S. Supreme Court on Monday agreed to hear Oklahoma death row inmate Richard Glossip's bid to challenge his conviction for a 1997 murder-for-hire based on his claim that prosecutors wrongly withheld certain evidence favorable to his defense. The justices took up Glossip's appeal of a lower court's refusal to grant him a hearing after that court determined the newly obtained evidence would not have changed the case's outcome. The Supreme Court in May 2023 halted Glossip's scheduled execution while they considered whether to take up his appeal challenging his conviction on various grounds. Glossip was convicted of commissioning the 1997 murder of Barry Van Treese, owner of the Best Budget Inn motel in Oklahoma City where Glossip was a manager. Van Treese was beaten to death with a baseball bat by maintenance worker Justin Sneed, who confessed to the killing and said Glossip had hired him to do it. Recent investigations into the case led Glossip's lawyers to evidence that they said cast doubt on the reliability of Sneed, the prosecution's key witness, prompting them to seek relief at the Oklahoma Court of Criminal Appeals. Defense lawyers told that appellate court that Sneed had misled the jury about his psychiatric condition at the time of the murder. Among the issues the Supreme Court will weigh is whether Glossip's due process rights under the U.S. Constitution were violated by the failure of prosecutors to disclose that Sneed was receiving mental health treatment, and the prosecution's failure to correct Sneed's false testimony about the care he received. John Mills, an attorney for Glossip, praised the justices for taking up the case and expressed gratitude for Oklahoma Attorney General Gentner Drummond's support of the appeal. \"We are grateful that the court is providing Richard Glossip the opportunity to argue that Oklahoma should not be permitted to kill him,\" Mills said.  The case is due to be argued during the Supreme Court's next term, which begins in October.  \"Public confidence in the death penalty requires the highest standard of reliability, so it is appropriate that the U.S. Supreme Court will review this case,\" Drummond, a Republican, said in a statement. Justice Neil Gorsuch did not participate in considering whether to hear the appeal, apparently because he dealt with Glossip's case at an earlier stage while serving on a lower court. The justices did not act on a separate appeal by Glossip challenging his conviction based on the failure of prosecutors to disclose that, according to the defense, Sneed had considered recanting his incriminating testimony against Glossip. Glossip appealed to the justices after the Oklahoma Court of Criminal Appeals last year ruled against him, based in part on its determination that the evidence would not have made a difference to jurors, and denied Glossip's request for a hearing.  His legal team's appeal to the Supreme Court was supported by Drummond, with the justices then halting his execution that had been scheduled for May 18, 2023. \nGlossip was found guilty of first-degree murder in 1998. After an appeals court threw out that conviction, he was found guilty again in 2004. He has drawn a range of prominent supporters while pursuing long-running appeals of his conviction, including from celebrity Kim Kardashian. The Supreme Court in 2015 ruled against a bid by Glossip and two other death row inmates to challenge Oklahoma's lethal injection protocol, with the justices deciding that the state's execution method did not violate the U.S. Constitution's ban on cruel and unusual punishment."
}