{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0C007_L.jpg",
  "title": "Yemen's Houthis vow strong response after new US strike",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 12, 2024 07:33PM ET",
    "Updated Jan 13, 2024 03:21PM ET"
  ],
  "comments": [
    7,
    [
      [
        "Mark Jannetty",
        "2024-01-14 14:52:25",
        "well it's a good thing we don't have a open border policy where terrorists can get in. oh wait.",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Barry Nickerson",
        "2024-01-14 11:52:12",
        "Brad Albright:  Did you write your little rant under the guise of using the term -does not have the authority- instead of the word -illegal- simply to show your ambiguity towards Kazz?  Or were you just out looking for a place to use your term -magabillie-?",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Casador Del Oso",
        "2024-01-13 23:36:44",
        "We are really in trouble now with such weak leadership.",
        "https://www.investing.com/members/221023565"
      ],
      [
        "Rizwan Aslam",
        "2024-01-13 14:25:08",
        "War war killing killing human love",
        "https://www.investing.com/members/255232462"
      ],
      [
        "tom kazz",
        "2024-01-13 11:40:55",
        "Joe Biden said in 2020 it was illegal for the president to do it without congressional approval.",
        "https://www.investing.com/members/234787801"
      ],
      [
        "Brad Albright",
        "2024-01-13 15:29:31",
        "\"Do it\"? Another magabillie whose confusion results from inattention to details. Biden is not committing the US to war. And what he said in 2020 was: \"Donald Trump does not have the authority to take us into war with Iran without congressional approval. A president should never take this nation to war without the informed consent of the American people.”",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Barry Nickerson",
        "2024-01-14 11:32:55",
        "Brad Albright",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Barry Nickerson",
        "2024-01-14 11:50:38",
        "Brad Albright",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Barry Nickerson",
        "2024-01-13 11:14:01",
        "Come on France, Italy, and Spain.  Jump into the target practice.  If you're UN, then you're involved, too.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Brad Albright",
        "2024-01-13 15:34:09",
        "Every country in the world is in the UN.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Derick Lim",
        "2024-01-13 08:06:49",
        "A good prosperous 2024 start for weapon manufacturers .. thanks to Houthis and Iran.......",
        "https://www.investing.com/members/214364779"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/biden-warns-of-more-strikes-on-yemens-houthis-if-red-sea-attacks-persist-3273884",
  "paragraph": "By Idrees Ali, Phil Stewart and Mohammed Ghobari WASHINGTON/ADEN (Reuters) -The Houthi militia threatened a \"strong and effective response\" after the United States carried out another strike in Yemen overnight, further ratcheting up tensions as Washington vowed to protect shipping from attacks by the Iran-aligned movement. The strikes have added to concerns about the escalation of a conflict that has spread through the Middle East since the Palestinian militant group Hamas and Israel went to war, with Iran's allies also entering the fray from Lebanon, Syria and Iraq. President Joe Biden said the United States had sent a private message to Iran about the Houthi attacks. He did not elaborate, telling reporters, \"We delivered it privately and we're confident we're well-prepared.\" The latest strike, which the U.S. said hit a radar site, came a day after dozens of American and British strikes on Houthi facilities in Yemen. \"This new strike will have a firm, strong and effective response,\" Houthi spokesperson Nasruldeen Amer told Al Jazeera, adding there had been no injuries nor \"material damages.\" Mohammed Abdulsalam, another Houthi spokesperson, told Reuters the strikes, including the one overnight that hit a military base in Sanaa, had no significant impact on the group's ability to prevent Israel-affiliated vessels from passing through the Red Sea and Arabian Sea. The Pentagon said on Friday the U.S.-British strikes had \"good effects.\" Hans Grundberg, U.N. special envoy for Yemen, called on Saturday for maximum restraint by \"all involved\" and warned of an increasingly precarious situation in the region. The Houthis say their maritime campaign aims to support Palestinians under Israeli siege and attack in Gaza, which is ruled by the Iran-backed Hamas. Many of the vessels they have attacked had no known connection to Israel. The group, which controls Sanaa and much of the west and north of Yemen, has also fired drones and missiles up the Red Sea at Israel itself.  The guided missile destroyer Carney used Tomahawk missiles in the follow-on strike early on Saturday local time \"to degrade the Houthis' ability to attack maritime vessels, including commercial vessels,\" U.S. Central Command said in a statement on X.  'BRUTAL AGGRESSION'  In Sanaa, government employee Mohammed Samei said the attacks were an act of \"brutal aggression\" and marked a new stage of a war Yemen has endured for 10 years.  Hussein Kabsi, a retired government employee, said supporting the Palestinians was a \"religious and moral duty.\" \"Our stance is unwavering, we will (continue) to stand with our brothers in Palestine and Gaza until victory and until all Palestinian land is liberated - not just Gaza,\" he said.  On Friday, hundreds of thousands of people rallied in Sanaa, chanting slogans denouncing Israel and the United States, footage broadcast by the Houthis' Al-Masirah TV showed. White House spokesperson John Kirby (NYSE:KEX) said the initial strikes had hit the Houthis' ability to store, launch and guide missiles or drones, which the group has used to threaten shipping. He said Washington had no interest in a war with Yemen. The Houthis said five fighters were killed in the initial strikes.  Biden, whose administration removed the Houthis from a State Department list of \"foreign terrorist organizations\" in 2021, was asked by reporters whether he felt the term \"terrorist\" described the movement now. \"I think they are,\" he said.  The Red Sea crisis has added to the spread of conflict through the Middle East since Hamas militants rampaged through southern Israel on Oct. 7, killing 1,200 people and seizing 240 hostages.  Israel has responded by laying waste to large sections of Gaza to try to annihilate Hamas. A total of 23,843 Palestinians have been killed in Israeli strikes on the enclave since Oct. 7, the Gaza health ministry said in a statement. Israeli Prime Minister Benjamin Netanyahu said on Saturday the country planned a \"huge\" addition to its defense budget as part of a build-up designed to cover its needs for years to come. At the U.N. Security Council on Friday, Russian U.N. Ambassador Vassily Nebenzia said the U.S. and Britain \"single-handedly triggered a spillover of the conflict (in Gaza) to the entire region.\" \nA senior U.S. official accused Tehran of providing the Yemeni group with military capabilities and intelligence. There has been no sign so far Iran is seeking direct conflict, although Iran condemned the American and British strikes. Houthi attacks have forced commercial ships to take a longer, costlier route around Africa, creating concern about a new bout of inflation and supply chain disruption. Container shipping rates for some global routes have soared this week."
}