{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK07004_L.jpg",
  "title": "Epstein invoked 5th Amendment right to silence 600 times - court filings",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 07, 2024 07:27PM ET",
    "Updated Jan 08, 2024 05:10AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/epstein-invoked-5th-amendment-right-to-silence-600-times--court-filings-3268727",
  "paragraph": "© Reuters. FILE PHOTO: U.S. financier Jeffrey Epstein appears in a photograph taken for the New York State Division of Criminal Justice Services' sex offender registry March 28, 2017 and obtained by Reuters July 10, 2019. New York State Division of Criminal Justice\n(This Jan. 5 story has been refiled to remove a picture) By Jonathan Stempel NEW YORK (Reuters) - The late financier Jeffrey Epstein invoked his constitutional right against incriminating himself about 600 times in testimony for a lawsuit brought by Virginia Giuffre, who accused him of sexual abuse. Epstein's refusal to answer questions in Giuffre's lawsuit against his longtime associate Ghislaine Maxwell was disclosed in a filing on Friday in Manhattan federal court, as part of a trove of documents being unsealed this month from the civil defamation case, which settled in 2017. The Fifth Amendment of the U.S. Constitution gives people the right not to incriminate themselves. In the September 2016 filing, Giuffre's lawyers said Epstein routinely answered \"Fifth\" in a deposition that month to about 500 substantive questions they posed, and 100 substantive questions that Maxwell's lawyers posed. Giuffre's lawyers said Epstein's refusal to answer extended to questions that posed no real risk of incriminating him, including whether he knew Maxwell, had in 2008 pleaded guilty in open court to a prostitution charge and was healthy enough to testify. The questions also included at least three about Epstein's relationship with former U.S. President Bill Clinton. Lawyers for Epstein said in a subsequent filing, also released on Friday, that their client would have invoked the Fifth Amendment if called upon to testify at trial. They cited among other reasons the \"burdens\" he would face, and the expected \"media circus generated by Mr. Epstein's personal appearance.\" Epstein killed himself in a Manhattan jail cell in August 2019 at age 66 while awaiting trial on sex trafficking charges. Several other people accused of aiding in his sexual abuses also invoked their rights against self-incrimination in various litigation related to him, Friday's unsealed filings show. More than 180 documents including depositions, legal briefs and email chains from Giuffre's lawsuit have been released since Wednesday, under an order last month from U.S. District Judge Loretta Preska in Manhattan, who oversaw the case. The documents name many of Epstein's victims, who were paid to give him and others massages in exchange for money. Others named included people who worked with the financier, and a handful of celebrities and politicians linked to him. In addition to Clinton, prominent people named in the documents include actor Kevin Spacey, magician David Copperfield and business executive Leslie Wexner. None was accused in the documents of wrongdoing. Several documents discussed the alleged activities of Britain's Prince Andrew, who Giuffre sued and accused of abusing her more than two decades ago when she was 17. Andrew has denied Giuffre's accusations, but settled her case for a reported 12 million pounds ($15 million) in 2022. \nMaxwell is appealing her December 2021 conviction and 20-year prison sentence for aiding in Epstein's sexual abuses. A federal appeals court in Manhattan may review her case as soon as March. ($1 = 0.7864 pounds)"
}