{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0E0M6_L.jpg",
  "title": "Dozens of prisoners escape Ecuador jail amid continued military operations",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 15, 2024 08:25PM ET",
    "Updated Jan 15, 2024 08:34PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/dozens-of-prisoners-escape-ecuador-jail-amid-continued-military-operations-3274536",
  "paragraph": "3/3\n© Reuters. Members of the Security Forces check an area near the Zonal 8 prison, from where Jose Adolfo Macias alias \"Fito\" disappeared earlier in the month, amid the ongoing wave of violence around the nation, in Guayaquil, Ecuador, January 15, 2024. REUTERS/Henry \n2/3\nBy Alexandra Valencia QUITO (Reuters) - Forty-three prisoners remain at large after escaping a prison in northern Ecuador, the SNAI prisons agency said on Monday, as security forces continued operations throughout the country. President Daniel Noboa declared a 60-day state of emergency last week, including a nighttime curfew, and designated 22 criminal groups as terrorists. The recent explosion of violence - including the storming by gunmen of a live TV news broadcast, explosions in several cities and the kidnapping of police officers - appears to be a response to Noboa's plans to address Ecuador's serious security crisis. Police and military personnel are present in jails throughout Ecuador after some 200 kidnapped guards and administrative officials were freed from at least seven prisons over the weekend. The inmates escaped a jail in Esmeraldas, a city close to the border with Colombia, SNAI said in a statement on Monday, after some 2,000 members of Ecuador's security forces conducted a search operation in the prison on Sunday. \"As a result of this inspection, the escape of 48 people inmates was discovered,\" the statement added, noting that five prisoners were recaptured. Security forces also learned that one prisoner had died in the prison, SNAI said, without giving further details. Since the state of emergency was declared, security forces have detained more than 1,500 people and have carried out 41 operations against terrorist groups, according to the government. Operations will continue throughout Ecuador this week, the government said in a separate statement. \n\"The stated objective is clear: to be implacable with those who have terrorized and abused citizens,\" the government said. Noboa, elected last year on pledges to restore security, has promised to keep gang leaders imprisoned in new high-security prisons, among other measures."
}