{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0M0VZ_L.jpg",
  "title": "Illinois man who shot 8 people to death was family to most of his victims",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 23, 2024 06:37PM ET",
    "Updated Jan 23, 2024 06:56PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/illinois-man-who-shot-8-people-to-death-was-family-to-most-of-his-victims-3281146",
  "paragraph": "© Reuters. Romeo Nance, sought by the Joliet Police Department as a suspect in the shooting deaths of seven people in two homes, poses in an undated photograph released by investigators in Joliet, Illinois, U.S. Joliet Police Department/Handout via REUTERS\nBy Steve Gorman (Reuters) - A man who fatally shot eight people in Illinois over the weekend before taking own life as law enforcement closed in on him in Texas was a family relative to most of his victims, but his motives remain a mystery, police said on Tuesday. The suspect, 23-year-old Romeo Nance, shot himself to death on Monday night as U.S. marshals gave chase outside a gasoline station near San Antonio, Texas, ending a manhunt that began 24 hours earlier about 1,200 miles (1,930 km) to the north outside Chicago, police said. Nance was wanted for the shooting deaths of seven people found slain on Monday morning in two homes across the street from one another in Joliet, Illinois, and for the killing of a man in a nearby township and wounding of a second man in a pair of apparently unrelated shootings. The investigation began with the Sunday afternoon murder of 28-year-old Toyosi Bakare, a Nigerian immigrant who was shot in the head as he was buying a pack of cigarettes near his apartment.  Will County sheriff's deputies tied that slaying to the getaway car used in the nearby shooting of another man who survived his attack with a leg wound. The search for the suspected vehicle and its registered owner eventually led authorities to the two residences where on Monday they made entry to find seven other victims dead of gunshot wounds - two in one home and five in the other. Joliet Police Chief Williams Evans said Tuesday that all seven - five females ranging in age from 14 to 47, and two males aged 35 and 38 - were part of the same family, and that Nance was himself related to all or most of them. Their identities have yet to be made public. Evans also said investigators have since determined the seven at the primary crime scene had already been slain by the time Bakare and the surviving victim were shot a short time later on Sunday. Detectives believe that the two subsequent shootings \"were more random in nature\" with no known \"nexus\" to the carnage discovered later at the two residences, the chief said. \"We can't get inside his head. We just don't have any clue as to why he did what he did,\" Evans told reporters. \nDan Jungles, deputy chief sheriff, said Nance had an \"extensive criminal history\" but that getting answers to the killings may ultimately confound investigators. \"We may never know the truth of the motive behind these senseless killings,\" he said."
}