{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "Joyce Randolph, Trixie on classic TV sitcom 'The Honeymooners', dies at 99 - media",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 14, 2024 03:57PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/joyce-randolph-trixie-on-classic-tv-sitcom-the-honeymooners-dies-at-99--media-3274155",
  "paragraph": "(Reuters) - Actress Joyce Randolph, who played the peppy working-class Brooklyn housewife Trixie on \"The Honeymooners\" and was the last surviving cast member of the seminal 1950s sitcom starring Jackie Gleason, died on Saturday at her Manhattan home, her family told multiple media. She was 99. The circumstances were not disclosed, but her son Randolph Charles confirmed the death to media, including People and TMZ. \"The Honeymooners\" starred Gleason, one of the top stars of the Golden Age of Television, as bus driver Ralph Kramden, Audrey Meadows as his wisecracking wife Alice, Art Carney as Ralph's best friend and neighbor Ed Norton and Randolph as Ed's wife. The foursome starred from 1951 to 1957 in \"The Honeymooners\" either as a segment in one of Gleason's popular variety shows or as a stand-alone series during the 1955-56 single TV season. The show was set in a Brooklyn apartment building and focused on decidedly blue-collar characters. Gleason's short-tempered Ralph chases get-rich-quick dreams that invariably do not lead to a pot of gold. Carney's sewer worker character drives Ralph crazy and both their wives lean toward the bossy side. But the characters all have a soft side - even Ralph, who one moment would threaten to knock his wife \"to the moon\" and the next would tell her, \"Baby, you're the greatest.\" Experts consistently ranked \"The Honeymooners\" among the top TV comedies ever made. With Carney's death in 2003, Randolph became the last survivor of the cast. Gleason died in 1987 and Meadows in 1996. Randolph, who was born on Oct. 21, 1924, moved from her native Detroit to New York to pursue her acting career and performed in the early days of television. She got her big break based on a commercial she did for Clorets chewing gum on the old DuMont television network, the home of Gleason's \"Cavalcade of Stars\" variety show. Gleason noticed the \"Clorets girl\" and offered her the part of Trixie when he was casting \"The Honeymooners\" skits. \"Trixie was married to a sewer worker and I guess she considered herself a little better than the character of Ed Norton,\" Randolph said in a 1999 interview with the Archive of American Television. \"But she was just a housewife. She and Alice didn't have jobs. They stayed home all the time, which was kind of amazing. But the husbands didn't want them to work.\" Randolph said that despite her character's superior attitude, it was mentioned twice during the series that she may have been a dancer in burlesque before becoming Mrs. Norton. Known as a very difficult star, Gleason was famous for his aversion to rehearsal - he wanted performances to feel spontaneous - and the cast often was given the final script just the night before shooting. \"Nobody worked like that in one day,\" Randolph told journalist Jane Wollman Rusoff in 2012. \"It was ridiculous. But Jackie wanted it fresh. He was the boss and theatrically brilliant, a strange, immensely talented man.\" She said Gleason displayed extreme mood swings.  \"You never knew whether he would show up on Saturday morning in a black Irish mood or if he'd be jovial,\" Randolph said. After \"The Honeymooners,\" Randolph performed in commercials and stage work. She did not appear in the 1960s revival of \"The Honeymooners,\" which had Jane Kean in the part of Trixie. She had one child, with her husband, retired advertising executive Richard Charles. He died in 1997."
}