{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "Shunned in computer age, cursive makes a comeback in California",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 27, 2024 05:02AM ET",
    "Updated Jan 27, 2024 06:17PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/shunned-in-computer-age-cursive-makes-a-comeback-in-california-3284747",
  "paragraph": "By Daniel Trotta FULLERTON, California (Reuters) - A generation of children who learned to write on screens is now going old school. Starting this year, California grade school students are required to learn cursive handwriting, after the skill had fallen out of fashion in the computer age. Assembly Bill 446, sponsored by former elementary school teacher Sharon Quirk-Silva and signed into law in October, requires handwriting instruction for the 2.6 million Californians in grades one to six, roughly ages 6 to 12, and cursive lessons for the \"appropriate\" grade levels - generally considered to be third grade and above. Experts say learning cursive improves cognitive development, reading comprehension and fine motor skills, among other benefits. Some educators also find value in teaching children to read historic documents and family letters from generations past.  At Orangethorpe Elementary School in Fullerton, about 30 miles (50 km) southeast of Los Angeles, fourth- to sixth-grade teacher Pamela Keller said she was already teaching cursive before the law took effect Jan. 1. Some kids complain about the difficulty, to which Keller has a ready answer. \"We tell them, well, it's going to make you smarter, it's going to make some connections in your brain, and it's going to help you move to the next level. And then they get excited because students want to be smarter. They want to learn,\" Keller said. While teaching a cursive lesson this week, Keller dished out gentle tips to her students such as \"Lighten up a little - do it really gently ... An eraser is our best friend ... That loop is wonderful. I love that loop.\" During a recent visit to the school library, Keller said one student grew animated upon seeing an image of the U.S. Constitution, written in 1787, remarking, \"It's cursive!\" Several of Keller's students acknowledged the subject was difficult, especially the letter Z, but enjoyed it nonetheless. \"I love it, because I just feel it's fancier how to write, and it's fun to learn new letters,\" said Sophie Guardia, a 9-year-old in the fourth grade. In teacher Nancy Karcher's class, the reaction from third-graders ranged from \"It's fun\" and \"It's pretty\" to \"Now I can read my mom's writing\" and \"It's for my secrets.\" CURSIVE COMEBACK As computer keyboards and tablets proliferated, cursive faded. In 2010, the national Common Core education standards were published to help prepare students for college. Cursive was left out. \"They stopped teaching kids how to form any letters at all. Teacher colleges are not preparing teachers to teach handwriting,\" said Kathleen Wright, founder of the Handwriting Collective, a nonprofit promoting handwriting instruction.  But cursive is making a comeback. California became the 22nd state to require cursive handwriting and the 14th to enact a cursive instruction bill since 2014, according to Lauren Gendill of the National Conference of State Legislatures. Five states have introduced cursive bills so far in 2024. Leslie Zoroya, project director for reading language arts at the Los Angeles County Office of Education, said research has shown that learning cursive promotes several skills that link together and improve childhood development. \"You're using different neural networks when you're doing cursive rather than printing. And so it's creating those pathways in your brain. It also helps with the retention of information, how letters are formed. As you're creating the letter, you're thinking about the sound that letter makes and how does it connect to the next letter,\" Zoroya said. Quirk-Silva said she was inspired to sponsor the bill after a 2016 meeting with the Jesuit-educated former Governor Jerry Brown, who, when he learned the recently re-elected assembly member was a teacher, immediately told her: \"You need to bring back cursive writing.\" \nTechnically, cursive was still alive. California's standards had cursive writing goals, but Quirk-Silva said instruction was flagging and inconsistent. \"The hope of the legislation is that by the time students leave sixth grade, they would be able to read and write it,\" Quirk-Silva said."
}