{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0P0J1_L.jpg",
  "title": "Russia's Putin says Ukraine shot down plane, deliberately or in error",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 26, 2024 04:38PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/russias-putin-says-ukraine-shot-down-plane-deliberately-or-in-error-3284609",
  "paragraph": "MOSCOW (Reuters) -Russian President Vladimir Putin said on Friday that a Russian military plane that crashed near the border with Ukraine was shot down by Ukrainian air defences, whether on purpose or by mistake. Moscow accuses Kyiv of downing the Ilyushin Il-76 plane in Russia's Belgorod region on Wednesday and killing 74 people on board, including 65 captured Ukrainian soldiers en route to be swapped for Russian prisoners of war. It has not presented evidence. Ukraine has neither confirmed nor denied that it shot down the plane and has challenged Moscow's account of who was on board and what happened. \"I don’t know if they did it on purpose or by mistake, but it is obvious that they did it,\" Putin said in televised comments, his first on the crash. \"In any case, what happened is a crime. Either through negligence or on purpose, but in any case it is a crime.\" Ukraine disputes Russia's assertion that it was warned in advance that a plane carrying Ukrainian POWs would be flying over Russia's southwestern Belgorod region at that time. It has also said there were discrepancies in a list published by Russian media of the 65 Ukrainians alleged to have been on the aircraft. Russia's Investigative Committee, the country's top investigative body, posted online a video it said showed Ukrainian soldiers preparing to board the Il-76 aircraft. The video has no sound and is accompanied by a single line of explanation that it depicts Ukrainian servicemen boarding the military transport. It gave no location. Ukrainian commentators immediately cast doubt on the video. In his remarks, Putin said the plane could not have been brought down by Russian \"friendly fire\" as its air defence systems have safeguards to prevent them attacking their own planes. \"There are 'friend or foe' systems there, and no matter how much the operator presses the button, our air defence systems would not work,\" he said. Putin said the missiles fired were mostly likely American or French, but this would be established in two to three days. An adviser to Ukrainian President Volodymyr Zelenskiy said Putin's comments amounted to a \"classic disinformation\" campaign. Mykhail Podolyak said they were aimed at taking away Kyiv's right to secure air defence missiles from its partners. RUSSIA SAYS DOCUMENTS, BODY PARTS RECOVERED The Investigative Committee earlier reported that Ukrainian identity documents and tattooed body parts had been recovered from the site of the crash. It said body parts were being collected and removed for genetic testing, and some of them bore distinctive tattoos like those worn by captured Ukrainians that Russia had interrogated. It said the evidence collected also included \"documents of Ukrainian servicemen who died in the disaster\" and documents from the Federal Penitentiary Service of Russia\". Russia has sole access to the crash site. Reuters could not independently verify its account of what happened and what evidence had been recovered. On Thursday the Investigative Committee said preliminary findings showed the plane was struck by a surface-to-air missile fired from Ukraine. Kyrylo Budanov, head of the Ukrainian Defence Ministry's Intelligence Directorate, told an official group dealing with the treatment of Ukrainian POWs that Kyiv had no \"credible and comprehensive information\" about who might have been on board the aircraft. \"Currently, there is no information indicating that such a number of people could have been on that plane,\" Budanov was quoted as saying on the group's Facebook (NASDAQ:META) page. Ukraine has rejected a Russian assertion that it was forewarned that a plane carrying Ukrainian POWs would be flying over Belgorod region at that time. It has also pointed to discrepancies on a purported list of the names of 65 Ukrainians published by Russian media, saying some of these were soldiers who had returned in a previous swap. \nKremlin spokesman Dmitry Peskov said he was not aware any official list had been published. He told reporters he had no information on what would happen to the body remains. Russia state media said the black box flight recorders from the plane had been delivered to a defence ministry laboratory in Moscow and investigators were already working on them."
}