{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK11044_L.jpg",
  "title": "Analysis-'Open warfare': Philippines' Marcos-Duterte alliance crumbles",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Feb 02, 2024 12:39AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/analysisopen-warfare-philippines-marcosduterte-alliance-crumbles-3290767",
  "paragraph": "4/4\n© Reuters. Philippine President Ferdinand Marcos Jr. delivers a joint statement during the visit of Indonesian President Joko Widodo at the Malacanang Palace, in Manila, Philippines, January 10, 2024. Ezra Acayan/Pool via REUTERS\n2/4\nBy Karen Lema MANILA (Reuters) - The alliance between Philippine President Ferdinand Marcos Jr and his predecessor Rodrigo Duterte disintegrated this week when they accused each other of using drugs - a rift that could threaten Marcos's reform agenda and risk fuelling instability. The alliance between two of the Philippines' most influential families that swept Marcos and Duterte's daughter, Sara, into power in 2022, was always expected to collapse, but analysts are surprised by how soon the gloves have come off. \"This is a point of no return,\" said Jean Encinas-Franco, a political science professor at the University of the Philippines, pointing to the ferocity of the exchanges between the two families. Sebastian Duterte, the former president's son and mayor of Davao city, has called on Marcos to resign over flawed policies such as his pro-U.S. foreign policy, which he said \"endangers the lives of innocent Filipinos\". \"The opportunistic political alliance was not meant to last,\" said Temario Rivera, chairman of the Center for People Empowerment in Governance think-tank.  \"The break seems to be taking place rather very early.\" Marcos was quick to play down the tensions, saying on Tuesday that the coalition was intact. \"It is still working,\" he said, adding he was keeping Sara Duterte as education minister.  Marcos' office did not respond to a request for comment. There was no immediate response from the Dutertes. But political analysts said the rift could now threaten Marcos's ambitious plans to grow the economy, create jobs, overhaul infrastructure and strengthen the armed forces. \"A breakdown of the formal alliance risk fomenting new divisions within the military, proving serious problems of governance and stability,\" said Rivera.  SWEPT TO POWER The Marcos and Duterte families joined forces in 2022 with Sara Duterte standing as Marcos's vice-presidential running mate, allowing Marcos to tap the Duterte family's huge support base and seal a comeback for the disgraced Marcos dynasty.  Ferdinand Marcos Sr. was president for two decades, ruling as an authoritarian before he was ousted in the 1986 \"people power\" uprising. Marcos Sr. and his wife Imelda were accused of amassing more than $10 billion while in office. But cracks in the Marcos-Duterte relationship emerged early. Marcos reversed Duterte's pro-China stance and pivoted back to the United States, granting Washington greater access to Philippine bases amid China's assertiveness in the South China Sea and near Taiwan. He brought to the fore a 2016 arbitral ruling fortifying Manila's territorial claims in the South China Sea, which Duterte largely set aside in a move seen as directed at China which has overlapping sovereignty claims in the South China Sea. Marcos also sought to revive peace negotiations with communist rebels, which his predecessor had scrapped, and which Sara Duterte has described as an \"agreement with the devil.\" A major blow to the relationship came in November when Marcos said he was considering rejoining the International Criminal Court. Duterte had withdrawn membership in 2018 after the court's prosecutor announced a preliminary examination into thousands of killings in Duterte's war on drugs.  An investigation into Duterte's internationally-rebuked 'war on drugs' is underway at the Hague-based tribunal. Marcos has thrown his support behind moves to change the 1987 constitution, saying it would ease regulations for business and lure investors, but Duterte has accused him of using constitutional change to stay in power. Opponents of constitutional change say it aims to change the political system and remove term limits, including that of the president, who can currently serve just one, six-year term. Duterte has warned Marcos might suffer the same fate as his father - who had to flee the country - if he insisted on amending the constitution introduced after the 1986 revolution.  'OPEN WARFARE' The alliance publicly disintegrated on Sunday when Duterte called Marcos a \"drug addict\" during a rally against moves to change the charter. The rally was attended by his daughter. Marcos hit back, saying Duterte's fentanyl use, which the former leader admitted to have used in the past for pain relief, could have clouded his judgment.  Analysts said the public bust-up could be linked to the 2028 presidential race, which Sara Duterte is expected to contest and stands a strong chance. A 2023 survey by pollster Social Weather Stations showed she was the top pick for president in 2028. \"It will be an open warfare this year,\" said Ronald Llamas, a veteran political analyst and former presidential adviser.  \nThe Philippines will hold mid-term elections in 2025 to choose half the Senate, elect congressmen, and local officials. If the candidates Marcos endorses lose the mid-terms, or his supporters shift loyalties, his legislative agenda could be in peril, said analysts."
}