{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0K09Q_L.jpg",
  "title": "Canada weighing extra border measures for asylum seekers from Mexico - minister",
  "category": "Economy",
  "publisher": "Reuters",
  "date": "Published Jan 21, 2024 12:59PM ET",
  "comments": [
    4,
    [
      [
        "Roger Miller",
        "2024-01-21 23:53:01",
        "Likely the plan was for the the Democrat regime in the White House to let in the illegals into the US while Canada drastically increased the amount of legal immigration.  Now that legal immigrants are moving away from Canada due to sky high living costs not sure why illegals would want to come. Trudeau may be trying to reduce legal immigration due to living costs, but the illegals are throwing a wrench in their plans.",
        "https://www.investing.com/members/205083859"
      ],
      [
        "Brad Albright",
        "2024-01-22 14:05:51",
        "Likely. Uh-huh.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Michael Benson",
        "2024-01-21 18:48:27",
        "Financial institutions face increasing regulatory pressure.",
        "https://www.investing.com/members/246214947"
      ],
      [
        "Michael Benson",
        "2024-01-21 18:49:34",
        "International trade agreements impact markets around the world.",
        "https://www.investing.com/members/246214947"
      ],
      [
        "Michael Benson",
        "2024-01-21 18:44:25",
        "Financial institutions face increasing regulatory pressure.",
        "https://www.investing.com/members/246214947"
      ],
      [
        "Michael Benson",
        "2024-01-21 18:45:35",
        "Fiscal policy decisions could impact the economy.",
        "https://www.investing.com/members/246214947"
      ],
      [
        "Phil Ht",
        "2024-01-21 18:40:13",
        "Guess they dont want US anymore. Too 3rd world ",
        "https://www.investing.com/members/208823124"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/economy/canada-weighing-extra-border-measures-for-asylum-seekers-from-mexico--minister-3279007",
  "paragraph": "© Reuters. FILE PHOTO: Liberal Member of Parliament Dominic LeBlanc shuffles his papers during a news conference in Ottawa December 8, 2008. LeBlanc announced he is withdrawing from the Liberal leadership race. REUTERS/Chris Wattie/File Photo\nOTTAWA (Reuters) - Canada is weighing a number of measures to prevent Mexican nationals from flying into the country to request asylum, a top official said on Sunday, after Quebec's premier said earlier this week the lack of visa requirements for Mexican travelers meant more refugees were arriving by plane. Speaking to the Canadian Broadcasting Corp, Public Safety Minister Dominic LeBlanc said he and the Immigration Minister Marc Miller were considering visas and other measures. The two ministers are looking for \"the appropriate way to ensure that people who arrived from Mexico arrived for the appropriate reasons and that this doesn't become sort of a side door to get access to Canada,\" LeBlanc said.  \"We're looking at a number of measures that would, in fact, put us in a position to have done what's necessary to ensure that these flights directly from Mexico don't become sort of an indirect way to get access to Canada and to claim asylum,\" he added. In a letter last week, Quebec Premier Francois Legault urged Canadian Prime Minister Justin Trudeau to stem the flow of refugees into the province and to compensate it for costs, claiming Quebec's services were close to a \"breaking point\" due to the rising number. \n\"Mexican nationals represent a growing proportion of the asylum seekers arriving in Quebec, the possibility of entering Canada from Mexico without a visa certainly explains part of the flow of asylum seekers,\" Legault wrote in the letter. Ottawa is coming under pressure for its immigration policies because they are blamed for exacerbating a housing crunch, and because some services provided by the provinces, like education and healthcare, are struggling to keep up with population growth."
}