{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0H0UX_L.jpg",
  "title": "Florida public university system to vote on defunding diversity programs",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 18, 2024 02:18PM ET",
    "Updated Jan 18, 2024 06:37PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Mark Jannetty",
        "2024-01-18 19:25:22",
        "1 step towards ending racism ",
        "https://www.investing.com/members/241633026"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/florida-public-university-system-to-vote-on-defunding-diversity-programs-3277659",
  "paragraph": "© Reuters. FILE PHOTO: Republican presidential candidate and Florida Governor Ron DeSantis speaks during a primary election campaign visit at Wally's restaurant in Hampton, New Hampshire, U.S. January 17, 2024. REUTERS/Elizabeth Frantz/File Photo\n(Reuters) - Florida's public university system will decide next Wednesday whether to ban diversity spending and remove sociology classes as a way to fulfill social-science course requirements, a week after the state education board approved the measures for public colleges. The new rules, which easily passed in a Florida Board of Education meeting on Wednesday, would bring the state's public higher education institutions in line with a bill that Governor Ron DeSantis signed in May.  The law banned the spending of tax dollars on college diversity, equity and inclusion programs (DEI) and restricted how race and gender could be taught on campuses. DeSantis, who is challenging former President Donald Trump to be the Republican nominee in November's U.S. presidential election, has aggressively fought efforts to build racial, social and religious diversity in Florida schools.  He has made the issue a pillar of his platform, emerging as a leader in a larger Republican war against what conservatives see as a left-wing agenda to sow racial and political divisions in U.S. public education. Many higher-education experts and free-speech advocates have criticized his policies as attacks on academic freedom. Under the new rules, public colleges and universities must not spend state or federal funds on programs that promote \"differential\" treatment of individuals based on \"race, color, sex, national origin, gender identity, or sexual orientation.\" They are also barred from spending such funds on activities \"intended to achieve a desired result related to social issues,\" which the rules define as \"topics that polarize or divide society among political, ideological, moral, or religious beliefs.\" The law that DeSantis signed last year required the \"core\" general education course curriculum to be revised by faculty committees appointed by the boards who oversee the state's 28 public colleges and 12 public universities.  \nThose committees recommended cutting sociology from the list of \"core\" social-science courses, and replacing it with an introductory survey course on U.S. history before 1877, the final year of the post-Civil War Reconstruction Era in which U.S. lawmakers sought to integrate into society enslaved people who had been freed. Sociology will still be available to Florida students who wish to take it, and colleges can still recommend it as a core social-science course, despite the fact that it will no longer be considered such under state law."
}