{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "Yemen's Houthis threaten more attacks on US, British warships",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 31, 2024 01:57AM ET",
    "Updated Jan 31, 2024 02:53AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Ken Roth",
        "2024-02-01 14:07:30",
        "Their official flag tells you all you need to know about the Houthis",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/yemens-houthis-say-they-will-target-us-british-warships-in-self-defence--al-massirah-3287739",
  "paragraph": "By Jana Choukeir and Nadine Awadalla DUBAI (Reuters) -Yemen's Iran-aligned Houthi group said on Wednesday it would keep up attacks on U.S. and British warships in the Red Sea in what it called acts of self defence, stoking fears of long-term disruptions to world trade.  In a statement, the group's military spokesperson said all American and British warships participating in \"aggression\" against its country were targets. The U.S. and Britain have launched strikes on Houthi targets in Yemen, and returned the militia to a list of terrorist groups as turmoil from the Israel-Hamas war spreads through the region. The Houthis, who control the most populous parts of Yemen, have been attacking ships in and around the Red Sea, saying they are acting in solidarity with Palestinians in the Gaza war. That conflict has spilled over into other parts of the Middle East. Lebanon's Iran-aligned Hezbollah has traded fire with Israeli troops along the border and Iraqi-armed groups have attacked U.S. forces in Iraq. The Houthis attacks on the Red Sea have added an economic element to the turmoil by targeting shipping in and around the Red Sea.  The Houthis fired missiles at U.S. warship USS Gravely, the statement added. On Tuesday night, the U.S. military's central command said they had shot down one anti-ship cruise missile fired from Yemen towards the Red Sea with no damage reported.  The Houthi attacks have primarily targeted container vessels. Many fuel tankers have kept using the route. \nSome shipping companies have suspended transits through the Red Sea, which is accessed from the Gulf of Aden, and taken much longer, costlier journeys around Africa to avoid being attacked. Houthis say they will persist with their military operations until a ceasefire is agreed in Gaza, and food and medicine are allowed in to the enclave to ease a grave humanitarian crisis."
}