{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "US targets Iranian, Hezbollah financial network with sanctions",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 31, 2024 11:06AM ET",
    "Updated Jan 31, 2024 11:40AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-targets-iranian-hezbollah-financial-network-with-sanctions-3288635",
  "paragraph": "WASHINGTON (Reuters) - The United States imposed sanctions on three entities and one individual based in Turkey and Lebanon on Wednesday for giving \"critical financial support\" to a financial network used by Iran's Quds Force (IRGC-QF) and Lebanon's Hezbollah. \"These entities have generated hundreds of millions of dollars' worth of revenue from selling Iranian commodities, including to the Syrian government,\" the U.S. Treasury Department said in a statement. \"These commodity sales provide a key source of funding for the IRGC-QF and Hezbollah's continued terrorist activities and support to other terrorist organizations throughout the region,\" it added. The Treasury Department said it had imposed sanctions on Turkey-based Mira Ihracat Ithalat Petrol, which purchases, transports, and sells Iranian commodities on the global market, and its chief executive and owner Ibrahim Talal al-Uwayr, who is also known under the alias Ibrahim Agaoglu. It also targeted two Lebanon-based entities, Yara Offshore SAL, a company affiliated with Hezbollah which has facilitated large sales of Iranian commodities to Syria, and Hydro Company for Drilling Equipment Rental, which is involved in financing the IRGC-QF by facilitating the shipment of Iranian commodities worth hundreds of millions of dollars to Syria. \nAs a result of the sanctions, all property of those targeted in the United States or that fall under the control of U.S. persons is blocked.  U.S. regulations generally bar U.S. persons from dealing with property of designated or otherwise blocked persons. Further, non-U.S. financial institutions and others that engage in certain dealings with those sanctioned may expose themselves to sanctions or be subject to an enforcement action."
}