{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBT014_L.jpg",
  "title": "California coast braces for next onslaught of treacherous surf",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 29, 2023 10:00PM ET",
    "Updated Dec 30, 2023 07:40AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/california-coast-braces-for-next-onslaught-of-treacherous-surf-3264871",
  "paragraph": "© Reuters. High tides hit the coastline of Ventura, California, U.S. December 28, 2023, in this screen grab from a handout video. Ventura Police Department and the City of Ventura via Ventura County Fire Department/Handout via REUTERS\nBy Sandra Stojanovic VENTURA, California (Reuters) - Beachfront California residents on Friday cleaned up from flood damage unleashed by massive waves that pounded the coastline a day earlier and braced for another bout of extreme surf and heavy showers forecast into the weekend. The National Weather Service (NWS) posted high surf and coastal flood warnings for much of the California shoreline from San Diego north to the San Francisco Bay area, with breaking waves expected to reach 20, 25 and even 40 feet (12 m) in height in some areas. The treacherous surf and coastal flood threat was attributed to a Pacific storm system also bringing heavy downpours to much of the West Coast on Friday night, while coinciding with the latest arrival of exceptionally high tides known as king tides. \"Significant flooding ... is likely over vulnerable, low-lying coastal areas around the time of high tide,\" the NWS warned. \"Large breaking waves can cause injury, wash people off beaches and rocks, and capsize small boats near shore.\" The seaside town of Ventura, about 65 miles (105 km)northwest of Los Angeles, got a taste of such hazards on Thursday, when heavy surf inundated homes and businesses with seawater, sand and ocean debris. Video footage broadcast by NBC News showed powerful, rogue waves crashing over a seawall onto a beachfront street, knocking people down as others dashed to safety on Thursday in Ventura, where eight people were reported to have been injured. The aftermath was visible on Friday at an ocean side hotel where ground-level porches stood cluttered with debris and shattered first-floor windows were covered over in plywood. Nearby, workers spent the morning stacking sandbags to protect other low-lying properties from further damage. \"Well, the water came over the wall, and you probably saw from any of the videos that it washed down the street like it was a river,\" recalled Dan Roundtree, 63, who told Reuters his residential complex was flooded. \"So we're all trying to recoup from yesterday's water and prepare ourselves as best as possible for tomorrow.\" Even as residents girded for the next onslaught, a few avid surfers donned wetsuits to take advantage of the still high but less ferocious waves that prevailed on Friday, in the relative lull before what forecasters were predicting for Saturday.  \nKenny Powell, 64, another Ventura resident and surfing enthusiast, said that while many surfers live for the thrill of riding exceptionally big waves, Thursday's conditions proved too challenging for him to venture into the swells. \"And we actually picked a few people out of the water,\" he said. \"Mother Nature had a little more than we had planned for.\""
}