{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0I0LH_L.jpg",
  "title": "Argentina arrests, deports relatives of fugitive Ecuador gang leader 'Fito'",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 19, 2024 11:37AM ET",
    "Updated Jan 19, 2024 12:52PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/argentina-arrests-deports-relatives-of-fugitive-ecuador-gang-leader-fito-3278550",
  "paragraph": "3/3\n© Reuters. Argentine authorities transport detained relatives of ecuadorian criminal 'Fito' Macias, in Buenos Aires, Argentina, in this screen grab obtained from a handout video. ARGENTINE SECURITY MINISTRY/Handout via REUTERS \n2/3\nBUENOS AIRES/QUITO (Reuters) -Argentine authorities detained the wife and children of fugitive Ecuadorean drug trafficker Jose Adolfo Macias and deported them early on Friday to Ecuador, authorities said. Argentine Security Minister Patricia Bullrich told a press conference that authorities detained eight people - including other associates of Macias - who arrived in Argentina on Jan. 5 and moved into a home in the province of Cordoba that they had purchased in November. Macias, whose alias is \"Fito,\" disappeared on Jan. 7 from the Ecuadorean prison where he was serving a 34-year sentence for various crimes including drug trafficking and murder. \"Our hypothesis is that Fito's plan was to buy the house, move the family out and then escape from prison,\" said Bullrich, who said Argentine authorities acted after a tip from Ecuadorean counterparts. Local media in Guayaquil reported that the family had arrived at the city's airport, but neither the Ecuadorean police nor the defense ministry responded to requests for information. \"We know that (Macias') entire family was in Argentina ... they have been deported to Ecuador,\" Ecuadorean President Daniel Noboa told RCN radio on Friday. \"Often these relatives are involved in money laundering or in the economic and operational part of the cartels and narco-terrorist groups,\" the president added. Authorities have tied Macias' criminal group Los Choneros to extortion, murder and drug trafficking and accuse the group of controlling Ecuador's crime-plagued and overcrowded prisons. Noboa declared a two-month state of emergency shortly after Fito went missing, deploying the military onto the streets and mandating a nationwide nightly curfew as the country confronts a wave of violence. \nIncidents in January alone have included an on-air attack by armed men on a TV station, the taking of more than 200 prison officials hostage and the kidnapping of police officers, as well as the murder of a prosecutor pursuing organized crime. \"Argentina is not going to be a narco-country nor are our provinces going to be a den of criminals. We are determined to combat this type of crime,\" Argentina's Interior Minister Guillermo Francos said at Friday's press conference."
}