{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK1103O_L.jpg",
  "title": "Saudi Arabia pushes for U.S. defence pact ahead of presidential election",
  "category": "Commodities news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 02, 2024 12:02AM ET",
    "Updated Feb 02, 2024 12:16AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/commodities-news/saudi-arabia-pushes-for-us-defence-pact-ahead-of-presidential-election-3290749",
  "paragraph": "2/2\n© Reuters. FILE PHOTO: Saudi Crown Prince Mohammed bin Salman fist bumps U.S. President Joe Biden upon his arrival at Al Salman Palace, in Jeddah, Saudi Arabia, July 15, 2022. Bandar Algaloud/Courtesy of Saudi Royal Court/Handout via REUTERS/File Photo\n2/2\nBy Samia Nakhoul, Dan Williams and Matt Spetalnick DUBAI (Reuters) - Saudi Arabia would be willing to accept a political commitment from Israel to create a Palestinian state, rather than anything more binding, in a bid to get a defence pact with Washington approved before the U.S. presidential election, three sources said. Months of U.S.-led diplomacy to get Saudi Arabia to normalise relations with Israel and recognise the country for the first time were shelved by Riyadh in October in the face of mounting Arab anger over the war in Gaza. But Saudi Arabia is increasingly keen to shore up its security and ward off threats from rival Iran so the kingdom can forge ahead with its ambitious plan to transform its economy and attract huge foreign investment, two regional sources said. To create some wiggle room in talks about recognising Israel and to get the U.S. pact back on track, Saudi officials have told their U.S. counterparts that Riyadh would not insist Israel take concrete steps to create a Palestinian state and would instead accept a political commitment to a two-state solution, two senior regional sources told Reuters. Such a major regional deal, widely seen as a long-shot even before the Israel-Hamas war, would still face numerous political and diplomatic obstacles, not least the uncertainty over how the Gaza conflict will unfold. A pact giving the world's biggest oil exporter U.S. military protection in exchange for normalisation with Israel would reshape the Middle East by uniting two long-time foes and binding Riyadh to Washington at a time when China is making inroads in the region. A normalisation deal would also bolster Israel's defences against arch-rival Iran and give U.S. President Joe Biden a diplomatic victory to vaunt ahead of the Nov. 5 presidential election. The Saudi officials have privately urged Washington to press Israel to end the Gaza war and commit to a \"political horizon\" for a Palestinian state, saying Riyadh would then normalise relations and help fund Gaza's reconstruction, one of the regional sources said. \"The message from the kingdom to America has been: 'Stop the war first, allow humanitarian aid and commit to a just and lasting solution to give the Palestinians a state',\" said Abdelaziz al-Sagher, head of the Gulf Research Center think-tank in Jeddah, who is familiar with the ongoing discussions. \"Without it, Saudi Arabia can't do anything.\" The problem, though, is that Israeli Prime Minister Benjamin Netanyahu, who has spent much of his political career opposing Palestinian statehood, has rejected outright any U.S. and Arab aspirations for a Palestinian state once the Gaza war is over. \"Normalisation does require really - if not legally, at least politically - a commitment from the Israelis that they are open to a two-state solution,\" said one of the senior regional sources familiar with Saudi thinking. \"If Israel stopped its military offensive on Gaza - or at least declared a ceasefire - it would make it easier for Saudi Arabia to go ahead with the deal,\" the person said. The Saudi government's communication office did not respond to requests for comment. PATHWAY TO STATEHOOD The diplomatic push by Riyadh is driven by a desire to nail down a deal while the U.S. Democrats are still in the White House and control the Senate, as well as growing concern about the military reach of Iran, which has proxies in Saudi Arabia's neighbours Iraq and Yemen, besides Lebanon, Syria and Gaza. In the past, many Democratic lawmakers have resisted such pacts and denounced Riyadh for its military intervention in Yemen, propping up oil prices, and its role in the killing of Saudi journalist Jamal Khashoggi in 2018. But with Biden keen on a deal, now might be the best opportunity to get an agreement through Congress, the sources familiar with Saudi thinking said. The Saudi officials have not spelled out exactly what an acceptable \"pathway\" to a Palestinian state would involve, giving them leeway to strike a deal with Israel that does not involve any binding moves, the regional sources said. There has also been no attempt to revive the policy long advocated by Saudi Arabia that offered Israel normal ties with the entire Arab world in return for its withdrawal from territories occupied in the 1967 war. The Gulf Research Center's Sagher said, however, that Riyadh and other Arab diplomats have told U.S. Secretary of State Antony Blinken and other visiting U.S. officials that without concrete and serious U.S. pressure on Israel, Palestinian statehood would not happen. A senior State Department official said Washington was continuing talks with Riyadh on the U.S.-Saudi elements of the normalisation deal - including nuclear cooperation and security guarantees - but everything rested on Israel coming into line on a pathway to Palestinian statehood and ending the war in Gaza. \"U.S. diplomatic efforts are currently focused on the immediate crisis,\" a White House National Security Council spokesperson said when asked about the status of normalisation. \"But we remain committed to the long-term goal of a more stable, prosperous, and integrated Middle East region, including through normalisation and advancement of a two-state solution.\" Blinken is due to return to the region in the coming days. A senior Israeli official, speaking to Reuters on condition of anonymity, said there was \"zero chance\" Netanyahu would talk about a Palestinian state. \"But that doesn't mean the Saudis can't talk about it, or anyone else,\" the official said. \"As Israel has made clear, the Palestinians will not have sovereignty in terms of being able to have an army or to enter treaties with Iran or to threaten Israel in any way.\" Netanyahu said in a statement last month that Israel must have security control over all the territory west of the Jordan River under any arrangement in the foreseeable future. In a possible sign of the sensitivity of the issue of statehood within the Israeli government, the official said the normalisation talks were being handled exclusively by Netanyahu and his top confident, Strategic Affairs Minister Ron Dermer. TOUGH DECISIONS A U.S. source said Washington believed Riyadh's strong desire to secure U.S. defence guarantees meant the kingdom would be willing to show some flexibility on what would constitute an Israeli commitment to a pathway to Palestinian statehood. One step in this direction could be Netanyahu dropping his opposition to the Palestinian Authority playing a significant role in post-war Gaza, the source said. Establishing relations with the Arab world's Sunni Muslim heavyweight would be Netanyahu's biggest diplomatic success, while for Palestinians, normalisation would put aspirations for statehood back on the map with full Arab backing. \"For the first time, I feel that there is a unified, unanimous, and sincere Arab agreement on the two-state solution to resolve the conflict,\" said Mohammed Dahlan, former security chief from the Palestinian Fatah faction, who is now based in the United Arab Emirates (UAE). \"The question is whether the United States is serious and capable of weighing in on Netanyahu to achieve that goal.\" The Biden administration believes Netanyahu is willing to keep Israeli-Saudi normalization prospects alive but he has shown no sign of softening his resistance to Palestinian concessions, in part because of the potential for destabilising his far-right coalition, the U.S. source said. On his trip to the Middle East last month, Blinken used the demand for a pathway to statehood – which was conveyed during meetings in Turkey, Jordan, Qatar, the UAE and Saudi Arabia - to present a united regional position to Israel. He told reporters Israel would have to make tough decisions to ensure its long-term security and integration in the region. With a new proposal for a three-stage ceasefire and release of hostages in Gaza under discussion, a pause in hostilities might give de facto Saudi ruler Crown Prince Mohammed bin Salman the opportunity to strike a deal.  \"Biden is extremely keen on the agreement. Saudi Arabia is extremely keen on the agreement,\" said one of the senior regional sources close to Saudi thinking. \"These two parties recognise that time is very tight and they need to do it soon, but the Israelis are making it difficult.\" CLOCK TICKING If Washington met Riyadh's demands for the defence pact, assistance with Saudi's nuclear programme, and extracted an acceptable compromise formula on statehood from Netanyahu, the crown prince might grab the opportunity, the person said. He said there was no doubt the Gaza war had complicated and delayed the process, but Riyadh's main objective was the defence agreement and everything else, be it normalisation with Israel or any other issue, was basically to enable a deal. Although Saudi Arabia and Iran ended their diplomatic rift in a rapprochement sponsored by China last year, Riyadh is determined to avoid a repeat of the Sept. 14, 2019 strikes on its oil facilities, the two regional sources said. Riyadh and Washington blamed Tehran for the attack. Iran has denied having any role. Washington and Riyadh agreed to start discussions about a defence pact and Israeli normalisation during Biden's visit to the kingdom in 2022 to repair strained ties over Khashoggi and the U.S. decision to end military assistance to Riyadh in its war against the Houthis in Yemen.  Biden blamed the crown prince for the killing. He has denied any involvement. Energy and security interests, however, prompted Biden and his aides to recalibrate the 80-year U.S.-Saudi strategic partnership, which was founded on a simple equation: American demand for Saudi oil and Saudi demand for American weapons. But the clock may be ticking down on achieving a mega-deal. The deeper the U.S. moves into the presidential election campaign, the U.S. source said, the harder it will be for the Biden administration to gain traction for any U.S.-Saudi security pact in Congress.  U.S. officials hope that tying U.S. defence guarantees to normalisation could help gain congressional support. \nHowever, Netanyahu may prefer to wait for the outcome of the election, in which former President Donald Trump, who had warm ties with the Israeli leader and the Saudi crown prince, is favoured to be Biden's Republican opponent, some analysts say. A second Trump presidency would be widely expected to back Israeli-Saudi normalisation, though it is uncertain how it might stand on enhanced U.S.-Saudi defence ties, the analysts said."
}