{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "A boy's arduous steps on prosthetic legs after Turkey's earthquake",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 05, 2024 03:02AM ET",
    "Updated Feb 05, 2024 08:03AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/a-boys-arduous-steps-on-prosthetic-legs-after-turkeys-earthquake-3292283",
  "paragraph": "By Clodagh Kilcoyne LONDON (Reuters) - When a devastating earthquake struck Turkey in the early hours of Feb. 6, 2023, the five-storey building in Hatay where 13-year-old Mehmet Koc lived collapsed, burying him in rubble and killing his older brother Emre, 14, and his mother Didem. Mehmet survived. But it took 76 hours before rescuers could pull him from the mound of concrete and twisted metal that remained of his home. Later in hospital, doctors determined that his legs were so badly crushed and injured, both needed to be amputated just below the hip. Hearing of the earthquake in London where he lived and worked, Mehmet's father, Hasan, caught the next available flight to Turkey and travelled to Hatay, in the southeast, desperate for news of his family. The 58-year-old encountered a scene of utter destruction in the city and learned his wife and elder son had not survived, but Mehmet was alive and trapped. He stood vigil by the rubble with other relatives. Hasan could not speak to his son himself, but passed messages to a teenage neighbour, Hayrettin, trapped closer to the surface, whose words could reach Mehmet, and who talked to him to keep him awake as rescuers came closer. Speaking in hospital in Turkey last February, Mehmet said \"I was yelling 'help'. Our neighbour Hayrettin was telling me when to yell and I was yelling for help when he told me to.\" \"I did not feel or think anything when I was rescued, I was confused. I wanted water when they rescued me. My family was waiting for me outside and I saw them right after I was pulled out from the rubble,\" he continued, adding he had no sense of how long he had been trapped. Doctors in Turkey said that if he had reached them just one hour later he could have died. Mehmet spent two months in Turkey in hospital, before being well enough to fly to Britain. Hasan, who first came to Britain in the 1990s and holds British citizenship as does Mehmet, found his son's crumpled British passport in the rubble. A year on, father and son live together in Hasan's small flat in Hackney, east London, both grieving for their loved ones and gradually coming to terms with the tragedy. \"We are trying to get used to life,\" said Hasan. \"Mehmet started school and is getting better. He is supporting me now, he tells me 'dad, we cannot bring them back or change what happened. Let's forget about it all and move on'.\" Looking after his son, managing his many medical appointments and applying for support and social services is a huge task. Friends within the local Turkish community help where they can but Hasan gave up his job as a school caretaker to look after him. \"I am very sad but I try not to show it when I am around him. He is very brave and he supports me a lot,\" he said. (For the photo essay, click on ) LONDON LIFE Mehmet is being treated at the Royal National Orthopaedic Hospital, an hour's drive across London from his home. He has received prosthetic legs, and in hospital he practises taking steps and doing exercises to build his strength. The legs however are a struggle to get used to, they take time to fit correctly, and as he grows they will need to be frequently adjusted. He may also face more surgery. Doctors estimate it requires 300% more energy to walk across a flat surface with bilateral above-knee prosthetics than natural walking, and for children it is particularly hard. Mehmet enjoys playing computer games and stays in touch with Turkish school friends, and speaks to relatives in Turkey, including his grandmother. He has always loved football. He says his favourite English team is Manchester City, and Norwegian striker Erling Haaland is a particular hero. He has now started at a school in London, after having been visited by a teacher at home, arranged by the local council. \"It has been lovely teaching Mehmet and getting to know him better,\" said Simon Joseph, a medical needs tuition teacher at Hackney Council. \"Over the weeks his warm and friendly nature has emerged more and more. He has a wonderful sense of humour, especially when it comes to trying out new words in English.\" \nTurkey's deadliest earthquake in modern times killed more than 50,000 and left hundreds of thousands with life changing injuries. In Syria it killed some 5,900. Turkish President Tayyip Erdogan has pledged to rebuild homes and cities, but the World Health Organization has warned the psychological stress for those caught up in the disaster is immense."
}