{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0C01F_L.jpg",
  "title": "Analysis-Did the US just get lured into war with the Houthis?",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 13, 2024 01:02AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/analysisdid-the-us-just-get-lured-into-war-with-the-houthis-3273897",
  "paragraph": "By Phil Stewart and Idrees Ali WASHINGTON (Reuters) - U.S. President Joe Biden's blistering strikes on Yemen followed weeks of warnings to the Houthis to stop attacking Red Sea shipping - or else. Yet the Houthis continued firing drones and missiles, seemingly goading the United States to follow through on its threats. That has raised a question for some experts: Did the Houthis want a war with America? And if so, why? Gerald Feierstein, a former U.S. ambassador to Yemen, is among those who think the United States has given the Houthis exactly what they wanted: a fight. \"Absolutely they have been trying to provoke U.S. retaliation,\" Feierstein told Reuters. \"They've been confident that they could withstand whatever we were going to do. They have seen they win popular support.\" The Houthis, who have controlled most of Yemen for nearly a decade, said five fighters had been killed in a total of 73 air strikes. They vowed to retaliate and continue their attacks on shipping, which they say are intended to support Palestinians against Israel, a popular cause in Yemen. The U.S. military said late on Friday it had launched another strike targeting a radar site. After the initial U.S. and British strikes, drone footage on the Houthis' al-Masirah TV showed hundreds of thousands of people in Sanaa chanting slogans denouncing Israel and the United States. Crowds gathered in other Yemeni cities as well. Experts say much of the Houthi confidence comes from having resisted years of attacks from Saudi Arabia. But a U.S.-led campaign against the group could be very different. U.S. Lieutenant General Douglas Sims, the director of the Joint Staff, told reporters on Thursday that the strikes hit 28 locations with more than 150 munitions. Reviewing the damage, he said he hoped the Houthis would not invite that kind of destruction. \"My guess is if you were operating a ballistic missile launcher last night, you certainly didn't want the strike. But, no, I would hope they didn't want us to strike,\" Sims said. MOUNTAIN FIGHTERS Abdul Malik al-Houthi, the enigmatic leader of Yemen's Houthi fighters, traces his lineage to the Prophet Mohammad. In pre-recorded speeches and sermons, he asserts that his movement is under siege because of its religion. Al-Houthi established a reputation as a fierce battlefield commander before emerging as head of the Houthi movement, mountain fighters who have been battling a Saudi-led military coalition since 2015 in a conflict that has killed tens of thousands, devastated Yemen's economy and left millions hungry. Under the direction of al-Houthi, who is in his 40s, the group has acquired tens of thousands of fighters and a huge arsenal of armed drones and ballistic missiles, largely supplied by Iran. Following the strikes, Sims and other U.S. officials acknowledged that the Houthis would probably make good on their threats to retaliate. On Friday, the Houthis fired an anti-ship ballistic missile into the Red Sea, the Pentagon said. A U.S. official, speaking on the condition of anonymity, said far from being deterred, the Houthis might see the likely low death toll among their fighters in the strikes as a success for the group, even if their capabilities have been degraded. \"Someone's definition of success really depends on their perspective,\" the official said. With tensions soaring, the price of Brent crude oil rose 1% on Friday on concern that supplies could be disrupted. Commercial ship tracking data showed at least nine oil tankers stopping or diverting from the Red Sea. MORE STRIKES? Michael Mulroy, a former deputy assistant secretary of defense for the Middle East under the Trump administration, said the Pentagon should prepare for additional military action. \"The U.S. should start planning to increase our response to further attacks in the Red Sea or Syria and Iraq,\" he said. \"And Iran's IRGC should be included in those targets,\" he added, using an acronym for Iran's Revolutionary Guard Corps. Iran champions the Houthis as part of its regional \"axis of resistance\" - a collection of Iran-backed groups that includes Palestinian militant group Hamas and militia in Iraq and Syria. The United States accuses Iran of enabling the Houthi Red Sea attacks, providing the military capabilities and intelligence to carry them out. The Houthis deny being puppets of Tehran and say they are fighting a corrupt system and regional aggression. Still, Feierstein cautions that the Houthi defiance of the United States and its allies helps burnish their brand in the Middle East, a concern shared by some current U.S. officials. \n\"Regionally, it raises the Houthi profile. It puts them in the first rank of Iranian affiliates in the 'Axis of Resistance,'\" Feierstein said. \"We shouldn't give the Houthis what they want, which is exactly what we did.\""
}