{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0709Z_L.jpg",
  "title": "Blinken meets Arab leaders in diplomatic push over Gaza war",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 08, 2024 04:22AM ET",
    "Updated Jan 08, 2024 03:12PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/blinken-meets-arab-leaders-in-diplomatic-push-over-gaza-war-3268934",
  "paragraph": "3/3\n© Reuters. U.S. Secretary of State Antony Blinken walks to meet with Qatar's Prime Minister and Foreign Minister Sheikh Mohammed bin Abdulrahman Al Thani, during Blinken's week-long trip aimed at calming tensions across the Middle East, in Doha, Qatar, January 7, 20\n2/3\nBy Simon Lewis ABU DHABI/AL ULA, Saudi Arabia (Reuters) -U.S. Secretary of State Antony Blinken said on Monday after meeting with the leaders of Saudi Arabia and Abu Dhabi that countries in the region were interested in pursuing normalization of relations with Israel but that it will require a clear path toward a Palestinian state. \"There's a clear interest in the region in pursuing that but it will require that the conflict end in Gaza and it will also clearly require that there be a practical pathway to a Palestinian state,\" Blinken said. \"But the interest is there, it's real, and it could be transformative.\" Four Arab states have formalized ties with Israel in pacts known as the Abraham Accords -- the United Arab Emirates, Bahrain, Sudan and Morocco. U.S. negotiations aimed at reaching a deal normalizing relations between Israel and Saudi Arabia were halted when the Gaza conflict erupted in October.  Blinken, speaking to reporters in Saudi Arabia after meeting with Crown Prince Mohammed bin Salman in the oasis town of Al Ula, said he discussed the region's future and there was broad agreement on a few objectives. Those included that the West Bank and Gaza should be united under Palestinian-led governance and that the region needs to work toward normalizing ties, not division or conflict. \"For that to happen, we need to see the establishment of an independent Palestinian state,\" Blinken said. Blinken is on his fourth trip to the region since October and holding more talks with Arab leaders as part of a diplomatic push to stop the war in Gaza spreading further. Earlier on Monday Blinken met with Abu Dhabi’s ruler, Sheikh Mohammed Bin Zayed Al Nahyan, in the United Arab Emirates. Blinken visited Jordan and Qatar on Sunday, and sought to reassure Arab officials that the United States opposes the displacement of Palestinians outside Gaza, and instead wants Israel’s Muslim majority neighbors to play a role in the Strip’s future governance. While on the trip, Blinken is asking states to try to reduce tensions that have already sparked violence in the Israeli-occupied West Bank, Lebanon, Syria and Iraq and led to Houthi attacks from Yemen on Red Sea shipping lanes.  \"Everywhere I went, I found leaders who are determined to prevent the conflict that we are facing now from spreading,\" Blinken said. He also said that countries expressed willingness to help Gaza stabilize and revitalize, adding that Washington would work with them on what that would require and what countries are prepared to do. Blinken has been joined by U.S. Special Envoy for Yemen Tim Lenderking as Washington seeks regional support for actions to counter the attacks by the Iran-aligned Houthis on commercial shipping. The U.S. has struck Houthi vessels and gathered an international coalition of more than 20 countries to participate in efforts to safeguard ships in Red Sea waters near Yemen, much of which is controlled by the Houthis. The Houthi attacks and the Western response have put new strains on ceasefire and peace talks that have largely quelled fighting in Yemen more than eight years after a Saudi-led coalition intervened against the Houthi movement. Blinken is set to end the day in Israel, where he will meet officials on Tuesday. He said he would share with Israeli leaders what he has heard in his meetings so far and discuss the future of Israel's military campaign in Gaza. \n\"I will press on the absolute imperative to do more to protect civilians and to do more to make sure that humanitarian assistance is getting into the hands of those who need it,\" he said. He will also focus on efforts to bring back hostages, Blinken said, as well as how the U.S. sees the future for the region."
}