{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0O0AV_L.jpg",
  "title": "China slams US 'provocation' in Taiwan Strait, pledges further drills",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 25, 2024 04:31AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/china-slams-us-provocation-in-taiwan-strait-pledges-further-drills-3282513",
  "paragraph": "© Reuters. FILE PHOTO: U.S. and Chinese flags are set up before a meeting between U.S. Treasury Secretary Janet Yellen and Chinese Vice Premier He Lifeng at the Diaoyutai State Guesthouse in Beijing, China, Saturday, July 8, 2023. Mark Schiefelbein/Pool via REUTERS/\nBEIJING (Reuters) - China criticised the United States on Thursday for causing \"trouble and provocation\" after the U.S. Navy sailed its first warship through the sensitive Taiwan Strait since presidential and parliamentary elections on the island. China claims democratically governed Taiwan as its own and has never renounced the use of force to bring the island under its control. Taiwan says only the island’s people can decide their future. \"U.S. warships and planes have caused trouble and provocation on China's doorstep, and carried out large-scale, high-frequency activities in waters and airspace around China,\" Chinese Defence Ministry spokesperson Colonel Wu Qian told reporters at a monthly briefing. The U.S. Navy said the destroyer USS John Finn transited through a corridor in the Taiwan Strait that was \"beyond the territorial sea of any coastal state\". Wu said China's response in driving away the ship was \"justified, reasonable, professional and restrained\". Wu added that China's military will \"continue to organise relevant military operations\" around the Taiwan Strait on a regular basis as part of its training, as analysts predict frequent drills in the run-up to Taiwan President-elect William Lai's inauguration in May. When asked about a potential meeting between newly appointed Chinese Defence Minister Dong Jun and his U.S. counterpart, Wu said China \"displays an open attitude to bilateral dialogues at all levels\", without confirming any meeting.  The Chinese and U.S. militaries held two days of talks in Washington earlier this month after both sides resumed high-level military contact last autumn. Pentagon officials say communication between the two militaries is key to preventing a miscalculation from spiralling into conflict. Separately, on the Philippines' plans to reinforce construction in the contested Spratly Islands, Wu accused Manila of \"violating China's sovereignty and making provocations in the South China Sea\" while \"in collusion with external powers\". On the India-China border dispute, Wu said border tensions were \"an issue left over from history and not the whole of China-India relations\", and said it was \"unwise and inappropriate\" for New Delhi to link the issue to bilateral relations. \nA senior Indian official told Reuters this month that India could ease its heightened scrutiny of Chinese investments if the two countries' border remained peaceful, the first signal that the four-year-old curbs could be lifted. China also denied that it has provided any weapons or equipment to the Middle East conflict, after reports that the Israeli military had found Hamas militants used Chinese-made weaponry in the Gaza Strip."
}