{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0C027_L.jpg",
  "title": "Ukraine attacked overnight by 40 Russian missiles, drones- air force",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 13, 2024 03:35AM ET",
    "Updated Jan 13, 2024 12:36PM ET"
  ],
  "comments": [
    2,
    [
      [
        "Barry Nickerson",
        "2024-01-13 11:16:46",
        "I'd say that the hotel in the picture just lost a star in the AAA guide book.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Brad Albright",
        "2024-01-13 15:30:49",
        "Aren't you funny.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Ken Roth",
        "2024-01-13 09:50:14",
        "And russia still a veto right in UN security council while they are in fact a major security treat to world peace…UN needs to do something",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/ukraine-suffers-mass-russian-missile-attackofficials-3273901",
  "paragraph": "© Reuters. A view shows a site of Park Hotel destroyed during a Russian missile strike, amid Russia's attack on Ukraine, in central Kharkiv, Ukraine January 11, 2024. REUTERS/Vyacheslav Madiyevskyy/File Photo\n(Reuters) -Ukraine suffered a large Russian missile attack in the early hours of Saturday, while its air defences were able to down a far lower proportion of them than usual. According to Ukraine's air force, Russia launched 37 missiles and three drones. Eight missiles were downed, it said in a statement on social media. The air force's spokesperson said earlier this week that Ukraine was now suffering from a deficit of air defence missiles. It was not immediately clear whether this or any other factor was the reason for the low hit rate. Most of the types of missile used overnight were extremely fast-moving ballistic types, the air force said. These are far harder to shoot down.  \"It should be noted that more than 20 of all the listed (weapons) which were not included in the number of the downed, did not reach their targets as a result of active countermeasures by electronic warfare,\" the statement said. There were no details on the targets of the strike. Air defences shot down Russian missiles in at least five regions across Ukraine, according to local officials from those provinces.  The large south-eastern city of Dnipro was struck, the local governor said, also without providing detail as to what was hit. \nPolice in the northern region of Chernihiv posted a picture of a large crater made by a downed missile. \"As a result of being hit by the debris of an enemy missile, several private homes and non-residential buildings were damaged, one building was practically destroyed,\" the police wrote. No people were hurt but a dog was killed, police said."
}