{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK150KO_L.jpg",
  "title": "Trump's sweeping immunity claim rejected by US appeals court",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 06, 2024 10:12AM ET",
    "Updated Feb 06, 2024 05:57PM ET"
  ],
  "comments": [
    5,
    [
      [
        "Tre Hsi",
        "2024-02-07 15:02:57",
        "Trump legal dream team in action once again.....",
        "https://www.investing.com/members/203741693"
      ],
      [
        "Ken Roth",
        "2024-02-07 02:15:43",
        "Finally they decided the obvious, crminal cases can now begin. Start preparing the cell in D block the proud boys will be having a fellow inmate soon.",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Mark Jannetty",
        "2024-02-06 17:39:13",
        "like communist district of Columbia would rule any other way. Politicized legal system is the reason companies like Tesla will move their companies to states with sanity",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Brad Albright",
        "2024-02-06 18:18:34",
        "LOL. The unanimous decision was issued by two judges appointed by a Democrat and one appointed by a Republican. But keep treading further into your conspiracy bubble in order to confront the truth about your conman god.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Ken Roth",
        "2024-02-07 03:46:34",
        "Sorry Mark you simply cant win can you? Maybe its because you refuse to understand the real world or you are simply a sick F…",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Brad Albright",
        "2024-02-06 16:18:08",
        "\"I just want to find eleven thousand seven hundred and eighty votes, which is one more than we have,\" is not an official act.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Brad Albright",
        "2024-02-06 16:15:22",
        "D'uh! So much winning.",
        "https://www.investing.com/members/236251128"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/trump-not-immune-from-election-subversion-charges-us-appeals-court-rules-3294163",
  "paragraph": "© Reuters. FILE PHOTO: Former U.S. President Donald Trump attends the closing arguments in the Trump Organization civil fraud trial at New York State Supreme Court in the Manhattan borough of New York City, U.S., January 11, 2024. REUTERS/Shannon Stapleton/File Pho\nBy Andrew Goudsward WASHINGTON (Reuters) -Donald Trump does not have immunity from charges he plotted to overturn his 2020 election defeat, a federal appeals court ruled on Tuesday, bringing the former U.S. president a step closer to an unprecedented criminal trial.  A three-judge panel of the U.S. Court of Appeals for the District of Columbia Circuit rejected Trump’s claim that he cannot be prosecuted because the allegations relate to his official responsibilities as president. \"We cannot accept that the office of the Presidency places its former occupants above the law for all time thereafter,\" the unanimous panel wrote.  The court concluded that any executive immunity that may have shielded Trump from criminal charges while he served as president \"no longer protects him against this prosecution.\"  The ruling, which Trump vowed to appeal, rebuffs his attempt to avoid a trial on charges that he undermined American democracy and the transfer of power, even as he consolidates his position as the frontrunner for the Republican presidential nomination.  A Trump campaign spokesperson said the ruling \"threatens the bedrock of our Republic.\" \"Without complete immunity, a President of the United States would not be able to properly function!\" the spokesperson, Steven Cheung, said in a statement. He said Trump would appeal, but did not say whether he would first ask the full D.C. Circuit Court to review the ruling or go directly to the U.S. Supreme Court. A spokesperson for Special Counsel Jack Smith, who is leading the prosecution, declined to comment. The case will remain paused until at least Monday to give Trump time to appeal to the U.S. Supreme Court. Trump’s lawyers argued that former presidents were entitled to sweeping legal protections and could not be criminally prosecuted for official actions unless first impeached by the House of Representatives and removed from office by the Senate. Trump was impeached twice by the House, but each time Senate Republicans cast sufficient votes to acquit him of the charges. IMMUNITY FOR ASSASSINATION Judges homed in on the broad nature of Trump’s claim at a Jan. 9 hearing, questioning a Trump lawyer over whether even a president who ordered military commandos to assassinate a political rival could escape criminal prosecution without initial action by Congress. The panel wrote in its ruling that giving Trump immunity in this case would give presidents \"unbounded authority to commit crimes that would neutralize the most fundamental check on executive power — the recognition and implementation of election results.\" The judges concluded there was no \"functional justification\" for giving former presidents full protection from federal prosecution even over actions related to their formal responsibilities.  Trump has repeatedly voiced his immunity claim on the campaign trail and social media, warning that his future administration could prosecute President Joe Biden, his likely opponent in the November election, if he returned to the White House. The indictment brought by Smith accuses Trump of using false claims of voter fraud to pressure state lawmakers, Justice Department officials and then-Vice President Mike Pence to thwart the certification of the election results. It is one four criminal cases facing Trump and one of two alleging interference in the 2020 election.  Trump has pleaded not guilty to four felony counts and accused prosecutors of a politically motivated effort to damage his campaign. The immunity argument was previously rejected by U.S. District Judge Tanya Chutkan in December, prompting Trump to appeal.  \nHis appeals have already delayed the start of his trial, which had been scheduled to begin on March 4. Chutkan has removed that date from the court calendar and not yet set a new start date. If Trump wins the election, he could seek to pardon himself or direct the Justice Department to shut down the case."
}