{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0H0PR_L.jpg",
  "title": "Top US diplomat Blinken to discuss security challenges during West Africa trip next week",
  "category": "General",
  "publisher": "Reuters",
  "date": [
    "Published Jan 18, 2024 11:13AM ET",
    "Updated Jan 18, 2024 11:45AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/general/top-us-diplomat-blinken-to-discuss-security-challenges-during-west-africa-trip-next-week-3277576",
  "paragraph": "© Reuters. U.S. Secretary of State Antony Blinken arrives for the 54th annual meeting of the World Economic Forum in Davos, Switzerland, January 16, 2024. REUTERS/Denis Balibouse/ File Photo\nBy Daphne Psaledakis and Humeyra Pamuk WASHINGTON (Reuters) - Security challenges in West Africa following the coup in Niger last year will be among key topics U.S. Secretary of State Antony Blinken will discuss with African leaders next week during his trip to the region, the State Department's top Africa diplomat said on Thursday. Blinken will travel to Cape Verde, Ivory Coast, Nigeria and Angola from Jan. 21 through Jan. 26, the department said in a statement, where he will discuss U.S.-African partnerships over trade, climate, infrastructure, health and other issues. Assistant Secretary of State for African Affairs Molly Phee told reporters the U.S. has a known record and hopes the junta in Niger will choose Washington over a partnership with Russia. \"If they chose to have a partnership with countries like Russia, that would be very complicated,\" Phee said. \"We have a demonstrated track record there that they're well aware of, and we hope they make the right decision.\" Phee pointed to Mali as an example, where she said there has been increased civilian casualties and security attacks since the government there invited in Russia's Wagner mercenary group. Russia and Niger, under military rule since a coup last year, have agreed to develop military cooperation, the Russian Defense Ministry said on Tuesday. Niger's junta has kicked out French troops and severed security pacts with the European Union, leaving Western allies concerned that the country could become a new foothold for Russia in the region. The military takeover in Niger was one of a series of coups or attempted power grabs over the past few years in West and Central Africa. Niger has been an important ally in Washington's fight against Islamist insurgents who have killed thousands of people in West Africa's Sahel region.  Tensions between Rwanda and Democratic Republic of Congo also will likely be a topic of discussion during Blinken's trip. \nThe trip is in part a follow-up to a summit in Washington with African leaders in 2022, Phee said, where U.S. President Joe Biden pledged that the U.S. was \"all in\" on Africa's future. Phee said on Thursday that Biden remained serious about his desire to travel to Africa but that had no plans to announce."
}