{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBL08S_L.jpg",
  "title": "Congo releases first provisional election results after messy vote",
  "category": "Commodities news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 22, 2023 05:49AM ET",
    "Updated Dec 22, 2023 04:36PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/commodities-news/congo-awaits-first-provisional-election-results-after-messy-vote-3262169",
  "paragraph": "By Ange Kasongo and Yassin Kombi KINSHASA/BENI (Reuters) -Democratic Republic of Congo on Friday released a few early results from general elections after an unscheduled day-long ballot extension that has prompted some opposition candidates to cry foul and call for a rerun. The provisional results from the few thousand voters in the Congolese diaspora showed President Felix Tshisekedi with a comfortable lead over challengers.  The CENI election commission said results cast within Congo by its around 44 million registered voters would be released from Saturday.  At a press conference in the capital Kinshasa, CENI President Denis Kadima again rejected criticism by the opposition and independent observers that the extended vote had been chaotic and lacked credibility. Disputed elections have often sparked unrest in Africa's second-largest country, which is also the world's third-largest copper producer and the top producer of cobalt, a key component in electric car batteries.  The presidential and legislative elections on Wednesday were derailed by delays in delivering election kits and malfunctioning equipment. People also struggled to find their names on registers, while violence disrupted the poll in other places. Highlighting the scale of the delays, small-scale protests broke out in eastern Lubero territory on Friday where a failure to deploy voting materials to remote areas had left 17,000 people still unable to vote. A CENI representative for Lubero told Reuters voting would take place on Saturday.  Commenting on the election for the first time on Friday, U.S. election monitoring group, the Carter Center, noted \"there was a lack of confidence in the process, stemming in part from previous elections, as well as from gaps in transparency, especially regarding the voter register\".  Voting for some was extended into Thursday, prompting five opposition presidential candidates to call for a new election, saying the extension was unconstitutional. Both opposition and Congolese independent observer groups have said voting unfolded in a way that could affect the credibility of results. The CENI set up a results centre in Kinshasa called Basolo - Truth in the Lingala language - where it says results from each polling station will be shared publicly as they come in. This has been a key demand of the opposition and civil society, who say the lack of transparency at previous elections enabled fraud. The CENI has set a Dec. 31 deadline for the release of full provisional results, but it is not clear if this will change due to the unexpected voting extension. The Carter Center called on the commission to post results at a local level and upload polling station results to its website to ensure the credibility of the process. Speaking on radio station Top Congo FM, the vice president of the commission, Didi Manara, said on Thursday the logistical setbacks on election day were out of the CENI's control and had nothing to do with bad planning. He noted that Congo had extended voting to a second day in parts of the country during the 2011 election. The tumultuous election day capped a campaign that was also marred by violence that led to the deaths of at least 19 people, according to figures from the Carter Center. Opposition presidential candidate Moise Katumbi, whose team has been monitoring the vote-count, said on Thursday that results so far showed him in the lead. \nThe observer mission from the Congo's powerful Catholic Church has deployed more than 25,000 observers to do its own compilation of election results. They did the same during the 2018 election, when they contested the results of the CENI's vote count. The vote will determine whether Tshisekedi serves a second term after a first five years in office marked by economic hardship and spiralling insecurity in Congo's rebel-plagued east."
}