{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0N0R2_L.jpg",
  "title": "Colombia inspector general suspends foreign minister for 3 months",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 24, 2024 02:03PM ET",
    "Updated Jan 24, 2024 03:41PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/colombia-inspector-general-suspends-foreign-minister-for-3-months-3282079",
  "paragraph": "© Reuters. FILE PHOTO: Colombian Foreign Minister Alvaro Leyva holds a news conference after attending an international conference on the political crisis in Venezuela, at Palacio de San Carlos in Bogota, Colombia April 25, 2023. REUTERS/Luisa Gonzalez\nBOGOTA (Reuters) -Colombia's inspector general on Wednesday suspended Foreign Minister Alvaro Leyva from his role for three months over possible irregularities in the tender process for producing passports in the Andean country. Leyva last year declared the bidding process void after just one company, Thomas Greg & Sons - which was already producing Colombian passports - tendered an offer. The government took emergency steps to ensure passports were produced, allowing Thomas Greg & Sons to continue printing them, while authorities prepared for a new tender round. \"The Foreign Minister could have incurred two disciplinary offenses, provisionally classified as very serious,\" the inspector general said in a statement.  The possible offenses include declaring the bidding process void and declaring the process urgent, without grounds to do so, the statement said. \"The minister could have overstepped his duties.\" Colombia's inspector general, who is authorized to investigate public officials and remove them, suspended Leyva over the accusations to avoid possible repeat offenses by the minister who would oversee any new bidding process, it said. Colombia's foreign ministry did not immediately respond to requests for comment. President Gustavo Petro told an audience in Cauca province the suspension was a strategy to stop his government.  \"It's going to cost us, they're going to suspend ministers here and there - we've lived it already,\" Petro said, referring to his time as mayor of Colombia's capital Bogota.  Thomas Greg & Sons filed a lawsuit against Colombia's government last year, seeking 117 billion pesos ($29.7 million) for the suspension of bidding for the passport contract. \nThe company declined to comment. ($1 = 3,934.62 Colombian pesos)"
}