{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBO03Z_L.jpg",
  "title": "In Christmas Day message, pope decries Gaza's 'appalling harvest' of civilian deaths",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 25, 2023 06:24AM ET",
    "Updated Dec 25, 2023 10:31AM ET"
  ],
  "comments": [
    2,
    [
      [
        "Tom Saltzman",
        "2023-12-25 13:23:18",
        "Level Gaza and then let them rebuild.",
        "https://www.investing.com/members/200520915"
      ],
      [
        "Otis Grant",
        "2023-12-25 13:04:31",
        "The armaments industry is not causing putin to attack Ukraine or Palestinian terrorists to attack Isreal. Thats not honest and imagine how bad dictators and terrorists would be if we lacked the capability to defend ourselves. We already saw what disarmament caused in 1939-1942 and it nearly cost western democracy everything ",
        "https://www.investing.com/members/251132356"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/in-christmas-day-message-pope-decries-gazas-appalling-harvest-of-civilian-deaths-3263240",
  "paragraph": "© Reuters. Palestinian flags are held as people gather to hear the traditional Christmas Day Urbi et Orbi message to the city and the world delivered by Pope Francis from the main balcony of St. Peter's Basilica at the Vatican, December 25, 2023. REUTERS/Yara Nardi\nBy Philip Pullella VATICAN CITY (Reuters) - Pope Francis said in his Christmas message on Monday that children dying in wars, including in Gaza, are the \"little Jesuses of today\" and that Israeli strikes there were reaping an \"appalling harvest\" of innocent civilians. In his Christmas Day \"Urbi et Orbi\" (to the city and world) address, Francis also called the Oct. 7 attack on Israel by Hamas militants \"abominable\" and again appealed for the release of around 100 hostages still being held in Gaza. Speaking from the central balcony of St. Peter's Basilica to thousands of people in the square below, he took another swipe at the armaments industry, saying it ultimately controlled the \"puppet-strings of war\". The 87-year-old Francis, celebrating the 11th Christmas of his pontificate, called for an end to conflicts, political, social or military, in places including Ukraine, Syria, Yemen, Lebanon, Armenia and Azerbaijan, and he defended the rights of migrants around the world. \"How many innocents are being slaughtered in our world! In their mothers' wombs, in odysseys undertaken in desperation and in search of hope, in the lives of all those little ones whose childhood has been devastated by war. They are the little Jesuses of today,\" he said. He gave particular attention to the Holy Land, including Gaza, where, according to Palestinian health officials, Israeli air strikes killed at least 78 people in one of the besieged enclave's deadliest nights of Israel's 11-week-old battle with Hamas. \"May it (peace) come in Israel and Palestine, where war is devastating the lives of those peoples. I embrace them all, particularly the Christian communities of Gaza and the entire Holy Land,\" Francis said. Speaking from the same balcony where he first appeared to the world on the night of his election on March 13, 2013, he said his \"heart grieves for the victims of the abominable attack of 7 October\" and again called for the release of hostages. 'APPALLING HARVEST'  \"I plead for an end to the military operations with their appalling harvest of innocent civilian victims, and call for a solution to the desperate humanitarian situation by an opening to the provision of humanitarian aid,\" he said. Last week, a U.N.-backed body said in a report that the entire 2.3 million population of Gaza was facing crisis levels of hunger and that the risk of famine was increasing every day. The Vatican, which has diplomatic relations with both Israel and the Palestinian Authority, believes a two-state solution is the only answer to the long-running conflict. Francis called for \"persevering dialogue between the parties, sustained by strong political will and the support of the international community\". Dedicating an entire paragraph of his message to the weapons trade, Francis said: \"And how can we even speak of peace, when arms production, sales and trade are on the rise?\" \nHe called for more investigation of the armaments trade. \"It should be talked about and written about, so as to bring to light the interests and the profits that move the puppet-strings of war,\" he said."
}