{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0801N_L.jpg",
  "title": "Norwegian mass killer Breivik says sorry, calls prison a 'nightmare'",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 08, 2024 09:07PM ET",
    "Updated Jan 09, 2024 03:04PM ET"
  ],
  "comments": [
    2,
    [
      [
        "Ken Roth",
        "2024-01-09 16:03:02",
        "The mass murderer belongs in isolation the rest of his life. He took the lives of 80 young people and he deserves nothing.",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Ken Roth",
        "2024-01-09 16:01:41",
        "The guy yearns for publicity at all time. He belongs in isolation with no outside contact to anybody considering his killing of 80 young people as a respect for the families who have lost so much.",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/mass-killer-breivik-to-testify-in-norway-in-bid-to-end-prison-isolation-3269923",
  "paragraph": "5/5\n© Reuters. Anders Behring Breivik and attorney Marte Lindholm attend a court hearing at Ringerike prison, in Tyristrand, Norway, January 8, 2024. Cornelius Poppe/NTB/via REUTERS \n2/5\nBy Gwladys Fouche TYRISTRAND, Norway (Reuters) - Norwegian mass killer Anders Behring Breivik told a court on Tuesday he was sorry for what he had done and broke down in tears as he said his life in prison isolation was a nightmare that left him considering suicide every day. The far-right fanatic who killed 77 people in a bombing and shooting rampage in 2011 is suing the state, arguing that his prison conditions, and a bar on communications with the outside world, violate his human rights. \"I don't think I can survive much longer without meaningful human relations,\" Breivik told the hearing, which has been set up in a gymnasium in his high-security jail. \"I am still a person and there is a limit to how much a person can take,\" he said, his voice breaking as he wiped his eyes. \"Every day is a nightmare. I consider suicide every day.\" Breivik killed eight people with a car bomb in Oslo and gunned down 69 others, most of them teenagers, on Utoeya island on July 22, 2011. He has been held in isolation ever since. Asked by government lawyer Andreas Hjetland what his thoughts were on Utoeya, Breivik said: \"I am sorry for what I did. I am willing to give up politics.\" Breivik has previously given mixed messages about how he regards his actions. He has said in the past that he did not regret what he did and at other times that he rejected all types of violence.  The lawsuit, now in its second day, has dragged Breivik back on to the front pages to the exasperation of many survivors and victims' families. Freddy Lie, father of two daughters who were at Utoeya in 2011 - one was shot dead, the other was wounded but survived - said Breivik was fishing for sympathy.  \"Crocodile tears. Playing to the gallery,\" Lie, who attended the court hearing on Tuesday, told Reuters. \"Let him sit where he sits. I personally hope he gets to be 100 years. Because now he is suffering ... He did not suffer before. He thought killing children was OK.  \"He is nothing more than a child killer.\" Ingrid Kragh Swang, whose son Kristian survived the attack on Utoeya, told public broadcaster NRK on Monday: \"We are sick and tired of this being brought up again and again. It wears us down and tears something up in us.\"  Breivik's lawyers argue Norway is breaching the European Convention on Human Rights, including sections saying no one should be subject to \"torture or to inhuman or degrading treatment or punishment\". Lawyers for the Justice Ministry say the curbs are necessary as Breivik remains a threat and could inspire others to commit violence. \"He sees himself as an ultra-nationalist. He is against multi-culturalism. He sees himself as the leader of a movement ... the leader of a project, and it is going as he wants it to - except for the limit on his correspondence,\" government lawyer Andreas Hjetland told the court \"And that is why he is bringing this case to the court.\"  As Hjetland spoke, Breivik shook his head, slowly, in disagreement at some of the lawyer's points.  Flanked by three prison guards, Breivik stood at the witness stand, rather than sit down as is customary in Norway, and consulted several sheets of notes. He wore a black suit, white shirt and brown tie. At the start of his witness statement he said his profession was head of a political party called Nordic State and of \"several other organisations I do not want to mention\". He said he was not dangerous himself, but had become a character online over which he no longer had control. \"It is a completely different person than me, it is a character I have lost control over and that is utilised by the far right,\" he said. \nThe case is scheduled to run until Friday. The judge's ruling will be issued in coming weeks. There is no jury. The jail is on the shore of Tyrifjorden lake, where Utoeya also lies."
}