{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBU00C_L.jpg",
  "title": "Israel pounds Gaza, Hamas fires rockets as Netanyahu indicates long war",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 30, 2023 07:49PM ET",
    "Updated Dec 31, 2023 06:29PM ET"
  ],
  "comments": [
    3,
    [
      [
        "Maximus Maximus",
        "2024-01-01 12:49:10",
        "stop the genocide.",
        "https://www.investing.com/members/204570756"
      ],
      [
        "Maximus Maximus",
        "2024-01-01 12:48:38",
        "netanyahoo and putin = wannabe hitlers",
        "https://www.investing.com/members/204570756"
      ],
      [
        "Tyrone Jackson",
        "2023-12-31 22:21:17",
        "Where are all the liberals from the UK and EU?\nThey should all be flying there and holding hands at the front.\nOr will they sit in the middle of the road in London with their blue hair and stop traffic??\n",
        "https://www.investing.com/members/220735724"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/netanyahu-says-israel-must-control-gazas-border-with-egypt-war-to-last-months-3264918",
  "paragraph": "3/3\n© Reuters. Israeli military operates near Gaza, amid a temporary truce between Hamas and Israel, in South Israel, November 30, 2023. REUTERS/Alexander Ermochenko\n2/3\nBy Nidal al-Mughrabi, Arafat Barbakh and Dan Williams CAIRO/GAZA/JERUSALEM (Reuters) -Israeli jets intensified attacks on central Gaza on Sunday, residents and medics said, as battles raged through the rubble of towns and refugee camps in a war Israeli Prime Minister Benjamin Netanyahu said would take \"many more months\" to end. Netanyahu's comments signal no let-up in a campaign that has killed many thousands and levelled much of Gaza, while his vow to restore Israeli control over the enclave's border with Egypt raises new questions over an eventual two-state solution. The Israeli military will release some reservists who were called up to fight Hamas in Gaza, a move it said on Sunday would help the economy as the country prepares for a prolonged war.  Air strikes pounded al-Maghazi and al-Bureij in the centre of Gaza, killing 10 people in one house and driving more to flee to Rafah on the border with Egypt from front lines where Israeli tanks are battling Hamas fighters. Rockets fired from Gaza raced toward central Israel overnight, triggering sirens throughout the central and southern parts of the country. Israeli media carried footage of numerous interceptions. There were no reports of any direct hits.  Hamas' armed wing said the barrage was in response to \"massacres against civilians\" in Gaza. A Red Crescent video published on Sunday showed rescuers working in the dark to carry an injured child from smoking rubble in central Gaza. Six people died in a strike on the village of al-Mughraqa outside Gaza City, health officials said. A separate strike on a house in Khan Younis killed one person and wounded others, they added. As 2023 drew to a close, Palestinians in Gaza prayed for a ceasefire but had little hope the new year would be better. “Tonight the sky in world countries will be lit by firecrackers, and joyful laughs will fill the air. In Gaza our skies are now filled with Israeli missiles and tank shells that land on innocent, homeless civilians,” said Zainab Khalil, 57, a resident from northern Gaza now in Rafah.  The stated goal of Israel's military is to eliminate Hamas, the Palestinian militant group that launched a surprise cross-border assault on Israeli towns on Oct. 7, killing 1,200 people, mostly civilians, and grabbing 240 hostages.  Israel's air and artillery bombardment has killed more than 21,800 people according to health authorities in Hamas-run Gaza, with many more feared dead in the rubble, and pushed nearly all of its 2.3 million people from their homes.  Palestinian health ministry casualty figures do not differentiate between fighters and civilians but the ministry has said that 70% of Gaza's dead are women and people under 18. Israel disputes Palestinian casualty figures and says it has killed 8,000 fighters.  Israel blockaded most food, fuel and medicine after the Oct. 7 attack. It said on Sunday that it was ready to let ships from some Western countries deliver aid directly to Gaza's shores after security checks in Cyprus.  Gemma Connell, an official with the U.N. humanitarian agency OCHA, said that many of the tens of thousands of people fleeing to Rafah had no possessions and nowhere to sleep.  \"I just am so fearful that the amount of deaths that we've been seeing is going to increase exponentially both because of this renewed offensive but also because of these conditions which are literally unbelievable,\" she said.  'WHERE WILL PEOPLE GO?' The United States, Israel's main ally, has urged it to scale down the war and European states have signalled alarm at the extent of Palestinian civilian suffering.  However Netanyahu's comments on Saturday, when he said he would not resign despite opinion polls showing his government is broadly unpopular and defended his security record despite the Oct. 7 attack, indicate that there will be no easing anytime soon.  Netanyahu said the \"the war is at its height\" and Israel would have to retake control of Gaza's border with Egypt, an area now crammed with civilians who have fled the carnage across the rest of the enclave.  Retaking the border could also constitute a de facto reversal of Israel's 2005 withdrawal from Gaza, raising new questions over the future of the enclave and prospects for a Palestinian state. Washington said Israel should allow a Palestinian government to control Gaza when the conflict is over. \"We just take a fundamentally different view here in terms of what post-conflict Gaza needs to look like,\" White House national security spokesperson John Kirby (NYSE:KEX) said on ABC television. Israel's hard-right Finance Minister Bezalel Smotrich fuelled concerns about the offensive's aims on Sunday by calling for Palestinians to leave Gaza and make way for Israelis who could \"make the desert bloom.\" That clashed with the official Israeli government position that Gazans will be able to return to their homes. Smotrich and other hardline coalition ministers have been excluded from the core war cabinet but have pushed to take part in decisions about the conflict. In his last comments as Israeli foreign minister before switching to the energy portfolio on Sunday, Eli Cohen said the border was the likely source of weaponry Hamas had obtained over recent years.  Senior Palestinian Authority official Hussein al-Sheikh in the Israeli-occupied West Bank said via social media that Israel taking over the border was evidence of a decision \"to completely return the occupation.\"  \"We moved here from Khan Younis on the basis that Rafah was a safe place. There is no space in Rafah as it is overcrowded with displaced,\" said Umm Mohammed, 45, a displaced Palestinian woman sheltering by the border.  \"If they control the border, where will people go?\" she asked, saying that would be \"a disaster.\" MAERSK CARGO SHIP ATTACKED The war risks morphing into a wider regional conflict involving Hamas ally Iran and groups Tehran supports across the Middle East.  Israel and Lebanon's Iran-backed Hezbollah have exchanged regular cross-border fire, with the Israeli military saying it struck targets in Lebanon on Sunday. Israel has hit Iran-linked targets in Syria. And Iran-backed groups have attacked U.S. targets in Iraq.  Yemen's Iran-aligned Houthi group, which has been attacking shipping in the Red Sea for weeks in what it calls a response to Israel's war in Gaza, attacked a Maersk cargo ship, the U.S. military said.  U.S. naval helicopters sank three of the four small boats the Houthis had used in Sunday's attack and drove the fourth back to shore, the military said.  \nIsrael says 174 of its military personnel have been killed in the Gaza fighting but that its operations are making progress, including by destroying some Hamas tunnels under the enclave.  Hamas and Islamic Jihad - both sworn to Israel's destruction - have said that they continue to target Israeli forces operating in the enclave."
}