{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0T0RE_L.jpg",
  "title": "NYC Council overrides mayor's vetoes of solitary confinement ban, policing bill",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 30, 2024 04:34PM ET",
    "Updated Jan 30, 2024 05:50PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Barry Nickerson",
        "2024-01-31 12:11:27",
        "NY City is in dire need of a couple of Paul Kersey's.",
        "https://www.investing.com/members/249373719"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/nyc-council-overrides-mayors-vetoes-of-solitary-confinement-ban-policing-bill-3287506",
  "paragraph": "© Reuters. FILE PHOTO: New York City Mayor Eric Adams speaks during a Lights for Liberty event demanding the release of the remaining 135 hostages held in Gaza, in Manhattan in New York City, U.S. December 13, 2023. REUTERS/David Dee Delgado\nBy Jonathan Allen NEW YORK (Reuters) -The New York City Council voted on Tuesday to override Mayor Eric Adams' vetoes of two bills it passed last month, one banning solitary confinement in city jails, the other requiring police to record lower-level investigative stops of civilians. In passing the bills with veto-proof majorities in December, lawmakers called solitary confinement cruel and torturous, and said it leads to heightened risks of injury or death for people in custody. The mayor and the labor union representing the city's jail guards argued the ban would make it more difficult to protect jail workers and detainees. Under the How Many Stops Act, police officers will have to record basic demographic information about people they question in low-level investigative stops, why they made the stop, and whether an officer used force against a person they questioned. In vetoing both bills this month, Mayor Adams, a Democrat, said the new reporting requirements would distract police officers from their jobs. Lawmakers in the Democrat-controlled council countered that the law amounted to an extension of existing reporting requirements that could be easily implemented by police. \"At a time when Black and Latino New Yorkers continue to be disproportionately subjected to unconstitutional stops that go underreported, and civilian complaints of misconduct are at their highest level in over a decade, the need for basic transparency is clear,\" Council Speaker Adrienne Adams, who is not related to the mayor, said in a statement.  The council voted 42-9 to override both vetoes, exceeding the two-thirds majority vote needed. In a statement after Tuesday's council vote, Mayor Adams, a former NYPD police officer, said the new laws will \"make New Yorkers less safe on the streets.\" \"Additionally, it will make staff in our jails and those in our custody less safe by impairing our ability to hold those who commit violent acts accountable,\" his statement said. The Police Benevolent Association, the main officers' labor union, said officers would comply with the new reporting law. \"Ultimately, it will be City Council members – not PBA members – who must answer for rising 911 response times and diminished police presence in our neighborhoods,\" PBA President Patrick Hendry said in a statement. Public defenders and civil rights groups praised both bills. \"Banning the dehumanizing practice of solitary confinement will save New Yorkers' lives,\" Donna Lieberman, the director of the New York Civil Liberties Union, said in a statement. \nUnder current \"punitive segregation\" rules, jail officials can punish detainees who are violent or otherwise break jail rules by isolating them in a cell for up to 23 hours a day for up to 60 days straight for the most serious infractions.  The new law reduces that to a maximum of four hours, with wellness checks by jail staff every 15 minutes. For serious infractions, detainees can be transferred to restrictive housing for up to 60 days in a single year."
}