{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "Russia and Ukraine exchange prisoners despite plane crash last week",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 31, 2024 08:36AM ET",
    "Updated Jan 31, 2024 12:07PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/russia-and-ukraine-say-they-have-completed-a-prisoner-exchange-3288391",
  "paragraph": "MOSCOW/KYIV (Reuters) - Russia and Ukraine said on Wednesday they had completed another large prisoner exchange despite the crash last week of a Russian military transport plane that Moscow says was shot down by Ukraine carrying Ukrainian PoWs en route to a similar swap. The two countries have carried out periodic prisoner swaps via intermediaries since the war began nearly two years ago, despite the absence of peace talks since the early months. The Russian Defence Ministry said each side had received 195 soldiers, while Ukraine said it had got 207 people back.  Russia's Foreign Ministry thanked the United Arab Emirates for helping broker the deal, adding in a statement that Russian soldiers would be flown to Moscow for medical and psychological treatment. The ministry said Wednesday's swap was originally intended to take place on Jan. 24, but was disrupted by Ukraine shooting down a Russian plane carrying Ukrainian prisoners to the exchange point with a ground-to-air missile killing all 74 people on board. The Il-76 transport plane was downed inside Russia's Belgorod region. President Vladimir Putin said on Wednesday that Kyiv had used a U.S. Patriot missile system to bring it down.  Ukraine has neither confirmed nor denied that it downed the plane, and has demanded proof of who was on board. Putin said Moscow would continue such exchanges and that Kyiv had indicated it was open to more. Ukrainian President Volodymyr Zelenskiy hailed the exchange on X: \"Our people are back. 207 of them. We return them home no matter what.\" Ukraine's state body in charge of PoWs said the 50th such exchange had brought home soldiers involved in defending the cities of Mariupol and Kherson as well as some captured by Russia on Snake Island in the Black Sea. \nIt said marines and combat medics were among the Ukrainians returned, with 36 injured or seriously ill. The latest and biggest exchange was on Jan. 3, when 478 captives were traded, also with UAE mediation."
}