{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0T0C4_L.jpg",
  "title": "China, US to cooperate on fentanyl, Beijing hopes for 'positive energy'",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 30, 2024 07:07AM ET",
    "Updated Jan 30, 2024 02:51PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/china-us-to-cooperate-on-fentanyl-beijing-hopes-for-positive-energy-3286875",
  "paragraph": "5/5\n© Reuters. Chinese Minister of Public Security Wang Xiaohong announces the launch of the U.S.-China Counternarcotics Working Group next to U.S. Deputy Assistant to the President and Deputy Homeland Security Advisor Jen Daskal at the Diaoyutai State Guesthouse in Bei\n2/5\nBEIJING (Reuters) -The U.S. and China launched a joint counter-narcotics working group on Tuesday in the first overt sign of cooperation in tackling the spread of fentanyl since late 2019, before bilateral relations between the superpowers soured. It follows a key summit in San Francisco in November where U.S. President Joe Biden and Chinese leader Xi Jinping agreed to work to curb fentanyl production and export, in a major breakthrough. Fentanyl is a highly addictive synthetic opioid 50 times more potent than heroin. The U.S. has said China is the primary source of the precursor chemicals synthesised into fentanyl by drug cartels in Mexico. China denies this. \"We had in-depth communication and were pragmatic. We reached common understanding on the work plan,\" China's Minister of Public Security Wang Xiaohong said at a joint address with the U.S. delegation before the group's inauguration in Beijing. He added that he hoped the two sides could accommodate each other's concerns and \"enhance and expand cooperation to provide more positive energy for stable, sound and sustainable China-U.S. relations\".  In Washington, White House national security spokesman John Kirby (NYSE:KEX) said both sides had committed to cooperate on increased law enforcement coordination to combat the distribution and export of precursor chemicals for the opioids, to address illicit financing and increase information sharing. \"So that's a good start, but it is just a start. And there's a lot more work to be done,\" Kirby said, adding there would be another set of meetings on Wednesday. TENSIONS Ties between the two countries have been tense in recent years over a range of issues including the origins of COVID-19, trade tariffs, Taiwan and human rights, hampering Washington's hopes of persuading Beijing to re-join its efforts to stop the flow of fentanyl into the United States.  In November 2019, in an unusual disclosure of Sino-U.S. cooperation in cracking down on fentanyl crimes, Chinese and U.S. law enforcement jointly announced that they had worked together to break up a fentanyl smuggling ring. But such cooperation on narcotics fizzled out when COVID-19 arrived, and multiple geopolitical headwinds pushed bilateral ties to their lowest in decades.  At their joint address to the media in Beijing, Jen Daskal, a deputy homeland security adviser at the White House, said Biden had sent a \"significant delegation\" to underscore the importance of the fentanyl issue to the American people.  \nWhen Biden met Xi last year in the United States, he told the story of the child of a friend in Delaware who died of a fentanyl overdose, Daskal said.  \"This was a deeply personal story of President Biden but it is unfortunately not a unique story in the United States,\" she said."
}