{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0F0SB_L.jpg",
  "title": "Woman accused of killing Russian war blogger says handler lied about bomb",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 16, 2024 01:07PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/woman-accused-of-killing-russian-war-blogger-says-handler-lied-about-bomb-3275495",
  "paragraph": "2/2\n© Reuters. FILE PHOTO: Darya Trepova, who is suspected in the killing of Russian military blogger Maxim Fomin, widely known by the name of Vladlen Tatarsky, is escorted inside a court building before a hearing in Moscow, Russia, April 4, 2023. REUTERS/Evgenia Novozh\n2/2\nBy Mark Trevelyan (Reuters) - A Russian woman accused of assassinating a prominent pro-war blogger told a court on Tuesday she had thought the package she handed to him in a St Petersburg cafe contained a listening device, not a bomb. Darya Trepova said she was acting under orders from a man in Ukraine whom she knew as \"Gestalt\" (German for \"Shape\"), who had been sending her money and instructions for several months before the killing of blogger Vladlen Tatarsky on April 2 last year. Russia accused Ukraine immediately after the attack of organising Tatarsky's murder. Senior Ukrainian officials have neither claimed responsibility nor denied involvement, with presidential aide Mykhailo Podolyak describing it as \"internal terrorism\". Tatarsky was killed by a bomb concealed in a statuette that Trepova handed to him in the cafe, where he was giving a talk to an audience of up to 100 people. The figurine was a crude likeness of Tatarsky, who accepted it as a present. Witnesses have told the trial that he jokingly called it \"Golden Vladlen\" and turned it over in his hands before it exploded, killing him on the spot and injuring dozens. Gestalt's identity remains unclear.  In testimony at her trial in St Petersburg on Tuesday, Trepova, 26, said she was introduced to him by a Ukraine-based journalist called Roman Popkov with whom she had connected on Twitter. She said she told Popkov that she opposed Russia's invasion and was sympathetic to Ukraine, and was looking for his help to come to Ukraine and work as a journalist herself. Russian investigators have accused Popkov in absentia of \"orchestrating the execution of a terrorist act\". He has denied any involvement. STATUETTE Trepova said that guided by Gestalt, she attended talks by Tatarsky in early 2023 and introduced herself to him, claiming to be an art student called Anastasia Kriulina.  In March, he sent her the statuette of Tatarsky by post, with instructions to hand it to him in person. She told the court it had occurred to her then that it might be a bomb and remembered the case of Darya Dugina, a pro-war journalist who died when her car was blown up near Moscow in 2022. \"I was very scared and asked Gestalt: 'Isn’t this the same as with Daria Dugina?' He replied that no, there was only a wiretap and a tracker,\" Trepova said, according to a transcript by independent Russian news outlet Mediazona. \"Handing over a listening device is already an invasion of privacy and is illegal, and I was very worried about this, and thought it might be a bomb.\" She said she went ahead because \"I didn't think they could set me up like this\", and assumed the purpose of eavesdropping on Tatarsky was to find out more of what he knew about the war in Ukraine, which she opposed. After the bomb went off, Trepova said, she called Gestalt to confront him. \"I swore at him and said that people were hurt there and I realised that they have done this and I was involved in it. I realised that the figurine had exploded,\" she said. \nTrepova said Gestalt told her she could ask questions later. \"I continued to swear. He said: 'When you come to Ukraine and visit us, you can hit me.' This made me very angry,\" she said tearfully."
}