{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK030NT_L.jpg",
  "title": "Blinken heads back to Middle East amid regional escalation fears",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 04, 2024 01:02PM ET",
    "Updated Jan 04, 2024 02:36PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/blinken-to-travel-to-israel-west-bank-in-weeklong-gaza-diplomacy-push--state-dept-3267598",
  "paragraph": "© Reuters. US Secretary of State Antony Blinken speaks to the media prior to departure from Al Maktoum International Airport in Dubai, on December 1, 2023. The United States remains \"intensely focused\" on freeing hostages held in Gaza despite the resumption of the I\nBy Simon Lewis, Daphne Psaledakis and David Brunnstrom WASHINGTON (Reuters) - U.S. top diplomat Antony Blinken will return to the Middle East on Thursday, continuing the Biden administration's intense diplomacy over Israel's three-month long conflict with Hamas, as fears of a broader regional conflagration grow. The U.S. secretary of state's weeklong trip - his fourth to the region since Hamas' deadly Oct. 7 attacks on southern Israel sparked a massive Israeli air and ground assault - will include visits to Israel and the West Bank, as well as Jordan, Qatar, the United Arab Emirates, Saudi Arabia and Egypt. He also will make stops in Turkey and Greece.  Blinken will repeat his calls to get more humanitarian aid into Gaza while attempting to make progress on the sensitive subject of how the Gaza Strip could be managed after the war, State Department spokesperson Matthew Miller told reporters. Blinken travels with concerns of regional escalation in the spotlight. After a drone strike on Tuesday killed Hamas deputy leader Saleh al-Arouri in the Lebanese capital Beirut, the leader of Iran-backed Hezbollah, which has exchanged fire with Israel from southern Lebanon, said his powerful Shi'ite militia \"cannot be silent.\" The U.S. military on Thursday carried out a retaliatory strike in Baghdad that killed a leader of a separate Iran-backed militia it blames for recent attacks on U.S. personnel, a U.S. official told Reuters. The conflict has also crept into vital Red Sea shipping lanes. The Iran-aligned Houthis, who control much of Yemen, have launched drones and missiles at more than 20 ships since Nov. 19. \"It is in no one's interest, not Israel's, not the region's, not the world's, for this conflict to spread beyond Gaza,\" Miller said, adding that Blinken would discuss unspecified steps the parties can take to avoid escalation. In response to Hamas' cross-border assault in which Israel says 1,200 people were killed and some 240 abducted, Israel unleashed a ground and air blitz that has killed 22,438 people, according to the Gaza health ministry. Visits to NATO allies Turkey and Greece are also on Blinken's agenda. Turkey is expected to soon approve Sweden's NATO membership, but its lengthy deliberation has frustrated Turkey's Western allies, including U.S. lawmakers who are holding up the sale of F-16 fighter jets until Ankara signs off on the addition to the alliance.  FUTURE OF GAZA Blinken is expected to revive U.S. appeals to Israeli leaders to reduce the impact of its operation in Gaza on civilians that has created what relief agencies have called a humanitarian crisis, and which threatens to turn public opinion against Israel. Israel stopped food, medicine, power and fuel imports into Gaza at the start of the war, and aid agencies warn the population is at risk of famine even as the blockade has been partially eased in response to requests from Washington. As on previous trips, Blinken will try to begin discussions on how Gaza will be run if and when Israel achieves its goal of eradicating Hamas, which has run the strip since 2007. \"We will discuss the need for combined governance that unites... the West Bank and Gaza under Palestinian leadership, but what the specifics look like I will keep for private diplomatic conversations,\" Miller said. Israel’s Arab neighbors have pushed back, insisting that securing a ceasefire should be the priority. U.S. officials have backed Israel in its rejection of genocide charges made at the International Criminal Court by South Africa, while pressing Israel to do more to protect civilians.  \nWashington this week criticized two Israeli ministers for advocating resettling Palestinians outside Gaza, saying Israel had assured U.S. officials the statements do not reflect policy. Miller acknowledged the challenges facing Blinken. \"We don't expect every conversation on this trip to be easy,\" he said."
}