{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0D07M_L.jpg",
  "title": "Denmark's King Frederik X appears before huge crowds after taking the throne",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 14, 2024 08:46AM ET",
    "Updated Jan 14, 2024 03:13PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Alan Pierce",
        "2024-01-14 18:28:24",
        "🧧🧧🧧My gratitude and praise to this team of SYLVIA GARCIA for bringing my life back on track when I thought 🛟🛟🛟 everything was gone, but with the help guidelines I was able to realized that the secret to making a million is saving for a better investment Get involve For more W/P 44 7 5 7 5 1 6 1 1 8 2✅✅✅",
        "https://www.investing.com/members/256295921"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/denmarks-king-frederik-x-takes-the-throne-as-his-mother-steps-down-3274107",
  "paragraph": "7/7\n© Reuters. People gather around a horse-drawn carriage which carries Danish Queen Margrethe on her way to Christiansborg Palace, on the day she abdicates after 52 years on the throne, and her elder son, Crown Prince Frederik, ascends the throne as King Frederik X, i\n2/7\nCOPENHAGEN (Reuters) -Denmark's King Frederik X ascended the throne on Sunday, succeeding his mother, Queen Margrethe II, who formally abdicated after 52 years as monarch, with large and admiring crowds gathered in the capital to witness history. Margrethe, 83, stunned the nation on New Year's Eve when she announced she planned to become the first Danish monarch in nearly 900 years to voluntarily relinquish the throne. The succession was formalized when Margrethe signed the declaration of her abdication during a meeting of the Council of State at parliament. After signing the declaration, the queen rose and gestured to Frederik to take her seat, and said \"God save the King\" before leaving the room. Denmark, one of the oldest monarchies in the world, does not have a coronation but there were still moments of pomp in the day's events. After the abdication, the new monarch, 55, was proclaimed king by Prime Minister Mette Frederiksen on the balcony of the parliament building, Christiansborg castle, with the words \"Long live his majesty King Frederik the 10th\". Wearing a ceremonial military uniform adorned with medals, Frederik addressed the crowd from the balcony. \"My hope is to become a unifying king of tomorrow. It is a task I have approached all my life. It is a task I take on with pride, respect and joy,\" he said. Visibly moved and several times wiping tears from his eyes, Frederik ended his speech with the words: \"United, committed, for the Kingdom of Denmark,\" his royal motto, a 500-year old tradition supposed to underpin a new monarch's reign. Frederik was joined on the balcony by his Australian-born wife Mary, 51, who is now queen, and their children: Christian, 18, who is the new heir to the throne, Princess Isabelle, 16, and 13-year-old twins Princess Josephine and Prince Vincent. The royal couple, who met in Sydney during the 2000 Olympic Games, kissed before leaving the balcony amid roaring cheers from the tens of thousands of people who had converged on the capital in close to freezing temperatures. \"They did so well. I think it was so nice that they ended with a kiss, the whole square was oozing with love and joy in that moment,\" said one woman who gave her name only as Marie. The new king and queen take the throne at a time of huge public support and enthusiasm for the monarchy in the nation of nearly six million.  \"It brought tears in a joyful way to see him do so well up on the balcony, both with his speech and when Mary came out and held his hands and finishing with a kiss,\" said Kasper Wiigh Larsen, 45. \"It has really been worth it to stand here and wait all day,\" he said.  Police closed several metro stations in central Copenhagen for security reasons to stop more people from entering the packed streets.  The new king and queen rode by horse carriage through the crowds back to their residence, Amalienborg, a royal complex built in the 1750s and located in central Copenhagen. \nThe royal family appeared later on the balcony of their residence to greet thousands of people below. The couple will continue to reside with Margrethe, who will retain her title as queen, in Amalienborg albeit in their respective palaces in the octagonal complex. Margrethe, who had said in the past she would remain on the throne for life, did not give a reason for her decision to step down but said that a major back surgery she underwent in February last year had made her consider her future."
}