{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBT001_L.jpg",
  "title": "Israel seeks full control of Gaza-Egypt border, Netanyahu says",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 29, 2023 07:07PM ET",
    "Updated Dec 31, 2023 04:48AM ET"
  ],
  "comments": [
    12,
    [
      [
        "Barry Nickerson",
        "2023-12-31 11:51:17",
        "Pretty soon it will all just be called Tel Gaza. Then, in another 1,000 years, geologists will dig into it and ponder on -what happened here?-",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Charles Manson",
        "2023-12-30 19:35:25",
        "\"Park that Tank at the Front Door!! Lots of great YouTube videos of the IDF Street Fighting. No Surrender, Total Defeat! Heard they lured a bunch of the \"Ham Bake\" brothers in a building and then called in an air strike on it...... BEAUTIFUL! Need to park a Food Truck, let it get swarmed by more \"Ham Bake\" supporters and call in another air strike. Gonna sleep well tonight. Gotta go take my car for an oil change, Later, Charles.\"",
        "https://www.investing.com/members/249519852"
      ],
      [
        "P Lance Sheldon",
        "2023-12-30 16:38:13",
        "Peace loving Palestinians should help to hasten the end of the war by doing what they can to aid Israel's defensive response. Want a \"cease fire today\"? Help destroy Hamas and their accomplices today.",
        "https://www.investing.com/members/255854011"
      ],
      [
        "Barry Nickerson",
        "2023-12-30 11:24:34",
        "Anyone notice that in the list of vaccines, there was no Covid jabs?",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Barry Nickerson",
        "2023-12-30 11:23:14",
        "Just like the weather reporters that have to get seen in the news for going out in the middle of a hurricane.   These dead and injured reporters are flocking into areas that are forewarned about getting bombed, and told to evacuate.  Darwinism at work.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Tom Saltzman",
        "2023-12-30 10:20:35",
        "Both sides are bad actors, and I don't care if they completely wipe each other out. We the United States have too many of our own problems to worry about.",
        "https://www.investing.com/members/200520915"
      ],
      [
        "Eric Beckerman",
        "2023-12-30 10:19:47",
        "BTW, \" Al Quds TV\" is the voice of Hezbollah. Another  Iran sponsored terror group dedicated to destroying Israel.",
        "https://www.investing.com/members/252390650"
      ],
      [
        "Peng Zhong Wong",
        "2023-12-30 10:17:00",
        "peace",
        "https://www.investing.com/members/236430529"
      ],
      [
        "Eman Smara",
        "2023-12-30 09:13:23",
        "massage Palestine",
        "https://www.investing.com/members/255917633"
      ],
      [
        "Sevde Arikan",
        "2023-12-30 08:58:39",
        "The truth can hurt somebody! ",
        "https://www.investing.com/members/244917379"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/fighting-between-israeli-forces-and-hamas-rages-after-nearly-200-killed-in-gaza-3264861",
  "paragraph": "© Reuters. Palestinians gather at the site of an Israeli strike on a house, amid the ongoing conflict between Israel and Hamas, in Rafah in the southern Gaza Strip, December 29, 2023. REUTERS/Fadi Shana\nBy Nidal al-Mughrabi, Arafat Barbakh and Dan Williams CAIRO/GAZA/JERUSALEM (Reuters) - Israel must take full control of the Gaza Strip border corridor with Egypt to ensure a \"demilitarisation\" of the area, Prime Minister Benjamin Netanyahu said on Saturday, as Israel's military pushed deeper into central and southern Gaza.  Speaking at a press conference, Netanyahu said: \"The Philadelphi Corridor - or to put it more correctly, the southern closing point (of Gaza) - must be in our hands. It must be shut. It is clear that any other arrangement would not ensure the demilitarisation that we seek.\" He did not elaborate. If accomplished, such a move would mark a de facto reversal of Israel's 2005 withdrawal from Gaza, placing the enclave under exclusive Israeli control after years being run by the Palestinian militant group Hamas.  Netanyahu's comments about the buffer zone came as Israeli military forces pressed ahead with an offensive that the prime minister reiterated will last \"for many more months.\"  Fighting was focused in al-Bureij, Nuseirat, Maghazi and Khan Younis, according to residents, and was backed by intensive air strikes that filled hospitals with wounded Palestinians.  The bombardment has killed 165 people and wounded 250 others in Gaza over the past 24 hours, Palestinian health authorities said.  At Nasser Hospital in Khan Younis, the biggest medical facility in the south of the crowded territory, a Red Crescent video showed paramedics rushing a tiny, dust-covered baby into a ward as one shouted \"there is breathing, there is breathing\".  Almost all Gaza's 2.3 million residents have been forced from their homes by Israel's 12-week assault, triggered after Hamas and allied groups killed 1,200 people and captured 240 hostages in a rampage in southern Israel on Oct. 7. The offensive has killed at least 21,672 Palestinians, according to health authorities in Gaza, with more than 56,000 injured and thousands more feared dead under the rubble.  Israel says 172 of its military personnel have been killed in the Gaza fighting. On Saturday, the armed wing of the Popular Front for the Liberation of Palestine said an Israeli soldier being held captive in Gaza by the group had been killed in an Israeli air strike that also wounded some of his captors.  A spokesperson for the group told Al Araby television the air strike followed a failed attempt by Israeli commandos to free the soldier.  The spokesperson gave no details of location or when the soldier had been taken captive. The Israeli military declined comment. FLEEING BOMBARDMENT The conflict risks spreading across the region, drawing in Iran-aligned groups in Lebanon, Iraq, Syria and Yemen, that have exchanged fire with Israel and its U.S. ally, or targeted merchant shipping.  Bombardment has smashed houses, apartment blocks, businesses and hospitals. On Saturday the Palestinian Culture Ministry said Israeli strikes had struck a medieval bathhouse. Gaza's Great Mosque was hit earlier in the war. Ziad, a medic in Maghazi in central Gaza, was fleeing with his three children to Rafah, on the border with Egypt. \"We want a ceasefire now,\" he said. \"Enough, more than enough, already.\" Israeli Defence Minister Yoav Gallant said on Friday troops were reaching Hamas command centres and arms depots. Pictures released by the military showed soldiers moving across churned-up earth among ruins of destroyed buildings.  The Israeli military said it had destroyed a tunnel complex in the basement of one of the houses of the Hamas leader for Gaza, Yahya Sinwar, in Gaza City. Troops also raided the Hamas military intelligence headquarters and an Islamic Jihad command centre in Khan Younis, and destroyed targets including a weapons foundry, a military statement said.  Hamas and Islamic Jihad - both sworn to Israel's destruction - said in separate statements their fighters destroyed and damaged several Israeli tanks and troop carriers in attacks across Gaza on Saturday. They also said they fired mortars against Israeli forces in Khan Younis and Al-Bureij as well as in northern Gaza. Israel's stated aim is to destroy Hamas and while the U.S. has called for it to scale down the war and move to targeted operations against the group's leaders, so far it shows no sign of doing so. VACCINES FOR GAZA Israel said on Friday it had facilitated the entry of vaccines into Gaza in coordination with UNICEF, the U.N. children's agency, to help prevent the spread of disease.  The little aid reaching the enclave since the start of the war, when Israel imposed a near total blockade on all food, medicine and fuel, has come across the border with Egypt.  Israel has only allowed access to the south of the enclave, where it started ordering all Gaza civilians to move from October, and aid agencies have said Israeli inspections have stopped all but a small fraction of needed supplies getting in. The Israeli government said it does not limit humanitarian aid and the problem was with distribution inside Gaza. Al-Bureij, Nuseirat and Khan Younis are three of eight camps set up in Gaza for some of the Palestinians who fled or were driven from their homes during Israel's creation in 1948. The camps have gradually become crowded urban areas after decades of building. Other Palestinian refugees live in camps in Lebanon, Syria, Jordan and the West Bank.  \nThe Gaza war has also stoked violence in the Israeli-occupied West Bank. On Saturday, Israeli troops shot a Palestinian motorist who tried to ram them near the West Bank city of Hebron, the army said. He was killed in the incident, the Palestinian health ministry said. A Palestinian journalist working for Al-Quds TV was killed along with some of his family members in an airstrike on their house in the Nuseirat camp in central Gaza Strip on Friday, health officials and fellow journalists said."
}