{
  "image": "https://i-invdn-com.investing.com/news/LYNXNPEC660AC_L.jpg",
  "title": "Stocks will fall 20-30% from a 2024 peak - JPMorgan",
  "category": "Stock market news",
  "publisher": "Investing.com",
  "date": [
    "Published Feb 08, 2024 07:06AM ET",
    "Updated Feb 08, 2024 08:47AM ET"
  ],
  "comments": [
    3,
    [
      [
        "Andy Mayr",
        "2024-02-08 13:53:46",
        "The bubble will burst soon. Especially since the Mag7 are carrying the S&P higher, with irrational PEs way above the norm, that earnings can't support. - I hear a crash",
        "https://www.investing.com/members/254649715"
      ],
      [
        "David Kumārajīva",
        "2024-02-08 13:43:44",
        "can I buy the JPM forecast reverse ETF?",
        "https://www.investing.com/members/255875154"
      ],
      [
        "didi aaa",
        "2024-02-08 12:32:57",
        "Just reminder to everyone.\n2022/10/13\n\"JPMorgan Chase & Co.’s boss Jamie Dimon says the US stock market could suffer another “easy 20%” drop\"\n2023/10/6\n\"JPMorgan’s top strategist warns stocks could be about to plummet 20%\"\nLOL",
        "https://www.investing.com/members/213935428"
      ],
      [
        "nirala stock",
        "2024-02-08 13:41:04",
        "that their business to create panic so that they can buy cheap",
        "https://www.investing.com/members/229085917"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/stock-market-news/stocks-will-fall-2030-from-a-2024-peak--jpmorgan-432SI-3297201",
  "paragraph": "JPMorgan equity strategists caution that the upside for global stock markets is now largely capped.\n“We stick to our view that upside from here appears limited and that equities will fall 20-30% from a 2024 peak,” strategists wrote in a note.\nDespite this bleak outlook, the strategists maintain a favorable view towards small caps, suggesting they present a more attractive investment opportunity compared to their larger counterparts in developed markets outside of Japan.\n“They could underperform by another 200-300 bps tops, but stand to deliver 34-59% of alpha over the coming 2-3 years,” analysts added.\nThe strategists highlight several concerning discrepancies in the market, signaling potential volatility and risk. These include an inverted yield curve that typically forecasts economic recession, yet earnings estimates are anticipating an acceleration in growth.\nThere's also a record divergence between the performance of small and large caps, indicating a risk-off environment, even as large caps reach new highs. Additionally, analysts point out the absence of a risk premium in U.S. equities, with earnings yields falling below the Federal Reserve's fund rates.\nAnother red flag is the historically low yield spreads, especially given the significant interest rate hikes by central banks – the most aggressive in over fifty years – at a time when corporate balance sheets are notably weaker than before the 2008 financial crisis.\n\"In our 25-year career, we have seen equity markets behave irrationally before and these were always times to act with caution as 2 + 2 ALWAYS ends up being 4,\" strategists concluded."
}