{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBU012_L.jpg",
  "title": "Russia has sentenced more than 200 captured Ukrainian fighters so far - Lavrov",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 30, 2023 09:22PM ET",
    "Updated Dec 31, 2023 02:15AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/russia-has-jailed-more-than-200-captured-ukrainian-fighters-so-far--lavrov-3264922",
  "paragraph": "© Reuters. FILE PHOTO: Russia's Foreign Minister Sergei Lavrov attends the Arab-Russian Cooperation Forum in Marrakech, Morocco, December 20, 2023. Russian Foreign Ministry/Handout via REUTERS \n(This Dec. 30 story has been corrected to tweak the headline into 'has sentenced' from 'has jailed') (Reuters) - Russian courts have sentenced more than 200 Ukrainian fighters to prison terms since Moscow started its military operation in Ukraine, Foreign Minister Sergei Lavrov said in an interview with the state RIA news agency published on Sunday.  \"The courts of the Russian Federation have already sentenced more than 200 representatives of Ukrainian armed formations to long terms of imprisonment for committing atrocities,\" Lavrov told RIA.  Both sides accuse each other of committing numerous atrocities in the war that Russia started with a full-scale invasion on Ukraine in February 2022.  The United Nations has found continued evidence of war crimes and human rights violations committed by Russian authorities, including torture, rape and the deportation of children. In March, the International Criminal Court (ICC) issued an arrest warrant for Russian President Vladimir Putin, alleging Moscow's forcible deportation of Ukrainian children is a war crime.  \"On our path to justice, the main result of the year is undoubtedly the arrest warrant issued by the International Criminal Court for Putin,\" Ukraine's Prosecutor General Andriy Kostin said in a statement on Saturday, summing up 2023. \"A historic decision and a clear signal that no one can be above the law.\" The Ukraine Prosecutor General's office has registered more than 121,000 Russian crimes of aggression and war crimes since the war started, according to its website. The UN has also found several cases of Ukrainian authorities committing violations of human rights of people they have accused of collaborating with Russian authorities. Lavrov told RIA that Russia's main investigative organ, the Investigative Committee, has initiated 4,000 criminal cases against about 900 Ukrainian individuals.  \n\"They include not only members of radical nationalist associations, representatives of Ukrainian security forces and mercenaries, but also representatives of the military and political leadership of Ukraine,\" Lavrov said. \"Those of them who were charged in absentia have been put on the international wanted list.\""
}