{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK090EH_L.jpg",
  "title": "Britain moves to quash wrongful Post Office convictions after historic miscarriage of justice",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 10, 2024 10:11AM ET",
    "Updated Jan 10, 2024 10:49AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/britain-moves-to-quash-wrongful-post-office-convictions-after-historic-miscarriage-of-justice-3271677",
  "paragraph": "By Sachin Ravikumar LONDON (Reuters) -The British government plans to introduce new legislation to overturn the wrongful convictions of hundreds of Post Office managers in one of the biggest miscarriages of justice in the country's history, Prime Minister Rishi Sunak said on Wednesday. Between 1999 and 2015, hundreds of self-employed sub-postmasters at branches of the state-owned Post Office - many of them at the heart of small communities and often run by family teams - were convicted of theft, fraud and false accounting because faulty computer software wrongly showed thousands of pounds missing from their accounts. Some sub-postmasters were jailed, hundreds of others saw their livelihoods destroyed, and several are reported to have committed suicide. A TV dramatisation aired at the start of the year has provoked public anger over their treatment and calls for executives and politicians to be held to account. While 93 convictions have been overturned, more than 800 others are yet to be quashed. Sunak told parliament that the new legislation will make sure that those wrongfully convicted are \"swiftly exonerated and compensated\". \"This is one of the greatest miscarriages of justice in our nation's history. People who worked hard to serve their communities had their lives and their reputations destroyed through absolutely no fault of their own,\" he said. Some legal experts have warned that the unprecedented step of legislating to have convictions quashed meant that politicians were meddling in the independent judicial process, potentially risking similar interference in the future on other issues. The normal process for anyone to have their conviction overturned in Britain is for the convicted party to lodge an appeal. However, the government and the main opposition have said the exceptional circumstances of the cases demanded an exceptional response. Under the plan, sub-postmasters will be able to sign a document to have their convictions reversed and claim compensation, the government said. About 138 million pounds ($176 million) has been paid to at least 2,700 claimants under three separate Post Office compensation schemes so far.  A public inquiry is expected to conclude later this year, while London police are conducting a separate investigation. Public anger over the scandal has erupted since  ITV  (LON:ITV)'s \"Mr Bates vs The Post Office\" was broadcast earlier this month. It is the most watched programme on any channel so far this year, with 9.2 million viewers tuning in, the broadcaster said. While questions have been raised about the role of Japan's Fujitsu, the maker of the defective Horizon software, politicians and former Post Office executives are also facing scrutiny. \nOn Tuesday former Post Office boss Paula Vennells, who oversaw many of the prosecutions of sub-postmasters, handed back a national honour after more than 1 million people signed a petition demanding she be stripped of it. ($1 = 0.7859 pounds)"
}