{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0B0SS_L.jpg",
  "title": "Explainer-Did Biden break the law by ordering Yemen airstrikes?",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 12, 2024 03:54PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/explainerdid-biden-break-the-law-by-ordering-yemen-airstrikes-3273810",
  "paragraph": "© Reuters. FILE PHOTO: U.S. President Joe Biden answers questions from the press at Nowhere Coffee Co. in Emmaus, Pennsylvania, U.S., January 12, 2024. REUTERS/Leah Millis/File Photo\nBy Patricia Zengerle WASHINGTON (Reuters) - Some members of the U.S. Congress have charged that President Joe Biden violated the Constitution by authorizing overnight strikes on Yemen. But provisions in U.S. law give the White House the authority to launch limited foreign military action, experts say. \"There's not actually a strong case to prevent Biden from this kind of action,\" said Michael O'Hanlon, director of research in foreign policy at the Brookings Institution. WHAT DID BIDEN DO? U.S. and British warplanes, ships and submarines launched dozens of airstrikes across Yemen in the early hours of Friday in retaliation against Houthi forces, who had carried out months of attacks on Red Sea shipping that the Iran-backed fighters cast as a response to the war in Gaza. The Biden administration informed Congress of the impending strikes, but did not seek its approval. WHAT DOES THE CONSTITUTION SAY? Several progressive Democrats who criticized Biden noted that Article 1 of the U.S. Constitution requires that Congress authorize war, not the president, one of the \"checks and balances\" that are a hallmark of the U.S. political system. But the Constitution's Article 2 designates the president as commander-in-chief of the armed forces and gives him the authority to use military force without congressional authorization for defensive purposes. Supporters of Biden's move say such defensive purposes would include responding to attacks on U.S. bases in Iraq and Syria and commercial ships in the Red Sea.  DID BIDEN VIOLATE THE WAR POWERS LAW? In addition to the constitutional provisions, the use of force is controlled by the War Powers Resolution, which Congress passed in 1973 as a check on presidential power in the wake of the Vietnam War. That resolution requires military actions without a declaration of war or specific legal authority to be terminated within 60 days. It also requires the president to provide to Congress within 48 hours of an attack a report on the circumstances that necessitated the action, the authority under which it took place, and the estimated scope and duration of the hostilities. WHAT HAPPENS NOW? Legal and security policy experts said the long-term response will depend on what happens on the ground. Repercussions are less likely if the conflict with the Houthis does not escalate and the administration keeps Congress informed. \"I think it's too early to tell the extent of the pushback from Congress on this,\" said Brian Finucane, a former State Department lawyer and senior adviser to the Crisis Group's U.S. program. \"I think the congressional response may change over time, particularly if there are further Houthi attacks on shipping in the Red Sea and if there are further strikes on Yemen,\" he said. Experts also noted that Congress can pass legislation reining in the president if it wants a greater say, given ambiguity in existing law. WHAT IS THE PRECEDENT? Congress passed a resolution to rein in the president's war powers in 2020 after then-President Donald Trump, a Republican, ordered a strike that killed top Iranian military commander Qassem Soleimani at Baghdad's airport without briefing Congress. Trump vetoed the resolution and the measure did not have enough support from his fellow Republicans for an override. \nAnd in 2011, then-President Barack Obama, a Democrat, authorized air strikes on Libya, then ruled by Muammar Qaddafi, without congressional approval. Obama later identified that decision as his worst mistake as president. The strikes helped lead to Qaddafi's overthrow, but left Libya deeply unstable."
}