{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "US, UK forces repel 'largest attack' by Houthis in Red Sea",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 09, 2024 09:35PM ET",
    "Updated Jan 10, 2024 10:48AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-uk-forces-shoot-down-houthi-missiles-drones-in-red-sea-us-military-3270827",
  "paragraph": "WASHINGTON/LONDON (Reuters) -U.S. and British naval forces shot down 21 drones and missiles fired by Yemen-based Houthis on Tuesday towards the southern Red Sea, the United States said, with Britain hinting at further measures to protect international shipping lanes. British Defence Secretary Grant Shapps said it was the largest attack in the area by the militants to date as the three-month-long war between Israel and Hamas in Gaza spills over into other parts of the Middle East. \"This is an unsustainable situation,\" Shapps told reporters, adding \"watch this space\" with regards to further possible action by Britain and its international partners.  \"This cannot continue and cannot be allowed to continue.\"  U.S. Central Command said no injuries nor damage were reported, adding that this was the 26th Houthi attack on commercial shipping lanes in the Red Sea since Nov. 19.  Later in the day, Houthi military spokesperson Yahya Saree said the Iranian-backed militants fired a large number of ballistic and naval missiles and drones at a U.S. ship that was \"providing support\" to Israel. In a televised speech, Saree did not say when the Houthi strike had occurred or what damage, if any, the vessel had suffered, but that the operation was a \"preliminary response\" to a previous U.S. attack that killed 10 Houthi fighters. The U.S. Fifth Fleet, which is based in the Gulf region and has along with Britain deployed naval forces to protect Red Sea shipping from an upsurge in Houthi attacks, did not immediately respond to a request for comment. It was not clear whether the missile and drone salvo against the U.S. ship reported by the Houthi official had anything to do with the U.S. and British naval action.  The Houthis, who control most of Yemen, have been targeting Red Sea shipping routes to show their support for Hamas, a Palestinian Islamist group. Germany's foreign ministry said the latest attacks were a \"clear escalation\". The attacks have seriously disrupted international commerce on the key route between Europe and Asia that accounts for about 15% of the world's shipping traffic.  Many shipping companies have been forced to reroute vessels, taking the longer journey around Africa, although several oil majors, refiners and trading houses have continued to use it. U.S. Central Command said 18 drones, two anti-ship cruise missiles and one anti-ship ballistic missile were shot down by the two navies in the incident on Tuesday. Shapps said that Royal Navy ship HMS Diamond, which repelled the attacks along with U.S. warships, may have been specifically targeted, adding there was also \"a generalised attack on all shipping\".  The Houthis have vowed to continue attacks until Israel halts the conflict in Gaza, and warned they would attack U.S. warships if the militia group itself was targeted.  \nGerman shipping group Hapag Lloyd said on Tuesday it would continue to avoid the Suez Canal and around the Cape of Good Hope for security reasons, while its Danish rival Maersk has said it would avoid the route \"for the foreseeable future\".  Retailers across the world have also been stocking up on goods before China's Lunar New Year holiday and seeking air or rail alternatives to avoid empty shelves this spring."
}