{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK020KY_L.jpg",
  "title": "Migrants from southern Mexico's dispersed caravan pin hopes on permits",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 03, 2024 02:08PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/migrants-from-southern-mexicos-dispersed-caravan-pin-hopes-on-permits-3266605",
  "paragraph": "3/3\n© Reuters. Karen, a 4-year-old migrant girl from Guatemala, is carried while crossing the Rio Bravo river with her family, the border between the United States and Mexico, with the intention of turning themselves in to the U.S. Border Patrol agents to request asylum\n2/3\nBy Jose Torres MAPASTEPEC, Mexico (Reuters) - Thousands of people from a 4,000-strong migrant caravan that has been crossing southern Mexico by foot since Christmas Eve dispersed on Tuesday as they boarded buses to processing centers where they are expected to apply for travel permits today. Buses provided by Mexican immigration authorities took the migrants to facilities in Huixtla, just 25 miles (41 km) north of the southern city of Tapachula near the Guatemalan border.  After migrants apply for a travel permit, Mexican authorities may provide free transit through Mexico for a year and then travel to the U.S. border, as well as other centers around Chiapas state. Early Wednesday, some 2,000 migrants from the caravan were still waiting for buses back down to Huixtla in Mapastepec, some 75 miles (120 km) north from the Guatemala border. Luis Garcia, who leads the caravan, said an agreement had been reached with Mexico's immigration head so that the migrants could obtain humanitarian passes and work permits. Mexican immigration authorities did not immediately respond to a Reuters request to comment on permits or an agreement. \"We're very happy because we've suffered a lot, we've been without food, with nothing, sleeping rough,\" said Diego Armando Zapata from Colombia. \"God-willing we'll get the bus and the permits so our family won't need to keep walking.\" Others expressed disappointment at being turned back. \"We're a little disappointed because we made some progress,\" said Paola Fuentes from Venezuela. \"With faith in God we'll reach the migration center and beg for the visas to move forwards.\" \n2023 year saw more than half a million migrants - double the previous year's record - cross the dangerous Darien Gap into Central America, many fleeing poverty, crime and conflict and hoping to gain entry into the United States. Mexican and U.S. officials have pledged to work more closely to curb numbers at their shared border and Mexican officials have stepped up enforcement, a senior U.S. official said Tuesday, including resuming deportation flights to Venezuela."
}