{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "Youngest US soldier killed in Jordan drone attack was 23",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 29, 2024 05:18PM ET",
    "Updated Jan 29, 2024 05:51PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Charles Manson",
        "2024-01-29 23:25:25",
        "So ...... With over 150+ strikes on targets in Iraq & Syria, it seems our beloved President wants to wait until troops are Killed before he takes action. Really? Like the City waits until children are killed before they put in a crosswalk, stop sign and crossing guard. No Plan here. Glad I'm not in the Service anymore. Too many Idiots at the top not knowing how to fight a War. Anyway, what a Lovely War. Charles.",
        "https://www.investing.com/members/249519852"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/youngest-us-soldier-killed-in-jordan-drone-attack-was-23-3286464",
  "paragraph": "WASHINGTON (Reuters) - The U.S. military on Monday released the names of the three Army Reserve soldiers killed in Sunday's drone attack by Iran-backed militants in Jordan, with the youngest victim just 23 years old. The names are:  * Sergeant William Jerome Rivers, 46, of Carrollton, Georgia * Specialist Kennedy Ladon Sanders, 24, of Waycross, Georgia * Specialist Breonna Alexsondria Moffett, 23, of Savannah, Georgia \"On behalf of the Army Reserve, I share in the sorrow felt by their friends, family, and loved ones,\" said Lieutenant General Jody Daniels, chief of the Army Reserve and commanding general of U.S. Army Reserve Command. \"Their service and sacrifice will not be forgotten, and we are committed to supporting those left behind in the wake of this tragedy, said Daniels.\" The attack on Sunday also wounded more than 40 troops when the drone slammed into the housing units early in the morning. It was the first deadly strike against U.S. troops since the Israel-Hamas war erupted in October and marks a major escalation in tensions that have engulfed the Middle East. \nThe United States is trying to determine exactly why the nearly 350 troops at the base in Jordan, known as Tower 22, were unable to stop the drone.  Two officials, speaking on condition of anonymity, said a U.S. drone was approaching the base around the same time the attack drone was incoming. One of the officials said the attack drone was also flying low, factors that may have contributed to it being missed by base defenses."
}