{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK160BY_L.jpg",
  "title": "Swedish central bank sees cuts ahead, but caution needed - minutes",
  "category": "Economy",
  "publisher": "Reuters",
  "date": [
    "Published Feb 07, 2024 04:46AM ET",
    "Updated Feb 07, 2024 04:52AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/economy/swedish-central-bank-sees-cuts-ahead-but-caution-needed--minutes-3294897",
  "paragraph": "© Reuters. FILE PHOTO: A general view of Sweden's central bank in Stockholm, Sweden, August 12, 2016. Picture taken August 12, 2016. REUTERS/Violette Goarant/File Photo\nBy Simon Johnson STOCKHOLM (Reuters) - Sweden's central bank could cut rates as early as the first half of this year, but there are risks that inflation might prove stubborn, delaying policy easing, the minutes of the central bank's most recent meeting, published on Wednesday, showed. The Riksbank kept its key interest rate unchanged at 4.00% on Feb. 1, but said it could start loosening policy much earlier than its previous forecast. The shift in policy reflects growing confidence among central bankers that inflation - which peaked in Sweden at over 10% at the end of 2022 - is now under control after a series of rate hikes.  The economy is slowing, while mortgage borrowers and commercial real estate firms are feeling the pinch from higher interest payments.  The central bank said it did not rule out a cut in the first half of this year and Deputy Governor Per Jansson said that could even come at the next meeting in March, though May or June were \"significantly more realistic\". \"The inflation outlook is favourable, which is why we expect the first rate cut in May and see the policy rate at 2.50% year-end 2024,\" Nordea said in a note. The positive message from the Riksbank was tempered by a note of caution, however. \"Experiences of previous episodes of high inflation clearly show the risks that can arise if the central bank lowers its guard too soon,\" Governor Erik Thedeen said. He said any monetary policy easing would be \"carried out with caution, and with a constant vigilance regarding the risk of setbacks\". The Riksbank is worried that companies still plan price hikes and that geopolitical tensions could hurt supply chains.  The weakness of the Swedish currency - which has lost ground against the euro since the Feb. 1 rate decision - is also a major concern.  \"If the krona weakens once again, caution would indicate taking a wait-and-see stance with regard to monetary policy,\" Thedeen said. Sweden's currency strengthened slightly against the euro after the minutes were published. \nMarkets have priced in a strong chance of a cut by June and for the policy rate to end the year around 3.00%. The Riksbank's next policy decision is published on March 27."
}