{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "Iran condemns US air strikes as violations of Iraqi, Syrian sovereignty",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Feb 03, 2024 06:10AM ET",
  "comments": [
    2,
    [
      [
        "Ken Roth",
        "2024-02-03 20:11:01",
        "We can only hope that Iran will attack US bases directly which would give us the right to end the mullahs regime.",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Patron Silver",
        "2024-02-03 15:28:57",
        "85 impressive",
        "https://www.investing.com/members/201354007"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/iran-condemns-us-air-strikes-as-violations-of-iraqi-syrian-sovereignty-3291879",
  "paragraph": "(Reuters) - Iran's foreign ministry on Saturday condemned overnight U.S. air strikes in Iraq and Syria as \"violations of the sovereignty and territorial integrity\" of the two countries. In Tehran's first response to the U.S. strikes, ministry spokesperson Nasser Kanaani said in a statement that they represented \"another adventurous and strategic mistake by the United States that will result only in increased tension in instability in the region\". The U.S. military launched air strikes against more than 85 targets linked to Iran's Revolutionary Guard (IRGC) and the militias it backs, in retaliation for last weekend's drone attack in Jordan that killed three U.S. troops. While the strikes did not target sites inside Iran, they signalled a further escalation of conflict in the Middle East from Israel's nearly four-month war on Hamas-ruled Gaza. Kanaani said the U.S. attacks were designed \"to overshadow the Zionist regime's crimes in Gaza\". He did not indicate if Iran would take any action in response. He urged the UN Security Council to prevent \"illegal and unilateral U.S. attacks in the region.\"  Before the U.S. retaliatory strikes on Friday, Iranian President Ebrahim Raisi said Iran would not start a war but would \"respond strongly to anyone who tries to bully it\". Kanaani said \"the root cause of tensions and crises in the Middle East is Israel's occupation and genocide of Palestinians with America's unlimited support\"."
}