{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0T0M0_L.jpg",
  "title": "Trump lawyer backs off idea that E. Jean Carroll judge had conflict",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 30, 2024 12:17PM ET",
    "Updated Jan 30, 2024 02:30PM ET"
  ],
  "comments": [
    2,
    [
      [
        "Brad Albright",
        "2024-01-31 13:51:32",
        "What? No!!!!!",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Ken Roth",
        "2024-01-30 20:17:42",
        "Alina Habba has proven to be a totally incompetent lawyer who has received payment for her useless lawyer services. She owes Trump a trip in the dressingroom where his fat fingers can wander without charges.",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/trump-attorney-claim-of-judges-conflict-utterly-baseless-carrolls-lawyer-says-3287323",
  "paragraph": "© Reuters. FILE PHOTO: E. Jean Carroll and her attorneys Shawn Crowley and Roberta Kaplan walk outside the Manhattan Federal Court, after the verdict in the second civil trial after she accused former U.S. President Donald Trump of raping her decades ago, in New Yor\nBy Luc Cohen and Jonathan Stempel NEW YORK (Reuters) -A lawyer for Donald Trump on Tuesday backed off her suggestion that the judge who oversaw E. Jean Carroll's two successful civil defamation trials against the former U.S. president might have had a conflict of interest. In a letter to U.S. District Judge Lewis Kaplan in Manhattan, Trump's lawyer Alina Habba said she was satisfied that the judge and Carroll's lawyer Roberta Kaplan, who is not related, did not have a \"mentor-mentee relationship\" when they worked at the same law firm three decades ago. Habba had on Monday suggested that such a relationship might have tainted the $83.3 million jury award that Carroll, a former Elle magazine advice columnist, won against Trump last Friday. She cited a Jan. 27 New York Post article that quoted an unnamed former partner at Paul, Weiss, Rifkind, Wharton & Garrison as saying Judge Kaplan had been \"like a mentor\" to Roberta Kaplan when both worked for about two years at the firm. In a letter on Tuesday, Roberta Kaplan called it \"utterly baseless\" to suggest there had been such a relationship, and said she might seek sanctions if Habba kept making \"false accusations of impropriety.\" Habba indicated that Kaplan's letter appeared to settle the matter. \"The point of my January 29 letter was to verify whether the information contained in the New York Post article is accurate,\" she wrote. \"Since Ms. Kaplan has now denied that there was ever a mentor-mentee relationship between herself and Your Honor, this issue has seemingly been resolved.\" A spokesperson for Roberta Kaplan declined to comment. Trump plans to appeal the $83.3 million verdict, which stemmed from his June 2019 denials that he raped Carroll in a Bergdorf Goodman department store dressing room in the mid-1990s. He is appealing a $5 million award to Carroll by a different jury last May, which found Trump liable for a similar October 2022 defamation and for sexual abuse. The first jury's findings were binding for the second trial, leaving the jury there to focus only on damages. \nTrump's legal team has argued that Carroll suffered no harm, and enjoyed the fame and attention her case drew. In Tuesday's letter, Habba stood by her comments that Judge Kaplan's \"overtly hostile\" treatment of Trump's side and \"preferential\" treatment of Carroll's side could also support an appeal."
}