{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0D0DL_L.jpg",
  "title": "North Korea says it tested solid-fuel hypersonic missile",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 14, 2024 04:56PM ET",
    "Updated Jan 14, 2024 09:27PM ET"
  ],
  "comments": [
    2,
    [
      [
        "Brad Albright",
        "2024-01-15 14:20:13",
        "By Trump's own admission, he wrote love letters to Kim. This is what happens when dictators are coddled.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Roger Miller",
        "2024-01-14 22:56:37",
        "The last President engaged with North Korea, even as the media had people believing he was going to start WWIII.  Now under the current Democrat White House regime regime we get this.",
        "https://www.investing.com/members/205083859"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/north-korea-says-it-tested-solidfuel-hypersonic-missile-3274159",
  "paragraph": "2/2\n© Reuters. Ballistic missile, said to be solid-fuel and hypersonic, launches during a test at an unspecified location in North Korea in this picture released by the Korean Central News Agency on January 14, 2024. KCNA via REUTERS\n2/2\nBy Hyunsu Yim SEOUL (Reuters) - North Korea on Sunday tested a new solid-fuel hypersonic missile with intermediate range, state news agency KCNA said on Monday, in a move that was condemned by the United States, South Korea and Japan. The launch was aimed at testing the reliability of new multi-stage, high-thrust solid-fuel engines and an intermediate-range hypersonic maneuverable controlled warhead, according to KCNA, which said the test did not pose a security threat to neighbouring countries. South Korea's military in a statement criticized the launch as a violation of U.N. Security Council resolutions and said direct provocations by the North would be met with its \"overwhelming response.\" Sunday's ballistic missile launch, the first by the North this year, was condemned by the nuclear envoys of South Korea, the U.S. and Japan, who said after a three-way phone call that North Korea's provocations were a root cause of instability in the region. The test occurred on the same day that a delegation led by Foreign Minister Choe Son Hui heading to Russia left Pyongyang, KCNA reported. The missile launch and the visit to Russia come amid growing tensions between the two Koreas following Pyongyang's series of intercontinental ballistic missile launches and its first military spy satellite, as well as deepening ties between Pyongyang and Moscow that have worried Washington and its allies. In a separate KCNA commentary on Monday, North Korea accused Seoul of escalating tensions in the region with military drills and armament calls by South Korean officials. \"Even a little spark can be a catalyst for enormous physical conflicts between the two most hostile countries,\" the commentary said. North Korea has recently announced changes to designate the South as a separate, enemy state, breaking with decades of policy, with leader Kim Jong Un saying peaceful reunification is no longer possible. Analysts have said the move could potentially help justify the use of nuclear weapons against Seoul in a future war. South Korea's military said Sunday's missile, launched from the area of Pyongyang at about 2:55 p.m. (0555 GMT), flew about 1,000 km (600 miles) off the country's east coast. Japan's defence ministry said the maximum altitude was at least 50 km (30 miles). Hypersonic missiles typically launch a warhead that travels at more than five times the speed of sound, or about 6,200 km per hour (3,850 mph), often manoeuvring at relatively low altitudes. \nDespite their name, analysts say the main feature of hypersonic weapons is not speed - which can sometimes be matched or exceeded by traditional ballistic missile warheads - but their manoeuvrability, which can help the warhead evade missile defences. Pyongyang had previously said it tested its new solid-fuel engines for an intermediate ballistic missile on Nov. 11 and Nov. 14."
}