{
  "image": "https://i-invdn-com.investing.com/news/moved_LYNXMPEHB508M_L.jpg",
  "title": "Bitcoin Whales Boost Holdings by $3 Billion, Pro-XRP Lawyer Highlights Key Factor in Ripple's Win, SHIB Price History Hints at Double-Digit Gains Next Month: Crypto News Digest by U.Today",
  "category": "Cryptocurrency news",
  "publisher": "U.Today",
  "date": [
    "Published Feb 04, 2024 01:57PM ET",
    "Updated Feb 04, 2024 06:00PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/cryptocurrency-news/bitcoin-whales-boost-holdings-by-3-billion-proxrp-lawyer-highlights-key-factor-in-ripples-win-shib-price-history-hints-at-doubledigit-gains-next-month-crypto-news-digest-by-utoday-3292114",
  "paragraph": "U.Today - Check out the top three news stories from the past weekend presented to you by U.Today.\nBitcoin whales boost holdings by $3 billionData provided by IntoTheBlock analytics firm shows a significant increase in Bitcoin whales' holdings; since the beginning of the year 2024, three major players have added approximately $3 billion to their Bitcoin stashes, or approximately 76,000 BTC. This trend indicates the confidence and investment strategy of the biggest holders in the crypto space. When analyzing smaller holdings over a 30-day period, the following changes are seen: accounts with 0-0.001 BTC increased by 1.02%, while those holding between 0.001-0.01 BTC and 0.01-0.1 BTC witnessed decreases of 1.90% and 1.36%, respectively. Notably, accounts with 10K-100K BTC experienced 2.88% growth, indicating a concentration of wealth at the higher end of the market. XRP advocate highlights key factor in Ripple's SEC winCoinbase (NASDAQ:COIN)'s CLO Paul Grewal and pro-XRP lawyer John Deaton have recently had a social media exchange, which shed light on a key point about Ripple's ongoing legal dispute with the SEC. Their discussion centered on the importance of the 1994 Second Circuit case, Revak v. SEC Realty. Grewal emphasized a key component that demonstrated the folly of defining an investment contract through an \"ecosystem\" access perspective. The CLO thus underscored the court's position on the Howey test, saying that a mere tie between investor fortunes and promoter efforts does not easily satisfy the criteria. The court ruled that a common enterprise must be essentially dependent upon promoter expertise for the investments to collectively hinge on fortuity. John Deaton agreed with Grewal's view and compared the Revak case to the ongoing legal disputes involving LBRY, Ripple and Coinbase. He particularly highlighted the jurisdictional subtleties, pointing out that the Second Circuit's Revak case is relevant to the Ripple and Coinbase cases.Shiba Inu price history hints at double-digit gains next monthAs January 2024 bids farewell, investors are now turning to February's prospects, and Shiba Inu investors are no exception. The departing month was not the luckiest for the meme coin, as SHIB is closing it with a 13% decline. However, according to SHIB's price history provided by CryptoRank, the token experienced a substantial 20.3% surge in February 2022, which was followed by a more modest yet positive growth of 1.6% in the subsequent year. February's historical median return rate, exceeding 10.9%, points to double-digit gains for SHIB in the next month. Despite the current market turmoil, historical evidence suggests that SHIB may see favorable developments. At the moment of writing, SHIB is changing hands at $0.000009029, down 0.69% over the past 24 hours, per CoinMarketCap.This article was originally published on U.Today"
}