{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK12055_L.jpg",
  "title": "Journalists briefly detained in Moscow at protest by soldiers' wives",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 03, 2024 08:40AM ET",
    "Updated Feb 03, 2024 12:58PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/dozens-detained-in-moscow-at-rally-of-russian-soldiers-wives--rights-group-3291903",
  "paragraph": "5/5\n© Reuters. The wife of a mobilised serviceman, who joined the Russian armed forces involved in a military campaign in Ukraine, comes together with members of the women's movement \"Way Home\" to lay flowers at the Tomb of the Unknown Soldier by the Kremlin wall and to\n2/5\nMOSCOW (Reuters) - Around 20 journalists were detained by police in central Moscow for several hours on Saturday at a rally of Russian soldiers' wives calling for their men to be returned from the front in Ukraine, a Reuters witness said. The journalists, including a video journalist from Reuters, who were covering the protest, filmed the women laying red carnations at the tomb of the unknown soldier in the shadow of the Kremlin's walls in central Moscow. Russian police ordered about 20 male journalists, many wearing press vests, onto a bus and took them to a police station. They were released a few hours later without charge. Moscow police did not respond to a request for comment. \"A Reuters journalist was detained while covering a story in Moscow, Russia today and released after several hours,\" a Reuters spokesperson said in an emailed statement. \"Journalists should be free to report the news without fear of harassment or harm, wherever they are. We are committed to covering world events in an independent, unbiased, and reliable way, in keeping with the  Thomson Reuters  (NYSE:TRI) Trust Principles\", the statement added. Agence France-Presse reported that one of its video journalists had been detained and later released. AFP did not immediately respond to a request for comment.  OVD-Info, which reports on freedom of assembly in Russia, said at least 27 people were detained. Most of the detained were journalists, it said. Additionally, a number of people were also detained at other locations in central Moscow, also protesting against the mobilisation, OVD-Info said. \nA growing movement of Russian women is demanding the return from the front of their husbands, sons and brothers who were mobilised after a decree by President Vladimir Putin in September 2022. The Moscow prosecutor's office said Saturday's rally had not been coordinated with the authorities, issuing a warning about calling and participating in unauthorised mass events."
}