{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBR0KQ_L.jpg",
  "title": "Big waves at California's Mavericks Beach draw surfers, 'super stoked' spectators",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 28, 2023 07:11PM ET",
    "Updated Dec 28, 2023 11:46PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/big-waves-at-californias-mavericks-beach-draw-surfers-super-stoked-spectators-3264525",
  "paragraph": "2/2\n© Reuters. A surfer enters the water at the Mavericks Beach near the Half Moon Bay, California, U.S. December 28, 2023. REUTERS/Nathan Frandino\n2/2\nBy Nathan Frandino HALF MOON BAY, California (Reuters) - At the famous Mavericks Beach surf spot, big waves thundering into the California coastline on Thursday attracted surfers and spectators alike to the legendary break 25 miles south of San Francisco. Waves were forecast to reach as high as 30 to 40-feet (9 to 12 meters) at Mavericks, according to the website Surfline. Spectators climbed a beachside cliff to peer through drizzle and heavy fog and watch the surfers catch the gnarly swells.  \"Super stoked to be out here. It's just awesome to have everyone else out here appreciating like what the California coast has to offer,\" said Lilly Baker, a 23-year-old student at the U.S. Military Academy from the California city of Oakland. Jet skis navigated choppy waters to propel surfers onto the steep waves. \"This perspective is kind of weird because you can't really see how big the waves are from the cliffs over here, but we saw a jet ski kind of flip over so that was wild. Some of those sets were huge,\" said Andre Assadi, 22, a software engineer from Oakland.\" \nA high surf warning was in effect until early Friday for shoreline counties along the Central and Northern California coastline breaking waves of 28 to 33 feet, according to the National Weather Service, warning \"these conditions are deadly!\" \"Being born in Berkeley, California, it's always been a bucket list item of mine to really go and see Mavericks firsthand and just see the beauty that the wave has to offer, it's always been a dream,\" said Eli Eccles, a 23-year-old student. \"So it's awesome to be here today.\""
}