{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK010G9_L.jpg",
  "title": "'It was a miracle': How passengers escaped a JAL fireball in Tokyo",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 02, 2024 12:50PM ET",
    "Updated Jan 02, 2024 02:12PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/it-was-a-miracle-how-passengers-escaped-a-jal-fireball-in-tokyo-3265709",
  "paragraph": "3/3\n© Reuters. Japan Airlines' A350 airplane is on fire at Haneda international airport in Tokyo, Japan January 2, 2024. REUTERS/Issei Kato\n2/3\nBy Daniel Leussink and Yoshifumi Takemoto HANEDA AIRPORT, Tokyo, Japan (Reuters) - The flight between the northern city of Sapporo and Tokyo's Haneda airport is Japan's busiest air route, and one of the most frequent services anywhere in the world. Japan Airlines (JAL) operates 16 round-trip flights a day. But when JAL516 followed that route to Haneda on Tuesday, what unfolded was a runway collision that is baffling aviation experts and a smooth evacuation and rescue that some described as miraculous. All 379 passengers and crew escaped the Airbus A350 aircraft which erupted into a fireball after colliding with a smaller Coast Guard plane shortly after landing. Five of the six Coast Guard plane crew were killed.  Satoshi Yamake, 59, was returning to the capital where he works in the telecoms sector after visiting relatives in his home town.  His mind drifted to the reunion with his wife Mika as the wheels skidded on the tarmac, before he was shaken by a rattling and a bang and then turned to see the engine on fire outside his window. The collision happened almost instantly after touching down at 5.46 pm (0846 GMT), the airline said.  The captain had been given permission to land but likely could not see the Coast Guard's smaller Bombardier-built Dash-8 maritime patrol plane below, airline executives said at a late night press conference. Authorities say they are investigating the circumstances behind the crash, which aviation experts say are highly unusual. Once a recurring safety problem, the aviation industry has managed to reduce drastically the number of accidents caused by runway collisions or incursions since the arrival of better ground tracking and procedures. As the passenger jet skidded to a stop, the captain of the Coast Guard plane, 39-year-old Genki Miyamoto, pulled himself from the wreckage and radioed his base.  \"The aircraft exploded on the runway. I escaped. The (condition of the) other crew members is unknown,\" he said, according to the Coast Guard. The other five crew, aged between 27 and 56, died. 'IT WAS A MIRACLE' The cabin of the passenger jet began quickly filling with smoke while some anxious passengers ran up and down the aisles and others clung to shrieking children. \"Please get me out of here,\" one woman shouted in a video shared with Reuters from inside the plane. \"Why don't you just open (the doors),\" a child screamed. \"I really thought I was going to die,\" said Tokyo resident Tsubasa Sawada, 28, who was returning from a holiday in Sapporo with his girlfriend.  \"After the accident happened, I was laughing a bit at first when I could see some sparks coming out (of the engine) but when the fire started, I realised it was more than just something.\" Flight attendants seemed to be urging people to remain calm, saying \"please cooperate\", according to the video shared with Reuters. Outside, 115 fire-fighting units were deployed to the scene to tackle a blaze that started at the back of the plane and eventually engulfed the whole aircraft in a ball of flames. Yamake, who was seated near the front, said despite some passengers being very anxious, the crew quickly deployed the evacuation chutes and people began disembarking in an orderly fashion.  The airline said the evacuation began almost immediately after the plane came to a standstill and that all passengers were taken to safety within less than 20 minutes.  Video footage showed passengers being evacuated calmly, apparently without hand luggage. Aviation safety agencies have warned for years that pausing to collect carry-on baggage risks lives during an evacuation. \"The cabin crew must have done an excellent job. There don't seem to be any carry-ons. It was a miracle that all the passengers got off,\" said Paul Hayes, director of air safety at UK-based aviation consultancy Ascend by Cirium. A Japanese transport ministry official said at a media briefing that the airline's evacuation procedures were \"conducted appropriately\". Sawada said around 10 minutes after they disembarked, there was an explosion on the plane. \n\"I can only say it was a miracle, we could have died if we were late,\" he said. \"I want to know why this happened and I feel like I don't want to board a plane again.\""
}