{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBR00A_L.jpg",
  "title": "Dozens arrested in pro-Palestinian protests at two major U.S. airports",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 27, 2023 07:28PM ET",
    "Updated Dec 27, 2023 07:36PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Darren Caris",
        "2023-12-28 04:33:08",
        "deport",
        "https://www.investing.com/members/242603901"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/dozens-arrested-in-propalestinian-protests-at-two-major-us-airports-3264180",
  "paragraph": "5/5\n© Reuters. Pro-Palestinian demonstrators block traffic on the road that leads to John F Kennedy airport (JFK), amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, in New York City, U.S., December 27, 2023. REUTERS/Stephanie Keith\n2/5\nBy Steve Gorman and Kanishka Singh (Reuters) - Pro-Palestinian protesters blocked morning traffic on Wednesday around Los Angeles International Airport and New York's John F. Kennedy International Airport - two of the nation's busiest - in coast-to-coast demonstrations that ended with dozens of arrests. Thirty-six people were taken into custody at LAX, where demonstrators became unruly, the Los Angeles Police Department said. \"Protesters threw a police officer to the ground, used construction debris, road signs, tree branches and blocks of concrete to obstruct\" a road leading into the airport \"while attacking uninvolved passersby in their vehicles,\" police said in a statement. Most of those detained were booked on rioting charges and at least one was arrested for battery on a police officer, according to the statement. Airport police said the entrance to the complex was reopened within about 45 minutes with \"no impacts to fights,\" the Los Angeles City News Service reported. Across the country, the Port Authority Police Department of New York said 26 people were arrested for disorderly conduct and impeding vehicular traffic during a protest along the Van Wyck Expressway inside JFK Airport in Queens. During the disruption, the Port Authority dispatched two airport buses offering rides to travelers caught in the resulting traffic backup to help them reach the airport safely, the agency said. The roadway was reopened after about 20 minutes, police said. Local news coverage of both protests showed demonstrators carrying banners with messages such as \"free Palestine\" and \"divest from genocide,\" in opposition to Israeli military action in the Gaza Strip over the past 11 weeks. The protests came as the U.N. health agency reported thousands of people trying to flee fighting that has raged in the coastal Palestinian enclave since the Iranian-backed militant group Hamas attacked Israel from Gaza on Oct. 7. \nSome 1,200 people were killed in the surprise cross-border raid, marking the deadliest day in Israel's history. A sustained Israeli counterattack on Gaza by air, land and sea has killed at least 21,000 and wounded more than 55,000 others, according to the Gaza health ministry. Nearly all of Gaza's 2.3 million people have been driven from their homes."
}