{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK13020_L.jpg",
  "title": "Biden courts Nevada voters after narrow 2020 win",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 04, 2024 05:04AM ET",
    "Updated Feb 04, 2024 11:25PM ET"
  ],
  "comments": [
    10,
    [
      [
        "Barry Nickerson",
        "2024-02-05 23:36:07",
        "If Old Joe needs to be astute in the primaries, he's in deep, um, sewerage.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Ken Roth",
        "2024-02-05 09:38:30",
        "As Biden says Trump is a sick F.u..ck that enjoys raping women, stealing topsecret documents, create insurrection, commit multiple frauds in his business and lies 50 times pr, day tells you everything you need to know about his supporters that must be totally brainwashed and so stu...pid that they only read Truth social as their prime information about the world, if they can read.",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Line Work",
        "2024-02-05 07:29:19",
        "Tweedledum vs. Tweedledee!",
        "https://www.investing.com/members/255148696"
      ],
      [
        "Flat Top",
        "2024-02-05 04:44:02",
        "Biden2024. Nothing but the best for this great country ",
        "https://www.investing.com/members/236391078"
      ],
      [
        "Mark Jannetty",
        "2024-02-05 10:56:20",
        "Kamala is best for this country? if you think Biden is doing more than 1 year, you need to put down the bong",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Tony Hurd",
        "2024-02-05 02:06:32",
        "Biden should be convicted of treason & strung up by his shriveled up nutsack",
        "https://www.investing.com/members/201624132"
      ],
      [
        "Ac Tektrader",
        "2024-02-05 06:35:18",
        "with Trump's theft of top secret national security documents. a d his attempts at insurrection, overthrowing constitutional governance, its trump That. should be convicted of treason.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ge K",
        "2024-02-05 01:08:06",
        "Lets go Brandon ",
        "https://www.investing.com/members/249403043"
      ],
      [
        "John Avenetti",
        "2024-02-04 23:22:02",
        "no one is voting for him. and no one should vote for the other guy. It's a show. ",
        "https://www.investing.com/members/225003989"
      ],
      [
        "Roger Miller",
        "2024-02-04 21:49:13",
        "I was moved when he said “Zippity zappity, flibberdy floo!”",
        "https://www.investing.com/members/205083859"
      ],
      [
        "Ac Tektrader",
        "2024-02-05 08:22:42",
        "yes, trump makes quite a fool of himself at his rallies.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "David JC",
        "2024-02-04 13:56:23",
        "Obama's puppet will need more pre-printed mail in ballots to steal this election.",
        "https://www.investing.com/members/204737048"
      ],
      [
        "John Avenetti",
        "2024-02-04 23:24:30",
        "Carmen Calabria",
        "https://www.investing.com/members/225003989"
      ],
      [
        "Ac Tektrader",
        "2024-02-05 00:43:58",
        "Mark Gesswein",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ac Tektrader",
        "2024-02-05 00:51:48",
        "Mark Gesswein",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ac Tektrader",
        "2024-02-05 01:04:57",
        "let's get down to the overwhelming evidence, that the one who tried to steal the 2020 election was Donald Trump, with his big lie, support and instigating inserection.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ac Tektrader",
        "2024-02-05 01:09:41",
        "all these anti-democratic ignorant brainwashed anti Americans supporting your views I liveQE good for you........",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Barry Nickerson",
        "2024-02-04 11:34:12",
        "Another state where he is running unopposed, yet he is worried about winning the primary.  Maybe the folks there will be writing in Phillips.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Ac Tektrader",
        "2024-02-05 08:30:53",
        "mark and John, your support of a convicted sex moleste, Donald Trump,r who brags about sexuality molesting women is noted..",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Mark Jannetty",
        "2024-02-05 10:58:00",
        " convicted? when did did this happen?",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Ac Tektrader",
        "2024-02-05 16:12:22",
        "we're you been mark under a rock ..the toast of sex molesters everywhere, Donald Trump; especially in New York City. then there's Donald Trump's bragging caught on tape. ",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Mark Jannetty",
        "2024-02-05 16:34:02",
        " like I said, convicted? when did this happen? in the minds of 🤡, does not make it reality",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Brad Albright",
        "2024-02-05 17:19:04",
        "Convicted? Stand back and stand by.",
        "https://www.investing.com/members/236251128"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/biden-courts-nevada-voters-after-narrow-2020-win-3291982",
  "paragraph": "© Reuters. U.S. President Joe Biden speaks during the opening of the Biden for President campaign office in Wilmington, Delaware, U.S., February 3, 2024. REUTERS/Joshua Roberts\nBy Jarrett Renshaw LAS VEGAS (Reuters) -U.S. President Joe Biden took his re-election pitch to Nevada voters on Sunday, part of a two-day stop in the 2024 battleground state ahead of Tuesday's Democratic primary.  The president attended two campaign events in the arid Western state, which has just over 3 million people, most of them clustered around the gambling and entertainment center Las Vegas. Biden visited the historic Westside, an area northwest of the Las Vegas Strip, where Black Americans faced with segregation founded their own casinos and clubs a century ago. Biden appears on Nevada's Democratic presidential primary ballot along with self-help author Marianne Williamson and other lesser-known challengers. U.S. Representative Dean Phillips of Minnesota missed the filing deadline and won't appear on the ballot. In 2020, Biden narrowly beat his Republican rival Donald Trump in Nevada by 33,596 votes, or less than 3%, and opinion polls show a rematch between the two men this year, which seems likely, would be close. About 30% of Nevada's population is self-described as Latino or Hispanic on the U.S. Census, and Republicans are making some inroads with these voters nationwide.  Republicans hold a primary on Feb. 6 in Nevada as well, but Trump won't be on the ballot as he has opted to participate in a Feb. 8 caucus in the state instead.  Nevada has about 705,000 registered Democrats, 646,000 registered Republicans and nearly 768,000 who are \"nonpartisan,\" according to the latest state figures.  Tuesday's Republican and Democratic primary voters also have the option to vote for \"None of these candidates.\" In November, the state's six Electoral College votes will be up for grabs, toward the 270 needed to be elected president. As the election draws closer, Biden and his team are traveling the United States to talk about the recession-defying economy, and the impact of the president's clean energy tax breaks, union support and infrastructure investment. \"We have to win,\" Biden told supporters on Sunday after detailing his case against Trump. \"I give you my word, we have to. There's not much of a choice here.\" In December, Biden visited Las Vegas to tout a new high-speed rail development that will connect the city and Los Angeles. Last March, the Biden administration created a new national park, Avi Kwa Ame, the Mojave name for Spirit Mountain, in southern Nevada. The site is sacred to Native American tribes, including the Paiute and Chemehuevi, and provides habitat for the desert bighorn sheep, the desert tortoise and a Joshua tree forest. In recent weeks, Biden has stepped up his direct attacks on Trump, describing him as a threat to democracy and questioning his mental capacity. The president has wrestled with stubbornly low approval ratings. \nBiden's strategy, which included moving senior White House staff to the campaign, reflects the view that Trump will be the Republican candidate despite his ongoing nomination competition with former South Carolina Governor Nikki Haley. \"Americans are sick and tired of the last four years of destructive policies that have brought nothing but pain and misery across the country,\" Trump campaign spokesman Steven Cheung said."
}