{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0200X_L.jpg",
  "title": "US believes Hamas used Al Shifa Hospital but evacuated before Israeli operation- source",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 02, 2024 08:54PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-believes-hamas-used-al-shifa-hospital-but-evacuated-before-israeli-operation-source-3265821",
  "paragraph": "By Jonathan Landay and Kanishka Singh WASHINGTON (Reuters) - U.S. spy agencies assess that Islamist group Hamas and another Palestinian group fighting Israel used Gaza's Al Shifa Hospital to command forces and hold some hostages but largely evacuated the complex days before Israeli troops entered it, a U.S. official said on Tuesday, citing declassified U.S. intelligence. The complex was used by both Hamas and Palestinian Islamic Jihad to command forces fighting against Israel, the U.S. official said, speaking on condition of anonymity.  U.S. intelligence agencies have not disclosed the evidence on which they based their assessment. The official said the U.S. had independently confirmed the information. Israel has also said Al Shifa, which it had occupied earlier in the war in Gaza, had been used by Hamas. Israeli troops entered the hospital in November.  The targeting of the hospital had stoked global alarm over the fate of civilians and patients who were inside. The World Health Organization last month described the emergency department in the enclave's main health facility as resembling a \"bloodbath.\" The American government believed that Hamas used the hospital complex and sites beneath it to carry out command and control activities, store some weapons and hold a few hostages, the U.S. official said. U.S. intelligence agencies obtained information that Hamas fighters had largely evacuated the complex days before Israel's operation and destroyed documents and electronics as they left, according to the American official. The U.S. intelligence assessment was reported first by the New York Times. A classified version of the assessment was sent to lawmakers in the U.S. Congress. Israeli tanks advanced on Gaza City's Al Shifa hospital, with some patients still inside, in mid-November. Israel said the hospital sat atop tunnels housing headquarters for Hamas fighters using patients as shields, which Hamas denied. Israeli assessment's was at least partially correct that some hostages were held at or under the complex but those hostages appeared to have been moved as Hamas evacuated, the New York Times reported. In November, White House national security spokesman John Kirby (NYSE:KEX) said Hamas militants were sheltering themselves in the hospital and using the facility as a shield against military action, placing patients and medical staff at risk. \n\"We have our own intelligence that convinces us that Hamas was using Al Shifa as a command and control node, and most likely as well as a storage facility,\" Kirby said in November. Washington had at the time not declassified the sources of the U.S. intelligence. Hamas' Oct. 7 attack on Israel killed 1,200, according to Israeli tallies. Israel's subsequent assault on Hamas-ruled Gaza has killed over 22,000, according to Gaza health officials."
}