{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK03045_L.jpg",
  "title": "Analysis-In threatening shift, North Korea moves to redefine relations with South",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 04, 2024 12:05AM ET",
    "Updated Jan 04, 2024 08:31AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/analysisin-threatening-shift-north-korea-moves-to-redefine-relations-with-south-3266792",
  "paragraph": "2/2\n© Reuters. FILE PHOTO: A South Korean soldier stands guard in the truce village of Panmunjom inside the demilitarized zone (DMZ) separating the two Koreas, South Korea, February 7, 2023. REUTERS/Kim Hong-Ji/File Photo\n2/2\nBy Hyonhee Shin and Josh Smith SEOUL (Reuters) - North Korea is shaking up the way it handles relations with South Korea, enacting changes to policy and government organisations that would effectively treat the South as a separate, enemy state. The moves, which break with decades of policy, could have North Korea's foreign ministry taking over relations with the South, and potentially help justify the use of nuclear weapons against Seoul in a future war, analysts said. Since the 1950-53 Korean War ended in a stalemate, both nations have had policies that treat each other differently than other countries.  That has included relying on special agencies and ministries for inter-Korean relations rather than their foreign ministries, and embracing policies for a future peaceful reunification, usually envisioning a single state with two systems. But in remarks to a year-end party meeting last week, North Korean leader Kim Jong Un said peaceful reunification is impossible, and said the government would make a “decisive policy change” in relations with the \"enemy\". He also ordered the military to be prepared to pacify and occupy the South in the event of a crisis. The changes in policy could help North Korea justify using nuclear weapons against the South, as it has increasingly threatened in recent years, said Hong Min, a senior researcher at the Korea Institute for National Unification in Seoul. \"If they give up on peaceful unification and redefine South Korea as a hostile enemy country with no diplomatic relations, the contradiction of using nuclear weapons against the same people will be eliminated,\" Hong said. REFLECTING REALITY Some observers say North Korea's declarations simply reflect the reality of two countries with deep divisions and disparities. \"North Korea in recent years had suggested that it was moving toward a fundamental shift in South Korea policy, and the December 2023 Party plenum not only confirmed it, it also formalised it,\" said Rachel Minyoung Lee, of the U.S.-based Stimson Center. The extent of the organisational changes is unclear, and some analysts said that because such rhetoric is more closely reflecting the status quo, there is unlikely to be a major shift in the already antagonistic relationship between the two Koreas.  Previous periods of high tensions, for example during the \"fire and fury\" of 2016 and 2017, have also occasionally been followed by periods of detent and diplomacy, including during the 2018 and 2019 summits between Kim and the presidents of South Korea and the United States. \"North Korea in its report on the result of the party plenary meeting said it would not consider us as a counterpart for reconciliation and unification but the truth is that it has never sincerely pushed for them,\" an official with the South's unification ministry, which handles relations with the North, said in a statement on Wednesday.  FOREIGN MINISTER The United Front Department (UFD) of the Workers' Party of Korea has traditionally been tasked with relations with the South, including intelligence gathering and propaganda efforts. But even if talks do someday resume, the announcement likely means that Foreign Minister Choe Son Hui, a seasoned diplomat, will be the one overseeing relations with the South, said Michael Madden, a North Korea leadership expert with the Stimson Center. \"I would trace her role as a substantive adviser on unification and South Korea policy to Kim's 2019 visit to the former inter-Korea resort near Mt. Kumgang. Her attendance at that event was not unprecedented but it was most unusual and portended her writ expanding to South Korean policy,\" Madden said. The fact that Choe, a career diplomat who has played little role in inter-Korean affairs, led the task of “dismantling and reforming” entities linked to South Korea, as reported by state media on Monday, could mean the foreign ministry will absorb those organisations and their functions, said Yang Moo-jin, president of the University of North Korean Studies in Seoul. \"The United Front Department and the Committee for the Peaceful Reunification of the Fatherland, which had traditionally handled inter-Korean ties, could be disbanded altogether or at least see their roles significantly reduce,\" he said. North Korea could also decide to cut the South out entirely and only deal with the United States, he added. \nWhile foreign ministry officials occasionally advised on inter-Korean issues, under Kim there has been no known crossover between foreign ministry and UFD officials, Madden said. Whatever changes occur, key UFD intelligence official are unlikely to be sidelined and the agency is likely to retain authority over some key propaganda broadcasts and websites, he added."
}