{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0O0PX_L.jpg",
  "title": "WHO chief breaks down describing 'hellish' Gaza conditions",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 25, 2024 01:07PM ET",
    "Updated Jan 25, 2024 06:22PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/who-chief-breaks-down-describing-hellish-gaza-conditions-3283360",
  "paragraph": "© Reuters. Director-General of the World Health Organisation (WHO) Dr. Tedros Adhanom Ghebreyesus attends an ACANU briefing in Geneva, Switzerland, December 15, 2023. REUTERS/Denis Balibouse/File Photo\nGENEVA (Reuters) - The head of the World Health Organization called for a ceasefire and a \"true solution\" to the Israel-Palestinian conflict in an emotional plea to the global health body's governing body on Thursday where he described conditions in Gaza as \"hellish\". WHO Director-General Tedros Adhanom Ghebreyesus, who lived through war as a child and whose own children hid in a bunker during bombardments in Ethiopia's 1998-2000 border war with Eritrea, became emotional describing conditions in the bombed-out Gaza enclave where more than 25,000 people have been killed. \"I'm a true believer because of my own experience that war doesn't bring solution, except more war, more hatred, more agony, more destruction. So let's choose peace and resolve this issue politically,\" Tedros told the WHO Executive Board in Geneva during a discussion about the Gaza health emergency. \"I think all of you have said the two-state solution and so on, and hope this war will end and move into a true solution,\" he said, before breaking down, describing the current situation as \"beyond words\". Israel unleashed its campaign to eliminate Hamas after the militants burst into Israel on Oct. 7 and killed 1,200 people, most of them civilians, and took over 200 hostages back to Gaza. Israel's ambassador said Tedros' comments represented a \"complete leadership failure\". \"The statement by the director-general was the embodiment of everything that is wrong with WHO since October 7th. No mention of the hostages, the rapes, the murder of Israelis, nor the militarisation of hospitals and Hamas' despicable use of human shields,\" Meirav Eilon Shahar said in comments sent to Reuters. She also accused the global health agency of \"collusion\" with Hamas, saying the WHO turned a blind eye to Hamas' military activities in Gaza hospitals.  \nIn the same address, Tedros warned that more people in Gaza would die of starvation and disease. \"If you add all that, I think it's not easy to understand how hellish the situation is,\" he said."
}