{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK01099_L.jpg",
  "title": "Explainer-What will happen to Oscar Pistorius when he is released from jail?",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 02, 2024 06:34AM ET",
    "Updated Jan 02, 2024 07:20AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/explainerwhat-will-happen-to-oscar-pistorius-when-he-is-released-from-jail-3265471",
  "paragraph": "© Reuters. FILE PHOTO: Olympic and Paralympic track star Oscar Pistorius is escorted by police officers as he arrives for his sentencing for the 2013 murder of his girlfriend Reeva Steenkamp, at North Gauteng High Court in Pretoria, South Africa July 6, 2016. REUTER\nJOHANNESBURG (Reuters) - Former Paralympic star Oscar Pistorius will be released from prison on Friday after he was granted parole nearly 11 years after killing his girlfriend Reeva Steenkamp. Here is a look at what will happen to Pistorius after his release under South Africa's so-called restorative justice programme. WHAT WILL HAPPEN TO PISTORIUS AFTER HIS RELEASE? Pistorius - known as the \"Blade Runner\" for his carbon-fibre prosthetic legs - became eligible for parole in March 2023 after he had served half of his 13 years and five months sentence for murder. He was granted parole on Nov. 24, to take effect on Jan. 5.  South Africa's Department of Correctional Services (DCS) said in November that Pistorius will complete the remainder of his sentence in the country's community corrections system. He will be under the supervision of the DCS and will be subjected to parole conditions until his sentence expires in December 2029.  He will be assigned a monitoring official, who will have to be kept informed when Pistorius is seeking job opportunities or moving homes. As part of the conditions, Pistorius will also have to attend programmes on gender-based violence and continue therapy sessions on anger management, a lawyer for the Steenkamp family said shortly after he was granted parole. He is expected to live in Pretoria. WHAT WAS CONSIDERED FOR HIS EARLY RELEASE? Several factors are typically taken into account by a parole board, including the nature of the crime, the possibility of reoffending, conduct in prison, physical and mental wellbeing and potential threats a prisoner may face if released. Prior to his parole, Pistorius also participated in the restorative justice programme - a system introduced after the end of apartheid to deal with apartheid-era crimes in a more participative and reconciliatory way. It is based partly on how indigenous cultures handled crime long before Europeans colonised South Africa, with the aim of bringing affected parties in a crime together to find closure, rather than merely punishing perpetrators. An integral part of the restorative justice programme is a victim-offender dialogue that brings parties affected by a crime together to try to achieve closure. Participation is voluntary. Pistorius was moved to a prison closer to where the Steenkamp family stayed in late 2021, ahead of reconciliation talks aimed at a potential early release from prison. He and the late Barry Steenkamp - Reeva's father - participated in the victim-offender dialogue on June 22, 2022.  WHAT HAS BEEN THE REACTION TO HIS EARLY RELEASE? The Steenkamp's family lawyer said in November that they were not surprised by the parole decision, issued after Pistorius had completed a set portion of his sentence. In the run-up to the parole hearing, Reeva Steenkamp's mother June released a statement saying she was not convinced Pistorius had been rehabilitated. However, she said she had no objections to his release. \nAfter Pistorius was granted parole, June Steenkamp lauded the parole board's efforts in involving the victims. Pistorius' lawyer and family did not comment."
}