{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "US Navy sends first warship through Taiwan Strait post-election",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 24, 2024 09:37AM ET",
    "Updated Jan 24, 2024 09:36PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-navy-says-uss-john-finn-conducted-transit-in-taiwan-strait-3281881",
  "paragraph": "BEIJING (Reuters) -The United States Navy sailed its first warship through the sensitive Taiwan Strait on Wednesday following presidential and parliamentary elections on the island, drawing the ire of Beijing. The U.S. Navy said the destroyer USS John Finn transited through a corridor in the Taiwan Strait that was \"beyond the territorial sea of any coastal state\". \"John Finn's transit through the Taiwan Strait demonstrates the United States' commitment to upholding freedom of navigation for all nations as a principle,\" the U.S. Navy said in its statement. \"No member of the international community should be intimidated or coerced into giving up their rights and freedoms.\" China's military said the mission was \"public hyping\" and that its forces monitored and warned the ship. \"Recently, the U.S. military has frequently carried out provocative acts to maliciously undermine regional peace and stability,\" the People's Liberation Army's Eastern Theatre Command said in a statement. Taiwan's defence ministry said the ship sailed in a southerly direction through the strait, adding it monitored the movement and the situation was \"normal\". The U.S. Navy's last announced passage of a warship through the strait was in early November, joined that time by a Canadian frigate. The latest transit came as leaders of the U.S. House of Representatives Taiwan Caucus, Republican Representative Mario Diaz Balart and Democratic Representative Ami Bera, visit Taipei, as a show of support after the island's Jan. 13 election. \nChina, which also views Taiwan as its own territory, has over the past four years regularly sent warplanes and warships into the skies and waters around the island as it seeks to assert sovereignty claims that the Taipei government rejects. Last week, Taiwan's defence ministry said it detected 18 Chinese air force planes operating around Taiwan and carrying out \"joint combat readiness patrols\" with Chinese warships, the first large-scale military activity after the Taiwanese election."
}