{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBR01W_L.jpg",
  "title": "Sources say China pressured Taiwanese band before vote, Beijing denies",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 27, 2023 11:04PM ET",
    "Updated Dec 28, 2023 08:31AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/china-pressures-influential-taiwanese-band-ahead-of-elections--sources-3264191",
  "paragraph": "© Reuters. FILE PHOTO: Taiwan pop band Mayday pose after winning the Best Song of The Year, the Best Album Composer, the Best Arranger, the Best Composer, the Best Mandarin Album of the Year and the Best Musical group categories at the 23rd Golden Melody Awards in T\nBy Yimou Lee TAIPEI (Reuters) -China pressured a popular Taiwanese rock band to make pro-China comments ahead of Taiwan's key elections next month, according to sources with knowledge of the situation and a Taiwan security note, but Beijing denied doing so. China's National Radio and Television Administration asked the band Mayday to publicly voice support for Beijing's claims that democratically governed Taiwan is part of China, according to the internal Taiwan security note reviewed by Reuters. The rock stars did not agree to China's request to provide unspecified \"political service\", a Taiwanese source with direct knowledge of the situation, who requested anonymity, added. The band's management company did not respond to requests for comment.  After Reuters' story on Mayday appeared earlier on Thursday, Taiwan's ruling Democratic Progressive Party (DPP) criticised China, saying it again demonstrated how Beijing is trying to influence the vote. Taiwan's main opposition party the Kuomintang (KMT) said if the accusations were true it also condemned China's behaviour, and called on China's government to respond. China's Taiwan Affairs Office, more than 24 hours after Reuters sought comment from them, issued a statement carried by Taiwanese media saying the accusations the government pressured Mayday were \"fake news\" and that the DPP was spreading rumours. \"This is sinister and malicious political manipulation,\" the office said, according to Taiwan's Central News Agency, United Daily News and other outlets. Mayday are among the most successful Taiwanese artists in China, a market that has become increasingly challenging for Taiwanese celebrities as Beijing steps up its political pressure to assert its sovereignty claims.  Chinese officials asked the band to join China's \"media propaganda on Taiwan,\" according to the security report drawn up earlier this month that cited intelligence on Chinese government activities gathered by Taiwan authorities. Two Taiwan security officials looking into the matter said separately that, as part of a pressure campaign, the Chinese authorities in December announced an investigation into Mayday, following allegations on Chinese social media that the band had lip synched during one of their recent concerts in China. LIP-SYNC INVESTIGATION The source with direct knowledge of the situation said that, after the band declined to make pro-Beijing comments, Chinese authorities threatened the band with a fine for lip-syncing - a practice which is banned in China.  \"They will have to pay up if they do not cooperate,\" the person said. The lip-sync investigation's findings and any penalties for Mayday have not yet been made public. Mayday's management company, B'in Music, has previously denied allegations of lip syncing during the band's November tour in China. China's Publicity Department, which oversees the radio and television administration, did not respond to requests for comment. The two Taiwan security officials, citing intelligence gathered by Taiwan, said the campaign was led by China's Publicity Department in a move to sway voters ahead of Taiwan's Jan. 13 presidential and legislative elections. By doing so the Chinese authorities believe they could \"sway the youth vote in Taiwan,\" one of the officials said. They described the scale of the cross-department campaign against Mayday as \"unprecedented\", which involved coverage on the lip syncing allegations by the Chinese Communist Party's official newspaper the People's Daily, state broadcaster CCTV, and the official Xinhua News Agency. The Procuratorate Daily, run by China's Supreme People's Procuratorate, also published an article in December describing lip syncing as an act of fraud punishable by Chinese laws and urging regulators to step up supervision. Taiwan officials have repeatedly warned in recent months that Beijing is trying new methods to interfere in the elections and get electors to vote for pro-China candidates. That have included trade sanctions, exchange activities with Taiwan politicians and military moves. Beijing, which claims Taiwan as its own and has increased military and political pressure to force the island to accept its sovereignty, frames the elections as a choice between \"peace and war\", calling the DPP dangerous separatists and urging Taiwanese to make the \"right choice\". \nChina has in recent years ramped up pressure on Taiwanese celebrities, international groups and companies to refer to Taiwan as being part of China, to the anger of Taiwan's government and many of its people. One day before the presidential vote in 2016, a Taiwanese singer with a South Korean girl band publicly apologised for holding a Taiwan flag, prompting anger in Taiwan as it voted for its next president."
}