{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "Commander says Ukrainian forces still in shattered town",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Dec 26, 2023 06:27PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/commander-says-ukrainian-forces-still-in-shattered-town-3263742",
  "paragraph": "(Reuters) - The commander of Ukraine's armed forces said on Tuesday his troops remained in an area of the eastern town of Maryinka despite assertions by Russia's defence minister that Moscow was in control of the settlement which has been reduced to ruins after many months of fighting. Valery Zaluzhnyi acknowledged to reporters that the town was in ruins, but Ukrainian troops were still positioned on its northern flank. Deepstate, a popular Ukrainian war blog, reported late on Tuesday that Russian troops had taken over all areas of the town that had previously been outside its control. Reuters could not confirm reports of military activity from either side. Capturing Maryinka would amount to Moscow's most significant battlefield gain since May. In his remarks to journalists, Zaluzhnyi said Russian forces had for two years been bearing down on Maryinka, a short drive from the Russian-held regional centre of Donetsk. \"At this time today, our troops are still in northern areas,\" Zaluzhnyi said. \"Our troops had readied a defensive line outside this locality, but I can say that this locality no longer exists.\" He said Ukrainian forces were resolved to defend any corner of the country, be it in Maryinka or Bakhmut or Avdiikva, two other towns in the country's east subject to months of fighting. Bakhmut was captured by Russian troops in May and Ukrainian forces have been trying to secure nearby villages in a counteroffensive launched soon after. Avdiivka, adjacent to Maryinka, remains in Ukrainian hands, but has been under fierce attack for two months. Russian Defence Minister Sergei Shoigu, in a televised video with Kremlin leader Vladimir Putin on Monday, said, \"Our assault units ... have today completely liberated the settlement of Maryinka.\" Putin said taking the town would enable Russian troops to be able to operate in a wider area."
}