{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "Russia launches 28 drones, three missiles at Ukraine - Ukraine's air force",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 07, 2024 03:02AM ET",
    "Updated Jan 07, 2024 09:39AM ET"
  ],
  "comments": [
    3,
    [
      [
        "American Truth",
        "2024-01-07 21:02:15",
        "This war is nothing bit the biggest money laundering operation in history.",
        "https://www.investing.com/members/218062379"
      ],
      [
        "Ac Tektrader",
        "2024-01-07 21:07:24",
        "another lie by American Truth.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ac Tektrader",
        "2024-01-07 21:14:57",
        "who's no American...",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Otis Grant",
        "2024-01-07 17:27:35",
        "Ukraine needs to start striking Moscow. Puketin must go he is a threat to world peace",
        "https://www.investing.com/members/251132356"
      ],
      [
        "Ac Tektrader",
        "2024-01-07 21:12:42",
        "Putin, a disgrace and threat to the well being of Russia and the Russian people.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Vladimir Bo",
        "2024-01-07 08:32:20",
        "Russia bombing Ukraine every day and then cries, when Ukraine strikes back",
        "https://www.investing.com/members/202152262"
      ],
      [
        "Levan Jackson",
        "2024-01-07 14:06:20",
        "That is the way.",
        "https://www.investing.com/members/206341051"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/russia-launches-28-drones-three-missiles-at-ukraine--ukraines-air-force-3268601",
  "paragraph": "(Reuters) -Russia launched 28 attack drones and three cruise missile at Ukraine overnight, Ukraine's air force said on Sunday, adding that its air defence systems destroyed 21 of the drones.  The air force said on its Telegram messaging channel that Russia targeted mainly the south and east of Ukraine, and did not say what happened to the three cruise missiles. \"The enemy is shifting the focus of attack to the frontline territories - Kherson and Dnipropetrovsk regions were attacked by drones,\" Air Force spokesperson Yuriy Ihnat told national television. Reuters could not independently verify the report. There was no immediate comment from Russia. Dnipropetrovsk regional authorities said on Telegram that 12 people were injured in a drone attack in Dnipro city. They also said an educational institution and its dormitory, two multi-apartment buildings and one administrative building were damaged. Ihnat said drones were predominantly destroyed by mobile teams, saving \"scarce\" air defence missiles. \nHe said Ukrainian forces used some missiles to repel two recent major Russian attacks and \"processes are under way to continue to provide Ukraine with the number of missiles needed to repel air attacks\". Russia deployed almost 300 missiles and more than 200 drones in attacks in the last days of 2023 and the first days of 2024."
}