{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0E0DN_L.jpg",
  "title": "Kremlin says Davos talks on Ukraine will achieve nothing as Russia is not there",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 15, 2024 08:29AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/kremlin-says-davos-talks-on-ukraine-will-achieve-nothing-as-russia-is-not-there-3274418",
  "paragraph": "2/2\n© Reuters. Snow covers rooftops, on the first day of the annual meeting of the World Economic Forum (WEF) in Davos, Switzerland, January 15, 2024. REUTERS/Denis Balibouse\n2/2\nBy Guy Faulconbridge and Filipp Lebedev MOSCOW (Reuters) -The Kremlin on Monday said that talks in Davos on Kyiv's peace proposals would achieve nothing as Russia was not participating in the discussions, and Moscow will continue its military operation in Ukraine until it achieves all its goals.  President Vladimir Putin sent thousands of troops into Ukraine in February 2022, triggering the biggest confrontation between the West and Russia since the 1962 Cuban Missile Crisis. U.S. Secretary of State Antony Blinken, French President Emmanuel Macron and key Middle East leaders are slated to attend this week's World Economic Forum, putting talks to end wars in Gaza and Ukraine at the top of the agenda for the global elite. \"This is simply talking for the sake of talking,\" Kremlin spokesman Dmitry Peskov said when asked about the discussions on Ukraine in Davos. \"This process cannot be aimed at achieving any specific results for the obvious reason - we are not participating. Without our participation, any discussions are devoid of any prospect of any results.\" Ukraine says it will not rest until every Russian soldier leaves its territory and Ukrainian President Volodymyr Zelenskiy has decreed that any talks with Russia are illegal.  Russia, which controls just under a fifth of Ukrainian territory, has dismissed Zelenskiy's peace plan, known as his \"peace formula\", as absurd as it aims to find peace without Russian participation.  Zelenskiy's 10-point plan calls for the withdrawal of Russian troops, cessation of hostilities, and the restoration of Ukraine's state borders with Russia. Putin casts the war in Ukraine as part of a much broader global struggle with the West - which he says aims to split Russia apart and steal its resources. The West denies it wants to destroy Russia. Ukraine's presidential chief of staff Andriy Yermak said on Sunday it was important that Russian ally China was at the table when Kyiv convenes further meetings on its peace formula. When asked about Russia's position on possible talks with Ukraine, Peskov said Ukraine's own position on outlawing talks with Moscow was \"absurd.\" \"For us, it is preferable to achieve our security objectives through peaceful and diplomatic means,\" Peskov said.  \n\"But in the face of the impossibility of this - the unwillingness of the collective West and Ukraine to take into account our security considerations, we continue the special military operation\", Peskov said. \"We will achieve our goals.\" Putin calls the fighting a \"special military operation\" though he and other top officials also have repeatedly used the word \"war\" to describe the conflict in Ukraine."
}