{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "US unveils charges, seizures linked to Iranian oil network",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 02, 2024 01:06PM ET",
    "Updated Feb 02, 2024 05:35PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-announces-charges-and-seizures-linked-to-irans-illicit-oil-trafficking-network-doj-3291623",
  "paragraph": "By Timothy Gardner and Rami Ayyub (Reuters) - The United States on Friday announced terrorism and sanctions-evasion charges and seizures linked to a billion-dollar oil trafficking network that it says finances Iran's elite Islamic Revolutionary Guard Corps (IRGC) and other militant groups.  The cases are in response to a series of aggressive actions by Iran over several years, the Department of Justice (DOJ) said. In August 2022, for example, the U.S. charged an IRGC member with plotting to murder John Bolton, who served as U.S. national security adviser under former President Donald Trump.  Actions by Iran-backed militants, including the Oct. 7 attack on Israel by the Palestinian group Hamas and the attack over the weekend in Jordan that killed three U.S. soldiers, have increased the focus on Iran's oil trade, the DOJ said. \"The Justice Department will continue to use every authority we have to cut off the illegal financing and enabling of Iran’s malicious activities, which have become even more evident in recent months,\" U.S. Attorney General Merrick Garland said in a statement.  The DOJ seized more than $108 million that it said China Oil & Petroleum Company Limited attempted to launder through accounts at U.S. financial institutions. The DOJ said China Oil & Petroleum is an IRGC front company. The DOJ said it also seized more than 520,000 barrels of Iran's oil aboard the crude tanker Abyss that were covered by U.S. sanctions.  The tanker was anchored in the Yellow (OTC:YELLQ) Sea between China and South Korea, according to ship tracking data from Kpler and  London Stock Exchange  Group (LON:LSEG). It in January loaded at the Eastern Outside Port Limits (EOPL), an anchorage east of Singapore and Malaysia often used for sanctioned cargoes, and was headed to Dongying in China, according to Kpler.  Seven defendants, including Sitki Ayan, who is a Turkish national and chairman of the ASB Group, Morteza Rostam Ghasemi, who is the son of a former IRGC commander and Iranian petroleum minister, and Behnam Shahriyari, who is an IRGC Quds Force official, were charged in the Southern District of New York federal court in connection with the seizure of the money. \nThe DOJ also charged a Chinese woman, Shaoyun Wang, and an Omani man, Mahmood Rashid Amur Al Habsi, with Iran sanctions evasion and money laundering in connection with the trafficking and selling of Iranian oil to Chinese government-owned refineries in a case in the U.S. District Court for the District of Columbia.  Iran's crude exports and oil output hit new highs in 2023 despite U.S. sanctions over Tehran's nuclear program. Tehran says the program is for peaceful purposes. In January, China's oil trade with Iran stalled as Tehran withheld shipments and demanded higher prices from its top client, tightening cheap supply for the world's biggest crude importer. Iranian oil makes up some 10% of China's crude imports."
}