{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0U0F7_L.jpg",
  "title": "Senior US official in Ukraine confident Congress will back aid package",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 31, 2024 06:40AM ET",
    "Updated Jan 31, 2024 03:22PM ET"
  ],
  "comments": [
    2,
    [
      [
        "Ken Roth",
        "2024-02-01 14:05:44",
        "EU just approved 350 billion USD aid to ukraine over the next 4 years. Thank god for the europeans who are still a beacon for the free world, certainly not USA anymore who screws our allies",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Mark Jannetty",
        "2024-01-31 21:55:30",
        "doesn't matter if congress does, you need the house and the answer is no ",
        "https://www.investing.com/members/241633026"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/senior-us-official-in-ukraine-for-talks-amid-uncertainty-over-aid-3288131",
  "paragraph": "© Reuters. U.S. State Department Under Secretary for Public Affairs Victoria Nuland attends a news conference at the Presidential Palace in Nicosia, Cyprus, April 7, 2022. REUTERS/Yiannis Kourtoglou/File Photo\nKYIV (Reuters) -A senior U.S. diplomat expressed confidence on Wednesday that Congress would back new aid for Ukraine reflecting broad American support for its war effort, adding she was impressed with the \"unity and resolve\" she saw in Kyiv. Ukraine is heavily reliant on support from its Western allies, particularly the United States, to hold its own against Russia's full-scale invasion, now approaching the two-year mark.  Uncertainty surrounds U.S. economic and military assistance for Ukraine as Congress considers an urgent request from President Joe Biden, a Democrat, in October to approve an additional $61 billion. The request has been stalled by Republicans' insistence that it be tied to an unrelated shift in immigration policy. \"Bipartisan support for Ukraine remains strong across the country,\" U.S. Under Secretary of State Victoria Nuland told reporters after a day of talks with Ukrainian leaders. \"The American people understand and admire the miracle that Ukraine has already achieved in defending itself against this vicious Russian aggression. They also understand what happens if you continue not only to survive but to thrive. \"I have great confidence that that understanding will be reflected in the vote that the Congress makes on this request from President Bidend,\" said Nuland, who has visited Ukraine several times over the past 10 years. Nuland said a new \"small-diameter\" bomb able to hit targets at greater distances would soon arrive in the country. Sources this week said the new weapon could be in Ukraine within days. \"We continue to provide security support in all categories, including new investments and new weapons systems,\" she said. \"Like the small-diameter bomb that is on its way to the front.\" Ukrainian President Volodymyr Zelenskiy's chief of staff has said that postponement of U.S. assistance for Kyiv would create a \"big risk\" of Ukraine losing the war with Russia. U.S. Treasury Secretary Janet Yellen told European Union officials on Wednesday that a failure by Congress to act on funding would hand a victory to Kremlin leader Vladimir Putin. Funding from the EU has also been stalled. EU leaders will discuss the future of an EU military fund at a summit on Thursday and try to reach agreement on a four-year economic aid plan for 50 billion euros ($54 billion) Nuland said she was leaving Kyiv \"more encouraged about (Ukraine's) unity and resolve, about 2024 and its absolute strategic importance for Ukraine.\" She predicted Ukrainian military successes in 2024 and that Putin \"is going to get some nice surprises on the battlefield\". Long-running differences between Zelenskiy and the commander of Ukrainian forces, Valery Zaluzhnyi, prompted a flurry of reports this week that the president had asked his commander to step down. \nA source familiar with the matter told Reuters on Wednesday that Ukraine's ground forces commander had declined an offer to take over the job. ($1 = 0.9248 euro)"
}