{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK101UI_L.jpg",
  "title": "Alberta restrictions for transgender youth 'extremely dangerous' -Canada minister",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 01, 2024 01:57PM ET",
    "Updated Feb 01, 2024 04:26PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/alberta-restrictions-for-transgender-youth-extremely-dangerous--canada-minister-3290369",
  "paragraph": "© Reuters. FILE PHOTO: Canada's Minister of Health Mark Holland rises to table a report in the House of Commons on Parliament Hill in Ottawa, Ontario, Canada September 18, 2023. REUTERS/Blair Gable\nBy Steve Scherer OTTAWA (Reuters) -Canada's health minister on Thursday said planned restrictions for transgender youth in the Western province of Alberta are \"extremely dangerous,\" a sign that policies could become a political wedge issue going into next year's election.  On Wednesday, conservative Alberta Premier Danielle Smith unveiled sweeping changes to policies related to students and gender identity. She plans to restrict the medical treatments they may seek, including prohibiting hormonal treatment, puberty blockers and gender-affirming surgery for children under 15 years of age and banning gender-related surgery for minors. Parents also will have to give permission for any student under 15 to use a different pronoun and name than the one given at birth, and transgender women will not be able to join female sports teams, Smith said. \"The decision that was made by Alberta places kids at risk. We know that one of the number one reasons why kids take their life is problems around sexual identity,\" Health Minister Mark Holland, a Liberal, told reporters.  \"I think it's extremely dangerous to engage in this kind of thing, which is, I think, playing politics when you're talking about children's lives,\" he added. Several Liberal ministers shared similar condemnations online or with reporters. Employment and Workforce Development Minister Randy Boissonault, the first openly LGBT member of parliament from Alberta, called the proposed rules \"draconian\". \"Trans kids aren't supposed to be part of your political strategy,\" Labor Minister Seamus O'Regan, who is gay, posted on social media platform X.  Alberta's guidelines would be the strictest introduced in Canada, and they are likely to fuel a debate that has polarized political parties in the United States for some time. \"We want to make sure that those adult decisions are made as adults,\" Smith told reporters on Thursday. \"Issues involving kids' reproductive health are not a political stunt.\" She said the rules would likely be implemented in the autumn.  \nFederal Conservative Party leader Pierre Poilievre has built a commanding lead in opinion polls against Liberal Prime Minister Justin Trudeau, mostly by hammering the government on cost-of-living issues. But in November of last year Poilievre did tell supporters that Trudeau \"does not have a right to impose his radical gender ideology on our kids and on our schools,\" without elaborating."
}