{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0F0P6_L.jpg",
  "title": "Exclusive-US targets Houthi anti-ship missiles in new strike on Yemen -officials",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 16, 2024 11:24AM ET",
    "Updated Jan 16, 2024 11:54AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/exclusiveus-targets-houthi-antiship-missiles-in-new-strike-on-yemen-officials-3275463",
  "paragraph": "© Reuters. FILE PHOTO: An aircraft takes off to join the U.S.-led coalition to conduct air strikes against military targets in Yemen, aimed at the Iran-backed Houthi militia that has been targeting international shipping in the Red Sea, from an undisclosed location,\nBy Idrees Ali and Phil Stewart WASHINGTON (Reuters) -The U.S. military on Tuesday carried out a new strike in Yemen targeting anti-ship ballistic missiles in a Houthi-controlled part of the country, two U.S. officials told Reuters, the latest military action against Iran-backed group over its targeting of Red Sea shipping.  U.S. officials, speaking on the condition of anonymity, said the strike on Tuesday targeted four anti-ship missiles. The strike has not been previously reported. Houthi attacks on Red Sea shipping have continued even after President Joe Biden last week ordered an initial wave of strikes to degrade Houthi capabilities.  The Houthis, who control most of Yemen's Red Sea coast, have claimed their attacks on commercial ships are aimed at supporting the Palestinians in Israel's war in Gaza. \nThe Houthi movement has pledged to expand its targets in the Red Sea region to include U.S. ships and has vowed to keep up attacks after U.S. and British forces carried out dozens of strikes last week against radar and missile capabilities. On Monday, Houthi forces struck the U.S.-owned and operated dry bulk ship Gibraltar Eagle with an anti-ship ballistic missile, the U.S. military said."
}