{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK06009_L.jpg",
  "title": "On Orthodox Christmas Putin vows to back soldiers who 'defend' Russia",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 06, 2024 07:25PM ET",
    "Updated Jan 07, 2024 03:40AM ET"
  ],
  "comments": [
    2,
    [
      [
        "Brad Albright",
        "2024-01-07 13:47:46",
        "I watched a compilation of drones recording wounded Russian soldiers shooting themselves in the head. I wonder how many of their last thoughts were of serving Putin's folly?",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Ac Tektrader",
        "2024-01-07 03:25:29",
        "more propaganda to quell the masses into sending more Russian youth to the meat grinder in Ukraine.",
        "https://www.investing.com/members/224473057"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/on-orthodox-christmas-putin-vows-to-back-soldiers-who-defend-russia-3268590",
  "paragraph": "© Reuters. Believers attend the Orthodox Christmas Eve service at a cathedral in the course of Russia-Ukraine conflict in Donetsk, Russian-controlled Ukraine, January 6, 2024. REUTERS/Alexander Ermochenko\n(Reuters) - President Vladimir Putin vowed on the eve of Orthodox Christmas to back soldiers who \"with arms in hands\" defend Russia's interests, ordering his government greater support of those who fight and calling on his people to be merciful and just.  \"Many of our men, our courageous, heroic guys, Russian warriors, even now, on this holiday, defend the interests of our country with arms in hand,\" Putin said at a late Saturday meeting with families of Russian soldiers who have died in Ukraine. Russia lunched its full-scale invasion on Ukraine in February 2022, in what Kyiv and its Western allies said was an unprovoked imperialistic land grab. Nearly two years later, the war, which has killed thousands and displaced millions, has shifted to increased air strikes at each other's territories as both sides have struggled to make significant gains along the frontline.  State television footage showed the Russian leader attending with a small group of families of soldiers killed an intimate midnight service, known as the Divine Liturgy, later on Saturday at a chapel at his residence in Novo-Ogaryovo outside Moscow. There was no call from Putin this year for a ceasefire in Ukraine to coincide with the holiday, which many Orthodox Christians celebrate on Jan. 6-7 - as was the case a year ago.  Ukraine said on Saturday that a Russian missile strike killed 11 people and injured 10 in and around the eastern Ukrainian city of Pokrovsk, while a Russian-installed official accused Kyiv of shelling parts of Donetsk now under Moscow's control.  Putin, who is facing elections in March and has been softening his speeches to focus on traditional values and unity, ordered the whole of his government a greater support to the families of killed servicemen. \"I would like our meeting to be a clear, understandable signal to all my colleagues throughout the Russian Federation, and at all levels - a clear signal to ensure that my colleagues are always and everywhere with you, I repeat, any level of power,\" he told the families.  GOODNESS, MERCY AND JUSTICE In a separate greeting issued on the Kremlin's website, Putin called on Russians to follow the \"unshakable\" values of \"goodness, mercy and justice\" and on the Russian Orthodox Church to help strengthen \"the institution of families\" and patriotism.  Putin has used the Orthodox Church as a powerful ally to promote his vision of a \"Russian World\" based on traditional conservative values, in contrast with what he portrays as a decadent West. Reflecting that trend, Russia last year banned what it called \"the international LGBT social movement\" on the grounds of \"extremism\". In Moscow's Christ the Saviour cathedral, people were able to pray in front of Russia's most famous religious painting - the 15th century Trinity icon, by Andrei Rublyov - which was brought out from a restoration workship and placed on display for a service on Orthodox Christmas Eve. Patriarch Kirill, the head of the Russian Orthodox Church, bowed his head before the painting and scattered incense from a censer as believers crossed themselves. The BBC Russian service reported that the fragile artwork had been taken to the cathedral the night before in temperatures of -20 Celsius (-4 Fahrenheit) and placed on view in an ordinary glass case without special protection to regulate its temperature and humidity. Putin transferred the artwork from Moscow's Tretyakov Museum and handed it to the Orthodox Church last year despite opposition from cultural experts who voiced fears over its preservation. Christmas services were also held in Russian-controlled areas of Ukraine - unlike the rest of Ukraine, where President Volodymyr Zelenskiy signed a law last July to change the date of the Christmas holiday to Dec. 25 from Jan. 7 as part of a drive to \"renounce Russian heritage\".  \nIn the southern Russian city of Belgorod, where 25 people were killed on Dec. 30 in Ukraine's deadliest cross-border attack of the war, Mayor Valentin Demidov said Christmas Eve services had been cancelled. The city, just 40 km (25 miles) from the border with Ukraine, has come under further sporadic rocket attack within the past week, overshadowing New Year and Christmas celebrations."
}