{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0F0G4_L.jpg",
  "title": "North Korean minister lauds 'comradely' ties with Russia, meets Putin in Kremlin",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 16, 2024 07:05AM ET",
    "Updated Jan 16, 2024 01:33PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/north-korea-lauds-comradely-ties-with-russia-putin-to-meet-kims-foreign-minister-3274903",
  "paragraph": "2/2\n© Reuters. North Korean Foreign Minister Choe Son Hui meets with her Russian counterpart Sergei Lavrov (not pictured), in Moscow, Russia, January 16, 2024. REUTERS/Maxim Shemetov/Pool\n2/2\nBy Guy Faulconbridge MOSCOW (Reuters) -North Korea's foreign minister lauded comradely ties with Russia on Tuesday and then held rare talks in the Kremlin with President Vladimir Putin, who has been invited by Kim Jong Un to visit the reclusive nuclear-armed country. The Kremlin said on the Telegram messaging app that North Korea's Choe Son Hui and Russia's Foreign Minister Sergei Lavrov had briefed Putin on the results of their talks earlier in the day. No further details were immediately available. Putin has deepened ties with North Korea since the 2022 invasion of Ukraine, and the United States and its allies have condemned what they say have been significant North Korean missile deliveries to Russia to help its war effort.  Both Russia and North Korea have repeatedly dismissed the criticism. Moscow says it will develop ties with whatever countries it wants and that its cooperation with Pyongyang does not contravene international agreements. Earlier on Tuesday, during her talks with Lavrov, North Korea's Choe hailed progress on implementing agreements struck during Kim's visit to eastern Russia last September. \"The fact that now the foreign ministers of the two countries often meet and deepen comradely ties is yet more proof that the Korean-Russian friendly relations, with a long history of friendship and tradition, are energetically moving forward in accordance with the plans of the leaders,\" Choe said. Lavrov, who visited North Korea last October, said they would discuss the broader situation on the Korean peninsula, and he cautioned the United States against making any threats, saying they would achieve little.  PUTIN VISIT?  During Kim's visit to Russia, Putin accepted an invitation to visit North Korea and Choe's talks in Moscow are expected to include discussions about that potential trip. \"As for Putin's visit, yes, it is on the agenda - there is a current invitation and Putin will definitely use it at a convenient time, by mutual agreement of the parties, of course,\" Kremlin spokesman Dmitry Peskov told reporters.  Russia has gone out of its way to publicise the renaissance of its relationship, including military ties, with North Korea, which was formed in 1948 with the backing of the then-Soviet Union. For Putin, who says Russia is locked in an existential battle with the West over Ukraine, courting Kim allows him to needle Washington and its Asian allies while securing a deep supply of artillery for the Ukraine war. For Kim, who has pledged to accelerate production of nuclear weapons to deter what he casts as U.S. provocations, Russia is a big power ally with deep stores of advanced missile, military, space and nuclear technology. \nWhen accompanying Kim on a tour of one of Russia's space launch sites in September, Putin said Russia would help Pyongyang build satellites and the two leaders discussed the possibility of sending a North Korean cosmonaut into space.  After taking over as president from Boris Yeltsin on the last day of 1999, Putin visited Pyongyang in July 2000 for a meeting with Kim Jong Il, the father of Kim Jong Un."
}