{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK1202H_L.jpg",
  "title": "Northern Ireland appoints Irish nationalist as First Minister in historic shift",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 03, 2024 08:11AM ET",
    "Updated Feb 04, 2024 03:31AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/northern-ireland-to-elect-first-irish-nationalist-first-minister-3291894",
  "paragraph": "© Reuters. FILE PHOTO: Vice President of Sinn Fein Michelle O'Neill leaves after voting at a polling station during local elections in Coalisland, Northern Ireland, May 18, 2023. REUTERS/Clodagh Kilcoyne/File Photo\nBy Amanda Ferguson and Natalie Thomas BELFAST (Reuters) -Northern Ireland's parliament appointed an Irish nationalist as First Minister for the first time on Saturday, a historic milestone in a state established a century ago to ensure the dominance of pro-British unionists. Michelle O'Neill's appointment, the delayed result of a watershed 2022 election, is the latest sign of the rise in the British region of a Sinn Fein party that has said its ultimate dream of a united Ireland is \"within touching distance\". The appointment came as Sinn Fein's pro-British rival, the Democratic Unionist Party (DUP), formally ended a two-year boycott of power-sharing government after striking a deal with the British government to ease post-Brexit trade frictions. \"This is an historic day which represents a new dawn,\" O'Neill, 47, told the assembly. \"I will serve everyone equally and be a First Minister for all. \"I am sorry for all the lives lost during the conflict without exception,\" O'Neill added.  Britain's minister for the region, Chris Heaton-Harris, said the restoration of government represented a \"great day for Northern Ireland\". U.S. President Joe Biden, who visited Belfast last year to urge a return to the power-sharing agreement, on Saturday called the restoration \"an important step\".  O'Neill represents a shift to a new generation of Sinn Fein politicians not directly involved in the region's decades-long bloody conflict between Irish nationalists seeking a united Ireland and pro-British unionists wanting to remain the United Kingdom. As the former political wing of the Irish Republican Army (IRA), Sinn Fein was long shunned by the political establishment on both sides of the border. It is now also the most popular party in the Irish Republic. The post of deputy First Minister, which has equal power but less symbolic weight, was taken by the DUP's Emma Little-Pengelly.  OPPOSITION There was heavy security around the assembly building, but no sign of trouble.  Opposition to O'Neill's appointment was led by the Traditional Unionist Voice party, which has also rejected the DUP's trade deal.  \"We have a Sinn Fein First Minister, but not in my name, nor in the name of thousands of unionists who will never bow the knee to IRA Sinn Fein,\" TUV's single deputy Jim Allister said.  While Sinn Fein has this week talked up the prospect of unity, all politicians in Northern Ireland are under intense pressure to deliver on bread-and-butter issues after the two-year hiatus piled pressure on already stretched public services. A referendum on unity is at the discretion of the British government and opinion polls consistently show a clear majority in favour of remaining part of the United Kingdom. The two-year shutdown is likely to lead to more calls for reform of the rules that have allowed the largest party on either side to repeatedly disable power-sharing for long periods.  Both the Irish and British governments have said they are open to considering reform. \n\"They're fed up,\" 40-year-old lawyer Tara Walsh said of the general mood on the streets of Belfast. \"People want change.\" Sinn Fein's pitch to voters at Northern Ireland's 2022 election focused on economic concerns, echoing its playbook in Ireland where the party has found success campaigning on everyday issues like housing."
}