{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBQ0EY_L.jpg",
  "title": "Tom Smothers, half of American comedy duo the Smothers Brothers, dies at 86",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 27, 2023 01:22PM ET",
    "Updated Dec 28, 2023 02:10AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/tom-smothers-half-of-american-comedy-duo-the-smothers-brothers-dies-at-86-3264110",
  "paragraph": "© Reuters. FILE PHOTO: Comedians and brothers, Tom (L) and Dick Smothers, star of the television series \"The Smothers Brothers Comedy Show\" accept the Favorite Singing Siblings award at the 3rd annual TV Land Awards in Santa Monica, California March 13, 2005. The aw\n(This Dec. 27 story has been corrected to fix the day to Tuesday in paragraph 1 and Wednesday in paragraph 2) By Jonathan Allen and Steve Gorman (Reuters) - American comic Tom Smothers, the elder half of the musical-comedy duo the Smothers Brothers, whose 1960s CBS variety show tested the limits of network censors and the boundaries of television satire, died on Tuesday at age 86. He died at his home in California following a battle with cancer, Smothers' family said in a statement released on Wednesday by the National Comedy Center.  Smothers and his younger brother, Dick, started out wanting to be folk singers but found success weaving comedy into their act, a formula they perfected in 1967 on CBS with \"The Smothers Brothers Comedy Hour,\" a precursor of \"Saturday Night Live\" and other satirical television shows. Tom played guitar and Dick played the stand-up bass, and both brothers sang. Their performance of songs usually digressed into comedy bits or arguments, often sparked by Tom mangling the lyrics, singing off-key or interjecting outlandish commentary. In his stage persona, Tom was the dimwitted, stammering older sibling forever provoking the calmer, more refined straight man played by his brother, spinning elaborate stories of their childhood and his resentment of Dick as their mother's favored son.  When trick-or-treating on Halloween, he recalled in one routine, their mother gave Dick a pillowcase in which to amass candy, while Tom had to make do with a sock. \"Tom was not only the loving older brother that everyone would want in their life, he was a one-of-a-kind creative partner,\" Dick Smothers said in a statement. \"Our relationship was like a good marriage – the longer we were together, the more we loved and respected one another.\" Tom Smothers was born in New York City on Feb. 2, 1937. His father, Thomas B. Smothers, was an officer of the U.S. Army who died in 1945 as a Japanese prisoner of war. The family moved to Southern California while Tom and Dick were children. In contrast to their clean-cut looks and the folksy underpinnings of their act, the brothers proved to be a subversively irreverent force on network television. Tom Smothers, the show's creative lead, recounted in interviews how he and his brother frequently fought with CBS executives over material poking fun at religion, drugs, politics and the Vietnam War in an era when social satire in prime time was still largely taboo.  Immediately popular with younger, more liberal viewers in the late 1960s, the show famously booked performers strongly identified with America's counterculture, including Joan Baez, The Who, Jefferson Airplane and The Doors.  Folk singer and activist Pete Seeger was invited onto the show for his first network TV appearance since being blacklisted in the 1950s for Communist Party affiliations. Seeger's performance of the anti-war song \"Waist Deep in the Big Muddy\" was initially censored from the show but was permitted on a subsequent appearance. Comedian Pat Paulson, the shows' double-talking \"editorialist,\" created friction when his faux presidential campaign in 1968 - under the slogan: \"If nominated I will not run, and if elected I will not serve\" - raised network fears that actual candidates would demand equal air time. The Smothers' battles over creative control of their show gradually escalated as they repeatedly missed deadlines network executives set for delivering the pre-recorded shows in time for CBS censors to edit them ahead of broadcast on Sunday nights. Despite continued high ratings, CBS abruptly canceled the program in June 1969, leaving Smothers convinced that newly inaugurated President Richard Nixon, had pressured CBS to pull the show off the air. Attempts by rival networks ABC and NBC to revive some version of a Smothers Brothers network variety show in the 1970s fizzled after very brief runs. \nIn a less well-known contribution to the pop culture of the era, Smothers also played acoustic guitar on John Lennon's 1969 anti-war song \"Give Peace a Chance,\" Lennon's first solo single while still a member of the Beatles. In a statement, the National Comedy Center called Smothers a pioneer and \"a true champion for freedom of speech, harnessing the power of comedy to push boundaries and our political consciousness.\""
}