{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK000GQ_L.jpg",
  "title": "Sudanese paramilitary leader Hemedti meets civilian leaders on tour",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 01, 2024 03:39PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/sudanese-paramilitary-leader-hemedti-meets-civilian-leaders-on-tour-3265147",
  "paragraph": "3/3\n© Reuters. FILE PHOTO: Deputy head of Sudan's sovereign council General Mohamed Hamdan Dagalo speaks during a press conference at Rapid Support Forces head quarter in Khartoum, Sudan February 19, 2023. REUTERS/Mohamed Nureldin Abdallah/File Photo\n2/3\nDUBAI/CAIRO (Reuters) - The leader of Sudanese paramilitary Rapid Support Forces (RSF) Mohamed Hamdan Dagalo met on Monday with civilian pro-democracy politicians in Addis Ababa, the latest stop in a foreign tour as his troops take the upper-hand in a devastating nine-month war. The meeting comes as General Dagalo, known as Hemedti, has appeared to present himself as a possible leader of a country now home to the world's largest displacement crisis, with little aid reaching millions in need amid threats of famine. He has also been received by leaders in Uganda, Ethiopia, and Djibouti, which army head and Sudan's head of state Abdel Fattah al-Burhan described as \"acts of hostility.\" The threat of further expansion of the RSF, which has taken hold of the center and most of the west of the country, has prompted calls for civilians to take up arms, with observers warning of all-out civil war. The local pro-democracy, anti-military resistance committee has accused the RSF of killing hundreds of civilians, kidnapping, and looting in Wad Madani, capital of Gezira State, which it took over late last month. Hundreds of thousands had sought refuge there from the capital Khartoum to the north. Civilians in the farming villages of the state reported similar activity, including RSF soldiers raiding homes demanding cars and women. That pattern, repeated throughout the war, prompted the U.S. last month to say that the RSF has committed war crimes and crimes against humanity, as well as ethnic cleansing in West Darfur state. In a speech before the meeting on Monday, Hemedti apologised for the violations in Gezira and said that RSF leadership was rounding up \"rogue actors.\" \"We ask the regional and international community to look optimistically at our struggle... towards Sudan's new future after achieving peace,\" echoing calls for equality and democracy long-espoused by the civilian politicians he met with on Monday.  Many in the group, including former Prime Minister Abdalla Hamdok, had been ousted from power in 2021, when the army and RSF led a coup ending Sudan's democratic transition after the 2019 downfall of Omar al-Bashir. In a speech late on Sunday, Burhan said that those who made allowances for the RSF were complicit in its crimes. Referencing previous talks in Jeddah, Burhan said that the way towards ending the war would be the exit of the RSF from Sudanese cities and Gezira state and the return of looted property. \nThe two leaders have accepted invitations by regional body IGAD to meet, but the details of a meeting have not been announced. The army has also been accused of war crimes by the U.S. Sudan Human Rights Monitor said in a report on Monday that it had killed 118 people in airstrikes on the western city of Nyala in late December."
}