{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0I0Q4_L.jpg",
  "title": "Jordan's PM urges US to take lead in ending Gaza \"carnage\"",
  "category": "Economy",
  "publisher": "Reuters",
  "date": [
    "Published Jan 19, 2024 04:19PM ET",
    "Updated Jan 19, 2024 05:17PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/economy/jordans-pm-urges-us-to-take-lead-in-ending-gaza-carnage-3278689",
  "paragraph": "© Reuters. Smoke rises over Gaza, amid the ongoing conflict between Israel and the Islamist group Hamas, as seen from Israel, January 19, 2024. REUTERS/Tyrone Siu\nBy Marc Jones LONDON (Reuters) - The United States and other top powers need to use their influence with Israel to end the ongoing \"carnage\" in Gaza, Jordan's Prime Minister, Bisher al Khasawaneh, said on Friday.  Jordan, which shares a border with the occupied West Bank, has been highly critical of Israel's bombardments of Gaza with Khasawaneh saying on Friday that they \"ticked all the boxes of war crimes against humanity.\" Israel has denied allegations that it has committed war crimes. Khasawaneh said heavyweight international diplomacy and influence was needed to secure a ceasefire. \"Leadership is needed from our American friends and our American partners, and from various capitals in the world, that can influence the decision making process in Israel in genuine terms to bring this carnage to an end,\" the Jordanian prime minister said at an event at the London School of Economics. He added that public opinion in the West was clear in its concerns about the violence and the pressure the international rules-based system was being put under around issues such as providing aid to the devastated parts Gaza. \"The main powers are under not only just a morale responsibility but also an obligation in the context of preserving the rules-based international system to come and tell the current Israeli government that this needs to stop,\" he said.  The hope was that then things could \"move into a mode that fundamentally resolves this vicious cycle of violence and killing,\" said Khasawaneh, who had been met with loud protests as he arrived at the event from LSE students and Arab diaspora. Israel and its biggest backer the United States appear at odds now, with Prime Minister Benjamin Netanyahu and his right-wing coalition government largely rejecting the establishment of a Palestinian state even though Washington maintains that the two-state solution is the only feasible way to bring lasting peace to the region. U.S. Secretary of State Antony Blinken, in his fourth trip to the Middle East last week since the Oct. 7 attack by Hamas, took a rough agreement to Israel that its predominately Muslim neighbours would help rehabilitate Gaza after the war and continue economic integration with Israel, but only if it committed to eventually allowing the creation of an independent Palestinian state. The latest episode of hostilities in the decades-old Israeli-Palestinian conflict started when Hamas militants stormed into southern Israel on Oct. 7, killing 1,200 people and taking 240 hostages. Israel says more than 130 remain in captivity. \nIsrael responded to Hamas' assault with a siege, bombardment and ground invasion of Gaza that have devastated the tiny coastal territory and killed more than 24,000 people, according to Gaza health officials. U.S.-brokered talks on a Palestinian state in territory now occupied by Israel collapsed almost a decade ago."
}