{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK05040_L.jpg",
  "title": "Anti-racists slam blackface use in Spain's Epiphany parades",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 06, 2024 10:36AM ET",
    "Updated Jan 06, 2024 11:41AM ET"
  ],
  "comments": [
    2,
    [
      [
        "dylan mulvaney",
        "2024-01-06 20:29:21",
        "Fake news, schools constantly teach about slavery, what they do not teach about is that the majority of global slavery is not due to white people but black people enslaving other black people. There are millions of slaves in Africa today. White people are the first people to end slavery of white people, and in fact in the US we fought a civil war to end slavery. Pretending to be offended by black face is just a symptom of a culture where there is so little actual racist them have to be offended by nonsense.",
        "https://www.investing.com/members/250212425"
      ],
      [
        "Stoxer One",
        "2024-01-06 18:22:55",
        "Reuters pushing its woke agenda as usual.",
        "https://www.investing.com/members/200770726"
      ],
      [
        "Brad Albright",
        "2024-01-06 18:27:45",
        "LOL. Another magabilly who thinks facts are woke. Sad.",
        "https://www.investing.com/members/236251128"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/antiracists-slam-blackface-use-in-spains-epiphany-parades-3268570",
  "paragraph": "3/3\n© Reuters. Participants dressed in costumes and wearing blackface, take part in the annual Epiphany eve parade of the Three Kings, in Alcoy, Spain January 5, 2024. REUTERS/Eva Manez\n2/3\nBy David Latona, Joan Faus and Eva Manez ALCOY, Spain/BARCELONA/MADRID (Reuters) - Anti-racism activists in Spain have called for a ban on the use of blackface seen in many of the country's traditional Epiphany celebrations. Rita Bosaho, the first Black woman in Spain's parliament, said the practice - part of annual Jan. 5 parades on the eve of Epiphany that depict the biblical Three Kings who brought gifts to Jesus - tarnish the memory of enslaved people and disempower Black children. In the parades, actors portraying the kings, or Magi, ride past on floats and fling sweets, which are eagerly scooped up by children. Early Christian texts describe one of the kings, Balthazar, as African and Renaissance paintings often depict him as Black. In the eastern town of Alcoy that has a long tradition of the parades, dozens of people acting the role of pages accompanied the kings in Friday's event, their faces painted black and with exaggerated, red-painted lips. Some ran along the edge of the crowd high-fiving children. Bosaho, who led the Equality Ministry's racial diversity department from 2020 to 2023, said the use of blackface in the parades persisted because of a lack of debate on racism that she said permeated Spanish society. \"It sends a message that racism, that our skin doesn't matter,\" Bosaho added. A spokesperson for the Equality Ministry was unavailable for comment during the holiday period. A 2021 study commissioned by the Equality Ministry found that although nearly half of people of African descent living in Spain were born in the country, only 12% described themselves as \"Afro-Spanish\" and 60% said they did not feel Spanish due to discrimination they suffered. People defending the use of blackface say they mean no harm and are just continuing a tradition. The northeastern town of Igualada holds the oldest parade in the Catalonia region and most of its around 800 participants wear blackface.  \"We don't consider ourselves xenophobic nor racist, nor do we consider racist the fact that some people dress up and apply makeup to act in a role and to bring joy to kids,\" said Eduard Creus, who leads the private organisation behind the parade. In Alcoy, the large gathering of pages with the kings are usually white local youths wearing blackface. \"We have our faces painted black because it's always been done and it's a great way for the local children of Alcoy who know us to be unable to know who we are,\" said Paula, who did not give her last name.  The local authority in Alcoy declined to be interviewed. MADRID INCIDENT  A video published on Thursday by authorities in Madrid's Chamartin district showed a white actor playing Balthazar wearing blackface and addressing children in an apparently mock-West African accent, sparking a widespread outcry online and in the media. \"It's incredible that among the 120,000 residents of Madrid who are of African descent, they were unable to find a single one who can play the role of Balthazar,\" said Eduardo Rubino of the left-wing Mas Madrid party, describing the accent as \"pathetic\" and \"pure racism\".  Madrid's deputy mayor told reporters the video was a \"regrettable error\" by the company that produced it and said the city would seek an explanation. Antoinette Torres, the founder of Afrofeminas, an online community seeking to boost Black womens' visibility, said there was a \"lack of political will to tackle racism\" but that nationwide legislation was needed to protect minors and end practices such as blackface.  \"Normalising these tendencies leads to things that shouldn't be tolerated in the 21st century are still happening in Spain,\" she said, mentioning last year's hanging of an effigy depicting Black Real Madrid player Vinicius Jr from a bridge.  \nShe added that many Spaniards do not see blackface as racist because the education system does not teach the country's past links to slavery and colonialism. Spain once had a protectorate that comprised part of modern-day Morocco and colonies in what are now Equatorial Guinea and Western Sahara, and engaged in the slave trade into the 1800s."
}