{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK110AN_L.jpg",
  "title": "'Take Our Border Back' vehicle convoy to rally near US-Mexico border",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 02, 2024 06:05AM ET",
    "Updated Feb 02, 2024 02:02PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/take-our-border-back-vehicle-convoy-to-rally-near-usmexico-border-3291002",
  "paragraph": "5/5\n© Reuters. Vendors sell Texas and American flags at a rally hosted by the 'Take Back Our Border' trucker convoy against migrants crossing from Mexico, in Dripping Springs, Texas, U.S., February 1, 2024. REUTERS/Go Nakamura\n2/5\nBy Helen Coster, Ted Hesson and Mica Rosenberg (Reuters) - A vehicle convoy carrying Americans opposed to illegal immigration plans to rally at three points near the U.S.-Mexico border on Saturday, with organizers saying the action will focus on peaceful protest and prayer. Critics of the convoy, however, worry it could fuel anti-immigrant sentiment at a time of acrimonious political sparring over the border and high numbers of migrant crossings. The “Take Our Border Back” convoy set off from Virginia this week and aims to hold events near Eagle Pass, Texas - the site of an ongoing standoff between the U.S. state and federal authorities over border security - as well as in Yuma, Arizona, and San Ysidro, California.  Two truckers who led legs of the convoy - Vincent Saben of Massachusetts and Kip Coltrin of Louisiana - estimated between 70 and 300 vehicles had participated as of Thursday morning. Reuters could not independently verify the figures. The convoy hopes to bring more attention to border security as the number of migrants caught illegally crossing into the U.S. has reached record highs under President Joe Biden, a Democrat seeking reelection in November. Republicans, including former President Donald Trump, the party’s leading presidential candidate, have called for more restrictive policies and sought to motivate their base voters with the issue. Eagle Pass has become a flashpoint in a dispute between the White House and Texas’ Republican Governor Greg Abbott over federal and state powers to deal with illegal immigration. Texas has deployed National Guard troops to the border and laid concertina wire and floating buoy barriers in the Rio Grande in an effort to deter migrant crossings, leading to legal and political disputes with the Biden administration.  In a separate high-profile event in Eagle Pass planned for Sunday, Abbott is due to appear with 14 Republican governors to defend the state’s border enforcement actions.  U.S. Customs and Border Protection did not respond to a request for comment regarding the convoy. A Reuters/Ipsos poll in late January found rising concern about immigration among Americans, with Republicans ranking it as the top issue. Trump has made immigration a key focus of his reelection campaign and sparked controversy by repeatedly saying that immigrants in the U.S. illegally were \"poisoning the blood of our country,\" language that has drawn criticism as xenophobic and echoing of Nazi rhetoric. BOOSTED ONLINE Details about the convoy have reverberated around right-wing media, amplified by high-profile figures including former Fox News host Tucker Carlson and Infowars founder and conspiracy theorist Alex Jones. Participants and supporters have organized and promoted the convoy on social media and in chat groups, including a “Take Our Border Back” Telegram channel, which as of Thursday had more than 4,400 members. A video promoting the convoy begins with “Warning: Invasion Alert,” and organizers and advisers have framed the action in religious, sometimes apocalyptic terms, describing the convoy in an interview streamed on online video platform Rumble as “God’s vision” and the illegal border crossings as “the biggest spiritual battle the world has ever seen.”  Coltrin said the event was intended to be peaceful and organizers expected a “hefty” law enforcement presence at the rallies. “Should migrants cross, that is no business of the convoy,” he said, adding that while some participants might be armed, Texas is an “open carry” state. Stephen Piggott, an expert on right-wing extremism at the social-justice nonprofit Western States Center, said he is concerned that the convoy and attention it has generated could spur more people into taking action against migrants or the groups that assist them, regardless of how many people show up at the rally. In 2022 a similar \"People's Convoy\" of more than a thousand vehicles traveled from California to the outskirts of Washington, D.C., as part of a protest against COVID-19 restrictions. \nRepublican Representative Tony Gonzales, whose district includes Eagle Pass, told Reuters he understands many Americans are frustrated over border issues, but that he won’t be joining Saturday’s rally. “Those of us that live on the border, that work on the border, we're exhausted,” Gonzales said. “Eagle Pass, three years ago, no one even knew it existed. And now it's in the news every single day. And many of us, all of us, we just want to get our lives back.”"
}