{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0S0HG_L.jpg",
  "title": "Factbox-What is Iran’s ‘Axis of Resistance’, which groups are involved?",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 29, 2024 10:09AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/factboxwhat-is-irans-axis-of-resistance-which-groups-are-involved-3286124",
  "paragraph": "2/2\n© Reuters. A cleric member of Basij paramilitary forces attends a rally in support of Palestinians, in Tehran, Iran, November 24, 2023. Majid Asgaripour/WANA (West Asia News Agency) via REUTERS/File Photo\n2/2\n(Reuters) - Groups backed by Iran have been waging attacks on Israeli and U.S. targets since war erupted between its Palestinian ally Hamas and Israel on Oct. 7, a campaign that has regionalised the Gaza conflict and fuelled fears of wider escalation. In one of the latest such attacks, three U.S. servicemen were killed and at least 34 wounded in a drone attack by Iran-backed militants in northeastern Jordan near the Syrian border, U.S. Central Command said on Sunday. Following are key groups involved in attacks. THE ISLAMIC RESISTANCE IN IRAQ An umbrella group of hardline Shi'ite Muslim armed groups close to Iran, the Islamic Resistance in Iraq claimed an attack near the Syrian-Jordanian border around the same time U.S. officials said their troops were targeted. They have claimed more than 150 attacks on bases housing U.S. forces in Syria and Iraq since October, leading to dozens of mostly minor injuries and drawing several rounds of U.S. strikes in response. Iranian-backed Shi'ite groups emerged as powerful players in Iraq after the 2003 U.S.-led invasion, with tens of thousands of fighters. Shi'ite armed groups played a leading role in battling the ultra-hardline Sunni Islamist Islamic State group, fighting as part of the Hashid Shaabi, or the Popular Mobilisation Forces. While members of these armed groups receive state salaries and are technically under the authority of the prime minister, they often operate outside the chain of command. Those targeting U.S. forces in recent months include Kataib Hezbollah and the Nujaba group, both of which are closely linked to Iran's elite Revolutionary Guards. Their arsenal includes explosive drones, rockets and ballistic missiles. Their statements have declared their operations as part of an effort to \"resist American occupation forces in Iraq and the region\", and carried out in \"response to the massacres\" committed by Israel against Palestinians in Gaza. The groups are designated terrorist organisations by the United States. YEMEN'S HOUTHIS The Houthi movement, which controls large parts of Yemen, announced it had entered the conflict on Oct. 31, firing drones and missiles at Israel more than a thousand miles from their seat of power in Sanaa. In November, the Houthis expanded their role by attacking shipping in the southern Red Sea, saying they were targeting vessels belonging to Israelis or heading to Israeli ports - though some of the targeted ships had no known Israeli links. The campaign prompted the United States and Britain to launch air strikes against Houthi targets in Yemen in January. The Houthis declared all U.S. and British ships and warships taking part in \"the aggression\" would be targets for the group. The attacks have disrupted international commerce on the shortest shipping route between Europe and Asia, leading some shipping companies to reroute their vessels. The United States believes Iran's Revolutionary Guards (IRGC) have been helping to plan and carry out the Houthi missile and drone attacks. Iran denies involvement. Sources told Reuters earlier this month that commanders from the IRGC and Hezbollah are on the ground in Yemen helping to direct and oversee Houthi attacks on Red Sea shipping. The Houthis denied any Hezbollah or Iranian involvement. The United States returned the Houthis to its list of designated terrorist groups in response to the shipping attacks. LEBANON'S HEZBOLLAH The heavily armed Lebanese group Hezbollah has been mounting near daily attacks on Israeli targets at the Lebanese-Israeli border since Oct. 8, prompting the heaviest exchanges of fire between the enemies since they waged full-scale war in 2006. Hezbollah says its attacks have helped to stretch the Israeli army while also uprooting tens of thousands of Israelis who have fled homes near the border. Israeli air and artillery strikes have also forced tens of thousands of Lebanese to flee. More than 150 Hezbollah fighters and at least 25 Lebanese civilians have been killed, in addition to at least nine Israeli soldiers and a civilian. A U.S. envoy has been engaged in efforts to prevent the violence from spiralling into an even bigger conflict. Founded by Iran's Revolutionary Guards in 1982, Hezbollah has served as a model for other Tehran-backed groups across the region, and has also advised or trained some of them. \nHezbollah is widely regarded as more powerful than the Lebanese state and shares Iran's Shi'ite Islamist ideology. The United States designates Hezbollah as a terrorist organisation."
}