{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0L0N8_L.jpg",
  "title": "As deep freeze grips the South, North Carolina gators chill out",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 22, 2024 01:29PM ET",
    "Updated Jan 22, 2024 04:45PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Robert Ruff",
        "2024-01-22 19:09:13",
        "That's a picture of Milwaukee ",
        "https://www.investing.com/members/207773642"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/as-deep-freeze-grips-the-south-north-carolina-gators-chill-out-3279945",
  "paragraph": "By Rich McKay and Julia Harte (Reuters) - The deep freeze that gripped the U.S. South this weekend forced a band of alligators at a North Carolina wildlife park out of their comfort zone, trapping them under an ice layer with only their toothy snouts jutting above the frozen surface, enabling them to breathe. Year-round the Swamp Park in Ocean Isle Beach offers visitors a chance to get up close to its menacing reptilian residents. But in recent days, the creatures - or the living \"gatorcicles,\" as the park staff dubbed them on social media - presented a more wondrous sight than usual. The creatures had suspended themselves with their snouts just above the frozen surface of their ponds in order to \"brumate,\" a lighter reptilian version of hibernate, which is what bears and some other mammals do to survive in cold weather. \"We have alligators in ice, folks,\" said a park staffer in a video posted to the park's Facebook (NASDAQ:META) page. \"Welcome to 2024.\" Swamp Park lies about 175 miles south of Raleigh and four miles inland from the Atlantic Ocean, close to the northern limit of the American alligator's range in the wild. The species is unable to tolerate the typically colder winters north of the state. Like all reptiles, the gators are cold-blooded, meaning their bodies are unable to generate their own heat and must rely on the environment to warm up. This winter has featured plenty of atypical weather. An Arctic blast swept across the entire United States last week, causing unusually chilly temperatures in many Southern states, said Marc Chenard, a meteorologist with the U.S. National Weather Service (NWS). Raleigh reached a low of 18 degrees Fahrenheit (minus 8 degrees Celsius) on Sunday night, but temperatures are expected to climb into the 40s and 50s over the week, which should thaw the alligators out of their brumation. The average high for Raleigh this time of year is 52 F (11 C) and the average low is 32 F (0 C). \"It only warms up from here,\" Chenard said. The freezing temperatures have claimed dozens of human lives, especially in states unused to extreme cold.  An unhoused man accidentally set himself on fire and died under a bridge while trying to stay warm on Saturday night in Atlanta, where wind chills sent temperatures plunging to 5 F (minus 15 C), according to local reports.  In Tennessee, the health department said the state recorded 27 deaths related to the Arctic blast since last week, the Tennessean newspaper reported. Public schools in Nashville canceled classes for a sixth day in a row on Monday, with school officials saying they would decide by late afternoon if classes can resume on Tuesday."
}