{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBQ07D_L.jpg",
  "title": "Mexico's weed 'nuns' want to take the plant back from the narcos",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 28, 2023 11:11AM ET",
    "Updated Dec 28, 2023 11:19AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/mexicos-weed-nuns-want-to-take-the-plant-back-from-the-narcos-3264448",
  "paragraph": "15/15\n© Reuters. A member of Sisters of the Valley, a non-religious international group founded in 2014 which has pledged to spread the gospel of the healing powers of cannabis, who uses the moniker \"Sister Bernardet\" online and asked not to give her name for fear of repr\n2/15\nBy Sarah Kinosian (Reuters) - Beneath each full moon on the outskirts of a village in central Mexico, a group of women in nun habits circle around a roaring fire, cleanse themselves with burned sage, and give thanks for the moon, animals, and plants.  Then they inhale deeply from a joint and blow clouds of marijuana into the flames. Despite their clothing, the women are not Catholic or any other religion. They are part of an international group founded in 2014 called Sisters of the Valley, which has pledged to spread the gospel of the healing powers of cannabis. In the United States, where around two dozen states have legalized recreational marijuana, the group has also launched a successful small business, selling CBD tinctures, oils and salves online, and raking in over $500,000 last year. But in Mexico, where a drug war has ravaged the country and Christianity is embedded in society, the image of a marijuana-smoking nun is more an act of rebellion, the women say. The sisters frequently post on social media, primarily Instagram, where they can be seen caring for cannabis crops, giving workshops, and attending cannabis-related events. Their product sales are a fraction of that of their U.S. sisters - around $10,000 annually. While prominent online, the women - five in total - are cautious about giving away too much about the location of their operations. They conduct business out of a two-story concrete false storefront with one finished room. Because cannabis sits in a legal gray area in Mexico and much of its production is still tied to criminal organizations, they worry police or local gangsters could arrive to threaten or extort them. On a recent weekend when Reuters visited, the curtains remained drawn. Bundles of marijuana dried in clandestine crevices – hanging from a tucked-away laundry line, or hidden in the stove.  \"The Sisterhood is in a totally different context here in Mexico – because of how religious the country is and because of the plant's ties to cartels,\" said one of the nuns, who uses the moniker \"Sister Bernardet\" online and asked not to give her name for fear of reprisal. In her main job as a homeopathic practitioner, she prescribes marijuana to her patients with cancer, joint pain and insomnia. \"We want to take the plant back from the narcos,\" she said. The Sisters fashion themselves after a lay religious movement, the Beguines, that dates back to the Middle Ages. The group, made up of single women, devoted itself to spirituality, scholarship and charity, but took no formal vows. The Sisters globally say they wear habits to project uniformity and respect for the plant, but they also know it catches media attention. Under the guidance of Alehli Paz, a chemist and marijuana researcher working with the group, the Sisters in Mexico grow a modest crop.  They pot plants in old paint buckets and place them in rows between four unfinished concrete walls on a rooftop.  Once grown, the Sisters move the plants to walled-off private gardens they identified with help from supportive older women in the community.  Their participation is limited to weekends they can steal away from their lives. Powered by a seemingly never-ending stream of joints and packed pipe bowls, the women spend time at the farm pruning plants, producing cannabinoid salves or weighing and storing different strains, labeled and dated, in old glass coffee jars. They also visit others in Mexico City pushing for full legalization in the growing cannabis community, or give workshops that touch on everything from how to make weed infusions to the chemistry behind the plant.  Business potential aside, they argue that the fight against drugs in Latin America has been a failure, leading to widespread violence and mass incarceration. But in a roughly 75% Catholic majority, conservative country locked in a drug war with criminal groups for nearly 20 years, joining the Sisters has created tension in nearly all of the women's families. Its founder in Mexico, who calls herself \"Sister Camilla\" online and declined to give her name, grew up in an evangelical household and left home at 16 due, in part, to her mother's strict religious code, she said. When she started Sisters of the Valley Mexico, the relationship became even more strained.  \"It was hard for her to accept,\" she said. \"She had certain ideas, heavily shaped by religion.\"  \nBut today, after lengthy discussions about the plant and the legalization movement, her mother is pivotal to the group's operations, helping to maintain the farm and offering other logistical support, she said. For another nun who works as a church secretary, uses the moniker \"Sister Kika\" and asked her name not be used, the mission is clear. \"It's time to put an end to this stupidity,\" she said.  (Photography by Raquel Cunha; Reporting and writing by Sarah Kinosian; Additional reporting by Andrea Rodriguez; Editing by Rosalba O'Brien)"
}