{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0N0P5_L.jpg",
  "title": "NATO's largest military exercise since Cold War kicks off",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 24, 2024 12:46PM ET",
    "Updated Jan 24, 2024 05:15PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/natos-largest-exercise-since-cold-war-kicks-off-3282051",
  "paragraph": "© Reuters. FILE PHOTO: Banners displaying the NATO logo are placed at the entrance of new NATO headquarters during the move to the new building, in Brussels, Belgium April 19, 2018. REUTERS/Yves Herman/File Photo\nWASHINGTON (Reuters) - The U.S. Navy dock landing ship Gunston Hall left port on Wednesday to mark the first movement for the largest NATO exercise since the Cold War, officials said. WHAT IS HAPPENING Some 90,000 troops from the United States and fellow NATO allied nations are due to join the Steadfast Defender 2024 drills that will run through May. More than 50 ships from aircraft carriers to destroyers will take part, as well as more than 80 fighter jets, helicopters and drones and at least 1,100 combat vehicles including 133 tanks and 533 infantry fighting vehicles. The drills will rehearse NATO's execution of its regional plans, the first defence plans the alliance has drawn up in decades, detailing how it would respond to a Russian attack. WHY IT'S IMPORTANT NATO did not mention Russia by name in its announcement. But its top strategic document identifies Russia as the most significant and direct threat to NATO members' security. The exercise comes at an important moment after Russia's invasion of Ukraine started the deadliest war on European soil in more than 70 years. KEY QUOTES \"#NATO today launched its biggest military exercise since 1988 with 90,000 personnel taking part in drills across the North Atlantic and Europe,\" Matthias Eichenlaub, a NATO spokesperson, said on Twitter. \"The departure of the @USNavy's Gunston Hall from Norfolk marked the (official) start of #SteadfastDefender24.\" \nRUSSIAN RESPONSE The scale of NATO's Steadfast Defender 2024 exercises mark an \"irrevocable return\" of the alliance to Cold War schemes, Russia's Deputy Foreign Minister Alexander Grushko told the state RIA news agency in remarks published on Sunday."
}