{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0U0AG_L.jpg",
  "title": "Israeli PM says UN agency for Palestinians must close, Israeli warplanes strike Gaza",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 31, 2024 04:03AM ET",
    "Updated Jan 31, 2024 03:34PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/israeli-forces-pound-gaza-hamas-studies-ceasefire-proposal-3287843",
  "paragraph": "3/3\n© Reuters. Israeli soldiers operate in the Gaza Strip amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, in this screen grab taken from a handout video released on January 31, 2024. Israel Defense Forces/Handout via REUTERS \n2/3\nBy Henriette Chacar, Mohammad Salem and Nidal al-Mughrabi JERUSALEM/GAZA/DOHA (Reuters) - Israeli Prime Minister Benjamin Netanyahu called on Wednesday for the closure of the U.N. Palestinian refugee agency (UNRWA) as his forces conducted more air strikes in Gaza amid diplomatic efforts for a ceasefire and release of hostages in the enclave. Israel has accused some UNRWA staff of involvement in the Oct. 7 Hamas assault in southern Israel that triggered the war in Gaza. Donors including the United States have paused funding pending an investigation, but aid agencies say ending UNRWA operations would wreck humanitarian efforts in devastated Gaza. The Palestinians have accused Israel of falsifying information to tarnish UNRWA, which was set up to help refugees of the war at Israel's founding in 1948 and to which more than half Gaza's population look to for day-to-day assistance. \"It's time the international community and the U.N. itself understand that UNRWA's mission has to end,\" Netanyahu told visiting U.N. delegates, according to his office. He said UNRWA should be replaced by other aid agencies \"if we are going to solve the problem of Gaza as we intend to do\". Earlier, U.N. Secretary-General Antonio Guterres described UNRWA as \"the backbone of all humanitarian response in Gaza\" and appealed to all countries to \"guarantee the continuity of UNRWA's life-saving work\". In Gaza, witnesses said Israel had stepped up air strikes on Gaza City, in the north, and bombarded parts of Khan Younis, in the south, despite what appeared to be the most serious peace initiative for months in the Israel-Hamas war. Hamas, the militant Palestinian group that runs Gaza, is currently studying the proposal, which envisages the release of all remaining hostages seized on Oct. 7. Israel says they number around 136. Hamas has demanded an end to Israel's offensive. World powers hope to prevent a wider conflict, but tensions in the Middle East remain high after Yemen's Iran-aligned Houthi rebels said they would keep attacking U.S. and British warships in the Red Sea in solidarity with Palestinians. Relations between Tehran and Washington are also tense after the deaths of three U.S. soldiers in a drone strike in Jordan that U.S. officials blame on Iran-backed militants. Washington has not yet outlined its response, but Iran's Revolutionary Guards said on Wednesday they would respond to any U.S. threat. DEVASTATION Much of the densely populated Gaza Strip has been devastated by almost four months of Israeli bombardment, and most of its 2.3 million residents have been uprooted by fighting that has caused the world's biggest humanitarian crisis. Gaza health authorities said 26,900 Palestinians had been killed - including 150 over the past 24 hours - so far in the war that was triggered after Hamas fighters stormed into Israeli towns on Oct. 7, killing 1,200 and taking 253 hostages. Israel's military said its forces had killed at least 25 Palestinian militants in Gaza in the past 24 hours, and that three Israeli soldiers had been killed - taking to 224 the number of troops killed during Israel's ground offensive. Smoke rose above Gaza City after the latest air strikes, some of which targeted the headquarters of the Hamas-run interior ministry, Hamas-run media and residents said.  The Al-Nuseirat refugee camp in central Gaza came under fire and tanks pounded areas of Khan Younis around Nasser Hospital, the largest still functioning in the south, witnesses said. As the health system deteriorates, Palestinian medics say they have formed field medical points to help reach front lines, as treating the wounded in Khan Younis has become increasingly difficult amid street battles and artillery strikes. \"There's a lot of injuries among the displaced who were in the industrial quarter and some schools,\" said Nassim Hassan, the head of the Emergency Unit at Nasser Hospital, adding that \"many of the injured left loaded on carts, tuk-tuks, cars or even on foot.\" THREE-STAGE TRUCE A senior Hamas official told Reuters the Gaza ceasefire proposal involved a three-stage truce, during which Hamas would release the remaining civilians among hostages captured on Oct. 7, then soldiers, and finally the bodies of dead hostages. The proposal followed talks in Paris involving intelligence chiefs from Israel, the U.S. and Egypt, with the prime minister of Qatar. The U.S. ambassador to the United Nations urged Hamas on Wednesday to accept the proposal, saying it would allow more vital food, water and medicine supplies to enter Gaza. \"(Hamas) can continue to dig tunnels, to plan for its next attack, to use civilians and civilian infrastructure as human shields, or it can lay down its weapons and accept the proposal on the table to release every hostage,\" Linda Thomas-Greenfield told a meeting of the U.N. Security Council. \nPalestinians said the fighting in Gaza must end for good. \"Any ceasefire that doesn't end the war and return us to our homes in Gaza City and the north is not worth it,\" Ahmed, who fled his home in Gaza City for Rafah in the south, said by telephone. \"We are exhausted.\""
}