{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBQ002_L.jpg",
  "title": "Denver police probe threats to Colorado judges in Trump ballot case",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 26, 2023 07:07PM ET",
    "Updated Dec 26, 2023 08:25PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Jimmy Doodoo",
        "2023-12-27 06:25:56",
        "Fake news",
        "https://www.investing.com/members/240314649"
      ],
      [
        "Brad Albright",
        "2023-12-27 13:11:34",
        "Another magaloon living in denial.",
        "https://www.investing.com/members/236251128"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/denver-police-probe-threats-to-colorado-judges-in-trump-ballot-case-3263748",
  "paragraph": "© Reuters. A general view of the Colorado Supreme Court in Denver, Colorado, U.S., December 20, 2023, a day after the court ruled that former President Donald Trump is disqualified from serving as U.S. President and cannot appear on the primary ballot in Colorado fo\nBy Keith Coffman DENVER (Reuters) - Colorado authorities are investigating possible threats against state Supreme Court justices, Denver police said on Tuesday, one week after the court's decision barring former President Donald Trump from the state's presidential primary ballot. The Denver Police Department also said it was providing \"extra patrols\" around the homes of the justices, who ruled 4-3 on Dec. 19 that Trump should be disqualified under a little-known clause of U.S. Constitution's 14th Amendment for engaging in insurrection. Two nights later, Denver police officers were dispatched to the home of one of the justices in response to a call for service that police afterward described as an apparent \"hoax report,\" adding they were still investigating the incident. Republican strategists have suggested the Colorado ballot ruling, likely headed for a U.S. Supreme Court appeal, would spark a backlash among political conservatives by reinforcing the narrative that Trump is the victim of a partisan legal process. NBC News and other media outlets have since reported the emergence of violent rhetoric on right-wing online forums from Trump supporters aimed at the four Colorado justices who sided against him. The posts in question included messages calling for the justices' personal information to be publicly exposed, and an apparent reference to the judges that said: \"All f**ing robed rats must f**ing hang.\" \"The Denver Police Department is currently investigating incidents directed at Colorado Supreme Court justices and will continue working with our local, state and federal law enforcement partners to thoroughly investigate any reports of threats or harassment,\" police said in a statement on Tuesday. Responding to a query about the probe, an FBI spokesperson in Denver said in a statement the agency was \"aware of the situation and working with local law enforcement.\" \"We will vigorously pursue investigations of any threat or use of violence committed by someone who uses extremist views to justify their actions regardless of motivation,\" the FBI statement added. Neither the police nor the FBI commented on the nature or extent of the incidents under investigation. A spokesperson for the Colorado state judicial branch likewise declined to comment on the issue. Trump became the first candidate in U.S. history deemed ineligible for the White House under a provision of the 14th Amendment prohibiting officials who engage in \"insurrection or rebellion\" against the U.S. government from holding elected office. The Colorado high court held that the insurrection clause applies to Trump because of the role he played in stoking the Jan. 6, 2021, attack on the U.S. Capitol by a mob of his supporters seeking to block Congress from certifying Democrat Joe Biden's victory over Trump in the 2020 presidential race. \nThe Colorado court, whose decision applies only to the state's March 5 Republican primary, said it would delay the effect of its ruling until at least Jan. 4, 2024, to allow time for an appeal. (This story has been refiled to fix a typo in paragraph 4)"
}