{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0E0AA_L.jpg",
  "title": "Taiwan loses ally Nauru, accuses China of post-election ploy",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 15, 2024 12:40PM ET",
    "Updated Jan 15, 2024 12:46PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/taiwan-loses-ally-nauru-accuses-china-of-postelection-ploy-3274504",
  "paragraph": "2/2\n© Reuters. An empty flag pole where Nauru's flag used to fly is pictured next to flags of other countries at the Diplomatic Quarter which houses embassies in Taipei, Taiwan January 15, 2024. REUTERS/Carlos Garcia Rawlins\n2/2\nBy Kirsty Needham and Yimou Lee SYDNEY/TAIPEI (Reuters) -Taiwan lost one of its few remaining diplomatic allies Nauru to China on Monday, just days after it elected a new president, and accused China of attempting to pressure it while it affirmed the will of Taiwanese to go out into the world. China claims Taiwan as its own territory with no right to state-to-state ties, a position Taiwan strongly disputes, and the two have for years traded accusations of using \"dollar diplomacy\" as they compete for diplomatic recognition. Taiwan security officials told Reuters before Saturday's election that China was likely to continue to whittle away at the handful of countries - now down to a dozen - that maintain formal diplomatic ties with Taipei. Lai Ching-te, repeatedly criticised by China before the poll as a dangerous separatist, won the election for the ruling Democratic Progressive Party (DPP) and will take office on May 20. The government of the tiny Pacific Island nation of Nauru said that \"in the best interests\" of the country and its people it was seeking full resumption of diplomatic relations with China and would cut ties with Taiwan.  Nauru has recognised China before, between 2002 and 2005. China and the United States have in recent years stepped up their competition for influence in the Pacific. In 2019, Kiribati and the Solomon Islands both ditched Taiwan for China in the space of a week. The U.S. affirmed that its commitment to Taiwan is \"rock solid\" after Saturday's election, in comments delivered by former U.S. National Security Advisor Stephen Hadley on Monday during a trip to the island. Taiwan's Deputy Foreign Minister Tien Chung-kwang told a hastily arranged media briefing after Nauru's announcement that the news had come suddenly. Beijing specifically chose the sensitive timing after the election to target Nauru, Tien said, calling the move \"ambush-like\" and equivalent to a \"a blatant attack on democracy\", just as many countries were offering congratulations to Taiwan on the smooth voting process. \"Taiwan did not bow to the pressure. We elected what we want to elect. That's unbearable for them,\" he added. China had offered Nauru, with a population of 12,500, money far in excess of what Taiwan provides its allies, Tien said. \"Once again, it proves that China's trying everything they can – money diplomacy – to repress us,\" he said. A senior Taiwan official briefed on the matter, speaking on condition of anonymity as they were not authorised to speak to the media, said Beijing is offering Nauru $100 million a year. A Nauru government spokesperson declined to comment China's foreign ministry said it appreciated and welcomed Nauru's decision. It did not directly answer a question on how much money it offered. \"Nauru, as a sovereign state, has made the right choice to resume diplomatic relations with China independently,\" ministry spokesperson Mao Ning said in Beijing. Taiwan's presidential office said Beijing's move amounted to suppression of the island's diplomatic space but could not undermine the will of the Taiwanese people to go to the world, nor could it change the fact that Taiwan and China are not subordinate to each other. Taiwan's 12 remaining diplomatic allies include the Vatican, Guatemala and Paraguay, plus Palau, Tuvalu and the Marshall Islands in the Pacific. Taiwan Foreign Minister Joseph Wu is in Guatemala attending the inauguration of its new president. Nauru is a small and remote Pacific Island nation that uses Australian currency and generates revenue from fishing licences and hosting a regional processing centre for refugees for the Australian government. An Australian bank providing the country's only banking service announced in December its plan to close its Nauruan operation. \nAustralia provides policing support and is a major aid donor, contributing A$46 million (US$31 million) in development assistance in 2023. The refugee processing centre was forecast to generate A$160 million in 2024, although Australia plans to wind it down over time. (A$1 = 0.6671 US$)"
}