{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBQ0FS_L.jpg",
  "title": "Biden says US air strikes in Iraq aimed to deter Iran, militants from attacks",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 27, 2023 02:50PM ET",
    "Updated Dec 27, 2023 03:15PM ET"
  ],
  "comments": [
    2,
    [
      [
        "Teena Marie",
        "2023-12-29 03:39:08",
        "Iran-aligned groups in Iraq and Syria are limited. Houthis stronghold is in Yemen.",
        "https://www.investing.com/members/242916302"
      ],
      [
        "Teena Marie",
        "2024-01-06 19:38:44",
        "***Disregard first sentence. I was trying to say something else.",
        "https://www.investing.com/members/242916302"
      ],
      [
        "Barry Nickerson",
        "2023-12-27 20:23:09",
        "That's a start.  When anyone, anywhere starts shooting at our troops, level them.  Next, start sinking all the Houthie boats.",
        "https://www.investing.com/members/249373719"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/biden-says-us-air-strikes-in-iraq-aimed-to-deter-iran-militants-from-attacks-3264124",
  "paragraph": "© Reuters. U.S. President Joe Biden holds an event about American retirement economics in the State Dining Room at the White House in Washington, U.S., October 31, 2023. REUTERS/Leah Millis/ File Photo\nBy Kanishka Singh WASHINGTON (Reuters) - The U.S. military's air strikes on Monday in Iraq aimed to deter Iran and Iran-backed militia groups from conducting or supporting attacks on United States personnel and facilities, President Joe Biden said on Wednesday. WHY IT'S IMPORTANT  The U.S. military carried out retaliatory air strikes on Monday in Iraq after a drone attack earlier in the day by Iran-aligned militants that left one U.S. service member in critical condition and wounded two other U.S. personnel. The back-and-forth clash was the latest demonstration of how the war in Gaza between Israel and Palestinian Islamist group Hamas risks rippling across the Middle East. KEY QUOTES \"The strikes were intended to degrade and disrupt the ongoing series of attacks against the United States and our partners, and to deter Iran and Iran-backed militia groups from conducting or supporting further attacks on United States personnel and facilities,\" Biden said in a letter on Wednesday to the top leaders of the U.S. Congress. \"The United States stands ready to take further action, as necessary and appropriate, to address further threats or attacks.\" CONTEXT Iran-aligned groups in Iraq and Syria oppose Israel's campaign in Gaza and hold the United States responsible due to its support for Israel. The U.S. strikes in Iraq likely killed \"a number of Kataib Hezbollah militants\" and destroyed facilities used by the group, the U.S. military said. Washington has also said Iran was \"deeply involved\" in planning operations against commercial vessels in the Red Sea.  \nIran denies involvement in the attacks by the Houthis, who control much of Yemen including the capital and have since October attacked commercial vessels that they say have Israeli links, in solidarity with Palestinians in Gaza.  Health officials in Hamas-run Gaza say over 21,000 people have died in Israel's offensive after Hamas' Oct. 7 attack on Israel that killed 1,200 people."
}