{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "Czech Senate fails to ratify European treaty on violence against women",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 25, 2024 07:59AM ET",
    "Updated Jan 25, 2024 08:11AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/czech-senate-fails-to-ratify-european-treaty-on-violence-against-women-3282945",
  "paragraph": "PRAGUE (Reuters) - Lawmakers in the Czech Republic's upper house Senate narrowly voted against ratifying a decade-old international treaty aimed at preventing and combating violence against women. The vote late on Wednesday, which fell two votes short of ratification, leaves the Czech Republic among the minority of European countries that have signed the treaty - the Istanbul Convention - but not ratified it.  The convention, forged by the Council of Europe and its dozens of member states, recognises violence against women as a violation of human rights and covers various forms of gender-based violence. It was first signed in Istanbul in 2011 and came into force three years later. Czech conservative opponents of the treaty have objected to it deviating from what they call \"traditional roles\" for men and women in society, and they say it has not reduced violence in countries that have ratified it. Czech European Affairs Minister Martin Dvorak called the rejection an \"international disgrace\".  \"We are sending a very bad signal to women and girls that we do not consider it necessary to protect victims of domestic violence,\" he said in a post on the X social media platform. Prime Minister Petr Fiala, quoted in an interview with tabloid Blesk, said the rejection was not a signal and would not impact the country's fight against violence and existing laws. A wider debate is needed for its future ratification, he said. The Senate vote means the lower house of parliament will likely not deal with the treaty now, CTK news agency said, making it unclear when the legislation will be put forward again. The vote however does not mean the Czech Republic has outright rejected or seceded from the treaty, which it signed in 2016.  Most European Union States have signed and ratified the treaty, although Slovakia has also not ratified it. In 2021, Turkey itself pulled out of the treaty."
}