{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "Ukraine drone attack injures two children in Russia's Voronezh",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 15, 2024 11:15PM ET",
    "Updated Jan 16, 2024 10:13AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Ken Roth",
        "2024-01-16 09:55:42",
        "Really??? Russia has kill....ed and deported thousands of Ukrainian children the past 2 years so Ukraine. We still remember the russian bombs that fell directly on the children gathering even though it was marked",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/officials-declare-state-of-emergency-in-russias-voronezh-city-after-ukraine-drone-attack-3274550",
  "paragraph": "VORONEZH, Russia (Reuters) -A state of emergency was declared in the southern Russian city of Voronezh on Tuesday after a Ukrainian drone attack wounded a 6-year-old boy and a young girl, officials said.  Russia's defence ministry said five Ukrainian drones were destroyed by air defences over the Voronezh region and three more were intercepted. It said four more drones were intercepted over the Belgorod region.  Yelena Fedyainova, whose 6-year-old boy was injured in one of the attacks, said the drones first struck at about 2:30 a.m. (2330 GMT Monday) and blew out the window of her apartment.  \"The was a blow and a flash,\" Fedyainova told reporters. \"I grabbed the child - there were shards everywhere and smoke.\" A girl of about 10 years old was injured in the same attack, officials said.  Voronezh, a city of more than 1 million people, lies some 250 km (155 miles) from the border with Ukraine. The city's mayor, Vadim Kstenin, said a state of emergency had been declared in the area to deal with the impact of the attack. There was no immediate comment from Ukraine.  Russia has an air base near the city, where some Sukhoi Su-34s bombers are based, according to Russian media. Russia often deploys the fighter-bomber aircraft during air strikes on Ukraine.  \nRussian news outlet Shot reported on Telegram that at least 15 blasts were heard near the air base and some drone debris fell nearby onto an apartment building.  Reuters could not independently verify the reports."
}