{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0S0A8_L.jpg",
  "title": "Gaza medical student's dreams of becoming doctor tested by war",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 29, 2024 06:03AM ET",
    "Updated Jan 29, 2024 07:36AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/gaza-medical-students-dreams-of-becoming-doctor-tested-by-war-3285615",
  "paragraph": "3/3\n© Reuters. Aseel Abu Haddaf, a Palestinian medical student who fled her house in Khan Younis with her family due to Israeli strikes amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, uses her mobile phone at a tent camp where they she\n2/3\nBy Saleh Salem RAFAH, Gaza (Reuters) - Palestinian medical student Aseel Abu Haddaf was due to graduate medical school in Gaza this year but instead she is living in a tent as her home and her university lie in rubble from Israeli air strikes, wondering if she will ever become a doctor.  Israel's war in Gaza, triggered by a Hamas attack on Oct. 7 that killed more than 1,200 people, has uprooted every vestige of normal life in the tiny, crowded enclave and killed about 25,000 Palestinians according to local health authorities.  For students like Abu Haddaf the future is even more uncertain than for most, not knowing if their hard years of study will now count for anything or if what remains of the university still has any record of their academic progress.  \"Medicine has been my ambition ever since I was young. As a child I always used to see myself as a doctor because of the situation we live in Gaza,\" Abu Haddaf said, adding that the devastation of the war had made her yet more determined to achieve that goal.  She had been in the final year of her six-year course at al-Azhar University in the southern part of Gaza City, ready to graduate later this year and start work as an intern to become a fully fledged doctor. She hoped eventually to become a surgeon.  Gaza City has been largely cut off from the rest of the enclave for weeks after Israeli forces encircled it during their first major offensive into the enclave, but massive destruction has been evident from video, photographs and satellite pictures.  Abu Haddaf has no idea what has become of her lecturers, other university staff or fellow students. \"There is no connection. I know nothing about them, if they are alive or dead,\" she said of classmates.  \"I hope we can go back to our studies even if it is in tents and to have access to the educational staff to teach us and help fulfil our dreams to become doctors,\" she said.  VOLUNTEER The Abu Haddaf family had lived in Khan Younis, the biggest city in southern Gaza. Israeli strikes have pounded the entire strip since the start of the war but have greatly intensified in Khan Younis as ground forces invaded it this year. Their home was destroyed and like about 85% of Gaza residents the family is now homeless. Like most others they are now in Rafah, hard against the Egyptian border and seen as relatively safer from Israel's bombardment.  Abu Haddaf spends much of her day cleaning the family tent, washing clothes, cooking the little food they can find and getting through the many hard chores required when living without a house or electricity.  But she also volunteers for medical duties as far as she can with local authorities to get practical experience in doctoring, but she regards it as a poor substitute for her university training.  Gaza needs all the medics it can get, with tens of thousands of people injured by Israel's bombardment, the enclave facing famine according to U.N. projections and much of the population at growing risk from disease.  \nWhether medical students like Abu Haddaf will ever complete their training is yet another of the war's unanswered questions. Meanwhile, like everybody else in Gaza, her biggest focus is simply survival.  \"Here in the camp we live through tough days. All that consumes us is how to find food and drink,\" she said."
}