{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0H0TX_L.jpg",
  "title": "Mexico, Chile refer Israel-Hamas conflict to ICC over potential crimes",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 18, 2024 08:55PM ET",
    "Updated Jan 19, 2024 03:31AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/mexico-chile-refer-israelhamas-conflict-to-icc-over-potential-crimes-3277857",
  "paragraph": "© Reuters. Smoke rises following Israeli strikes, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, as seen from Rafah, in the southern Gaza Strip, January 18, 2024. REUTERS/Ibraheem Abu Mustafa/File Photo\nBy Kylie Madry MEXICO CITY (Reuters) - Mexico and Chile expressed \"growing worry\" on Thursday over \"an escalation of violence\" after several months of war between Israel and Hamas in a referral to the International Criminal Court (ICC) over possible crimes. Hamas militants launched a surprise attack in Israel in October, killing 1,200 mostly civilians and seizing 253 hostages, with multiple accounts later emerging of rape and mutilation.  The Israeli retaliatory offensive on the Hamas-led Gaza Strip has led to increasing international alarm and scrutiny over the deaths of civilians, especially children. Gaza health authorities said on Thursday the war's death toll had risen to 24,620, with many more feared buried under the rubble. In a statement, Mexico's foreign ministry argued that the ICC was the proper forum to establish potential criminal responsibility, \"whether committed by agents of the occupying power or the occupied power\". \"The action by Mexico and Chile is due to growing worry over the latest escalation of violence, particularly against civilian targets,\" it said. Israel is not a member of the Hague-based court and does not recognize its jurisdiction. But the ICC's prosecutor has stressed his court has jurisdiction over potential war crimes carried out by Hamas militants in Israel and by Israelis in Gaza. Mexico cited \"numerous reports from the United Nations that detail many incidents that could constitute crimes under the ICC's jurisdiction\". Chile's Foreign Minister Alberto van Klaveren told reporters on Thursday in Santiago that his nation was \"interested in supporting the investigation into any possible war crime\" wherever they might occur. Mexico said it was closely following the case presented last week before the International Court of Justice (ICJ) in which South Africa accused Israel of carrying out genocide in Gaza and demanded that the court order an emergency suspension of Israel's military campaign. Israel has rejected the accusation.  \nThe Palestinian Foreign Ministry welcomed the referral to the ICC, which it said confirmed the court's need to fulfill its mandate by deterring, investigating and prosecuting the most serious crimes. \"Israeli officials are not deterred as they continue with their genocidal war,\" it said in a statement. Both the ICJ and the ICC handle cases of alleged genocide, with the former resolving disputes between states and the latter prosecuting individuals for crimes."
}