{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0B0HX_L.jpg",
  "title": "Strikes on Yemen had good effects, will continue to monitor -Pentagon",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 12, 2024 08:39AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/strikes-on-yemen-had-good-effects-will-continue-to-monitor-pentagon-3273554",
  "paragraph": "© Reuters. FILE PHOTO: The Pentagon building is seen in Arlington, Virginia, U.S, April 6, 2023. REUTERS/Tom Brenner/File Photo\nWASHINGTON (Reuters) - U.S.-British strikes on Iran-backed Houthi forces in Yemen had \"good effects,\" Pentagon spokesman Patrick Ryder said on Friday, and their militaries will continue to monitor the situation for any retaliatory strikes. There are currently no plans to send additional U.S. troops to the region, Ryder said in an interview with CNN. \"Our initial assessment is that we had good effects,\" he said. \"We will continue to monitor and as the president and (Defense) Secretary Austin have said, we will continue to take necessary action.\"  Pentagon chief Lloyd Austin, who was hospitalized on Jan. 1 to treat an infection, was in good condition, had spoken twice to President Joe Biden in the last two days and had been \"actively engaged in overseeing and directing these strikes.\" U.S. and British warplanes, ships and submarines launched dozens of air strikes across Yemen overnight in retaliation against Iran-backed Houthi forces for attacks on Red Sea shipping, widening regional conflict stemming from Israel's war in Gaza. Asked about worries that the conflict might escalate, Ryder said the U.S. continues to work to contain the Israel-Hamas war in Gaza. \nThe Houthi militants' attacks on commercial shipping in the vital Red Sea waterway has affected more than 50 countries, Ryder noted, and the United States and its allies see the actions as distinct from what is happening in Gaza. \"No one wants to see a wider regional conflict. But again, we also cannot allow for this kind of dangerous, reckless behavior,\" he said."
}