{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0H00K_L.jpg",
  "title": "US in new strikes against Houthi targets in Yemen",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 17, 2024 07:40PM ET",
    "Updated Jan 18, 2024 12:36AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Confid Love",
        "2024-01-18 12:54:10",
        "When will they call off back ?",
        "https://www.investing.com/members/213010755"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/us-conducts-another-round-of-strikes-against-houthi-targets-in-yemen-3276774",
  "paragraph": "© Reuters. FILE PHOTO: An aircraft takes off to join the U.S.-led coalition to conduct air strikes against military targets in Yemen, aimed at the Iran-backed Houthi militia that has been targeting international shipping in the Red Sea, from an undisclosed location,\nBy Idrees Ali and Phil Stewart WASHINGTON (Reuters) - The U.S. military said on Wednesday its forces conducted strikes on 14 Houthi missiles that were loaded to be fired from Yemen, in the fourth day of U.S. strikes in less than a week. In a statement on social media platform X, U.S. Central Command said the Houthi missiles presented an imminent threat to merchant vessels and U.S. Navy ships in the region. \"These missiles on launch rails ... could have been fired at any time, prompting U.S. forces to exercise their inherent right and obligation to defend themselves,\" it added. \"These strikes, along with other actions we have taken, will degrade the Houthi’s capabilities to continue their reckless attacks on international and commercial shipping in the Red Sea, the Bab-el-Mandeb Strait, and the Gulf of Aden.\" Attacks by the Iran-allied Houthi militia on ships in the region since November have slowed trade between Asia and Europe and alarmed major powers. The U.S. strikes are meant to degrade the Houthis' ability to carry out attacks in the Red Sea. But the Houthis, who control most of Yemen, say they are acting in solidarity with Palestinians in Gaza and have threatened to expand their attacks. Earlier on Wednesday, U.S. Central Command said a drone launched from areas controlled by the Houthi rebels in Yemen had struck a U.S.-owned vessel in the Gulf of Aden. There was some damage but no injuries in the attack, it added on X.  \nThe vessel, M/V Genco Picardy, is a Marshall Islands-flagged flagged, U.S.-operated bulk carrier ship, it said. The United States returned the Yemen-based Houthi rebels to a list of terrorist groups, as the militants also claimed another attack this week on a U.S.-operated vessel in the Red Sea region."
}