{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK060CS_L.jpg",
  "title": "Biden, Saudis call for Israeli restraint as Gaza suffers another bloody day",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 07, 2024 06:18PM ET",
    "Updated Jan 08, 2024 04:42PM ET"
  ],
  "comments": [
    1,
    [
      [
        "john wick",
        "2024-01-08 05:31:40",
        "Isreal and america - axis of evil. ",
        "https://www.investing.com/members/256103011"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/blinken-in-uae-saudi-israel-on-monday-seeking-to-avert-wider-middle-east-war-3268720",
  "paragraph": "5/5\n© Reuters. U.S. Secretary of State Antony Blinken and Qatar's Prime Minister and Foreign Minister Sheikh Mohammed bin Abdulrahman Al Thani attend a press conference, during Blinken's week-long trip aimed at calming tensions across the Middle East, in Doha, Qatar, Ja\n2/5\nBy Arafat Barbakh, Simon Lewis and Nidal al-Mughrabi GAZA/TEL AVIV/CAIRO (Reuters) -Pressure grew on Israel on Monday from its staunch ally the United States and from Middle East powers to ease its assault on Gaza as its forces said they engaged in \"tough battles\" against Hamas militants in central and southern parts of the enclave. Following talks with Arab leaders, U.S. Secretary of State Antony Blinken landed late Monday in Tel Aviv on the latest leg of a regional tour aimed at preventing the war - now entering its fourth month - from turning into a wider conflagration. Israeli officials have said they are entering a new phase of more targeted warfare after mass bombardments that have devastated the Gaza Strip and killed more than 23,000 Palestinians. There was no respite on Monday, however, with the Israeli military saying a \"different mix of forces\" was pursuing holdout Hamas fighters in the enclave's north as \"intense operational activity\" focused on central Gaza and the area of the southern city of Khan Younis. \"Handling tough battles in both the center and south,\" said Rear Admiral Daniel Hagari, an Israeli military spokesman. \"The fighting will continue through 2024.\" Israeli forces bombarded the eastern part of Khan Younis and the central Gaza Strip amid ground clashes, residents said. They said a strike in Deir Al-Balah killed 18 people overnight and four on Monday, while health officials in the Hamas-run enclave said 247 people were killed overnight. Hamas's military wing the Al-Qassam Brigades said its fighters fired a missile barrage at the Israeli city of Tel Aviv in response to what it called the \"Zionist massacres against civilians\". And in a further sign the war is spreading beyond Gaza's borders, Israel killed a top commander of Hamas' ally Hezbollah in a strike in south Lebanon on Monday, sources familiar with the group's operations said. Blinken held talks in the United Arab Emirates and Saudi Arabia on Monday to try to chart a way forward in the bloodiest chapter ever of the decades-long Israel-Palestinian conflict. It is his fourth mission to the region since the deadly Oct. 7 attacks on Israel by Hamas militants triggered the massive Israeli assault. Speaking to reporters before flying to Israel following talks with Saudi Arabia Crown Prince Mohammed bin Salman in the Saudi oasis town of Al Ula, Blinken said he found support among Arab leaders for normalizing relations with Israel. \"There's a clear interest in the region in pursuing that but it will require that the conflict end in Gaza and it will also clearly require that there be a practical pathway to a Palestinian state,\" said Blinken, who stopped in Jordan and Qatar on Sunday. The Saudi crown prince, the kingdom's de facto ruler, stressed the importance of stopping the hostilities in Gaza and forming a path for peace, Saudi state news agency SPA reported. SPA said the crown prince - who prior to the war's outbreak had been leading a rapprochement between his country and Israel - underscored the need to restore stability and to ensure the Palestinian people gain their legitimate rights. Meanwhile, U.S. President Joe Biden, confronted by protesters shouting \"ceasefire now\" while he visited a church in Charleston, South Carolina, said he had been working \"quietly\" with the Israeli government to encourage it to reduce its attacks and \"significantly get out of Gaza\". Though long a fervent supporter of Israel, Biden has previously described Israel's bombing campaign as \"indiscriminate\". Israel, which says it is in a fight for its very survival, accuses Hamas of operating among civilians. Hamas, which is sworn to Israel's destruction, denies this. Israeli Defence Minister Yoav Gallant told the Wall Street Journal his country was both determined to end Hamas rule of the enclave and deter other Iran-backed adversaries.  The Israeli offensive has so far killed 23,084 Palestinians, Gaza health officials say, while Israel says Hamas still holds more than 100 hostages of the 240 seized during its attack on Israeli towns on Oct. 7 in which the militants killed about 1,200 people. Blinken said he would tell Israeli officials in their meetings that they must do more to prevent civilian casualties in Gaza. He also said Israel must allow Palestinian civilians to return home after right-wing members of Israel's ruling coalition called for them to move elsewhere. 'GENERATION OF ORPHANS' Jordan's King Abdullah said on Monday that \"indiscriminate aggression\" and shelling could never bring peace or security. In remarks at the Kigali Genocide Memorial in Rwanda, he said: \"More children have died in Gaza than in all other conflicts around the world this past year. Of those who have survived, many have lost one or both parents, an entire generation of orphans.\" The Israeli military said it had bombed an arms cache and uncovered a tunnel shaft in central Gaza and killed at least 10 militant fighters in Khan Younis. It dropped leaflets on al Moghani in central Gaza warning residents to evacuate several districts it said were \"dangerous combat zones\". Hamas said a sniper had killed an Israeli soldier in central Gaza. Nearly all of Gaza's 2.3 million people have fled their homes at least once and many are now moving again, often sheltering in makeshift tents or huddled under tarpaulins. \nFor Aziza Abbas, 57, camped close to the southern border with Egypt, there was nowhere else to go after what she said was bombing around a school in which she had taken shelter after leaving her home in the north. \"They may kill us here, it doesn't matter to them,\" she told Reuters, saying she did not want to leave Gaza for Egypt, which has closed the border fearing an exodus."
}