{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0H00W_L.jpg",
  "title": "Last Salvadoran woman imprisoned over baby's death calls for change",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 17, 2024 08:14PM ET",
    "Updated Jan 18, 2024 03:12AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/last-salvadoran-woman-imprisoned-over-babys-death-calls-for-change-3276781",
  "paragraph": "5/5\n© Reuters. Lilian, a 28-year-old cosmetologist, who was sentenced to 30 years in prison for aggravated manslaughter due to an abortion caused by an obstetric emergency, and who was released on December 1, 2023 after more than seven years in prison, speaks during a p\n2/5\nSAN SALVADOR (Reuters) - The last woman imprisoned in El Salvador on charges linked to abortion on Wednesday called for people in the Central American country to stop denouncing women who suffer obstetric emergencies, in her first public comments since her release. El Salvador has one of the most draconian abortion bans in the Americas, which critics say extends to women who suffer miscarriages and stillbirths. Many women have been sentenced to decades in prison on charges of killing their children. The 28-year-old woman, known as Lilian, was the last woman still imprisoned on such charges, according to two local civil rights groups. Others still face judicial proceedings. \"I call on people stop denouncing other innocent women,\" Lilian told a press conference after a judge last month acquitted her of a 30-year sentence after seven years behind bars. The civil rights groups said Lilian gave birth to a girl in a public hospital, but the baby died 72 hours later while under the care of doctors. Lilian was, however, prosecuted for abandonment and neglect, and later for aggravated homicide. Years later, a judge reviewed the 2015 sentence and acquitted Lillian on the grounds that both she and her daughter were in a vulnerable condition in the hospital when the events occurred, the groups said. Lilian, who is also the mother of a 10-year-old, said she was happy to be reunited with her family. The groups, the Citizens' Group for the Decriminalization of Abortion and the Feminist Collective, since 2012 have campaigned for the release of women facing up to 50 years in prison on charges of aggravated homicide. They say their campaigns have helped release 73 women, though another six cases are being processed and 11 remain active because the attorney general's office decided not to file the appeals. These women are currently not in prison. \nEl Salvador's attorney general's office did not immediately respond to a request for comment. Central American neighbors Nicaragua and Honduras, as well as the Dominican Republic in the Caribbean, also impose blanket bans on abortion, including in cases of rape and when the mother's life is at risk."
}