{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0L0MR_L.jpg",
  "title": "Trudeau meets to rally ministers, lawmakers around key issues as reelection support sags",
  "category": "Economy",
  "publisher": "Reuters",
  "date": [
    "Published Jan 22, 2024 12:46PM ET",
    "Updated Jan 22, 2024 04:08PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Mark Gesswein",
        "2024-01-22 18:26:43",
        "I’ll BET re-election support is sagging! Trudeau is a freaking TYRANT! ",
        "https://www.investing.com/members/245851936"
      ],
      [
        "Connecticut Yankee",
        "2024-01-22 21:36:43",
        "Oh, but he's SO pretty. How can you not vote for him, right? Just keep saving and in less than 10 years you'll be able to buy a house, too.",
        "https://www.investing.com/members/201160387"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/economy/trudeau-meets-to-rally-ministers-lawmakers-around-key-issues-as-reelection-support-sags-3279927",
  "paragraph": "2/2\n© Reuters. FILE PHOTO: Canada’s Prime Minister Justin Trudeau speaks on stage during a Tamil Heritage Month event in Laval, Quebec, Canada January 21, 2024. REUTERS/Evan Buhler\n2/2\nBy Steve Scherer OTTAWA (Reuters) - Canadian Prime Minister Justin Trudeau is gathering his government and lawmakers this week to talk about crucial issues, including housing and food prices, as he seeks to claw back support ahead of a likely fourth election run next year. Conservative leader Pierre Poilievre would clobber Trudeau if an election were held today, according to an Angus Reid Institute poll published on Monday. Conservatives would take 41% versus 24% for Liberals, according to 1,620 adults surveyed on Jan. 16-17. \"The Conservatives have maintained a double-digit vote lead since last September,\" the Angus Reid Institute said. \"The Liberals have much work to do to convince past supporters to return to the party.\" Fewer than three-in-five (57%) of those who voted Liberal in 2021 say they would do so again, the pollster said. Trudeau's cabinet is meeting in Montreal on Monday and Tuesday, and all the Liberal members of parliament are meeting in Ottawa on Wednesday through Friday.  On Monday, Immigration Minister Marc Miller announced a two-year cap on international student permits as it seeks to rein in record numbers of newcomers seen aggravating a housing crisis. \"This cabinet retreat is focused on issues as important as housing affordability and housing accessibility,\" Public Safety Minister Dominic LeBlanc told reporters late on Sunday. \"There's a broader conversation around affordability.\" The meetings come as interest rates hover at a 22-year high after 10 rate hikes to tame inflation, which is still running well above the central bank's 2% target.  Treasury Board President Anita Anand said this week's meetings have nothing to do with poll numbers.  \"What we are here to do is to fight for Canadians every single day in terms of what is needed in times of high inflation and high interest rates,\" she told reporters on Sunday. The meetings also come ahead of this year's election in the United States, and the possible return of Donald Trump to the White House.  While president, Trump forced the renegotiation of the North American trade pact, a vital agreement for the Canadian economy. The U.S. and Canada are top trading partners and their economies are closely linked. Industry Minister Francois-Philippe Champagne said the election would be part of their discussions, adding that the Liberal government has had valuable experience dealing with Trump in the past if he should win again. \n\"We've negotiated the North American free trade (pact) and I think people should trust those who have done that,\" Champagne told reporters.  Last week, Trudeau said a second Trump presidency would be challenging and would reflect \"a lot of anguish and fury.\""
}