{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0D09O_L.jpg",
  "title": "Israel cabinet set to vote on 2024 wartime budget, higher deficit",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 14, 2024 12:09PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/israel-cabinet-set-to-vote-on-2024-wartime-budget-higher-deficit-3274146",
  "paragraph": "© Reuters. FILE PHOTO: Israeli Prime Minister Benjamin Netanyahu speaks during the weekly cabinet meeting at the Defence Ministry in Tel Aviv, Israel, January 7, 2024. REUTERS/Ronen Zvulun/Pool\nBy Steven Scheer JERUSALEM (Reuters) -Israeli cabinet ministers on Sunday began what is expected to be a marathon session on approving an amended 2024 budget to account for a sharp rise in spending to finance the country's war with Palestinian Islamist group Hamas. Typically, the discussions last into the night and a vote may not occur until daybreak on Monday.  Israel last year approved a two-year budget for 2023 and 2024, but the war against Hamas in Gaza has shaken government finances, requiring budget changes and additional spending. Billions of shekels in extra finance is needed to fund the military, compensate reservists and the tens of thousands who live near the border and have been displaced, as well as those directly affected by the Oct. 7 attacks by Hamas gunmen. However, the budget has turned political and controversial, in particular over payments Prime Minister Benjamin Netanyahu agreed under a 2002 coalition accord with Finance Minister Bezalel Smotrich and the heads of other religious parties. That accord was for 8 billion shekels ($2.15 billion) to be set aside for ultra-Orthodox and far-right-wing pro-settler parties in 2024. According to a budget draft, only 2.5 billion shekels of that will be cut, despite the war funding needs.  At the outset of the cabinet meeting, Netanyahu did not refer to the coalition funds, saying only that all ministries must share in the burden. \"What is required now is, first of all, to cover the expenses of the war and to allow us to conduct the war in the coming year and complete it, including eliminating Hamas, returning our hostages and restoring security and the sense of security in both the north and the south so that the residents can return there,\" he told ministers. SLOWER RATE CUTS In a letter to Netanyahu last week, Amir Yaron, who just started a second five-year term as central bank chief, urged the government not to spend excessively and offset any spending increases needed for the war with reductions elsewhere, along with tax hikes. The government intends some cuts to ministries' budgets, while raising some taxes, such as the value added tax, by 1 percentage point to 18% in 2025 on bank profits and on cigarettes and tobacco. Israel recorded a budget deficit of 4.2% of gross domestic product in 2023 due to a spike in fourth-quarter war spending and a drop in tax income. The deficit target in the 2024 budget was raised to 6.6% of GDP from a prior 2.25% and the war will lower 2024 economic growth by 1.1 percentage points to around 1.6%, the finance ministry estimates. The fiscal impact of the war is estimated at 150 billion shekels in 2023-24 assuming intense fighting ends in the first quarter. \nIn December, the Israeli parliament approved a special war budget for 2023 of nearly 30 billion shekels ($1 = 3.7266 shekels)"
}