{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0807D_L.jpg",
  "title": "Bridge dilemma captures divide over China in Taiwan elections",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 09, 2024 02:18AM ET",
    "Updated Jan 10, 2024 12:35AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/bridge-dilemma-captures-divide-over-china-in-taiwan-elections-3269960",
  "paragraph": "© Reuters. The flag of Taiwan is seen painted on Shihyu Islet in front of Xiamen, a coastal city in China, in Lieyu Township, Kinmen, Taiwan, October 19, 2021. REUTERS/Ann Wang/File Photo\nBy Sarah Wu KINMEN, Taiwan (Reuters) -Pointing at Xiamen's skyscrapers across the water from his office, Chen Tsang-chiang recalled how 30 years ago the southern Chinese city was as low-slung as his Taiwanese island of Kinmen. In the following decades, the 68-year-old former politician watched the metropolis of 5 million people rise, while Kinmen's forests, sorghum fields, and villages saw little change. What the Taiwan-controlled island about the size of Washington, DC, and only some five km (three miles) off China's coast needs, Chen says, is a bridge to Xiamen - \"a connection to an economic lifeline\". But the proposed bridge has become a flashpoint ahead of Taiwan's Jan. 13 presidential and parliamentary elections, drawing leaders from all major parties to the island to speak about its construction or national security. It strikes at the heart of the most important question voters will be answering in the polls: How should Taiwan relate to China? Kinmen is a stronghold for Taiwan's main opposition party the Kuomintang (KMT), which traditionally favours close ties with China. Like many in Kinmen, Chen sees China as the key to development and says residents should be able to vote on the proposed bridge. \"Must this 151-square-km small island, with tens of thousands of people, forever be a chess piece for both sides of the strait?\" he asked. \"Do we not have a voice?\" For Taiwan, Kinmen is the frontline of democracy and the closest point to China where its electors will cast ballots. For China, Kinmen is a litmus test for its ability to bring Taiwan under Beijing's control and a prime target in its charm offensive. In September, China unveiled its most comprehensive blueprint yet for cross-strait integration, featuring stronger transport, energy, and business links between Xiamen and Kinmen. A Chinese official said in November that construction on the Xiamen side of a bridge that could connect to Kinmen had begun. Hou Yu-ih, the KMT's presidential candidate, vowed to hold a local referendum on the bridge, saying he would build \"the most important symbol of cross-strait peace\" if residents wanted it. The ruling Democratic Progressive Party (DPP) administration, through Taiwan's Mainland Affairs Council, dismissed Beijing's proposals as \"wishful thinking\" and a futile attempt to win over Taiwanese people with economic incentives. The council called the bridge \"a Trojan horse carrying tremendous national security risks\". China, which claims Taiwan as its own territory despite Taipei's objections, says \"reunification\" with Taiwan is inevitable and has never renounced the use of force to bring the democratically governed island under its control. Beijing has cast the election as a choice between peace and war, and urged Taiwanese voters to make the \"correct choice\" to promote cross-strait relations. China has taken particular exception to the DPP's presidential candidate, Vice President Lai Ching-te, saying he is a dangerous separatist. Lai has said he would maintain the status quo and that only Taiwan's people can decide their future. The KMT also says Taiwan's 23 million people should decide their future, although it strongly opposes independence. A BRIDGE TOO FAR? Some of about two dozen Kinmen residents interviewed for this story welcome the bridge as a sign that Taipei and Beijing could work together, a driver of growth, or a way to travel unconstrained by the ferry schedule. Others, especially younger voters, fear it would usher in unwanted investment and erode the political freedoms Kinmen enjoys as part of Taiwan. Many from this growing group identify as Taiwanese rather than Chinese and want to promote Kinmen's culture and rely less on China for economic opportunities. One of them is bookstore owner Weng Yu-wen, 34. She was part of the 22% in Kinmen who in 2020 voted for the DPP's candidate, current president Tsai Ing-wen, nearly triple the DPP's support here in the 2012 poll. Plastered on the wall of Weng's bookstore is a poster that says: \"Youth return to your hometown to vote for a better future.\" The shelves are lined with social and political books, including one titled \"What is Democracy?\" As is common for Kinmen's younger generation, Weng studied and worked on the main island of Taiwan before returning. She said she hopes her books and events will spark discussion of public affairs. When the ferry stopped during the pandemic, \"we could very clearly feel that we are indeed two different countries,\" Weng said.  Before that, residents often took the ferry to Xiamen - where many have property, business, or family - for entertainment or grocery shopping.  The frequency is natural given geographic proximity and historical ties, Weng said, but she worries that a bridge would further blur the boundary between their political systems. \"If Kinmen grows closer to mainland China, would this still be a place where I want to live?\" she asked. \"Why does it seem like there is only one possibility for development?\" Kinmen residents once made their living serving the tens of thousands of Taiwanese soldiers stationed here until martial law was lifted in 1992. In 2001, the establishment of a 30-minute ferry service between Kinmen and Xiamen marked the beginning of the island transforming into a magnet for Chinese tourists. From Kinmen's northern coast, cranes constructing a massive airport to serve Xiamen are visible. The most likely bridge route would connect to Xiamen via this airport, said Kinmen's deputy mayor, Li Wen-liang. He estimates it would extend up to 8 km and cost more than $322 million (T$10 billion). The prospect of greater cross-strait integration spurred Taiwanese investors to buy most of the 118 units in Kinmen's first serviced apartment building, said Henry Lee, general manager at Chiau-Mau Realty, which has overseen sales.  \nAdvertisements for the building - which opened one year after Chinese President Xi Jinping in 2019 outlined his vision for \"integrated development\" - show higher property prices in Xiamen than in Kinmen. \"If people can enter, money can enter,\" reads one brochure featuring a map of the proposed bridge."
}