{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "Migrant caravan spends Christmas on the road before heading to U.S. border",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 24, 2023 05:38PM ET",
    "Updated Dec 25, 2023 07:46AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Otis Grant",
        "2023-12-25 12:59:12",
        "Things like this will get traitor trump re elected if they don't get some kind of control on it. ",
        "https://www.investing.com/members/251132356"
      ],
      [
        "NK Dole",
        "2023-12-25 16:50:12",
        "Sure would be nice. Biden isn’t held accountable for anything. The media don’t even question him about anything. Its f 4ck ing ridiculous already. I work down in S TX and have seen this stuff. It’s mainly military aged men, hardly ever see women/children. It maybe was at first, but no more. They figured out Dumbiden isn’t doing anything so here they come. And to what end? There are probably at least another 5-6% of the entire US population added in 3 years without an ability to contribute legally. Who is paying for this - tax payers. Unless we all wanted it, it is BS. Meanwhile we have people sleeping on thr street and old people with a paltry SS check barely scraping by. And check your medical insurance cost - these illegals aren’t paying for that either- we are via higher rates. ",
        "https://www.investing.com/members/248759308"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/migrant-caravan-spends-christmas-on-the-road-before-heading-to-us-border-3263129",
  "paragraph": "By Jose Torres TAPACHULA, Mexico (Reuters) - Thousands of migrants arrived on Sunday in the southern Mexican town Alvaro Obregon to spend the Christmas Eve in a public square without shelter before making their way north to cross the country and reach the border with the United States. On Sunday, the group of mostly Central American and Caribbean migrants had walked 15 kilometers (more than 9 miles) from the southern border city Tapachula to get to Alvaro Obregon, with plans to set off again around 4 a.m. the next day. Migrant rights activist Luis Garcia Villagran urged that migrants must not become political bargaining chips in the upcoming presidential election in the United States, where migrants were heading.  \"We won't be stopped, we'll keep walking,\" he said. Local authorities estimated the size of the caravan to average about 8,000 people per day. A Reuters witness traveling with the group said most migrants were from Central and South America but also the Caribbean. Haitian migrant Ysguel Jean, who was carrying a white cross with \"Christ\" painted in red letters, said he had left his home country because of rampant crime and corruption, and because he wanted to provide for his two daughters. \"Three months in Tapachula trying to get papers and I still have nothing,\" he said. \"I'm tired of waiting around in Tapachula, being hungry, and unable to earn a living.\" Like others, he said he wanted to reach the United States. \nIn 2018 and 2019, large caravans mostly comprised of Central Americans, crossed Mexico to reach the United States. These were followed by smaller groups in recent years. Last year, record numbers of migrants attempted to cross the U.S.-Mexico border illegally."
}