{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK110EC_L.jpg",
  "title": "Desperate for news, Gazans struggle with mobile network",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 02, 2024 07:21AM ET",
    "Updated Feb 02, 2024 11:18AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/desperate-for-news-gazans-struggle-with-mobile-network-3291185",
  "paragraph": "© Reuters. An Israeli mobile artillery unit fires towards Gaza, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, near the Israel-Gaza border, in Israel, February 1, 2024. REUTERS/Dylan Martinez\nBy Mohammad Salem RAFAH, Gaza Strip (Reuters) - Hamzeh Tabash walks to the Egyptian border every day from his tent in Gaza for a faltering mobile signal so he can send voice messages to loved ones separated by war and hopefully receive one in return. \"One message revives the soul,\" he says. Most of bombed-out Gaza's 2.3 million people have fled their homes under Israel's intense bombardment and ground assault, scattered into tent cities where their only news of those they care about most depends on a broken phone network. With the local telecom network almost entirely out of operation, especially in the north and centre of the Palestinian enclave, many people try to connect to the Egyptian network by standing along the border.  \"Mother, how are you? I hope you're well. Things are fine here. I wanted to reassure you. Don't worry,\" Tabash said, recording a short voice note and holding his phone into the air to try to transmit it.  The family are from Khan Younis but they split when Israel began to focus its offensive on the city, the biggest in the enclave, with Tabash heading for Rafah and his mother staying at the family home.  Fighting and destruction in Khan Younis has been intense in recent days and those with family still there are terrified for their safety.  Where Tabash stood on a high point by the first barbed wire border fence with Egypt, a cluster of other people were sitting on the sand tapping in messages, pacing in circles as they talked or holding their phones into the air trying for a signal.  The white tents of displaced people stretched beneath them towards Rafah and beyond into the devastated enclave.  Israel's offensive in Gaza was triggered by a Hamas attack on Oct. 7 when the militant group stormed the border, killing 1,200 people in Israeli towns and dragging 240 hostages back into Gaza.  The Israeli assault on Hamas-run Gaza has now killed more than 27,000 people, according to health authorities there, and destroyed swathes of housing and public facilities, driving 85% of the population from their homes.  Gaza's phone network, run by local provider Paltel, has reported more than 10 total collapses in service provision since Oct. 7, most recently in late January, which it has attributed to Israel's offensive. Even when its network has been partly working, it has struggled to maintain service in many areas because of the fighting, it has said.  COMMUNICATION BREAKDOWN Sitting by border fence, anxiety writ across her face, Mariam Odeh said she too had been separated from parts of her family who stayed in Khan Younis.  \"We want to communicate with our relatives, reassure them and tell them we are still alive. What shall I say? I cry for this situation we're facing,\" she said.  \"Every day we come to the Egyptian border to call our relatives because when they call there is no service, even in Rafah. When they call us they can't connect,\" she said.  \"We call them to reassure them about us, that we are alive. That we are not martyred like the others.\"  Standing nearby, Ahmed Abu Daka was tapping a message into his phone. He had walked a long way from his tent up through the sand and onto the rise where the Egyptian network connection was reachable.  \n\"The internet is really weak. Sometimes you wait hours to send only one message,\" he said.  \"I wait for a long time, sometimes an hour, waiting for a message from family and relatives trapped in Nasser Hospital, to be reassured about them. We wait for hours to be reassured about them, check on them and know about the danger surrounding them,\" he said."
}