{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0B080_L.jpg",
  "title": "Britain's Sunak, in Ukraine, announces increase in military aid",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 12, 2024 02:26AM ET",
    "Updated Jan 12, 2024 04:17PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/britain-to-hike-funds-for-ukraine-to-buy-drones-sunak-visits-kyiv-3273031",
  "paragraph": "2/2\n© Reuters. FILE PHOTO:Britain's new Prime Minister Rishi Sunak visits a monument to Holodomor victims, amid Russia's attack on Ukraine, in Kyiv, Ukraine November 19, 2022. Ukrainian Presidential Press Service/Handout via REUTERS/File Photo\n2/2\nBy Sergiy Karazy KYIV (Reuters) - British Prime Minister Rishi Sunak visited wartime Kyiv on Friday to sign a new security agreement and announce an increase in military funding for Ukraine to buy drones, including surveillance, long-range strike and sea drones.  Britain, one of Ukraine's closest allies during President Vladimir Putin's Russian invasion, will increase its support in the next financial year to 2.5 billion pounds ($3.19 billion), an increase of 200 million pounds on the previous two years, Sunak said.  \"Our opponents around the world believe that we have neither the patience nor resources for long wars. So waver now, and we embolden not just Putin, but his allies in North Korea, Iran and elsewhere,\" Sunak told a press conference. His trip comes at an important juncture for Kyiv in the nearly two-year-old war. Political infighting in the United States and European Union has held up two major packages of assistance.  Kyiv has relied heavily on military and financial aid from the West since the Russian invasion in February 2022. President Volodymyr Zelenskiy told the press conference he felt vital U.S. financial assistance would also materialise and that he felt more positive now than last month.  The two leaders signed what Zelenskiy described as an \"unprecedented security agreement\" - an arrangement the Ukrainian leader said would remain in place until Kyiv joined the NATO military alliance.  \"This is not simply a declaration,\" Zelenskiy wrote on social media platform X.  In his nightly video address, the president praised the agreement as a \"very serious and modern accord\" providing help with weapons, intelligence, and cyber know-how, as well as sanctions and other punitive actions against Russia. It was, he suggested, similar to Israel's longstanding relations with the United States. \"Many have heard about exemplary security agreements of the 20th century between the United States and Israel, as well as some other similar agreements,\" Zelenskiy said. \"Now we have formed such an example for our time - it is what gives us confidence now as we defend ourselves against Russian aggression.\" Former Russian President Dmitry Medvedev, a senior Putin ally, warned on Friday that Moscow would regard any move by Britain to deploy a military contingent to Ukraine as a declaration of war against Russia. SUPPORT FROM LONDON Zelenskiy's chief of staff, Andriy Yermak, said the agreement set out the support that London would continue to provide, including intelligence sharing, medical and military training, and defence industrial cooperation.  The UK-Ukraine Agreement on Security Cooperation follows an earlier agreement by the Group of Seven nations to provide Ukraine with bilateral security guarantees.  Ukrainian lawmakers posted short video clips of Sunak addressing members of parliament in Kyiv and receiving a standing ovation.  \"We meet today at a difficult moment in the struggle for Ukraine's freedom. And as always during conflict there will be difficult moments. But we must prepare for this to be a long war,\" Sunak told the lawmakers.  Britain said it would provide the largest delivery of drones to Ukraine from any nation, with most of them expected to be manufactured in Britain.  \nUkraine had been fighting for the principles of freedom and democracy for two years, Sunak said in a statement. \"We will stand with Ukraine, in their darkest hours and in the better times to come,\" he said."
}