{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "Suspects arrested in 6 California desert murders tied to marijuana trade",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 29, 2024 04:33PM ET",
    "Updated Jan 30, 2024 02:26AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Charles Manson",
        "2024-01-30 14:17:16",
        "6 Dead, 5 Jailed. California. What a Dump. Here in Arkansas, we raise our Families to respect the Law, Go to Church, support the Military, teach our children at a young age Firearms use, charity activities, ....etc. Anyway, we need to pray for theses poor souls. Love to All, Charles.",
        "https://www.investing.com/members/249519852"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/arrests-made-in-killings-of-6-people-found-slain-in-california-desert-3286415",
  "paragraph": "By Steve Gorman and Daniel Trotta LOS ANGELES (Reuters) -Five men have been arrested on suspicion of murdering six people last week in a remote patch of California's Mojave Desert, a mass killing investigators believe stemmed from the illicit marijuana trade, local law enforcement officials said on Monday. The six victims, all men, were shot to death, and four of them also were partially burned, their bodies left strewn in a grisly crime scene discovered last Tuesday night at the junction of two dirt roads about 60 miles (97 km) northeast of Los Angeles, officials said.  Authorities said the victims may have themselves been involved in criminal activity that led to the killings. \"It looks like illicit marijuana was the driving force behind these murders,\" Sheriff Shannon Dicus told reporters at a news briefing in San Bernardino on Monday evening. The six victims \"had arranged to meet at the location for a marijuana transaction,\" and the five suspects \"arrived at the location and for reasons still under investigation shot the six victims,\" the sheriff's office said in a media statement issued a short time later. Dicus said criminal gangs and violence remained enmeshed in the cannabis trade even after California voters in 2016 legalized the sale and cultivation of marijuana for recreational use, as the law lowered penalties for illicit marijuana offenses from felonies to misdemeanors. \"By allowing that, we've unleashed a plague in California, and the plague is the black market of marijuana, and certainly cartel activity, and a number of victims that are out there,\" Dicus said. He said his department served more than 400 search warrants for illegal marijuana growing operations last year alone, including 11 sites in the immediate vicinity of where the six bodies were found last week.  Deputies who located the victims in an area of desert scrub off Highway 395 last Tuesday responded to a 911-emergency phone call from a man speaking Spanish who said he had been shot and did not know his own whereabouts, according to sheriff's Sergeant Michael Warrick.  That man, Franklin Noel Bonilla, 22, was among the six found dead a short time later after police tracked the phone call to the scene of the killings. Two others were identified as Baldemar Mondragon-Albarran, 34, and Kevin Dariel Bonilla, 25.  Los Angeles television station KTLA-TV reported last week that aerial footage from the murder scene showed bloodied bodies on the ground with dozens of evidence markers and bullet casings surrounding them.  Some of the victims are believed to be of Honduran origin, officials said.  The five men arrested are believed to be the only suspects involved in the killings. They were taken into custody at an illegal cannabis cultivation site under development and were jailed without bond on suspicion of murder, the sheriff said. They were identified as Toniel Baez-Duarte, 34, Mateo Baez-Duarte, 24, Jose Nicolas Hernandez-Sarabia, 33, Jose Gregorio Hernandez-Sarabia, 34, and Jose Manuel Burgos Parra, 26. All were residents of the area."
}