{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0O0WS_L.jpg",
  "title": "Mexico high schoolers take up arms after village kidnappings",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 25, 2024 06:24PM ET",
    "Updated Jan 25, 2024 06:46PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/mexico-high-schoolers-take-up-arms-after-village-kidnappings-3283588",
  "paragraph": "5/5\n© Reuters. Children hold rifles before a ceremony to join the ranks of the community police, few days after an armed group abducted four people from the community, in Ayahualtempa, Guerrero state, Mexico, January 24, 2024. REUTERS/Stringer NO RESALES. NO ARCHIVES. \n2/5\nBy Javier Verdin and Diego Oré ACAPULCO, Mexico (Reuters) - A volunteer police force in rural Mexico that says it has been overwhelmed by local kidnappings has recruited schoolchildren as young as 12 to join its ranks, the latest sign of how some parts of the country are struggling to cope with organized crime. Armed with rifles and sticks, and with their faces covered, boys and girls paraded around the local sports field this week before joining a patrol in Ayahualtempa, a mountain village in the southwestern state of Guerrero. \"We can't study because of lawlessness,\" one recruited teenager told the Milenio television channel. The boy explained how he had learned to shoot a gun after a handful of lessons. Violence has recently escalated in Guerrero, one of the poorest states in Mexico. In early January, a drone attack allegedly carried out by drug cartel La Familia Michoacana killed around 30 people, human rights groups say. In Ayahualtempa, four members of a local family have been missing since Friday when they were kidnapped, the Guerrero state prosecutor's office said. The minors are reinforcing the volunteer police force, and will do their best to guard the village of about 700 inhabitants while adults search for the missing people, said Antonio Toribio, a local official.  \n\"We're not going to allow them to kidnap us any more, or for people to keep disappearing,\" Toribio said. This is not the first time minors have been armed in Guerrero, where authorities have struggled to counter powerful drug trafficking gangs."
}