{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBP0EK_L.jpg",
  "title": "Israel pounds central Gaza, thousands of Palestinians try to escape",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 26, 2023 06:23PM ET",
    "Updated Dec 27, 2023 02:07PM ET"
  ],
  "comments": [
    2,
    [
      [
        "John Laurens",
        "2023-12-27 08:07:03",
        "I envision an unihabited renamed gaza Israeli National Park dedicated to the 1,100 slain innocent Jews on 10/7.",
        "https://www.investing.com/members/231182441"
      ],
      [
        "Ueslei Brandao",
        "2023-12-27 10:01:29",
        "Keep your hate to yourself",
        "https://www.investing.com/members/203496790"
      ],
      [
        "Sherman Shields",
        "2023-12-27 13:57:53",
        "Ueslei Brandao",
        "https://www.investing.com/members/219394686"
      ],
      [
        "John Laurens",
        "2023-12-28 12:15:45",
        "Ueslei Brandao",
        "https://www.investing.com/members/231182441"
      ],
      [
        "John Laurens",
        "2023-12-27 08:06:32",
        "I envision an unihabited renamed gaza Israeli National Park dedicated to the 1,100 slaughtered innocent Jews on 10/7.",
        "https://www.investing.com/members/231182441"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/gaza-war-to-last-months-israel-says-as-fears-of-conflict-spread-rise-3263741",
  "paragraph": "5/5\n© Reuters. An Israeli self-propelled artillery unit fires amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, as seen from southern Israel, December 26, 2023. REUTERS/Violeta Santos Moura\n2/5\nBy Nidal al-Mughrabi, Bassam Masoud and Dan Williams CAIRO/GAZA/JERUSALEM (Reuters) - Israeli forces pounded central Gaza by land, sea and air on Wednesday and Palestinian authorities reported dozens more deaths, with the U.N. health agency saying thousands of people were trying to flee the fighting. Reflecting Israeli resolve to wipe out Hamas despite international calls for a ceasefire amid a humanitarian crisis, Israel's military chief Herzi Halevi said on Tuesday the war would last many months. There were \"no short cuts in dismantling a terrorist organisation\", he said. Israel also signalled it could step up its response to cross-border attacks from northern neighbour Lebanon, where Hamas ally Hezbollah is based. A Gaza health ministry statement said an Israeli air strike killed 20 Palestinians on Wednesday near the Al-Amal Hospital in Khan Younis, in the southern Gaza Strip. There was no immediate comment from the Israeli military. In central Gaza's Al-Maghazi district, five Palestinians were killed in one air strike, medics said, while to the north in Gaza City health officials said the bodies of seven Palestinians killed overnight arrived at Al Shifa Hospital. Residents in the central Gaza Strip said with nightfall, Israeli tank shelling intensified east of Al-Bureij and Al-Maghazi refugee camps where tanks have been trying to force their way through.  Israel's military on Wednesday reported three more soldiers killed in action in Gaza, bringing total military losses in the enclave since ground operations began on Oct. 20 to 166.  The war erupted after Hamas killed 1,200 people and captured 240 hostages in a cross-border rampage on Oct. 7, the deadliest day in Israel's history. Prime Minister Benjamin Netanyahu has responded with an assault that has laid much of Hamas-ruled Gaza to waste. The Gaza health ministry said Israeli forces had killed 195 Palestinians and wounded 325 in the past 24 hours, bringing the recorded toll to 21,110 killed and 55,243 wounded in Israeli attacks in the coastal Palestinian territory since Oct. 7. Nearly all the enclave's 2.3 million people have been driven from their homes, many several times. In Tel Aviv, a huge clock counted the time elapsed since Hamas took the hostages as families kept up their campaign for their loved ones to be freed.  LEBANON BORDER At Israel's northern frontier, security sources said Hezbollah had fired the most rockets and weaponised drones on Wednesday that it has in a single day since the series of daily clashes began. The Israeli military said its warplanes had targeted Hezbollah military sites and other locations in Lebanon, and minister Benny Gantz said the situation must change. \"If the world and the Lebanese government don't act in order to prevent the firing on Israel's northern residents, and to distance Hezbollah from the border, the IDF will do it,\" he told a press conference, referring to the Israel Defence Forces. The IDF said it was working in several areas of Gaza, particularly around Al-Bureij and Khan Younis, which it described as a terror base for Hamas. \"We have expanded our activity and today we added another brigade and we are continuing to act there with the use of new military tactics above ground and underneath,\" IDF spokesperson Daniel Hagari said. PEOPLE FLEEING The U.N. World Health Organization said on Wednesday its staff had seen tens of thousands of people fleeing heavy strikes in Khan Younis and the Middle Area on foot, on donkeys or in cars. Makeshift shelters were being built along the road, it said. “WHO is extremely concerned this fresh displacement of people will further strain health facilities in the south, which are already struggling to meet the population’s immense needs,” said Rik Peeperkorn, WHO representative in the West Bank and Gaza, said in the agency's statement on X. “This forced mass movement of people will also lead to more overcrowding, increased risk of infectious diseases and make it even harder to deliver humanitarian aid.” Israel says it is doing what it can to protect civilians, and blames Hamas for putting them in harm's way by operating among them, which Hamas denies. Even Israel's closest ally the U.S. has said it should do more to reduce civilian deaths from what President Joe Biden has called \"indiscriminate bombing\". Israeli government spokesperson Eylon Levy also urged the United Nations to help clear the backlog of aid waiting to enter Gaza, describing the U.N. aid mechanism as \"woefully unsuccessful\". The Israeli military said it was continuing to strike militant targets in Gaza, at one point using its navy to hit suspects deemed to pose a threat to ground troops. In the Shejaia district of Gaza City, an Israeli attack on militant fighters on foot caused secondary explosions, indicating the area was rigged with explosives to attack soldiers, a military statement said. In the Israeli-occupied West Bank, six youths were killed in an Israeli raid into the city of Tulkarm, the Palestinian health ministry said. An Israeli military statement said Israeli forces on a counter-terrorism operation came under attack by militants who threw explosive devices at them. The attackers were struck by an Israeli air force aircraft, it said. \nResidents said the youths were neither fighters nor militants. \"It was a sight I could not see,\" Saida Famawi, the mother of one of the youths, said. \"It was something you cannot look at.\""
}