{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0G0WK_L.jpg",
  "title": "Guatemalan ex-president Alejandro Giammattei barred from entering US",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 17, 2024 06:01PM ET",
    "Updated Jan 17, 2024 09:52PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/guatemalan-expresident-giammattei-barred-from-entry-into-us-state-dept-3276753",
  "paragraph": "© Reuters. Guatemala’s President Alejandro Eduardo Giammattei Falla, addresses a ministerial level meeting of the United Nations Security Council on the crisis in Ukraine at U.N. headquarters in New York, September 20, 2023. REUTERS/Brendan McDermid/File Photo\nWASHINGTON/GUATEMALA CITY (Reuters) - Former Guatemalan President Alejandro Giammattei has been barred from entering the U.S. over allegations of \"his  involvement in significant corruption,\" the State Department said on Wednesday. \"The State Department has credible information indicating  that Giammattei  accepted bribes in exchange for the performance of his  public functions during his tenure  as president of  Guatemala,  actions that undermined the rule of law and government transparency,\" State Department spokesperson Matthew Miller said in a statement. The former president was criticized during his tenure for not reviving a U.N.-backed anti-corruption watchdog terminated by his predecessor, and he repeatedly clashed with the U.S. over efforts to curb graft. Reuters was not able to immediately reach Giammattei for comment. Giammattei was replaced on Monday by anti-corruption crusader Bernardo Arevalo, after an uphill campaign due to what Arevalo has called an \"attempted coup\" by prosecutors to invalidate him. Giammattei had publicly vowed to carry out an orderly transition.  \"The government of President Arevalo is respectful of U.S. government decisions and the criteria it considers for the ineligibility of Guatemalan citizens,\" a government spokesperson told Reuters. \nArevalo was sworn in as Guatemala's president in the early hours of Monday after a chaotic inauguration that was delayed for hours by a last-ditch attempt by opposition in Congress aiming to weaken his authority. Giammattei skipped the ceremony. The 65-year-old Arevalo has cast himself as a democracy advocate and the leader of a progressive movement bent on reshaping a political landscape long dominated by conservative parties."
}