{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK010BX_L.jpg",
  "title": "Displaced Gazans scavenge wood for makeshift shelters in tent city",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 02, 2024 08:55AM ET",
    "Updated Jan 03, 2024 08:36AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Vitaliy Ne Vazno",
        "2024-01-02 19:14:44",
        "Shadi Maarouf, his wife Safeya and their six children\nYou have to tell thanks for your present life to your leaders and to those arabs raping İsrailian girls",
        "https://www.investing.com/members/251978950"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/for-gaza-family-living-in-tent-city-campfire-is-the-only-home-3265605",
  "paragraph": "4/4\n© Reuters. Palestinians who fled their houses due to Israeli strikes sit by a tent, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, in Rafah, in the southern Gaza Strip, January 1, 2024. REUTERS/Mohammed Salem\n2/4\nBy Mohammad Salem RAFAH, Gaza Strip (Reuters) - For the Maarouf family, living in Rafah's tent city after fleeing their house in Gaza at the start of Israel's deadly bombardment nearly three months ago, home is now the small campfire they sit around each night.  Supplies of wood, scavenged from ruined buildings, were exhausted long ago in the devastated Palestinian enclave, and the small fires of displaced, destitute people are now fed with bits of cloth or plastic.  \"There is no safety. We're scared, I swear. My children are scared and say to me, 'Dad we're out in the open.' I tell them 'God help us, where can we go?'\" said Shadi Maarouf, his face lit up by the firelight.  Nearly all the Gaza Strip's 2.3 million people have lost their homes, driven out by a shattering bombardment and ground offensive that Israel launched after Hamas fighters rampaged across the border on Oct. 7, killing 1,200 people.  More than 22,000 Palestinians have been killed by Israeli bombardment, health authorities in Hamas-run Gaza say. The tiny coastal territory's population now live packed into communal shelters in U.N. schools or in makeshift camps crowded around the streets of Rafah, near Gaza's southern border with Egypt, and a few other centres.  The Maaroufs, from Beit Lahia close to the northern border with Israel, fled on the first day of the war. They sought refuge in a shelter in another northern district but found it to be unsafe and moved on.  They stayed in al-Nuseirat, in central Gaza, for a month but air strikes came close too often. Then they moved south, to Rafah, right on the frontier with Egypt.  The family now sit around the campfire outside their tent made of pieces of wood and tarpaulin. They hold their four-month-old baby and play with her or warm their hands near the stuttering flames.  By night the tent city is ghostly. Gaza's electricity gave out early in the war after Israel cut off power supply and fuel for generators. Only solar power remains. Occasionally a tent is lit from inside by a flashlight, its plastic sheeting glowing dimly in the night. Shadi Maarouf, his wife Safeya and their six children huddle for warmth against the biting cold. \"This life in Rafah is a tragedy,” Maarouf said. \n“We sleep in fear,” said Safeya Maarouf, who struggles to find diapers and baby formula for her daughter. \"What can we do? There is no shelter. The life and conditions are difficult, for us and everyone else, all the people, not just us. All the people are suffering, they are all in pain. There are no bathrooms, no water, no warmth, no safety. We sleep in fear,\" she said."
}