{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "Oregon Supreme Court rules lawmakers cannot seek reelection after Senate boycott",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 01, 2024 02:32PM ET",
    "Updated Feb 01, 2024 02:41PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/oregon-supreme-court-rules-lawmakers-cannot-seek-reelection-after-senate-boycott-3290394",
  "paragraph": "By Jonathan Allen (Reuters) - The Oregon Supreme Court ruled on Thursday that Republican lawmakers who embarked on a six-week boycott of legislative sessions last year in opposition to bills on abortion and gun control were correctly disqualified from reelection. Ten of the 12 Republican members of Oregon's Senate began their walkout last May, denying the Democratic majority the two-thirds quorum needed to vote on bills.  The walkout was the longest in the state's history, according to Ballotpedia, though not its first. It came after Oregonians voted in 2022 in favor of a ballot measure to amend the constitution to disqualify truant lawmakers from a subsequent term in office. In that amendment, a lawmaker who had 10 or more unexcused absences from legislative sessions was deemed to be engaged in \"disorderly behavior\" and was disqualified from serving in the legislature \"following the election after the member's current term is completed.\" Last August, Oregon Secretary of State LaVonne Griffin-Valade, a Democrat, ruled that the 10 lawmakers who boycotted the Senate were thereby disqualified from the ballot in 2024's elections. Five of the lawmakers sued, arguing that the wording of the 2022 ballot measure meant they were not disqualified from seeking reelection in 2024, but instead for the term after that. The state's Supreme Court disagreed, citing how the ballot measure was explained to voters and how it was covered in the media. \"Reading the text of the amendment in light of the ballot title and the voters' pamphlet, voters would have understood the disqualification to apply to the term of office immediately following the term in which a legislator accrued 10 or more unexcused absences,\" the justices wrote. Griffin-Valade said in a statement she was glad her interpretation of the amendment and her decision to disqualify the lawmakers from the ballot was affirmed. \"I've said from the beginning my intention was to support the will of the voters,\" her statement said.  John DiLorenzo, a lawyer for the lawmakers who sued the secretary of state, said the court missed \"a great opportunity to let initiative sponsors know that they should be careful how they draft their text.\"   \"I would not be surprised if this decision comes back to haunt those who today will rely on it,\" he wrote in an email. The Republicans who took part in the boycott said they were seeking to enforce a 1979 law requiring that state bills be written in simple language. Democrats countered that their Republican colleagues objected to the contents of the bills, not their readability, which sought to allow children under the age of 14 to seek an abortion without parental consent and to raise the minimum age for gun purchases to 21, from 18."
}