{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0O06W_L.jpg",
  "title": "US envoy sees rapid F-16s sale to Turkey after Sweden NATO bid sign-off",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 25, 2024 02:18AM ET",
    "Updated Jan 25, 2024 02:41AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-envoy-sees-rapid-f16s-sale-to-turkey-after-sweden-nato-bid-signoff-3282451",
  "paragraph": "By Jonathan Spicer ISTANBUL (Reuters) -The U.S. ambassador to Turkey said he anticipates that President Tayyip Erdogan will give a final sign-off on Sweden's NATO membership within days, triggering rapid steps toward U.S. Congress endorsing a sale of F-16 fighter jets to Ankara.  In an interview on Thursday, Ambassador Jeff Flake said that once the formal ratification document is received in Washington, the U.S. State Department will immediately send Congress notification of the $20 billion F-16s sale.  Turkey's parliament ratified Sweden's NATO membership bid on Tuesday, clearing a major hurdle to expanding the Western military alliance after 20 months of delay.  Erdogan needs to sign the legislation, which would be published in Turkey's Official Gazette. The instrument of accession for Sweden also needs to be sent to Washington.  Asked whether he expected this \"within days\", Flake, a former U.S. Republican senator, told Reuters: \"Yes, I do.\"  \"I see no reason why, with the parliament having acted here, that Turkey would wait,\" he said. \"So I would expect as soon as that is conveyed to Washington, then congressional notification (of the F-16 sales) will happen.\"  \"The president here needs to sign it and then the instrument needs to be conveyed to Washington,\" he told Reuters by phone. \"As soon as that happens, then we expect notification to happen. And official notification will happen.\" Both Erdogan and members of the U.S. Congress had tied Turkey's backing of Sweden's NATO bid with congressional approval of the $20 billion sale of  Lockheed Martin  (NYSE:LMT) aircraft and modernization kits to Turkey.  U.S. President Joe Biden sent a letter to leaders of key Capitol Hill committees on Wednesday informing them of his intention to begin the formal notification process for the F-16 sale once Ankara completes Sweden's NATO accession process. CALLS TO CONGRESS Sweden bid to join the U.S.-led North Atlantic Treaty Organization in 2022 to bolster its security in response to Russia's full-scale invasion of Ukraine.  All bloc members must approve new members. But Turkey raised objections at the time over what it said was Sweden's protection of groups it deems terrorists, prompting Stockholm to introduce a new security law.  Ankara's delays had frustrated some of its Western allies and enabled it to extract some concessions. But Flake, who was envoy throughout the process, said Sweden addressed Turkey's \"very legitimate security needs\" in that time. The ambassador said he has been in touch with the heads of the U.S. House and Senate foreign relations committees, including those with concerns about selling F-16s to Turkey over its human rights record and the Sweden delays.  \n\"There are members of Congress who felt strongly that before proceeding with the F-16 sale that Sweden needed to be a member of NATO,\" he said.  \"But they all see the value of Turkey's participation in NATO, and they all see the value of interoperability that comes with this F-16 modernization.\""
}