{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBR0GM_L.jpg",
  "title": "NRA fails to end New York probe, as trial nears",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 28, 2023 01:13PM ET",
    "Updated Dec 28, 2023 03:46PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/nra-fails-to-end-new-york-probe-as-trial-nears-3264470",
  "paragraph": "2/2\n© Reuters. FILE PHOTO: NRA Executive Vice President and CEO Wayne LaPierre speaks at the National Rifle Association (NRA) annual convention in Indianapolis, Indiana, U.S., April 14, 2023. REUTERS/Evelyn Hockstein/File Photo\n2/2\nBy Jonathan Stempel NEW YORK (Reuters) - A New York state appeals court on Thursday rejected the National Rifle Association's bid to end a corruption probe by state Attorney General Letitia James that the gun rights group has viewed as politically motivated. The unanimous decision by a five-judge panel of the Appellate Division in Manhattan came 1-1/2 weeks before a scheduled Jan. 8 trial, where James is seeking remedies including the removal of NRA Chief Executive Wayne LaPierre. James, a Democrat, sued the NRA in August 2020 saying it diverted millions of dollars to fund luxuries for officials including LaPierre. She also said NRA officials failed to obtain board approval for conflicts of interests and insider transactions, and retaliated against whistleblowers who suspected financial misconduct. In seeking a dismissal, the NRA accused James of violating the First Amendment for trying to silence its speech because she disliked what it stood for. It also accused her of selective enforcement, including through her unsuccessful effort to dissolve the group. But the appeals court said James had probable cause to investigate and sue the NRA, citing her authority to enforce state laws governing nonprofits, and the \"ample evidence of malfeasance\" she claimed to uncover. It also rejected the selective enforcement claim, saying other nonprofits where dissolution had been sought agreed to overhaul their leaderships, while the NRA had not. Neither lawyers for the NRA nor James' office had immediate comments. Thursday's decision upheld a June 2022 ruling by Justice Joel Cohen of the New York state court in Manhattan, who would oversee the trial. Cohen had in March 2022 blocked James' effort to dissolve the NRA, finding a lack of evidence that the group deserved the \"corporate death penalty.\" At trial, jurors may assess how much four current and former NRA officials including LaPierre should repay the group, and recommend whether LaPierre and NRA Secretary John Frazer should be removed. Cohen would later consider the removal requests. \nJury selection begins on Jan. 2. The trial may last six weeks. The case is New York v. The National Rifle Association of America Inc et al, New York State Supreme Court, Appellate Division, 1st Department, No. 1026-28."
}