{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK090PD_L.jpg",
  "title": "Madrid museum welcomes ruling it can keep painting looted by Nazis",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 10, 2024 12:29PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/madrid-museum-welcomes-ruling-it-can-keep-painting-looted-by-nazis-3271730",
  "paragraph": "3/3\n© Reuters. Members of the media stand by Camille Pissarro's 1897 \"Rue Saint-Honore in the Afternoon. Effect of Rain\" at Thyssen-Bornemisza museum in Madrid, Spain, January 10, 2024. REUTERS/Susana Vera\n2/3\nBy Catarina Demony and Elena Rodriguez MADRID (Reuters) - One of Spain's top museums welcomed a U.S. court decision allowing it to keep a French impressionist painting looted from a Jewish woman by the Nazis, which the museum said it had bought decades later in a transparent way.  Tuesday's decision by a California appeals court concerned one of the oldest Nazi art theft cases, which began in 2005 after the heirs of Jewish woman Lilly Neubauer brought forward an ownership claim for Camille Pissarro's \"Rue Saint Honore, apres midi, effet de pluie\" (\"Rue Saint Honore, Afternoon, Rain Effect\"), depicting a Paris street scene. \"It is a regrettable story like everything else related to the Nazi plunder,\" the general director of Madrid's Thyssen-Bornemisza Museum, Evelio Acevedo, told Reuters. \"(But) it is a very important decision because... it does justice.\"  \"The Spanish state bought the painting with all legitimacy and in good faith,\" he added.  Neubauer was forced to sell the artwork in 1939 for 900 Reichsmarks ($360) to obtain a visa and flee Germany, but was never paid. According to Acevedo, Neubauer's heirs, the Cassirer family, later \"obtained compensation for the market value of the painting from the German government\". Ownership passed through several hands until 1993, when the state-owned Thyssen-Bornemisza Museum bought it and put it on display, where it remains. After learning where the painting was, the Cassirers petitioned for its return and sued. The case reached the U.S. Supreme Court two years ago. In Tuesday's decision, Circuit Judge Carlos Bea said Spain's interest in providing \"certainty of title\" to its museums outweighed California's interest in deterring theft and obtaining recoveries for victims of stolen art who live there. Another judge, Consuelo Callahan, said Spain should have voluntarily relinquished the painting but the law compelled a different outcome. \nLawyers for the Cassirers said the family sought to \"challenge Spain's continuing insistence on harbouring Nazi looted art\", especially amid a recent resurgence in anti-Semitism around the world. Acevedo said current circumstances have nothing to do with the history of the case and there was absolutely no anti-Semitic sentiment."
}