{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0S0LY_L.jpg",
  "title": "US begins reimposing sanctions on Venezuela, oil may come next",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 29, 2024 01:06PM ET",
    "Updated Jan 29, 2024 08:37PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/venezuelas-machado-rejects-possibility-of-substitute-opposition-candidate-3286291",
  "paragraph": "2/2\n© Reuters. Venezuelan opposition presidential candidate Maria Corina Machado addresses the media, after a court upheld a ban preventing her from holding office, in Caracas, Venezuela, January 29, 2024. REUTERS/Leonardo Fernandez Viloria\n2/2\nBy Matt Spetalnick and Vivian Sequera WASHINGTON/CARACAS (Reuters) - The U.S. on Monday began reinstating sanctions on Venezuela and a Biden administration source said a roll-back of restrictions on the oil industry could be allowed to expire, after the South American country's top court upheld a ban blocking the candidacy of the leading opposition hopeful in presidential elections. The United States had granted sanctions relief for OPEC member Venezuela in October in recognition of a deal for elections this year.  But that relief was conditioned on President Nicolas Maduro's government freeing certain opposition-linked and American prisoners and making progress toward removing bans on a number of opposition figures. Though Venezuela in December carried out a prisoner swap, the Maduro-allied Supreme Court on Friday kept in place a ban on opposition candidate Maria Corina Machado, upholding prior findings that she supported the sanctions and a U.S.-backed opposition interim government, which the Maduro government blames for the loss of Venezuelan foreign assets. The arrests of several opposition members were confirmed the same day. In a first reinstatement of sanctions, the Treasury Department said on Monday evening any U.S. entities conducting transactions with Venezuelan state-owned gold mining firm Minerven will have until Feb. 13 to wind them down.  The move came hours after a Biden administration official had said the Treasury license that broadly restored dealings with Venezuela's oil industry would be allowed to expire on April 18 if Machado and other opposition figures were not allowed to run. \"Unless Maduro and his representatives in Venezuela are able to get back on track, specifically with regard to allowing all presidential candidates to compete in this year's election, we will not be in a position to renew General License 44, which provides relief to Venezuela's oil and gas sector when it comes up for renewal in April,\" the White House official said on condition of anonymity. The official said the U.S. was also considering additional unspecified measures to punish the Venezuelan government. 'NO RETREAT' White House national security spokesman John Kirby (NYSE:KEX) said earlier on Monday that U.S. measures would depend on Maduro and his government.  \"They've got till the spring to honor their commitments,\" he told a daily briefing. \"They've got decisions they have to make before we weigh what decisions we'll take.\" Machado, a 56-year-old industrial engineer who overwhelmingly won an October opposition primary vote, said on Monday she would not move aside in favor of a substitute. \"There is no retreat. We have a mandate and we will complete it,\" Machado told a press conference in Caracas. The ruling was \"judicial crime,\" she said, adding there will be many obstacles still to overcome but there will be elections this year. Jorge Rodriguez, a lawmaker who heads Maduro's team in negotiations with the opposition, said prior to the Treasury decision that if Washington took \"any aggressive action,\" Venezuela's response would be \"serene, reciprocal and energetic.\" \nMaduro repeated the same rhetoric during his weekly television show on Monday evening, without commenting directly on the Minerven decision. (This story has been refiled to clarify confirmation date of arrests of opposition figures in paragraphs 5 and 6)"
}