{
  "image": "https://i-invdn-com.investing.com/news/international_newspapers_69x52._800x533_L_1419494241.jpg",
  "title": "Sidney Wolfe, longtime US consumer health watchdog, dead at 86",
  "category": "General",
  "publisher": "Reuters",
  "date": [
    "Published Jan 01, 2024 07:39PM ET",
    "Updated Jan 01, 2024 08:05PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/general/sidney-wolfe-longtime-us-consumer-health-watchdog-dead-at-86-3265156",
  "paragraph": "(Reuters) -Sidney Wolfe, a doctor who for decades campaigned for reform across the U.S. health system, including for more affordable care and stricter oversight of drug safety and medical devices, died Monday in Washington. The cause was brain cancer, his wife, Suzanne Goldberg, told Reuters. He was 86. For more than four decades, Wolfe ran the Health Research Group at Public Citizen, a Washington consumer advocacy group, before stepping down in 2013, according to the organization. He also sat on the U.S. Food and Drug Administration's Drug Safety and Risk Management Advisory Committee from 2008 to 2012, in addition to serving as a researcher at the National Institutes of Health and an adjunct professor at Case Western Reserve University. The news was first reported by The Washington Post. Wolfe campaigned with consumer advocate Ralph Nader in 1971 for the recall of contaminated intravenous fluids that were causing sometimes fatal bacterial infections, according to Public Citizen. In a statement, the organization's president Robert Weissman said the United States had lost a \"towering public health leader,\" and that during Wolfe's time at Public Citizen, it had helped to force the withdrawal of 28 dangerous medications and won limits on the use of 10 others, in addition to protective workplace health standards and other achievements.  \"He's a terrific person, a very loving, caring human being, apart from being dedicated to his work,\" Goldberg told Reuters. Wolfe is survived by four daughters, two stepsons and five grandchildren, Goldberg said."
}