{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0P0SZ_L.jpg",
  "title": "US Defense Secretary Austin to return to Pentagon Monday",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 26, 2024 05:33PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-defense-secretary-austin-to-return-to-pentagon-monday-3284627",
  "paragraph": "© Reuters. FILE PHOTO: U.S. Secretary of Defense Lloyd Austin testifies before a Senate Appropriations Committee hearing on Capitol Hill in Washington, U.S., October 31, 2023. REUTERS/Kevin Lamarque\nWASHINGTON (Reuters) - U.S. Defense Secretary Lloyd Austin is expected to return to the Pentagon on Monday, nearly a month after being secretly admitted to a hospital for complications from an undisclosed prostate cancer surgery in December, two U.S. officials told Reuters on Friday.  Austin's secrecy surrounding his condition and his Jan. 1 hospitalization caught the White House and Congress off guard, and even President Joe Biden didn't know Austin was hospitalized during much of the first week of January.  Austin, 70, has not yet spoken publicly about his health. He had been due to make a passing reference to it on Tuesday, but skipped over that portion of his prepared remarks during a virtual meeting of Ukraine's military allies that Austin joined from his Virginia home. Austin's secrecy has triggered a political uproar. Republicans accused Austin of dereliction of duty. Austin is a retired four-star general who led forces in Iraq and who is America's first Black defense secretary. Some prominent Republicans, including Donald Trump, called for Austin to be removed from his job. However, Biden has said he has confidence in Austin despite what the president agreed was a lapse in judgment. Austin was admitted to Walter Reed National Military Medical Center in Maryland on Dec. 22 to treat prostate cancer. \nHe returned to the hospital on Jan. 1 due to complications that included a urinary tract infection. His hospitalization was not revealed until four days later, and the Pentagon did not specify why he was being treated until Jan. 9. Earlier on Friday, physicians at Walter Reed said Austin continued to recover well from prostate cancer treatment and was expected to make a full recovery."
}