{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK080RV_L.jpg",
  "title": "AI advances risk facilitating cyber crime, top US officials say",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 09, 2024 03:38PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/ai-advances-risk-facilitating-cyber-crime-top-us-officials-say-3270631",
  "paragraph": "© Reuters. FILE PHOTO: Words reading \"Artificial intelligence AI\", miniature of robot and toy hand are pictured in this illustration taken December 14, 2023. REUTERS/Dado Ruvic/Illustration/File Photo\nBy Luc Cohen NEW YORK (Reuters) - Advances in artificial intelligence may facilitate hacking, scamming and money laundering by reducing the technical know-how required to carry out such crimes, top U.S. law enforcement and intelligence officials said on Tuesday.  Rob Joyce, director of cybersecurity at the National Security Agency, said at the International Conference on Cyber Security at Fordham University in Manhattan that less capable people are using AI to guide hacking operations they would not have otherwise been able to carry out themselves. \"It's going to make those that use AI more effective and more dangerous,\" Joyce said, adding that on the flip side, AI advances were helping U.S. authorities find malicious activity.  The FBI is already observing an increase in cyber intrusions due to AI lowering the technical barriers to carrying them out, James Smith, the assistant director in charge of the FBI's New York field office, said at the conference. Two top federal prosecutors said AI could also spur some financial crimes.  Damian Williams, the U.S. Attorney in Manhattan, said AI could help people who do not speak English generate believable-sounding messages to try to scam potential victims out of money.  \nBreon Peace, the U.S. Attorney in Brooklyn, said AI-generated \"deepfake\" images and videos could be used to trick banks' systems designed to verify their customers' identities to prevent money laundering. \"That, in turn, could allow criminals and terrorists to open accounts at scale, undermining the system of controls that we have developed for decades,\" Peace said."
}