{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBS0FP_L.jpg",
  "title": "Airlines urge US to do more to address flight delays",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 02, 2024 01:21PM ET",
    "Updated Jan 02, 2024 01:26PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/airlines-urge-us-to-do-more-to-address-flight-delays-3265714",
  "paragraph": "By David Shepardson WASHINGTON (Reuters) -A group representing major passenger airlines on Friday urged U.S. transportation officials to do more to address the impact of private planes and air traffic controller staffing shortages on holiday flight delays and cancellations.  Airlines for America, a group representing American Airlines (NASDAQ:AAL), Delta Air Lines (NYSE:DAL), United Airlines, Southwest Airlines (NYSE:LUV) and others, urged Transportation Secretary Pete Buttigieg and Federal Aviation Administration (FAA) chief Michael Whitaker to \"take all possible actions to find the appropriate balance between commercial and private aviation traffic with the goal of minimizing delays and cancellations for the traveling public.\" The group in a letter also urged \"all possible steps be taken to avert additional staffing triggers, particularly in high volume centers\" for air traffic control. The FAA said airlines, general aviation and others \"have a seat at the Command Center, where the FAA monitors the airspace 24/7 and gives updates every two hours.\" The FAA said \"as air travel continues to rebound, the agency is taking immediate action to recruit, train and hire more air traffic controllers\" but has acknowledged it is still about 3,000 controllers below optimal levels.  Preliminary data from December 20—27 show 77% of delays have been due to volume, 19.1% to weather, and 0.9% due to FAA staffing, the agency said.  The National Business Aviation Association said independent studies previously have shown flights by mostly small, non-airline general aviation planes \"are not a significant causal factor in aviation-system delays\" and added \"delays are most often caused by weather and the practices of the airlines themselves.\" Buttigieg said this month the U.S. is on pace to have the lowest number of flight cancellations in five years. He and Whitaker have prioritized boosting air traffic control staffing. The FAA in September extended cuts to minimum flight requirements at congested New York City-area airports through October 2024, citing staffing shortages. New York Terminal Radar Approach Control staffing is just at 54% of recommended levels. \nIn June, a government watchdog report said critical air traffic facilities face significant staffing challenges, posing risks to air traffic operations. At many facilities, controllers are working mandatory overtime and six-day work weeks to cover the shortage. Whitaker last week said he was naming a panel led by a former safety board official to address air traffic controller fatigue after a series of near-miss incidents."
}