{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "Panama ex-president's return to office endangered by graft sentence",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 01, 2024 07:04PM ET",
    "Updated Feb 01, 2024 07:36PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/panama-expresidents-return-to-office-endangered-by-graft-sentence-3290613",
  "paragraph": "By Valentine Hilaire and Elida Moreno (Reuters) - Panama's ex-president Ricardo Martinelli is hoping to convince voters to give him a second chance in an election on May 5, but a decade-long prison sentence for money laundering could imperil his run. Martinelli's candidacy could implode if Panama's top court upholds a 128-month prison sentence for money laundering handed down last year for his role in a case known as \"New Business,\" which alleges public funds were used to buy a media conglomerate and give him a majority stake. His lawyers announced they would appeal the sentence in a press conference held hours after the ruling was published in July last year, denying that the former president had used public funds for the transaction.  Panama's constitution bars from the presidency anyone condemned to a prison sentence of five years or more.  One of Martinelli's lawyers, Carlos Carrillo, told Reuters the defense expects the court to accept the appeal, adding that even a rejection would not rule out his candidacy immediately.  Martinelli said on X this week that he would be \"happy to\" pass on his votes to running mate Jose Raul Mulino if he is barred, arguing his party would win under that scenario too.  Martinelli, a multimillionaire supermarket magnate, held office from 2009 to 2014 after a campaign in which he called himself \"the crazy man\" and vowed to make all changes needed to lift Panama's fortunes.  He is running now since Panamanian law obliges ex-presidents to wait for a decade until seeking a second term.  He exited the post with an approval rating of over 60%, but many judicial cases were filed against him soon after. Martinelli claimed in social media posts he was the target of political persecution. Martinelli was arrested in Miami, where he had since moved, in the midst of an investigation by Panamanian authorities into alleged political espionage. He was then extradited to Panama and spent about one year in jail, but was ultimately acquitted. The United States last year barred Martinelli and his immediate family from entering the country, accusing him of accepting bribes in exchange for improperly awarding government contracts during his tenure as president.  \nU.S. Secretary of State Antony Blinken announced the ban on the same day two of Martinelli's sons completed a U.S. prison sentence for acting as intermediaries for bribes from Brazilian construction firm Odebrecht to a Panamanian official while their father was president. U.S. ambassador to Panama Mari Carmen Aponte said in a television interview that the U.S. government will work with the president chosen by Panamanians. Time was needed for local judicial authorities to resolve Martinelli's ongoing case, she said."
}