{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "Ukraine, Russia accuse each other of early New Year's Day attacks",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 31, 2023 07:58PM ET",
    "Updated Jan 01, 2024 04:21PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Barry Nickerson",
        "2024-01-02 11:23:34",
        "He attacked me!, each other cried in the middle of a war.  I do not recall hearing anything about a New Year's cease fire.",
        "https://www.investing.com/members/249373719"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/ukraine-russia-accuse-each-other-of-early-new-years-day-attacks-3264995",
  "paragraph": "(Reuters) -Ukraine's shelling of the city of Donetsk on Monday killed four people, a Russian-installed official in the eastern region of Ukraine said, while Russia's air attacks on several Ukrainian regions killed at least one person, local officials said.  Thirteen people were also injured in \"heavy shelling\" by Ukrainian forces on the centre of Donetsk, Denis Pushilin, the head of the Donetsk region, wrote on the Telegram messaging app. In a statement, the Russian Foreign Ministry called the shelling of Donetsk a \"terrorist act\" that it said was aimed at civilian infrastructure. Separately, a person was killed by shelling in the Russian border region of Belgorod, the local governor said on Telegram. On the Ukrainian side, one person was killed and nine injured in a Russian drone attack on the southern port of Odesa, Oleh Kiper, governor of the region, said on Telegram.  Kiper said that falling debris from drones that were shot down caused several fires in residential buildings in different parts of the city.  A social media video, posted by Odesa Mayor Henadii Trukhanov, showed him inspecting a damaged apartment building with broken windows. \"They say that how you welcome the New Year is how you will live the year,\" Trukhanov said in a post.  \"Well, this year Ukraine will break this rule: we will persevere and we will win.\" Officials in Ukraine's western region of Lviv, which borders Poland, said that an early New Year's Day Russian air attack damaged a university building in the city of Dubliany and damaged a monument to a 1940s commander of the Ukrainian Insurgent Army (UPA) on the outskirts of the city of Lviv.  \nUkraine's air force said that Russia's air attack also targeted the Mykolaiv and Dnipro regions. Reuters could not independently verify the Russian and Ukrainian reports. Both sides deny targeting civilians in the war that started with Russia's full-scale invasion of Ukraine in February 2022."
}