{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK080L7_L.jpg",
  "title": "'The Crown' costumes and props head for auction after royal drama wraps",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 09, 2024 10:43AM ET",
    "Updated Jan 09, 2024 03:58PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/the-crown-costumes-and-props-head-for-auction-after-royal-drama-wraps-3270462",
  "paragraph": "LONDON (Reuters) - From a replica of Queen Elizabeth II's Coronation gown to a reproduction of the Gold State Coach, costumes, props and sets from the award-winning royal drama \"The Crown\" will be on show in London this week before going under the hammer at auction. More than 450 items from the Netflix (NASDAQ:NFLX) show, which focused on the reign of Britain's late monarch Elizabeth, will be on public display at Bonhams from Thursday ahead of its \"The Crown Auction\" on Feb. 7. The hit show, which stirred controversy for its fictionalised dialogues and storylines, wrapped last month after six seasons, during which actors Claire Foy, Olivia Colman and Imelda Staunton portrayed the queen at different stages of her reign. Among items on display are costumes worn by the main characters, including Elizabeth Debicki, who portrayed the late Princess Diana in the series. A replica of the queen's Coronation ordaining dress, Imperial Mantle and red Coronation robe worn by Foy in season one has an estimate of 20,000 - 30,000 pounds ($25,430 - $38,145), while a black off-the-shoulder frock worn by Debicki in season five and inspired by Diana's so-called \"Revenge Dress\" has a price tag of 8,000-12,000 pounds. Also for sale is what Bonhams says is the world's only reproduction of the Gold State Coach (30,000-50,000 pounds) and a reproduction of the Coronation Chair (10,000-20,000 pounds).  There are also the show's replica Buckingham Palace wrought-iron gates (6,000-8,000 pounds) and a recreation of the Number 10 Downing Street facade (20,000-30,000 pounds). \"Lots in the sale are from all six seasons,\" said Charlie Thomas, director of house sales and private and iconic collections at Bonhams. Although the queen was the focus, \"the sale features all of the main characters from all six seasons and it's ... a real love letter to the show,\" Thomas added. Some 150 lots will go under the hammer in a live sale on Feb. 7. Some further 300 are being offered as part of an online auction running Jan. 11 to Feb. 8. \nProceeds from the live sale will go towards establishing a scholarship programme at the National Film and Television School, which has training sites across Britain. ($1 = 0.7865 pounds)"
}