{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0G0E2_L.jpg",
  "title": "Blinken says US in demand as he mourns 'gutwrenching' scenes in Gaza",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 17, 2024 06:18AM ET",
    "Updated Jan 17, 2024 12:05PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/blinken-says-us-in-demand-as-he-mourns-gutwrenching-scenes-in-gaza-3276011",
  "paragraph": "© Reuters. U.S. Secretary of State Antony Blinken attends the 54th annual meeting of the World Economic Forum in Davos, Switzerland, January 17, 2024. REUTERS/Denis Balibouse\nBy Leela de Kretser and Alexander Smith DAVOS, Switzerland (Reuters) - U.S. Secretary of State Antony Blinken told business and political leaders in Davos on Wednesday he could not think of a time in his career when there had been more global challenges, ranging from war in Gaza and Ukraine to tensions over Taiwan. Blinken said that almost none of the problems that U.S. President Joe Biden's administration wanted to address could be tackled in isolation, echoing comments on Tuesday by Chinese Premier Li Qiang, who called for greater global cooperation. Describing the conflict in Gaza as \"gutwrenching\", Blinken said what was needed to resolve the situation was a Palestinian state with a government structure \"that gives people what they want and works with Israel to be effective\". \"The suffering breaks my heart,\" he said during a keynote session at the World Economic Forum in the Swiss ski resort of Davos, adding: \"The question is what is to be done.\" The U.S. Secretary of State said that Washington was hearing from virtually every country in the Middle East that they wanted the United States to be at the table in discussions over how to bring about an end to Israel's war with Hamas militants in Gaza. And he said Washington was also in demand elsewhere. \"There is a greater premium than ever on a U.S. partnership,\" Blinken told the WEF panel audience. The war in Gaza started when Hamas militants stormed into southern Israel on Oct. 7, killing 1,200 people and taking 240 hostages. Israel says more than 130 remain in captivity. Israel responded to Hamas' assault with a siege, bombardment and ground invasion of Gaza that have devastated the tiny coastal territory and killed more than 24,000 people, according to Gaza health officials.  NO IMMEDIATE PROSPECT SEEN FOR UKRAINE CEASEFIRE Asked if there was any immediate prospect of a ceasefire in the war between Russia and Ukraine, Blinken was said he did not think there was, although the U.S. was always open to one. He said that in terms of money and resources needed to pay for Ukraine's reconstruction after nearly two years of conflict, the private sector was visiting the country and that the process was \"taking on a life of its own\". After Chinese Premier Li's comments on China being open to foreign investment on Tuesday, Blinken said the United States was dealing \"very directly and clearly\" with Beijing on businesses and while there were differences between the two, there were also \"places to cooperate more\". Asked about tensions over Taiwan, where the ruling Democratic Progressive Party (DPP) won the presidential election on Saturday, Blinken highlighted the importance of the Taiwan Strait and said the island had an outsized place in the world. He said that everyone had the same interests, particularly given Taiwan's role in producing semi-conductor chips. Summing up the challenges the United States was facing around the world, Blinken drew on the words of British wartime Prime Minister Winston Churchill. \n\"When it comes to the hard things ... when you are  going through hell, keep going,\" Blinken said."
}