{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0J03M_L.jpg",
  "title": "Fighting across Gaza as Israel drops leaflets seeking its hostages",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 20, 2024 06:09AM ET",
    "Updated Jan 20, 2024 02:30PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/fighting-across-gaza-as-israel-drops-leaflets-seeking-its-hostages-3278809",
  "paragraph": "© Reuters. Israeli soldiers operate in the Gaza Strip, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, in this handout picture released on January 20, 2024. Israel Defense Forces/Handout via REUTERS \nBy Nidal al-Mughrabi and Fadi Shana DOHA/GAZA (Reuters) -Israel pounded targets across the Gaza Strip on Saturday while its planes dropped leaflets on the southern area of Rafah urging Palestinians seeking refuge there to help locate hostages held by Hamas, residents said. Palestinian fighters battled tanks trying to push back into the eastern suburbs of the Jabalia area in northern Gaza, where Israel had started pulling out troops and shifting to smaller-scale operations, residents and militants said.  The Israeli military said aircraft struck militant squads trying to plant explosives near troops and fire missiles at tanks in northern Gaza and said it was striking targets throughout Gaza. In the southern area of Khan Younis, where Israel says it has expanded its operations against Hamas, witnesses said tanks shelled areas around Nasser Hospital overnight, describing the bombardment as the most intense in many days. Nasser is now Gaza's largest functioning hospital. Israel says Hamas fighters operate from in and around hospitals, including Nasser, which Hamas and medical staff deny. The Israeli military said that in Khan Younis it raided a military compound, neutralized ready-to-use rocket launchers and found explosives stashed underground while an aircraft struck two gunmen there. In north Gaza, troops raided a weapons site, and the military said it confiscated enough chemical materials and gear to manufacture 800 rockets. With nightfall, residents said Israeli planes and tanks intensified their bombardment in Jabalia on the northern edge of Gaza, and in Khan Younis and Rafah in the south. Five people were killed when an Israeli air strike hit a house in Jabalia, health officials said. In Rafah, medics said four people were killed and others were wounded when an Israeli air strike hit a car in the middle of Rafah city. The Israeli military said it was checking the report. The Gaza health ministry said Israeli strikes had killed 165 people and wounded 280 others in the past 24 hours, one of the biggest death tolls in a single day so far in 2024.  It did not distinguish between combatants and non-combatants in its daily toll, but most of the 24,927 Palestinians killed since the Oct. 7 war began are civilians, health officials say.  Fighting has not been confined to Gaza. An Israeli strike on Syria's capital Damascus on Saturday killed five members of Iran's Revolutionary Guards and an unspecified number of Syrian troops, Iran said. Israel has vowed to annihilate Hamas in Gaza after its fighters burst into Israel on Oct 7., and rampaged through Israeli towns and bases killing 1,200 people, most of them civilians, dragging 253 hostages back to the enclave.  Israel says its forces have so far killed around 9,000 militants. Israeli Prime Minister Benjamin Netanyahu on Thursday vowed to press on with the war until Hamas is defeated and the remaining hostages released. In more than 100 days of war, Israel's air, land and sea offensive has laid much of Gaza to waste, displacing most of the 2.3 million population, many forced to move repeatedly and seek refuge in tents that do little to protect them from the elements and disease, according to the United Nations. In Rafah, where over a million Palestinians are taking shelter, Israel dropped leaflets showing photos of 33 hostages, their names written in Arabic, urging the displaced to make contact. \"Do you want to return home? Please make the call if you recognise one of them,\" the leaflets read.  \"They are asking people's help because they are unable to get to their hostages because of the resistance,\" said Abu Ali, one north Gaza resident. \"End the war, Netanyahu, and get your people back,\" he told Reuters. More than 100 of the hostages seized by Hamas were freed during a short-lived November truce. Israel says 132 remain in Gaza, 27 of whom have been killed in captivity. \nIn Israel, families of hostages camped outside Netanyahu's residence in the coastal city Caesarea. \"He needs to choose one (deal) and end the hostage saga,\" said Eli Stivi, whose son Idan is being held incommunicado in Gaza."
}