{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBQ0IB_L.jpg",
  "title": "Israeli tanks push deep into central Gaza town, air strike kills 20 in south",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 27, 2023 05:55PM ET",
    "Updated Dec 28, 2023 05:12PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Dave Macdonald",
        "2023-12-28 06:59:15",
        "Israel are a law into themselves. disgusting!",
        "https://www.investing.com/members/201129640"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/israeli-attacks-in-gaza-add-to-heavy-palestinian-toll-in-war-on-hamas-3264170",
  "paragraph": "6/6\n© Reuters. Smoke rises over Gaza following an Israeli airstrike, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, as seen from southern Israel, December 27, 2023. REUTERS/Amir Cohen\n2/6\nBy Nidal al-Mughrabi and Bassam Masoud CAIRO/GAZA (Reuters) -Israeli tanks thrust deep into a town in the central Gaza Strip on Thursday after days of relentless bombardment that forced tens of thousands of already displaced Palestinian families to flee in a new exodus. A Palestinian journalist posted pictures of Israeli tanks near a mosque in a built-up area of Bureij, the armoured contingent having apparently advanced from orchards on the eastern outskirts.  Three Palestinians were killed in an Israeli missile strike on a house in northeastern Maghazi camp in central Gaza, health officials said. Further south Israeli forces hit the area around a hospital in the heart of Khan Younis, Gaza's main southern city, where residents feared a new ground push into territory crowded with families made homeless in 12 weeks of an Israel-Hamas war. In one of Israel's latest deadly airstrikes, 20 Palestinians were killed and 55 wounded in Rafah, a major town near the southern border with Egypt, Gaza health ministry spokesman Ashraf Al-Qidra said. Their bombed building was housing displaced civilians, according to local medics and residents. Reuters video showed rescuers scrabbling frantically through rubble to uncover and pull out victims including a baby and several children and rushing them through milling crowds of dazed and weeping people to the nearby Kuwaiti Hospital. Palestinian health authorities said earlier that 210 people were confirmed killed in Israeli strikes in the past 24 hours, raising the toll of Palestinians killed in the war so far to 21,320 - nearly 1% of Gaza's population. Thousands more dead were feared to be buried or lost in the ruins. Over the course of the war, the Israeli military has expressed regret for civilian deaths but it accuses Hamas of operating in densely populated areas and using civilians as human shields, a charge the group denies. GROUND OFFENSIVE INTENSIFIES DESPITE U.S. PLEAS Israel has escalated its ground offensive in Gaza sharply since just before Christmas despite public pleas from its closest ally the United States to scale the campaign down in the closing weeks of the year. It launched the war to destroy the militant Islamist Hamas movement that runs Gaza after fighters rampaged through Israeli towns in a cross-border raid on Oct. 7, killing 1,200 people and taking about 240 hostages.  Of the hostages, 110 were freed during a short truce in late November and another 23 have now been declared dead in absentia, an Israeli government spokesperson said on Thursday. Later on Thursday, U.S. President Joe Biden said American Judith Weinstein, who was believed to have been kidnapped by Hamas, was killed by the Islamist group on Oct. 7. Her husband, Gadi Haggai was killed on the same day, Biden said last week. The Israeli military released findings of an investigation into the killings by its troops in error of three Israeli hostages in Gaza on Dec. 15. Soldiers mistook their cries for help as a ruse by Hamas militants to draw them into an ambush, the military said on Thursday, concluding that the soldiers acted rightly to the best of their understanding. The main focus of fighting is now in central areas south of the wetlands that bisect the narrow coastal strip, where Israeli forces have ordered civilians out over the past several days as their tanks close in. Tens of thousands of people fleeing the densely packed Nusseirat, Bureij and Maghazi districts were heading south or west on Thursday into the already overwhelmed city of Deir al-Balah along the Mediterranean coast, crowding into hastily built camps of makeshift tents. \"Over 150,000 people - young children, women carrying babies, people with disabilities & the elderly - have nowhere to go,\" the main U.N. organisation operating in Gaza, UNRWA, said in a social media post. The eastern part of Bureij was a theatre of heavy fighting on Thursday morning, with Israeli tanks thrusting in from the north and east, residents and militants said. \"That moment has come, I wished it would never happen, but it seems displacement is a must,\" said Omar, 60, who said he had been forced to move with at least 35 family members. He declined to give his surname for fear of reprisals. Yamen Hamad, living in a school in Deir al-Balah since fleeing from the north, said the people who were newly displaced from Bureij and Nusseirat were setting up tents wherever there was open ground. FIGHTING NEAR HOSPITAL IN KHAN YOUNIS Khan Younis, where Israeli forces advanced this month after a truce collapsed on Dec. 1, also came under heavy bombardment on Thursday morning from warplanes and tanks near al-Amal hospital, west of Israeli positions. The Palestinian Red Crescent, which runs the hospital and has its headquarters nearby, said 10 Palestinians were killed and 12 wounded in one bombardment there, the third strike targeting the area around the hospital in less than an hour. Residents said they believed Israeli forces were trying to provoke a new exodus ahead of a further ground assault. Nearby at Nasser Hospital, the main medical centre in Khan Younis and largest still functioning in Gaza, women and children shrieked as the dead and wounded were brought in. A toddler lay motionless on a cot while medics tried to revive him; one doctor nodded \"no,\" signalling the boy was dead. Israel reported three more of its soldiers killed, bringing its toll in the ground campaign to 169. The past week has seen some of its heaviest losses of the war so far.  Virtually all of Gaza's 2.3 million residents have been driven from their homes at least once and many several times. Only a handful of hospitals still function. In a statement on Thursday, the Israeli military said it \"regrets the harm caused to uninvolved civilians\" from a Dec. 24 air strike on the Maghazi refugee camp that killed 70 people, according to the Palestinian health ministry.     \n   The statement said warplanes struck two targets adjacent to where Hamas militants were operating, and a preliminary inquiry showed further buildings nearby were also hit, \"which likely caused unintended harm to additional uninvolved civilians\". It added: \"The IDF ... is acting to draw conclusions and learn lessons from this event.\"  The Palestinian health ministry denounced the attack as a massacre in a crowded residential square."
}