{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0F0RP_L.jpg",
  "title": "Suspect in Long Island beach serial killings charged with fourth murder",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 16, 2024 12:49PM ET",
    "Updated Jan 16, 2024 05:56PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/suspect-in-long-island-beach-serial-killings-charged-with-fourth-murder-3275486",
  "paragraph": "© Reuters. Accused Long Island serial killer Rex A. Heuermann appears during a hearing in Suffolk County Superior Court in Riverhead, New York, U.S. August 1, 2023. James Carbone/Pool via REUTERS/File Photo\nNEW YORK (Reuters) - A Long Island architect was charged by a New York prosecutor on Tuesday with the murder of a fourth woman, six months after he was named as the prime suspect upon his arrest in the killings of three other women whose bodies were left near a beach. Rex Heuermann, 59, was formally charged with the murder of Maureen Brainard-Barnes, a 25-year-old Connecticut mother of two children who went missing in 2007, Suffolk County District Attorney Raymond Tierney said at a press conference. Heuermann was arrested in July and pleaded not guilty to the murders of Melissa Barthelemy, Megan Waterman and Amber Lynn Costello, who investigators say were sex workers whose remains were found near Gilgo Beach, a short drive from Heuermann's home.  He did not speak at a brief court hearing on Tuesday and remains jailed without bail, local media reported. If convicted of the first-degree murder charges, he faces life in prison without the possibility of parole. In all, 11 sets of human remains were found in 2010 and 2011 along an isolated stretch of the beach, about 30 miles (50 km) east of New York City, drawing national attention. \nInvestigators determined via DNA analysis that a human hair belonging to Heuermann's wife was in the buckle of a belt used to bind Brainard-Barnes, Tierney's office said. The murders coincided with trips out of town by Heuermann's wife and their daughter, Tierney's office said. Heuermann used a burner cellphone to contact sex workers who advertised their services online, prosecutors said. He bound them with belts or tape before wrapping some of the bodies in a burlap-type material, according to prosecutors."
}