{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK020JS_L.jpg",
  "title": "Epstein accuser says Prince Andrew groped her, documents show",
  "category": "Stock market news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 03, 2024 12:57PM ET",
    "Updated Jan 04, 2024 03:45AM ET"
  ],
  "comments": [
    16,
    [
      [
        "Charles Manson",
        "2024-01-04 14:25:42",
        "\"What's the Big deal? I found the Island Resort very nice. The food was great. Weather Perfect\". -- Senator Joe Biden, 2 August, 1993.",
        "https://www.investing.com/members/249519852"
      ],
      [
        "Todd Gray",
        "2024-01-04 07:20:34",
        "Hillary has all the photos on a hard drive in a Colorado basement. ",
        "https://www.investing.com/members/220832994"
      ],
      [
        "Ac Tektrader",
        "2024-01-04 06:13:29",
        "Epstein and Trump.. well you know what they say .... bird's of a feather flock together.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Maximus Maximus",
        "2024-01-04 03:47:37",
        "difference between donald and bill.. donald is a convicted sexual molester and serial criminal, now trying to become president again...",
        "https://www.investing.com/members/204570756"
      ],
      [
        "Mark Jannetty",
        "2024-01-04 13:37:52",
        "convicted? when did this happen? during your fantasies? do you know the difference between civil and criminal?",
        "https://www.investing.com/members/241633026"
      ],
      [
        "rob finch",
        "2024-01-04 02:53:49",
        "bill gates nickname has emerged. Microhard.",
        "https://www.investing.com/members/207168654"
      ],
      [
        "rob finch",
        "2024-01-04 02:48:07",
        "how embarrassing for hillary",
        "https://www.investing.com/members/207168654"
      ],
      [
        "Maximus Maximus",
        "2024-01-04 02:36:26",
        "degenerate prince andrew is guilty beyond any doubt..",
        "https://www.investing.com/members/204570756"
      ],
      [
        "Maximus Maximus",
        "2024-01-04 02:34:40",
        "trump frequently hung out with his 'good friend' epstein, whom he described as a 'terrific guy'.. only natural that they conspired to rape minors together too...",
        "https://www.investing.com/members/204570756"
      ],
      [
        "Maximus Maximus",
        "2024-01-04 02:32:51",
        "'grab em by the possy'-trump had a history of molesting women long before he used to hang out with his 'good friend' epstein, whom he described as a 'terrific guy'.. only natural that they conspired to molest minors together..",
        "https://www.investing.com/members/204570756"
      ],
      [
        "Maximus Maximus",
        "2024-01-04 02:31:56",
        "'grab em by the pssy'-trump had a history of molesting women long before he used to hang out with his 'good friend' epstein, whom he described as a 'terrific guy'.. only natural that they conspired to rape minors together..",
        "https://www.investing.com/members/204570756"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/stock-market-news/names-of-jeffrey-epsteins-associates-set-to-be-released-3266589",
  "paragraph": "By Jonathan Stempel and Luc Cohen NEW YORK (Reuters) -A woman who has said she was victimized by late sex offender Jeffrey Epstein said Britain's Prince Andrew put his hand on her breast at Epstein's Manhattan townhouse in 2001, according to court documents from a civil lawsuit unsealed on Wednesday. The incident, which has been previously reported by other media outlets and Andrew has denied, was among the details described in an initial trove of previously redacted documents that otherwise revealed few new details about the extent of Epstein's alleged sex trafficking activities. More documents are expected to be unsealed or unredacted in the coming days. Prince Andrew could not immediately be reached for comment. Epstein socialized with Wall Street titans, royalty and celebrities before pleading guilty to soliciting prostitution from a minor in 2008. He took his own life in 2019 at age 66 while awaiting trial on federal sex-trafficking charges. Dozens of women have accused Epstein of forcing them to provide sexual services to him and his guests at his private Caribbean island and homes he owned in New York, Florida and New Mexico.  The names of more than 150 people mentioned in a lawsuit by Virginia Giuffre, one of Epstein's most prominent accusers, were kept under seal for years until a federal judge ruled last month that there was no legal justification to keep them private. In a deposition, Giuffre said she had sex with several politicians and financial leaders.  Giuffre's deposition named several prominent figures who have previously denied her allegations, including hedge-fund owner Glenn Dubin, billionaire U.S. businessman Tom Pritzker and the late New Mexico Governor Bill Richardson.  She said she also had sex with other political leaders whose names she could not remember. Dubin could not immediately reached for comment. A spokesperson for Pritzker said the businessman \"continues to vehemently deny\" the allegation.  Sigrid McCawley, Giuffre's lawyer, said some questions about who enabled Epstein have still not been answered. \"The unsealing of these documents gets us closer to that goal,\" she said in a statement on Wednesday.  In a separate deposition, Epstein accuser Johanna Sjoberg said Prince Andrew put his hand on her breast to pose for a photo with Epstein, Giuffre and Ghislaine Maxwell, Epstein's former girlfriend. Sjoberg said the photo also included a puppet that said \"Prince Andrew\" on it.  This allegation was previously reported by the Mirror in 2020. Andrew has been stripped of most of his royal titles due to his association with Epstein. He settled a civil lawsuit with Giuffre in 2022 for an undisclosed sum, and has denied wrongdoing.  The list stems from a long-settled defamation lawsuit that Giuffre filed against Maxwell. Maxwell, the daughter of British media mogul Robert Maxwell, is serving a 20-year prison sentence for recruiting underage girls for Epstein. She is appealing her conviction.  \nGiuffre accused Maxwell of recruiting her when she was underage for Epstein to abuse. U.S. District Judge Loretta Preska, who is overseeing the case, ruled that some names would remain confidential, including those of people who were underage when Epstein abused them."
}