{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBS0F0_L.jpg",
  "title": "Missile strikes in Ukraine show Putin 'must be stopped,' Biden says",
  "category": "Economy",
  "publisher": "Reuters",
  "date": [
    "Published Dec 29, 2023 01:34PM ET",
    "Updated Dec 29, 2023 01:51PM ET"
  ],
  "comments": [
    4,
    [
      [
        "Richard Warden",
        "2023-12-29 20:14:32",
        "Biden will probably try to engage Russia, start WWIII, engage war time martial law or something, in order to somehow try to avoid his family's crimes being properly adjudicated and losing the 2024 election ",
        "https://www.investing.com/members/252649548"
      ],
      [
        "Ac Tektrader",
        "2023-12-30 02:04:26",
        "Richard that's quite a stretch of the imagination you've got going...you apparently didn't hear the rest of his inflammatory speech and his support of an attack on the Capitol...",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ac Tektrader",
        "2023-12-30 02:05:34",
        "Richard that's quite a stretch of your imagination....",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ac Tektrader",
        "2023-12-30 02:09:07",
        "time to politically cancel Trump.... before he does anymore damage to America's democracy..",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ac Tektrader",
        "2023-12-30 02:13:57",
        "Richard that idea is right out of Trump's political playbook. he ran that by his advisors before he left office...",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ac Tektrader",
        "2023-12-30 02:20:44",
        "Trump will probably try to engage Iran start world warlll, engage war time martial law or something,in order somehow try to avoid his family's crimes being properly adjudicated and losing the 2024 election.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ken Roth",
        "2023-12-29 18:50:29",
        "Russian trolls are the only comments in here they ofcourse hate USA and wants us to screw our allies",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Merica Moment",
        "2023-12-29 18:53:04",
        "Imagine supporting corrupt not zees. Ukraine is garbage just like America. The world is waking up. ",
        "https://www.investing.com/members/255178822"
      ],
      [
        "First Last",
        "2023-12-29 22:08:29",
        "Merica Moment",
        "https://www.investing.com/members/200601457"
      ],
      [
        "Ac Tektrader",
        "2023-12-30 01:19:21",
        "another troll supping Russian Fascism War crimes and the the brutality of its invasion..",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ac Tektrader",
        "2023-12-30 01:22:16",
        "merica it's time the Ukrainians take the war to down town Moscow .it's time . Russia needs to be taught a lesson.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Llewellyn Kruger",
        "2023-12-29 18:44:49",
        "The only reason Ukraine still fights is because of US support.",
        "https://www.investing.com/members/206996260"
      ],
      [
        "Ma Lu",
        "2023-12-29 18:55:06",
        "And EU support. And GB support. And because they need to defend themselves. ",
        "https://www.investing.com/members/202599970"
      ],
      [
        "First Last",
        "2023-12-29 22:06:37",
        "Ukraine is defending because Russia is attacking.  And Russia is attacking partly because it has the support of its puppet, the retrumplicans.",
        "https://www.investing.com/members/200601457"
      ],
      [
        "Merica Moment",
        "2023-12-29 18:42:11",
        "The USA has $35 Trillion in debt and its people have record credit card, auto loan, student loan, and mortgage debt. The dollar is in danger and the weak USA is a thing of the past. Putin knows it too. ",
        "https://www.investing.com/members/255178822"
      ],
      [
        "Brad Albright",
        "2023-12-29 20:26:11",
        "Isn't it time to go stand in line for some eggs?",
        "https://www.investing.com/members/236251128"
      ],
      [
        "oeg vokar",
        "2023-12-29 18:51:34",
        "And these 35 billion bring profitability....it's called an investment, not a debt. No one gives their money to poor crooks. And how much debt/investment is there in Russia? Why doesn't anyone give their money to Putin?",
        "https://www.investing.com/members/209949173"
      ],
      [
        "oeg vokar",
        "2023-12-29 18:47:48",
        "And these 35 billion bring profitability....it's called an investment, not a debt. No one gives their money to poor crooks. And how much debt/investment is there in Russia? Why doesn't anyone give their money to Putin?",
        "https://www.investing.com/members/209949173"
      ],
      [
        "oeg vokar",
        "2023-12-29 18:46:53",
        "And these 35 billion bring profitability....it's called an investment, not a debt. No one gives their money to poor crooks. And how much debt/investment is there in Russia? Why doesn't anyone give their money to Putin?",
        "https://www.investing.com/members/209949173"
      ],
      [
        "oeg vokar",
        "2023-12-29 18:46:08",
        "And these 35 billion bring profitability....it's called an investment, not a debt. No one gives their money to poor crooks. And how much debt/investment is there in Russia? Why doesn't anyone give their money to Putin?",
        "https://www.investing.com/members/209949173"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/economy/missile-strikes-in-ukraine-show-putin-must-be-stopped-biden-says-3264789",
  "paragraph": "2/2\n© Reuters. A man walks next to a car destroyed during a Russian missile and drone strike, amid Russia's attack on Ukraine, in Kyiv, Ukraine December 29, 2023. REUTERS/Vladyslav Musiienko\n2/2\nBy Andrea Shalal CHRISTIANSTED, St. Croix (Reuters) - U.S. President Joe Biden on Friday called Russia's latest missile barrage on Ukraine a \"stark reminder\" that Russian President Vladimir Putin remained committed to destroying Ukraine and said \"he must be stopped.\" Biden, in a statement issued during his vacation in St. Croix, said the overnight attack, which killed 31 civilians and wounded over 120 across Ukraine, was the largest aerial assault since Moscow launched its invasion in February 2022. \"It is a stark reminder to the world that, after nearly two years of this devastating war, Putin’s objective remains unchanged. He seeks to obliterate Ukraine and subjugate its people. He must be stopped,\" Biden said. Biden said Ukraine used air defense systems that the United States and its allies and partners had provided to successfully intercept and destroy many of the missiles and drones launched by Russia, and he urged Congress to approve continued aid. \"Unless Congress takes urgent action in the new year, we will not be able to continue sending the weapons and vital air defense systems Ukraine needs to protect its people. Congress must step up and act without any further delay,\" Biden said. The United States on Thursday said it would provide up to $250 million in arms and equipment to Ukraine in a final aid package this year, as top officials continued to urge lawmakers to approve another $61 billion in aid to the war-torn country. Republicans are refusing to approve the assistance requested by Biden unless Democrats agree to tighten security along the U.S.-Mexico border. The White House has warned that without the additional appropriation U.S. aid will run out by the end of the year for Ukraine's fight to retake territory occupied by Russian forces. Congress has approved more than $110 billion for Ukraine since Russia's invasion, but it has not approved any funds since Republicans took control of the House of Representatives from Democrats in January 2023. Biden said the stakes of the fight extended far beyond Ukraine to the entire NATO alliance and the security of Europe, and warned of risks to the United States. \"When dictators and autocrats are allowed to run roughshod in Europe, the risk rises that the United States gets pulled in directly,\" he said. \"We cannot let our allies and partners down. We cannot let Ukraine down. History will judge harshly those who fail to answer freedom’s call.\" \nSeparately, Biden's national security adviser, Jake Sullivan, who is also in St. Croix, said he discussed reports of a missile temporarily entering Polish airspace with Polish Secretary of State Jacek Siewiera in a call on Friday, the White House said. Sullivan expressed the United States’ solidarity with Poland, and pledged technical assistance as needed. He said Biden is following the issue closely."
}