{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK1305J_L.jpg",
  "title": "Biden condemns anti-Arab hate after WSJ opinion piece calls Dearborn 'jihad capital'",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 04, 2024 10:44AM ET",
    "Updated Feb 04, 2024 03:50PM ET"
  ],
  "comments": [
    2,
    [
      [
        "Barry Nickerson",
        "2024-02-05 10:37:56",
        "Mayor Hammoud said this and that, but he did not deny supporting the Palestinian Islamists.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Tre Hsi",
        "2024-02-06 16:34:26",
        "using the same logic, you said this and that, but you also did not deny supporting the palestinian islamists",
        "https://www.investing.com/members/203741693"
      ],
      [
        "Tre Hsi",
        "2024-02-06 16:32:38",
        "when did Mayor Hammoud support Hamas?  using the same logic, you said this and that, but you also did not deny supporting the palestinian islamists",
        "https://www.investing.com/members/203741693"
      ],
      [
        "Jake Vee",
        "2024-02-04 16:55:20",
        "Give me a break. The call to prayer rings 5 tines a day out there. Its not even america anymore. ",
        "https://www.investing.com/members/249287397"
      ],
      [
        "Tre Hsi",
        "2024-02-06 16:33:33",
        "\"Its not even america anymore.\" -- all the native americans agree with you when they drove by all those churches",
        "https://www.investing.com/members/203741693"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/police-in-michigan-city-put-on-alert-after-wsj-opinion-piece-3292056",
  "paragraph": "© Reuters. FILE PHOTO: A 2020 Ford Explorer hybrid police vehicle is unveiled in Dearborn, Michigan, U.S., May 15, 2019. Picture taken May 15, 2019. REUTERS/Joe White\nBy Kanishka Singh (Reuters) -President Joe Biden on Sunday denounced anti-Arab rhetoric in response to a Wall Street Journal opinion piece targeting Dearborn, Michigan, that the mayor called \"bigoted\" and \"Islamophobic.\" The WSJ published the piece on Friday headlined as \"Welcome to Dearborn, America's Jihad Capital\", suggesting the city's residents, including religious leaders and politicians, supported Palestinian Islamist group Hamas and extremism. The column drew outrage from Dearborn Mayor Abdullah Hammoud, as well as several U.S. lawmakers and rights advocates from the Council on American-Islamic Relations and the Arab American Anti-Discrimination Committee. The mayor said on Saturday he had ramped up the city's police presence at houses of worship and other public places after \"an alarming increase in bigoted and Islamophobic rhetoric online targeting the city of Dearborn.\" As of Sunday afternoon, there were no reports of any unrest in Dearborn, a suburb of about 110,000 people that borders Detroit. Biden, while not referring directly to the WSJ or the article's author, said on social media platform X it was wrong to blame \"a group of people based on the words of a small few.\" \"That's exactly what can lead to Islamophobia and anti-Arab hate, and it shouldn't happen to the residents of Dearborn – or any American town,\" Biden said on the platform formerly called Twitter. The city has one of the highest percentages of Arab Americans among U.S. cities, with census figures showing it is about 54% Arab American. \"Reckless. Bigoted. Islamophobic,\" Hammoud said on Saturday about the WSJ piece written by Steven Stalinsky, executive director of the Middle East Media Research Institute. Biden, who is running for re-election, has himself faced criticism and protests from Dearborn and from anti-war voices around the country for his administration's support for Israel in its operations in Gaza. The WSJ did not respond to a request for comment. Stalinsky said he stood by his piece and added that videos compiled by his institute showed that \"shocking anti-U.S. and pro-jihad sermons and marches\" had taken place in the city. Reuters was not able to independently verify the location or the date of when the videos were filmed. Rights advocates have noted a rise in Islamophobia, anti-Palestinian bias and antisemitism in the U.S. since the eruption of war in the Middle East in October. Among anti-Palestinian incidents that raised alarm were a November shooting in Vermont of three students of Palestinian descent and the fatal stabbing of a 6-year-old Palestinian American in Illinois in October. \nSome Democratic members of the U.S. Congress like Representatives Pramila Jayapal and Ro Khanna, and Senators Gary Peters and Debbie Stabenow, also condemned the WSJ opinion piece, with Jayapal demanding an apology from the newspaper. The latest eruption of war in the Middle East began on Oct. 7 when Hamas attacked Israel, killing 1,200. Israel has since assaulted Hamas-governed Gaza, killing over 27,000, according to the local health ministry. Nearly all of Gaza's 2.3 million population is displaced. The densely populated enclave also faces starvation."
}