{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK070J0_L.jpg",
  "title": "Iowa students walk out in protest over school gun violence",
  "category": "General",
  "publisher": "Reuters",
  "date": [
    "Published Jan 08, 2024 09:49AM ET",
    "Updated Jan 08, 2024 06:26PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/general/iowa-students-to-walk-out-in-protest-over-school-gun-violence-3269638",
  "paragraph": "© Reuters. A medical examiner enters the school as police respond to a school shooting at the Perry Middle School and High School complex in Perry, Iowa, U.S., January 4, 2024. REUTERS/Cheney Orr/ File Photo\nBy Brendan O'Brien (Reuters) - Students in Iowa walked out of school on Monday to demonstrate at the state capitol, calling for lawmakers to take action to address gun violence after an 11-year-old was killed and five others wounded in a school shooting last week. Several dozen students waved signs and chanted \"No more silence, end gun violence\" inside the rotunda of the state's capitol building in Des Moines as lawmakers begin their first legislation session of 2024, video footage posted on social media showed. \"Now is the time to take real action,\" State Representative Adam Zabner, a Democrat, told the students. \"We have the power to take real action and save lives.\" Specifically, organizers are hoping to persuade lawmakers to halt proposed Republican-backed legislation that would allow guns to be stored in cars on school property. The demonstration comes four days after a 17-year-old high school student shot and killed an 11-year-old sixth-grader and wounded five others at a school in Perry, a rural community near Des Moines.  The shooting, on the first day of classes following the district's winter break, is part of a national epidemic of gun violence in U.S. schools that has worsened in recent years.  It was one of four such incidents that unfolded in the first week of the year after 2023 saw a record number of similar events in U.S. schools, according to the K-12 School Shooting Database.  \nData shows that 346 incidents occurred in 2023 in which a gun was brandished or fired at school or a bullet hit school property. It was the most in any year since the organization began compiling the data in 1966, and it marks the third record-setting year in a row. Next week, Iowa will take center stage in U.S. politics as the state hosts the first Republican nominating contests for the U.S. presidential election. Most of the Republican candidates ardently oppose any efforts to regulate guns and routinely dismiss calls for more gun control after mass shootings as attempts to politicize tragedies."
}