{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBQ0AZ_L.jpg",
  "title": "Trump wins Michigan state court battle to qualify for primary election ballot",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 27, 2023 08:54AM ET",
    "Updated Dec 27, 2023 12:28PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Ken Roth",
        "2023-12-27 15:59:49",
        "Just let the people decide if they want to vote for a traitor of american values and a future convict who belongs in cell block D sharing soap with his proud boys",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/michigan-supreme-court-rejects-attempt-to-remove-trump-from-2024-ballot-cnn-3264030",
  "paragraph": "© Reuters. FILE PHOTO: Former U.S. President Donald Trump attends the Trump Organization civil fraud trial, in New York State Supreme Court in the Manhattan borough of New York City, U.S., November 6, 2023. REUTERS/Brendan McDermid/Pool/File Photo\nBy Andrew Goudsward WASHINGTON (Reuters) -Donald Trump scored a victory on Wednesday in his fight against challenges to his eligibility to run for the White House again when Michigan's top court declined to hear a case seeking to disqualify him from the state's presidential primary ballot. The Michigan Supreme Court said it would not hear an appeal from four voters in the state seeking to bar the former president from the Feb. 27 Republican primary for his role in the Jan. 6, 2021, attack on the U.S. Capitol. The voters argued that Trump, the frontrunner for the 2024 Republican nomination, could not serve as president under a provision in the U.S. Constitution that bars people from holding office if they engaged in \"insurrection or rebellion\" after swearing an oath to the United States. \"We are not persuaded that the questions presented should be reviewed by this Court,\" the justices said in a brief order.  Trump in a post on his Truth Social site said that the court \"strongly and rightfully denied\" what he called a \"desperate Democrat attempt\" to take him off the ballot in Michigan. The Michigan ruling contrasts with a decision by Colorado's top court last week to disqualify Trump under the same constitutional provision, known as Section 3 of the 14th Amendment. Trump has vowed to appeal the Colorado ruling to the U.S. Supreme Court. Trump has been indicted in both a federal case and in Georgia for his role in trying to overturn the 2020 election but he has not been charged with insurrection related to the Jan. 6 attack.  A ruling by the U.S. Supreme Court could resolve the issue of Trump's eligibility nationwide to run in the 2024 presidential race. A lawyer for the voters cast the ruling as procedural, noting that the court allowed them to revive their case for the November 2024 general election. “The Court’s decision is disappointing but we will continue, at a later stage, to seek to uphold this critical constitutional provision designed to protect our republic,” the attorney, Mark Brewer, said in a statement. \nUnlike in Colorado, the Michigan Supreme Court did not decide the merits of whether Trump engaged in insurrection. The justices upheld lower court rulings concluding that courts should not decide the issue for the primary election. Unlike 14th Amendment challenges brought in some other states, Michigan is considered one of the key swing states likely to decide the outcome of the general election."
}