{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0C00E_L.jpg",
  "title": "Blinken discusses human rights, Taiwan Strait with Chinese official",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 12, 2024 10:08PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/blinken-discusses-human-rights-taiwan-strait-with-chinese-official-3273894",
  "paragraph": "2/2\n© Reuters. U.S. Secretary of State Antony Blinken meets with Chinese Communist Party International Liaison Department Minister Liu Jianchao (not pictured) at the State Department in Washington, U.S., January 12, 2024. REUTERS/Anna Rose Layden\n2/2\nBy Kanishka Singh WASHINGTON (Reuters) -U.S. Secretary of State Antony Blinken on Friday raised concerns over China's human rights issues in a meeting with senior Chinese official Liu Jianchao in Washington, the State Department said, adding they also discussed \"maintaining peace and stability\" in the Taiwan Strait. WHY IT IS IMPORTANT Senior U.S. and Chinese officials have held regular discussions recently to keep communication lines open between the world's two largest economies.  Friday's meeting came a day ahead of elections in Taiwan that will test efforts to ease U.S.-China tensions and was the latest in a flurry of U.S.-China interactions following a November summit between U.S. President Joe Biden and Chinese President Xi Jinping in San Francisco.  Ties between the two sides have otherwise been tense in recent years over a range of issues such as the origins of COVID-19, trade tariffs, Taiwan and human rights. KEY QUOTES Blinken \"emphasized the importance of resolving the cases of American citizens who are wrongfully detained or subject to exit bans in China and raised U.S. concerns about (China's) human rights abuses,\" the State Department said in a statement. \"The Secretary reiterated the importance of maintaining peace and stability across the Taiwan Strait and in the South China Sea,\" it said. The State Department said the two also discussed North Korea, Russia's invasion of Ukraine and the situation in the Red Sea and the Middle East, where observers fear a widening of Israel's war in Gaza after the U.S. and UK's strikes in Yemen. CONTEXT The Jan. 13 presidential and parliamentary contests in Taiwan, which China claims as its own territory, represent the first real wild card in 2024 for the Biden administration's goal of stabilizing ties with China. The U.S. is Taiwan's most important international backer and arms supplier even though Washington does not formally recognize its government, maintaining official relations only with Beijing.  \nTaiwan's government has accused China of election interference to sway the vote toward candidates Beijing may prefer. China has labeled those allegations \"dirty tricks.\" Other communication between China and the U.S. from this week included a Wednesday meeting between Liu and White House deputy national security adviser Jon Finer, a phone call on Thursday between U.S. Commerce Secretary Gina Raimondo and China's Commerce Minister Wang Wentao, and the resumption of long-frozen military talks."
}