{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0P0MS_L.jpg",
  "title": "Key takeaways from the World Court decision in Israeli genocide case",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 26, 2024 12:17PM ET",
    "Updated Jan 26, 2024 04:14PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/factboxkey-takeaways-from-the-world-court-decision-in-israeli-genocide-case-3284467",
  "paragraph": "5/5\n© Reuters. A person shouts slogans during a pro-Palestinian demonstration outside the International Court of Justice (ICJ) as judges rule on emergency measures against Israel following accusations by South Africa that the Israeli military operation in Gaza is a stat\n2/5\nTHE HAGUE (Reuters) - The International Court of Justice (ICJ) ordered Israel on Friday to take action to prevent acts of genocide as it wages war against Hamas militants in the Gaza Strip but stopped short of calling for an immediate ceasefire. The top United Nations court for handling disputes between states was ruling in a case brought by South Africa. Here are key takeaways from the decision. WHAT DID THE COURT RULE? The court ordered Israel to refrain from any acts that could fall under the Genocide Convention and to ensure its troops commit no genocidal acts in Gaza. \"At least some of the acts and omissions alleged by South Africa to have been committed by Israel in Gaza appear to be capable of falling within the provisions of the (Genocide) Convention,\" the judges said. The ruling required Israel to prevent and punish any public incitements to commit genocide against Palestinians in Gaza and to preserve evidence related to any allegations of genocide there. Israel must also take measures to improve the humanitarian situation for Palestinian civilians in the enclave, it said. However, the court did not demand an immediate ceasefire in Gaza, something that Israel says would allow Hamas militants to regroup and to launch new attacks on the country. The court also said it was \"gravely concerned\" about the fate of hostages held in Gaza and called on Hamas and other armed groups to immediately release them without conditions. DID ALL JUDGES SUPPORT THE RULING? A majority of at least 15 out of 17 judges voted in favour of imposing the so-called provisional measures, including the court's president, Joan Donoghue of the United States. Judge Julia Sebutinde of Uganda was the only one to vote against all six measures adopted by the court. Israel's ad hoc judge, Aharon Barak, voted against four measures. \"I have voted in favour in the hope that the measure will help decrease tensions and discourage damaging rhetoric,\" Barak wrote, detailing his vote in favour of an order that Israel punish incitement to genocide. WHAT HAPPENS NOW? Israel is required to submit a report to the court on the steps it has taken to comply with the orders within one month of the ruling. The court will examine in detail the merits of the case, a process which could take years. While the ICJ's decisions are final and without appeal, the court has no way to enforce them. WHAT IS THE GENOCIDE CONVENTION? The 1948 Genocide Convention, enacted in the wake of the mass murder of Jews in the Nazi Holocaust, defines genocide as \"acts committed with intent to destroy, in whole or in part, a national, ethnical, racial or religious group\". Acts of genocide include killing members of the group, causing serious bodily or mental harm to members of the group and deliberately inflicting conditions of life calculated to bring about the destruction of the group in whole or in part. WHAT HAS BEEN THE REACTION TO THE ICJ RULING? Israeli Prime Minister Benjamin Netanyahu said the charge of genocide leveled against Israel was \"outrageous\" and said it would do whatever is necessary to defend itself. Israel had an \"unwavering commitment\" to international law, he said. Defence Minister Yoav Gallant expressed dismay that the ICJ did not reject South Africa's petition outright, while National Security Minister Itamar Ben-Gvir appeared to mock the ruling with a Yiddish-style putdown on social media platform X: \"Hague Shmague\". Palestinians broadly welcomed Friday's ruling. \"The ICJ judges assessed the facts and the law, they ruled in favour of humanity and international law,\" Palestinian Foreign Minister Riyad al-Maliki said. \nSenior Hamas official Sami Abu Zuhri said the ruling helped to isolate Israel on the world stage. South Africa, a longtime supporter of the Palestinian cause, hailed the ICJ ruling and President Cyril Ramaphosa said he expected Israel to abide by its ruling that it take measures to prevent genocide against the people of Gaza. (This story has been refiled to fix a typo in the headline)"
}