{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0I056_L.jpg",
  "title": "U.S. wants Japanese shipyards to help keep warships ready to fight in Asia",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 19, 2024 01:12AM ET",
    "Updated Jan 19, 2024 05:16AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-eyeing-japanese-shipyards-for-warship-overhauls-says-us-ambassador-3277904",
  "paragraph": "© Reuters. The U.S. (L) and Japanese national flags are hoisted next to a traditional Okinawan Shisa statue at the U.S. Marine's Camp Foster in Ginowan, on the southern island of Okinawa, Japan June 18, 2016. REUTERS/Tim Kelly/file photo\nBy John Geddie and Tim Kelly YOKOSUKA, Japan (Reuters) - The United States and Japan are looking to make a deal for Japanese shipyards to regularly overhaul and maintain U.S. Navy warships so they can stay in Asian waters ready for any potential conflict, U.S. Ambassador to Japan Rahm Emanuel said on Friday. \"China watches what ships are coming in and out. It is not like this is a secret, they know what's happening. So therefore, they take an evaluation of your deterrence,\" Emanuel told reporters at the Yokosuka naval base near Tokyo. Unchallenged in Asian waters for decades, the U.S. Navy faces a growing Chinese navy being built in shipyards that are outpacing U.S. warship production.  China has more than 370 ships and submarines, up from the 340 ships they had in 2023, according to an annual report released by the Pentagon in October, making it numerically the largest navy in the world.  Using Japanese dry docks would ease pressure on U.S. yards that are wrestling with maintenance backlogs of up to 4,000 days and allow them to focus on shipbuilding that will allow the U.S. to expand its fleet, Emanuel said. Washington and Tokyo, he added, had established a council to work out a joint plan for the maintenance work.  \nU.S. ally Japan hosts the biggest overseas concentration of U.S. military power, including the only forward-deployed carrier strike group, which operates from Yokosuka. That group of warships is part of the Seventh Fleet, which commands up to 70 ships and submarines from its headquarters at the Japanese naval base. Mitsubishi Heavy Industries, which makes warships and submarines for Japan's Self Defense Forces, operates commercial dockyards in nearby Yokohama, which have done some maintenance work on U.S. Navy ships in the past."
}