{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBP0DP_L.jpg",
  "title": "Migrant caravan advances north as U.S. officials head to Mexico",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 26, 2023 05:30PM ET",
    "Updated Dec 26, 2023 06:57PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/migrant-caravan-advances-north-as-us-officials-head-to-mexico-3263725",
  "paragraph": "5/5\n© Reuters. Migrants walk in a caravan, some of them holding a banner reading 'Exodus from Poverty', as an attempt to reach the U.S. border, in Huixtla, Mexico December 26, 2023. REUTERS/Jose Torres\n2/5\nBy Jose Torres VILLA COMALTITLAN (Reuters) - Thousands of migrants and asylum seekers moved slowly north across the southern Mexican state of Chiapas on Tuesday in a caravan hoping to reach the U.S. border, one day before top U.S. officials planned to visit Mexico to discuss migration. On Wednesday, Secretary of State Antony Blinken and Homeland Security chief Alejandro Mayorkas will visit Mexico to meet with Mexican President Andres Manuel Lopez Obrador. The officials will discuss \"unprecedented irregular migration in the Western Hemisphere and identify ways Mexico and the United States will address border security challenges,\" according to a statement from State Department spokesman Matthew Miller. The meeting comes a week after U.S. President Joe Biden spoke with Lopez Obrador by telephone, during which the two leaders said that more enforcement was needed at their shared frontier.  On Wednesday, migrants and asylum seekers, many carrying small children, walked along the highway near the southern Mexican city of Villa Comaltitlán. Some held a banner reading \"Exodus from poverty.\" Rosa, from El Salvador, said she hoped the officials would ease the suffering of migrants. \"We are looking for something better for our children and our families,\" she said as she walked. \"I hope this touches their hearts,\" she added. Migrants and asylum seekers transit through Mexico to the U.S. to escape violence, economic distress and negative impacts of climate change, according the United Nations.  The number crossing the perilous Darien Gap straddling Colombia and Central America has topped half a million this year, double last year's record.  Migrant rights activist Luis García Villagrán criticized the meeting, saying the officials' main concerns are domestic electoral issues, and that more enforcement efforts aimed at stopping migrants from reaching the U.S. border would only hurt the poorest of the poor. \n\"They want women and children to be bargaining chips,\" he said, speaking alongside the caravan on Tuesday.  \"We are not bargaining chips for any politicians.\""
}