{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0L0O0_L.jpg",
  "title": "Ecuador police capture leader of Colombian dissident rebel group",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 22, 2024 01:52PM ET",
    "Updated Jan 22, 2024 06:51PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/ecuador-police-capture-leader-of-colombian-dissident-rebel-group-3279954",
  "paragraph": "© Reuters. Ecuador's President Daniel Noboa gestures at a ceremony to deliver equipment to the National Police, amid the ongoing wave of violence around the nation, in Quito, Ecuador, January 22, 2024. REUTERS/Karen Toro\nQUITO (Reuters) - Ecuador's police on Monday said they have captured the leader of Colombian armed group Oliver Sinisterra and that Ecuadorean authorities will return him to Colombia.  News of the capture comes amid a military offensive launched by Ecuador's government to combat criminal gangs. President Daniel Noboa declared a state of emergency with nighttime curfew for 60 days at the beginning of January amid spiraling violence in the Andean country and designated 22 criminal bands as terrorist groups.  Carlos L, known as El Gringo, was captured on Sunday night in Imbabura, in the north of Ecuador, following three months of preparations by security forces.  \"An immigration hearing will be held so that he can be expelled from Ecuador and sent to Colombia,\" Ecuador police commander Cesar Zapata told reporters. \"He has a pretty hefty criminal record.\" Zapata has spoken with Colombian police to coordinate the handover, he said. Carlos L was involved in criminal activities in Ecuador, police said, especially with terrorist groups in San Lorenzo near the border with Colombia. \nOliver Sinisterra is a faction of the Segunda Marquetalia group of dissident rebels of the now-demobilized Revolutionary Forces of Colombia (FARC) which abandoned a 2016 peace deal with the state.  The Oliver Sinisterra front operates in Colombia's Narino province and Ecuador's Esmeraldas province."
}