{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0M002_L.jpg",
  "title": "Why is Canada capping foreign students and who will be impacted?",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 31, 2024 11:13AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/why-is-canada-capping-foreign-students-and-who-will-be-impacted-3288638",
  "paragraph": "© Reuters. A view of East Hastings street in Downtown Eastside of Vancouver, British Columbia, Canada January 31, 2023. REUTERS/Jennifer Gauthier\n(Corrects first paragraph to show Canada issued more than 650,000 study permits last year and not one million) By Wa Lone TORONTO (Reuters) -Canada on Monday announced a two-year cap on new international student permits after explosive growth in recent years aggravated the housing shortage. Last year Canada issued more than 650,000 study permits to foreign students, according to government data, taking the number of international students entering the country to a record more than a million, roughly triple the number who entered the country a decade ago. Here is how the new plans will work and what is at stake. WHAT ARE THE DETAILS? Canada's immigration minister, Marc Miller, said the Liberal government will introduce a temporary, two-year cap on new student permits, which will result in the issue of about 364,000 permits in 2024. The proposals will also set limits on work permits handed out after graduation to foreign students who attended some institutions. The permits have been seen as an easy path to securing permanent residency. People pursuing master's or post-doctorate programs will be eligible for a three-year work permit. Spouses of international students enrolled in other levels of study, including undergraduate and college programs, will no longer be eligible, Miller said. The acceptance of new study permit applications in 2025 will be subject to reassessment at the end of the current year, he said. WHY IS GOVERNMENT CRACKING DOWN? Canada has emerged as a popular destination for international students since it is relatively easy to obtain work permits after finishing courses. But the surge in international students led to an acute shortage in apartments, pushing up rents. In December, rents nationwide rose 7.7% from a year earlier, according to Statscan. Prime Minister Justin Trudeau's popularity has been dented mainly due to affordability issues, and opposition Conservative Party leader Pierre Poilievre has taken a commanding lead over Trudeau in opinion polls ahead of an election next year. Apart from the rental crisis, the government has also been concerned about the quality of education provided by some of the institutions. WHOM WILL THIS IMPACT? International students contribute about C$22 billion ($16.4 billion) annually to the Canadian economy. The move will hurt many educational institutions that had expanded their campuses in the hope of a continued inflow of students. Ontario, the most populous province, received the biggest share of international students. Some businesses, including restaurants and retail sectors, have warned that a cap on foreign students will create a shortage of temporary workers. Restaurants across Canada are grappling with labour shortages with nearly 100,000 vacancies, and international students made up 4.6% of 1.1 million workers in the food service industry in 2023, a lobby group told Reuters last week. Canadian banks had benefited from the influx of new students, as each student is now required to have a Guaranteed Investment Certificates (GIC) of more than C$20,000, a prerequisite for international students to cover living expenses. A plurality of foreign students, about 40%, come from India, with China coming in second with about 12%, according to official data from 2022. \nThe University of Toronto said in a statement that it looks forward to working with all levels of government to ensure that the allocation of study permits recognizes institutions like U of T and addresses the problem where the challenges lie. International students made up almost 30% of the U of T's 86,297 students last year, according to the 2022-23 enrollment report."
}