{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0I0Q1_L.jpg",
  "title": "US Democrats push Biden administration over civilian toll in Israel's Gaza campaign",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 19, 2024 03:52PM ET",
    "Updated Jan 19, 2024 06:56PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-democrats-push-biden-over-civilian-toll-in-israels-gaza-campaign-3278687",
  "paragraph": "2/2\n© Reuters. U.S. Representative Ayanna Pressley (D-MA) speaks to reporters about a resolution to strip U.S. Representative Lauren Boebert (R-CO) of her committee assignments in response to Boebert’s anti-Muslim comments made towards U.S. Representative Ilhan Omar (\n2/2\nBy Patricia Zengerle WASHINGTON (Reuters) -Dozens of President Joe Biden's fellow Democrats signed a letter on Friday urging his administration to reaffirm that the U.S. strongly opposes \"the forced and permanent displacement\" of Palestinians from Gaza. The letter to Secretary of State Antony Blinken, led by U.S. Representatives Ayanna Pressley and Jamie Raskin, was signed by 60 Democratic House of Representatives members, reflecting concern, especially on the left, over the steep toll on Palestinian civilians of Israel's campaign against Hamas. \"We urge you to continue to reiterate the United States’ firm commitment to this position and ask that you provide clarification regarding certain provisions of the administration's supplemental humanitarian and security funding request,\" the letter said. A State Department spokesperson said the department does not typically comment on congressional correspondence. But on the broader issue of displacement, the spokesperson said in an email, \"We have been clear. There must be no enduring forced displacement of Palestinians, whether inside of Gaza or outside.\" The spokesperson said State had rejected statements by some Israeli officials calling for resettlement of Palestinians outside of Gaza and understands from Prime Minister Benjamin Netanyahu that is not the Israeli government's policy. The U.S. gives Israel $3.8 billion in annual military assistance. Biden has asked Congress to approve an additional $14 billion, part of a sweeping supplemental funding request stalled in Congress as Republicans and Democrats negotiate immigration policy changes. Separately, a group of Democratic senators said on Friday that 18 Democrats in that chamber support an amendment that would require that any country receiving funding in the supplemental use the money in accordance with U.S. law, international humanitarian law and the law of armed conflict. Also this week, Senator Bernie Sanders, an independent who caucuses with Democrats, forced a vote on a resolution that would have frozen security aid to Israel unless the State Department produced a report within 30 days examining whether Israel committed human rights violations in its campaign against Hamas. Seventy-two senators voted to set the resolution aside, versus 11 who backed it, easily clearing the simple majority needed to kill the resolution in the 100-member chamber. \nIsrael launched the war to eradicate Hamas, an Iran-backed group sworn to Israel's destruction, after militants stormed across the border on Oct. 7, killing 1,200 people and capturing 240 hostages, Israeli tallies showed. Gaza health authorities said the war, now in its fourth month, has killed more than 24,760 people in the Palestinian enclave."
}