{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK080VT_L.jpg",
  "title": "China satellite launch causes pre-election political storm in Taiwan",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 09, 2024 09:39PM ET",
    "Updated Jan 10, 2024 02:25AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/china-satellite-launch-causes-preelection-political-storm-in-taiwan-3270826",
  "paragraph": "By Yimou Lee and Sarah Wu TAIPEI (Reuters) -The launch of a Chinese satellite that flew over Taiwan, prompting an erroneous air raid alert, sparked a political storm on the island on Wednesday about China's motives only days out from presidential elections.  Taiwan's presidential office said it did not consider the launch of a Chinese satellite whose rocket flew over southern Taiwan an attempt at interference ahead of the poll, but the main opposition party questioned why the alert was issued. On Tuesday, the government issued a mistaken air raid alert after the Chinese rocket carrying a science satellite flew over southern Taiwan at an altitude of more than 500 km (310 miles). The defence ministry later apologised for the wrong translation in English which used the word \"missile\". Taiwan's presidential office, responding to questions on whether it considered the satellite launch election interference, said it did not think there was a political motive. While the rocket launch sparked an erroneous air raid alarm, Taiwan, which China views as its territory over the strong objections of the government in Taipei, has repeatedly accused Beijing of trying to interfere in the vote, whether via military, political, economic or other means. China has labelled those allegations \"dirty tricks\". The ruling party's presidential candidate Lai Ching-te supported the Taiwan defence ministry's publication of a chart showing the flight path of the satellite crossing over southern Taiwan. \"This information was based on the people's right to know, and to not let the public misunderstand. At the same time, if any wreckage is discovered then it could be handed over to the relevant authorities. This is something that should be done,\" he said during campaigning on Wednesday.  China's Taiwan Affairs Office said in a written response to Reuters on Wednesday that the satellite launch was a regular annual arrangement and had \"nothing to do with the Taiwan election.\" China made two satellite launches on consecutive days in early December from a launch site in Inner Mongolia. Neither of those had flown over Taiwan or triggered an alert. Jonathan McDowell, an astrophysicist at the Harvard-Smithsonian Center for Astrophysics who tracks space launches, told Reuters the first stage of the rocket landed well inside China, and the second stage flew over Taiwan at a height comparable to that of the International Space Station.  \"It was far up in space and indeed entered orbit well before crossing the coast of mainland China. So I think this is an overreaction by Taiwan. Satellites fly over Taiwan every day,\" he said. OPPOSITION ANGER Taiwan's foreign minister was speaking to foreign reporters when the shrill alert sounded on phones in the room using the words \"satellite launch by China\" in Chinese and \"missile\" in English. He had described the launch as part of a pattern of Chinese harassment, like the recent cases of Chinese balloons spotted over the island. Taiwan's largest opposition party the Kuomintang (KMT), slammed the government, saying the alert issued over the satellite launch \"should not become an election tool\". KMT Chairman Eric Chu told reporters on Wednesday that people are most concerned about whether the alert was mistakenly sent or if those sending it had a particular goal in mind. \"This is like how the Democratic Progressive Party (DPP) has recently described everything as Chinese election interference. This is another new move of so-called Chinese election interference,\" he said. Vincent Chao, spokesperson for Vice President Lai Ching-te, the ruling DPP's presidential candidate, defended the alert as crucial for keeping citizens informed and reassured. \"A democratic and free society should have an open and transparent defence ministry,\" Chao said during a press conference on Wednesday. \"Our national issues, especially national security, should not become a political tool.\" Taiwan's defence ministry said in a statement that its issuing of a warning was based on national security considerations and there was \"absolutely no political interference\" involved. It added, however, that while it adheres to administrative neutrality, the English alert messaging system would be comprehensively reviewed and revised by the relevant units. A Taiwan security source familiar with the matter, speaking on condition of anonymity given the sensitivity of the subject, said China regularly launches satellites close to but not over Taiwan, so alerts are not needed given falling debris is not a concern. \"The path was different from what was originally expected, and its actual route was over us. The fear was something falling off, so the alert was issued,\" the source said. Taiwan's defence ministry earlier said rocket debris had fallen only on China, and that the rocket had taken an \"abnormal\" flight path. Former Taipei Mayor Ko Wen-je of the small Taiwan People's Party (TPP), who is also standing for the presidency, wrote on his Facebook (NASDAQ:META) page that the biggest fear in cross-strait relations is a conflict could be sparked accidentally.  \n\"Today's misunderstanding confirms that the two sides lack the most basic dialogue mechanism, which may lead to inaccurate judgments at important moments and the eruption of crisis,\" Ko wrote. Both the TPP and KMT have pledged to re-start dialogue with China if they win the presidency."
}