{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0S0IV_L.jpg",
  "title": "Pentagon says it is not seeking war with Iran after Jordan attack",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 29, 2024 11:04AM ET",
    "Updated Jan 29, 2024 06:42PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Ken Roth",
        "2024-01-29 17:34:22",
        "Iran must feel the consequences of their proxy attacks",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/austin-vows-all-necessary-actions-after-us-troop-deaths-3286228",
  "paragraph": "© Reuters. U.S. Defense Secretary Lloyd Austin holds a bilateral meeting with NATO Secretary Jens Stoltenberg at the Pentagon in Washington, U.S., January 29, 2024. REUTERS/Leah Millis\nBy Idrees Ali and Phil Stewart WASHINGTON (Reuters) - U.S. Defense Secretary Lloyd Austin on Monday vowed the U.S. would take \"all necessary actions\" to defend its troops after a deadly drone attack in Jordan by Iran-backed militants, even as President Joe Biden's administration stressed it was not seeking a war with Iran. The attack on Sunday killed three U.S. soldiers and wounded more than 40 troops. It was the first deadly strike against U.S. troops since the Israel-Hamas war erupted in October and marks a major escalation in tensions that have engulfed the Middle East. \"Let me start with my outrage and sorrow (for) the deaths of three brave U.S. troops in Jordan and for the other troops who were wounded,\" Austin said at the Pentagon. \"The president and I will not tolerate attacks on U.S. forces and we will take all necessary actions to defend the U.S. and our troops,\" Austin added at the start of meeting with NATO Secretary General Jens Stoltenberg at the Pentagon. \"As the president said yesterday, we will respond and that response could be multi-leveled, come in stages and be sustained over time,” U.S. Secretary of State Antony Blinken said. But officials across the Biden administration said they did not want the situation to escalate. The Pentagon suggested Iran didn't want a war either. \"We certainly don't seek a war and frankly we don't see Iran wanting to seek a war with the United States,\" Pentagon spokesperson Sabrina Singh told reporters. She added that the Pentagon believed Iran did not want a war either. \"We are not seeking a conflict with the regime in the military way,\" White House national security spokesman John Kirby (NYSE:KEX) said, adding that Biden was working his way through response options. The United States is trying to determine exactly why the nearly 350 troops at the base in Jordan, known as Tower 22, were unable to stop the drone.  Two officials said a U.S. drone was approaching the base around the same time the attack drone was incoming. One of the officials said the attack drone was also flying low, factors that may have contributed to it being missed by base defenses.  The U.S. military released the names of the victims, the youngest of which was a 23-year-old Army Reserve specialist, Breonna Alexsondria Moffett. U.S. troops have been attacked over 160 times in Iraq, Syria and Jordan since Oct.7 and warships been attacked in the Red Sea as well. Houthi fighters in Yemen have been firing drones and missiles at them on the Red Sea.  The attacks are piling political pressure on Biden to deal a blow directly against Iran, a step he has been reluctant to take out of fear of igniting a broader war. Biden met with Austin and other members of his national security team in the White House Situation Room on Monday morning to discuss the latest developments regarding the attack, the White House said. The president's options could include targeting Iranian forces outside or inside Iran and opting for a more cautious retaliatory attack solely against the Iran-backed militants responsible, experts say. \"Iran continues to destabilize the region, this includes backing terrorists who attack our ships in the Red Sea,\" Stoltenberg said. CONFLICT SPREADING The attack, and any potential U.S. response, is likely to fan fears of wider conflict in the Middle East, where war broke out in Gaza after Palestinian Islamist group Hamas' raid on Israel on Oct. 7, which killed 1,200 people. Israel's subsequent assault on Gaza has killed over 26,000 Palestinians, according to the local health ministry. The United States has already retaliated in Iraq, Syria and Yemen in response to previous attacks by Iran-backed groups.  Singh said the weekend attacks had the \"footprints\" of the Kataeb Hezbollah, an Iran-aligned armed group, but the Pentagon had not yet made a final assessment. British Prime Minister Rishi Sunak said on Monday he was concerned about tensions in the Middle East and urged Iran to de-escalate. \nIran's minister of intelligence said that regional armed groups aligned with Tehran respond to \"American aggressors\" at their own discretion. Experts have cautioned that any strikes against Iranian forces inside Iran could force Tehran to respond forcefully, escalating the situation in a way that could drag the United States into a major Middle East war."
}