{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0G0X9_L.jpg",
  "title": "California governor quashes bill to ban tackle football for kids",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 17, 2024 06:37PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/california-governor-quashes-bill-to-ban-tackle-football-for-kids-3276761",
  "paragraph": "© Reuters. FILE PHOTO: Governor of U.S. state of California Gavin Newsom speaks at a press conference in Beijing, China October 25, 2023. REUTERS/Tingshu Wang/File Photo\nBy Daniel Trotta (Reuters) - California Governor Gavin Newsom killed a bill that would have banned tackle football for kids under 12, as his veto threat led the sponsor of the bill to withdraw it from consideration on Wednesday. California would have been the first state in the U.S. to ban tackle football for kids, according to the nonprofit newsroom CalMatters, though legislators in several other states have introduced similar, unsuccessful bills out of concern that blows to the head in contact sports can cause brain injuries. State Assembly Member Kevin McCarty, a Democrat from Sacramento, had advanced his proposed ban past a sports committee last week, setting the bill up for a vote on the Assembly floor. But Newsom, a Democrat widely considered to be preparing for a future run for the White House, announced late on Tuesday he would refuse to sign any ban. \"I am deeply concerned about the health and safety of our young athletes, but an outright ban is not the answer,\" Newsom said. In response, McCarty said in a statement on Wednesday, \"We will not take up AB 734 - which would have phased out kids 12 years old and younger from playing youth tackle football.\"  American football remains wildly popular, even as the U.S. Centers for Disease Control and Prevention and National Institutes of Health and have linked it to increased risk of chronic traumatic encephalopathy (CTE). Boston University researchers diagnosed 345 of 378 former professional players studied with CTE. \nInterest in the topic grew after a number of former players died by suicide, including Hall of Fame linebacker Junior Seau, who was found to have suffered from CTE.  McCarty said he welcomed Newsom's offer \"to work on ways to better protect our youngest athletes and keep them safe from repetitive head hits.\""
}