{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK080AM_L.jpg",
  "title": "Israeli nurse spent Gaza captivity aiding elderly hostages underground",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 09, 2024 05:09AM ET",
    "Updated Jan 09, 2024 01:32PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/israeli-nurse-spent-gaza-captivity-aiding-elderly-hostages-underground-3270002",
  "paragraph": "© Reuters. FILE PHOTO: Nili Margalit and Shani Goren, hostages who were abducted by Hamas gunmen during the October 7 attack on Israel, are handed over by Hamas militants to the International Red Cross, as part of a hostages-prisoners swap deal between Hamas and Isr\nBy Dan Williams JERUSALEM (Reuters) -A nurse who was among scores of Israelis abducted to Gaza says she spent her captivity in an underground tunnel, treating elderly fellow hostages, some hard of sight or hearing, with meagre medical supplies for which she had to haggle with Hamas. Nili Margalit was repatriated in a November truce between Israel and Hamas. Interviewed by local TV, she said Palestinian civilians had seized her from her village and \"sold\" her to the Islamist gunmen who led the Oct. 7 rampage that triggered a war. Unaware that her father, along with some 1,200 other people, had been killed, Margalit, 41, was bundled barefoot into a stifling Hamas tunnel where, she says, hostages had been rounded up, bearing a variety of injuries from their rough handling. \"We were in a state of shock,\" she told Channel 12 TV current affairs programme Uvda. But using basic Arabic learned in the emergency room of a southern Israeli hospital which has Bedouin patients, Margalit informed the Hamas captors that she was a nurse. They agreed to her offer to take charge of hostages' medical needs.  \"The elderly ones worried me,\" she said. \"I asked them to list their important medications - for heart conditions, blood pressure, kidneys.\" Margalit wrote these down in English for Hamas. Days later, a black bag of pharmacy supplies arrived - but proved inadequate, with some prescriptions mismatched. \"There were sick people. They had chronic illnesses,\" she said. \"There weren't enough pills. There wasn't enough food.\"  The privation offered stopgaps, however. Near-starvation meant untreated diabetes-sufferers were spared hyperglycemia. Given only one strip of antibiotics, Margalit decided to save it and instead dressed a wound with honey to counter inflammation.  Getting new supplies required regular negotiation with Hamas captors, including some she described as senior Palestinian officials who would inspect the hostages and converse in Hebrew. \"I bugged them, doing it with what you might call a bit of good grace,\" she said, recalling how she warned the captors that some of the hostages could succumb to their illnesses. \"That frightened them. They did not want these people to die.\" Several elderly female hostages were released along with Margalit, in a deal in which Israel freed scores of Palestinian prisoners. Elderly men remain among the 132 hostages still in Gaza - 25 of whom have died, according to Israeli officials. Hamas has said some of them were killed by shelling of Gaza and, early in the war, also threatened to execute hostages itself.  Margalit said she believed medical supplies have run out, by now. \"We know that we were in tunnels, and we know that the war is currently being fought above where we were held,\" she said. Among Margalit's fellow hostages was Yarden Bibas, who was seized separately from his wife Shiri and their two young boys, Ariel and Kfir. Such was his consternation about his family's fate that the Palestinian captors told him, falsely, that his wife and sons had been spotted back in Israel, Margalit said. Then Hamas changed tack, telling Bibas that Shiri, Ariel and Kfir had been killed in an Israeli air strike in Gaza - and recording his traumatised response in a video that was aired. When the captors got annoyed, their punishment of hostages included limiting the number of hours of illumination in their underground cells or the use of ventilation fans, Margalit said. After 40 days' captivity, she was allowed to watch some TV news, and would relay the information by shouting into the ears of elderly hostages who could not follow the reports themselves as they had been taken captive without glasses or hearing aids. Hamas blamed the lack of food and medication on Israel's Gaza offensive, Margalit said: \"We began to feel that Israel had forsaken us, again\" after failing to prevent the Oct. 7 attack. \nThe tranquilisers and sleeping pills that Hamas supplied, at her request, helped hostages' racked by long nights of worry. \"I wanted to calm down. I wanted it for myself. I thought I would go crazy at any moment,\" she said."
}