{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0J047_L.jpg",
  "title": "Exclusive-Iranian and Hezbollah commanders help direct Houthi attacks in Yemen, sources say",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 20, 2024 08:22AM ET",
    "Updated Jan 20, 2024 07:06PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/exclusiveiranian-and-hezbollah-commanders-help-direct-houthi-attacks-in-yemen-sources-say-3278826",
  "paragraph": "3/3\n© Reuters. FILE PHOTO: Supporters of the Houthi movement rally to denounce air strikes launched by the U.S. and Britain on Houthi targets, in Sanaa, Yemen January 12, 2024. REUTERS/Khaled Abdullah/File Photo\n2/3\nBy Samia Nakhoul and Parisa Hafezi DUBAI (Reuters) - Commanders from Iran's Islamic Revolutionary Guards Corps (IRGC) and Lebanon's Hezbollah group are on the ground in Yemen helping to direct and oversee Houthi attacks on Red Sea shipping, four regional and two Iranian sources told Reuters. Iran - which has armed, trained and funded the Houthis - stepped up its weapons supplies to the militia in the wake of the war in Gaza, which erupted after Iranian-backed militants Hamas attacked Israel on Oct. 7, the four regional sources said. Tehran has provided advanced drones, anti-ship cruise missiles, precision-strike ballistic missiles and medium-range missiles to the Houthis, who started targeting commercial vessels in November in solidarity with Palestinians in Gaza, the sources said. IRGC commanders and advisers are also providing know-how, data and intelligence support to determine which of the dozens of vessels travelling through the Red Sea each day are destined for Israel and constitute Houthi targets, all the sources said.  Washington said last month that Iran was deeply involved in planning operations against shipping in the Red Sea and that its intelligence was critical to enable the Houthis to target ships. In response to a request for comment for this story, the White House pointed to its previous public comments about how Iran has been supporting the Houthis.     In his weekly news conferences, Iran's Foreign Ministry spokesman Nasser Kanaani has repeatedly denied Tehran is involved in the Red Sea attacks by the Houthis. The IRGC public relations office did not respond to request for comment.  Houthi spokesperson Mohammed Abdulsalam denied any Iranian or Hezbollah involvement in helping to direct the Red Sea attacks. A Hezbollah spokesperson did not respond to a request for comment. The Houthis, who emerged in the 1980s as an armed group in opposition to Saudi Arabia's Sunni religious influence in Yemen, say they are supporting Hamas by striking commercial ships they say are either linked to Israel or are heading to Israeli ports.      Their attacks have affected global shipping between Asia and Europe through the Bab al-Mandab strait off Yemen. That has triggered U.S. and British air strikes on Houthi targets in the country, opening a new theatre of conflict linked to the war in Gaza.  The Gaza conflict has also sparked clashes between Israel and Hezbollah militants along the Lebanese border, as well as attacks by Iran-linked groups on U.S. targets in Iraq and Syria.     \"The Revolutionary Guards have been helping the Houthis with military training (on advanced weapons),\" an Iranian insider told Reuters. \"A group of Houthi fighters were in Iran last month and were trained in an IRGC base in central Iran to get familiar with the new technology and the use of missiles.\"     The person said Iranian commanders had travelled to Yemen as well and set up a command centre in the capital Sanaa for the Red Sea attacks which is being run by the senior IRGC commander responsible for Yemen. REGIONAL STRATEGY     The Red Sea attacks fit in with Iran's strategy of expanding and mobilising its regional Shi'ite network of armed militias to project its influence and show its ability to threaten maritime security in the region and beyond, two analysts said.     They said Tehran wanted to show that the Gaza war could be too costly for the West if it drags on - and could have catastrophic consequences in the region as things escalate. \"The Houthis are not acting independently,\" said Abdulaziz al-Sager, director of the Gulf Research Center think-tank, who based his conclusion on a close analysis of the capabilities of the group, which has an estimated 20,000 fighters.      \"The Houthis, with their personnel, expertise and capabilities are not that advanced. Dozens of vessels cross through Bab al-Mandab daily, the Houthis don't have the means, resources, knowledge or satellite information to find the specific target and attack,\" he said. White House national security spokeswoman Adrienne Watson also said last month that Iranian-provided tactical intelligence had been critical in enabling the Houthis to target ships. According to two former Yemeni army sources, there is a clear presence of IRGC and Hezbollah members in Yemen. They are responsible for supervising military operations, training and reassembling missiles smuggled into Yemen as separate pieces, the two people said.      Abdulghani Al-Iryani, a senior researcher at the Sana'a Center for Strategic Studies, an independent think-tank, said: \"It is clearly the case that the Iranians are helping identify the target and the destination. There is no local Houthi capacity to do that.\"      One senior regional source who follows Iran and who spoke on condition of anonymity said: \"The political decision is in Tehran, the management is Hezbollah, and the location is the Houthis in Yemen.\" WEAPONS AND ADVICE     Houthi spokesperson Abdulsalam said the group's aim was to target Israeli ships heading to Israel without causing any human or significant material losses. U.S. and British strikes on Yemen would not force them to back down, he said. \"We don't deny that we have a relationship with Iran and that we have benefited from the Iranian experience in training and military manufacturing and capabilities but the decision taken by Yemen is an independent one that has nothing to do with any other party,\" he said.     But a security official close to Iran said: \"The Houthis have drones, missiles and everything needed for their fight against Israel but they needed guidance and advice on shipping routes and ships, so it has been provided to them by Iran.\"     When asked what kind of advice Tehran offered, he said it was similar to the advisory role taken by Iran in Syria, ranging from training to overseeing operations when needed. \"A group of Iranian Guards members are in Sanaa now to help the operations,\" the security official said. Iran sent hundreds of Revolutionary Guards to Syria, alongside thousands of Hezbollah fighters, to help train and organise Shi'ite militia fighters from Afghanistan, Iraq and Pakistan to prevent the downfall of President Bashar al-Assad during the Sunni-led insurgency that erupted in 2011.  Washington and Gulf Arab states have repeatedly accused Iran of arming, training and financing the Houthis, who follow an offshoot of Shi'ite Islam and are aligned with Tehran as part of its anti-Western, anti-Israel \"Axis of Resistance\" alongside Lebanon's Hezbollah and groups in Syria and Iraq.     While Iran has denied having any direct role in the Red Sea attacks, Supreme Leader Ali Khamenei has praised the Houthis, whose Zaidi sect is an offshoot of Shi'ism, saying he hoped their strikes would last \"until victory\". TRAIN AND EQUIP A leader within the coalition of pro-Iranian groups denied there were any commanders from the IRGC or Hezbollah on the ground in Yemen right now.  He said a team of Iranian and Hezbollah military experts had gone to Yemen earlier in its civil war to train, equip and build the manufacturing military capability of the Houthis.     \"They came and helped the Houthis and left, just as they did with Hezbollah and Hamas,\" he said, adding that the military capabilities of the Houthis should not be underestimated.     The person said the Houthis knew the terrain and the sea well and already had the systems in place for attacking ships, including high-precision equipment from Iran. During the chaotic years after the 2011 Arab Spring uprising in Yemen, the Houthis tightened their grip on the country's north and seized the capital Sanaa in 2014, pushing a Saudi-led coalition to intervene militarily months later.     When Hamas attacked Israel, Iran had little choice but to demonstrate support for the Palestinian group after years of anti-Israel rhetoric but was worried that using Hezbollah would trigger massive Israeli retaliation, analysts said. \nIryani at the Sana'a Center for Strategic Studies said a major war between Israel and Hezbollah would be disastrous for Lebanon - and endanger the future of the group that has become the most important in Iran's \"Axis of Resistance\".     By contrast, the Houthis were in a unique strategic position to have a huge impact by disrupting global maritime activity with little effort, he said."
}