{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBN06M_L.jpg",
  "title": "Israel's Netanyahu vows no let-up in war against Hamas as Gaza deaths mount",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 24, 2023 06:27PM ET",
    "Updated Dec 25, 2023 04:01PM ET"
  ],
  "comments": [
    12,
    [
      [
        "Ken Roth",
        "2023-12-26 10:23:13",
        "Problem is 85% of all palestinians support Hamas and their mission to k…ill all je..ws, so palestinians will find it hard to get symphathy while Hamas still have more than 100 hostages.",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Ken Roth",
        "2023-12-26 10:18:10",
        "Problem is 85% of all palestinians support Hamas mission to exterminate isreal and all jews, so we do have symphathy for the isreali people just trying to survive lile they have since 1948",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Phil Ht",
        "2023-12-25 22:52:05",
        "You can hit 100,000 Bibi. Maybe eventually beat the 500,000 dead Ukrainian soldiers. Go man go 🤪🤪",
        "https://www.investing.com/members/208823124"
      ],
      [
        "Anubhav Sood",
        "2023-12-25 19:47:50",
        "well done israel..... get us rid of this cancer..... if you have to wipe out every gazan to get peace thats not a heavy price to pay....",
        "https://www.investing.com/members/210144905"
      ],
      [
        "Taha Mohammed",
        "2023-12-26 00:51:41",
        "What wrong did they do you ?",
        "https://www.investing.com/members/232414854"
      ],
      [
        "Deborah Holloway",
        "2023-12-25 20:21:15",
        "Killing children in the name of peace is sick and evil. I used to sympathize with the Jews because of their long history of oppression and victimization. But now, seeing them murdering civilians without mercy I wonder if the Israelis have become infected with the inhumanity and cruelty they once suffered. Shame.",
        "https://www.investing.com/members/201011469"
      ],
      [
        "Deborah Holloway",
        "2023-12-25 19:00:48",
        "The Israeli's slaughter of twenty thousand Palestinians is a disgrace. The power and resource inequality places them in the position of oppressor and their overreaction to the Gaza uprising is horrifying.",
        "https://www.investing.com/members/201011469"
      ],
      [
        "chess reed",
        "2023-12-25 19:50:36",
        "Before you realize the gazans we'll be at your door (let's see you then)",
        "https://www.investing.com/members/207347322"
      ],
      [
        "Deborah Holloway",
        "2023-12-25 21:54:16",
        "chess reed",
        "https://www.investing.com/members/201011469"
      ],
      [
        "santo rian",
        "2023-12-25 23:30:12",
        "chess reed",
        "https://www.investing.com/members/238522390"
      ],
      [
        "santo rian",
        "2023-12-25 23:32:40",
        " you have lost your humanity. please live at other planet, chess reed",
        "https://www.investing.com/members/238522390"
      ],
      [
        "Jonathan Golab",
        "2023-12-25 15:19:50",
        "Unverified source is “Gaza Officials.”",
        "https://www.investing.com/members/200768777"
      ],
      [
        "Michael Miller",
        "2023-12-25 15:12:40",
        "Its really simple, release ALL hostages, and Israel will come out of Gaza. ",
        "https://www.investing.com/members/200720317"
      ],
      [
        "santo rian",
        "2023-12-25 23:35:11",
        "its really simple, get out from palestine. go to other planet. ",
        "https://www.investing.com/members/238522390"
      ],
      [
        "Alex Zlotnikov",
        "2023-12-25 14:02:25",
        "Palestinians are willing to die for hammas and not change the regime. How many Palestinians voted for release of all Hostages to end the war?How many still support their leaders ?How did the Palestinian GDP was impact form this war?How did the tech in Palestine will recover ?Whats the best startup to invest in Palestine ? Anything good on infrastructure investment sector.",
        "https://www.investing.com/members/230319322"
      ],
      [
        "Merica Moment",
        "2023-12-25 13:42:15",
        "J ew s doing J ew things ",
        "https://www.investing.com/members/255178822"
      ],
      [
        "chess reed",
        "2023-12-25 18:23:53",
        "You mean yeah the right thing- get it",
        "https://www.investing.com/members/207347322"
      ],
      [
        "Jonathan Golab",
        "2023-12-25 15:29:16",
        "Well, jews are only 15 million in the world, and own/control 99% of the world’s wealth. Gee, maybe that is beacause they spend their time working hard, support democracy, not Sharia law, don’t espouse jihad, welcome everyone into their country including law abiding Arabs/muslims, unlike every Arab country that kicks out all jews, jews are not murderous terrororists blowing up twin towers twice, hijacking planes, blowing uo embassied, hoteks, kilking innocent civilians, murder all Israeli Olympic athletes at the Munich Games. ",
        "https://www.investing.com/members/200768777"
      ],
      [
        "Merica Moment",
        "2023-12-25 13:41:23",
        "Global central bankers and American Fed banker zi on ists continue to fund evil and destruction. Whats new",
        "https://www.investing.com/members/255178822"
      ],
      [
        "Jonathan Golab",
        "2023-12-25 15:30:52",
        "Too bad we are 15m in the world and control 99% of the worlds wealth ;) we aint going anywhere;)",
        "https://www.investing.com/members/200768777"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/israeli-airstrikes-kill-dozens-gaza-officials-say-in-christmas-bloodshed-3263130",
  "paragraph": "© Reuters. A flare falls over Gaza, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, as seen from southern Israel, December 24, 2023. REUTERS/Violeta Santos Moura\nBy Nidal al-Mughrabi, Bassam Masoud and Emily Rose CAIRO/GAZA/JERUSALEM (Reuters) -Israeli Prime Minister Benjamin Netanyahu vowed to keep up the fight against Hamas militants on Monday while Palestinians mourned more than 100 people who Gaza health officials said were killed overnight in Israeli airstrikes. Netanyahu visited Israeli troops in the northern Gaza Strip just hours after one of the besieged enclave's deadliest nights in the 11-week-old battle between Israel and Hamas. Retaliating against Hamas for its deadly Oct. 7 cross-border rampage, Israel has been under pressure from its closest ally the United States to shift operations in Gaza to a lower-intensity phase and reduce civilian deaths. But Netanyahu told lawmakers from his Likud party that the war was far from over and dismissed what he cast as media speculation his government might call a halt to the fighting. He said Israel would not succeed in freeing its remaining hostages without applying military pressure. \"We are not stopping. The war will continue until the end, until we finish it, no less,\" Netanyahu, who has defied international calls for a ceasefire, said during the Gaza visit. At a funeral in Gaza, a line of Palestinian mourners touched the white shrouds wrapped around the bodies of at least 70 people who Palestinian health officials said were killed by an airstrike that hit Maghazi in the centre of the strip. One man, Ibrahim Youssef, said his wife and four children including a 4-month-old baby, were trapped under the rubble of the house where they were staying in Maghazi. \"What did they do wrong?\" he asked. \"Were there resistance fighters here?\" The strikes that began hours before midnight persisted into Monday. Palestinian media said Israel had stepped up its air and ground shelling in central Gaza. Health ministry spokesperson Ashraf Al-Qidra said many of those killed at Maghazi were women and children. Eight others were killed as Israeli planes and tanks struck houses and roads in nearby al-Bureij and al-Nusseirat, health officials said. Medics said an Israeli airstrike in Khan Younis in southern Gaza killed 23, bringing total Palestinian fatalities overnight to more than 100. Pope Francis said in a Christmas message that children dying in wars, including in Gaza, are the \"little Jesuses of today\" and that Israeli strikes were reaping an \"appalling harvest\" of innocent civilians. The Israeli army said it was reviewing the report of a Maghazi incident and was committed to minimising harm to civilians. Israel says Hamas operates in densely populated areas and uses civilians as human shields, which Hamas denies. BETHLEHEM CELEBRATIONS CANCELLED Christian clergy cancelled celebrations in Bethlehem, the Israeli-occupied Palestinian West Bank city where Christian tradition says Jesus was born in a stable 2,000 years ago. Palestinian Christians held a candle-lit Christmas vigil in Bethlehem with hymns and prayers for peace in Gaza. There was no large tree, the usual centrepiece of Bethlehem's Christmas observances. Nativity figurines in churches were placed among rubble and barbed wire in solidarity with the people of Gaza. In Gaza, Hamas and smaller militant ally Islamic Jihad, both sworn to Israel's destruction, are believed to be holding more than 100 hostages from among 240 they captured during their Oct. 7 rampage through Israeli towns, when they killed 1,200 people. Since then, Israel has laid much of the narrow strip to waste. Nearly 20,700 Gazans have been killed, including 250 in the last 24 hours, according to authorities in Hamas-ruled Gaza. The vast majority of Gaza's 2.3 million population have been driven from their homes, and the United Nations says humanitarian conditions are catastrophic. The Israeli military said on Monday two of its soldiers had died in the last day, bringing to 158 the number killed since ground operations began on Oct. 20. Separately, three security sources said an Israeli airstrike outside the Syrian capital Damascus on Monday killed a senior adviser in Iran’s Revolutionary Guards. The sources told Reuters the adviser, known as Sayyed Razi Mousavi, was responsible for coordinating the military alliance between Syria and Iran, which supports Hamas in Gaza. The Revolutionary Guards, in a statement read on Iranian state television, said Israel \"will pay for this crime.\" On Saturday, Israel's military chief of staff said his forces had largely achieved operational control in the north of Gaza and would expand operations further in the south. But residents say fighting has only intensified in northern districts. Diplomatic efforts, mediated by Egypt and Qatar, on a new truce to free the remaining hostages held in Gaza have yielded little public progress. \nHamas and the allied Islamic Jihad have rejected an Egyptian proposal, made in Cairo talks, that they relinquish power in the Gaza Strip in return for a permanent ceasefire, two Egyptian security sources told Reuters on Monday. The militant groups have said they would not discuss any release of hostages unless Israel ends its war in Gaza, while the Israelis say they are willing to discuss only a pause in fighting."
}