{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBQ0AO_L.jpg",
  "title": "Mourners chant 'Death to Israel' at Revolutionary Guards adviser funeral",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 27, 2023 08:46AM ET",
    "Updated Dec 27, 2023 08:52AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Ken Roth",
        "2023-12-27 18:11:27",
        "Good ridance to another Iranian terrorist. Lets hope they fire some more missiles so that we can attack their bases.",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/mourners-chant-death-to-israel-at-revolutionary-guards-adviser-funeral-3264026",
  "paragraph": "5/5\n© Reuters. People carry the coffin of senior adviser for Iran's Revolutionary Guards, Sayyed Razi Mousavi, who was killed in an Israeli air strike outside the Syrian capital Damascus, during his funeral in Najaf, Iraq, December 27, 2023. REUTERS/Alaa al-Marjani\n2/5\nBy Alaa al-Marjani and and Ahmed Saeed NAJAF, Iraq (Reuters) - Mourners chanted \"Death to America, Death to Israel\" during the funeral service on Wednesday for a senior adviser in Iran's Revolutionary Guards who was killed in an air strike in Syria. Three security sources and Iranian state media said an Israeli air strike outside Damascus on Monday killed Sayyed Razi Mousavi. The sources said he was responsible for coordinating the military alliance between Syria and Iran.  The coffin of Mousavi was passed over the heads of members of the Iraq's Popular Mobilisation Forces, a heavily armed state paramilitary grouping that contains dozens of Iran-backed factions, during the funeral in Iraq's holy city of Najaf.  Following the funeral at Iraq's most revered Shi'ite Muslim shrine, his coffin will be flown to Iran for burial.  The powerful Revolutionary Guards, Iran's dominant military force, with its own army, navy, air force and intelligence wing, has said Israel will suffer for killing Mousavi. An Israeli military spokesperson declined specific comment about his death, but said it took whatever action necessary to defend the country. \nSince the eruption of war between Israel and the Palestinian group Hamas on Oct. 7, Iran-backed groups have mounted operations against Israel, while others, including militias in Iraq, have threatened U.S. interests.  Israel has for years carried out attacks against what it describes as Iran-linked targets in Syria, where Tehran's influence has grown since it backed President Bashar al-Assad in the civil war that erupted in Syria in 2011."
}