{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0T0MK_L.jpg",
  "title": "Gaza ceasefire plan for hostage release awaits Hamas response",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 30, 2024 12:48PM ET",
    "Updated Jan 30, 2024 12:53PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/gaza-ceasefire-plan-for-hostage-release-awaits-hamas-response-3287335",
  "paragraph": "5/5\n© Reuters. Dahlia Cooper hangs a picture of her father-in-law Amiram Cooper, who was kidnapped on the deadly October 7 attack by Palestinian Islamist group Hamas, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, in Tel Aviv, Israel,\n2/5\nBy Jonathan Landay, Maya Gebeily, Andrew Mills and Nidal al-Mughrabi WASHINGTON/BEIRUT/DOHA (Reuters) - Hamas is studying a three-phase Gaza ceasefire plan that would secure the release of most Israeli hostages but does not yet commit Israel to end its war with the Palestinian militant group, according to sources with knowledge of the proposal. The viability of the plan formulated by U.S., Israeli and Egyptian spy chiefs and Qatar's prime minister hinges on whether or not Hamas, which rules the enclave, will agree to the first phase without agreeing to a permanent end to the war - thus far a core demand of the group. \"We don't know and we cannot predict what Hamas' response will be,\" Sheikh Mohammed bin Abdulrahman Al Thani, Qatar's prime minister, said on Monday. Hamas told Reuters in a statement on Tuesday the proposal would involve three stages, including the release of hostages held by the group and Palestinian prisoners held in Israel. The statement corroborated some details of the framework provided to Reuters by two sources briefed on the proposal. Men, children, the elderly and wounded would be released in the first stage, the statement said, and the plan had been sent to Gaza to obtain the opinion of Hamas leaders there. \"After that, the Hamas leadership will meet to discuss the paper and express its final opinion on it,\" the statement said. More than 100 Israeli hostages are still held, following the release of a similar number in an earlier truce in November that involved the release of scores of Palestinian prisoners. Versions of the phased ceasefire framework have been under discussion since late December, but Israel did not sign onto the concept until David Barnea, the Mossad chief, met his U.S. and Egyptian counterparts and Sheikh Mohammed in Paris on Sunday.  Egyptian sources said Qatar, Egypt and Jordan would guarantee that Hamas adheres to any agreement, while the U.S. and France would do the same on the Israeli side. Reuters was unable to establish what assurances the guarantors would be able to offer. Israeli officials did not immediately respond to Reuters request for comment.  Hamas chief Ismail Haniyeh, who says the group is open to all ideas that will lead to an end to Israel's Gaza offensive, announced on Tuesday he would visit Cairo to discuss the plan. WOMEN, CHILDREN, THE ELDERLY Its first phase would consist of a pause in fighting and the release of elderly, civilian women and children hostages, said a source briefed on the Paris talks and a second source with in-depth knowledge of the talks and their results. Major deliveries of food and medicine to Gaza, facing a ruinous humanitarian crisis, would resume, according to both sources.  The sources differed on how long the first stage ceasefire would last, but two of them said it would be set for at least a month. The second phase would see the releases of female Israeli soldiers, and another increase in aid deliveries and restoration of utility services to Gaza, and the third phase would see the release of the bodies of deceased Israeli troops in exchange for Palestinian prisoners freed, the two sources said.  The Hamas statement said the second phase would also involve the release of male military recruits. \"Military operations on both sides will stop during the three stages,\" it said. The number of Palestinian prisoners to be released is to be left to the negotiation process \"at every stage, with the Israeli side preparing to release those with high sentences,\" the Hamas statement said.     Both sources said that although Israel has not committed to a permanent ceasefire, the ultimate aim of this phased approach is a fourth phase in which the war would end and Hamas would release male IDF soldiers held captive in exchange for Israel's release of additional Palestinian prisoners held in jail.  \"There is a consensus on the concept of the framework, but critical details of each phase still need to be worked out,\" said an official briefed on the negotiations.  If Hamas does agree to the framework proposal it could still take days or weeks to settle logistical details of the ceasefire and the release of hostages and prisoners, the official said. During the talks preceding the truce in November, the indirect chain of communication between Hamas leaders based in the group's Gaza tunnels and Israeli officials broke several times because of power outages amid intense fighting, a source briefed on those talks said at that time. The current behind-the-scenes discussions are proceeding in tandem with a public standoff in which both sides in the conflict appear to want to pressure the other by issuing statements ruling out various potential concessions. On Tuesday, Prime Minister Benjamin Netanyahu said Israel would not quit Gaza or free thousands of Palestinian prisoners, while Hamas ally Islamic Jihad said it would not engage in any understandings on hostages without ensuring a comprehensive ceasefire and withdrawal of Israeli forces from Gaza. A far-right partner in Netanyahu's coalition, Itamar Ben-Gvir, threatened on Tuesday to quit the government over any attempt to enter a \"reckless\" deal with Hamas on the hostages. 'WHAT REALLY MATTERS' It was not immediately clear whether such public positioning reflected developments in the backroom discussions. The framework agreed in Paris is based on elements of an initial proposal made by Israel and a counterproposal made by Hamas, Sheikh Mohammed said at Washington's Atlantic Council think tank on Monday.  \"We tried to blend things together to come up with some sort of reasonable ground that brings everybody together,\" he said.  The source with in-depth knowledge of the proposal said it could still be amended.  \"The number of days or hostage calculations can change, but with this approach it allows for a sort of win-win shaped by what really matters to the two sides,\" the source said.  Significant gaps remain, almost four months after Hamas fighters killed 1,200 people and took 253 others hostage on Oct. 7 in a bloody rampage through southern Israel towns.     Israel has responded by bombarding the narrow, densely populated Gaza Strip, killing more than 26,000 Palestinians and turning the enclave into a wasteland of rubble.  \n    The source with in-depth knowledge of the talks said the discussions in Paris were \"productive,\" but that the deal could only move forward if both Hamas and Israel received robust guarantees from its backers.     By leaving the issue of male hostages from the Israeli Defense Forces to the end, the source said, Hamas could be made to feel it retained some leverage over the Israeli military."
}