{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBN034_L.jpg",
  "title": "Moldova's pro-European president Sandu says she will seek second term",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Dec 24, 2023 05:08PM ET",
  "comments": [
    1,
    [
      [
        "Michael Benson",
        "2023-12-25 01:03:28",
        "Commodities play a significant role in the global economy.",
        "https://www.investing.com/members/246214947"
      ],
      [
        "Michael Benson",
        "2023-12-25 01:04:36",
        "The global economy is becoming more interconnected.",
        "https://www.investing.com/members/246214947"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/moldovas-proeuropean-president-sandu-says-she-will-seek-second-term-3263128",
  "paragraph": "By Alexander Tanas CHISINAU (Reuters) -Moldova's pro-European President Maia Sandu said on Sunday she intended to run for a second presidential term in late 2024 and called on parliament to begin preparations for a referendum on the country's drive to join the European Union. The country's most prominent opposition figure, Socialist pro-Russian former President Igor Dodon, denounced both her intention to seek re-election and the call for a referendum. \"We still have important steps to take and I pledge to continue, if you will give me your trust for a new term,\" Sandu said in a statement published on the presidential website. She asked the parliament, controlled by her allies in the Party of Action and Solidarity (PAS), to start work on a referendum on the European orientation of Moldova, an ex-Soviet state lying between Ukraine and EU member Romania. \"Our future is in the European family and we need to say clearly - the whole country - which path we choose for Moldova. I call on parliament to initiate a referendum next autumn, in which the voice of the citizens will be decisive,\" Sandu said. Sandu has denounced Russia's invasion of Ukraine and accused Moscow of plotting a coup to oust her. The Kremlin says she is fomenting Russophobia. A former World Bank economist, Sandu has made EU membership the cornerstone of her programme since defeating Dodon in a landslide election in December 2020. An EU summit earlier this month gave the go-ahead to start membership talks with both Moldova and Ukraine. Dodon, writing on his Facebook (NASDAQ:META) page, said pro-European policies were no guarantee of victory for Sandu. \"People are not as naive as they were in 2020,\" Dodon wrote. \"Today they associate Sandu not with progress and the law but with poverty, arrogance and anti-democratic violence.\" Presidential elections are due to be held in November-December 2024, with the exact date to be determined by parliament. Last May, tens of thousands of people poured into an open air meeting in Chisinau's central square to back Sandu's drive to move towards the European mainstream. \nCurrent polls give her PAS between 30 to 45 percent of the vote compared to 28 to 38 percent for Dodon's Socialists and eight to 15 percent for the Chance party of fugitive business magnate Ilan Shor, sentenced to 15 years in prison on fraud charges earlier this year. In municipal elections last month, seen as a barometer of her pro-European policies, PAS candidates won control of about one-third of local councils, a result seen as positive by her allies."
}