{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK02009_L.jpg",
  "title": "US to reopen border crossings as illegal immigration drops",
  "category": "General",
  "publisher": "Reuters",
  "date": [
    "Published Jan 02, 2024 07:28PM ET",
    "Updated Jan 02, 2024 11:10PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/general/us-to-reopen-border-crossings-as-illegal-immigration-drops-3265810",
  "paragraph": "© Reuters. People wait behind concertina wire and newly installed barriers to turn themselves to the U.S. border authorities, in Brownsville, Texas, as seen from Matamoros, Mexico, December 29, 2023. REUTERS/Veronica G. Cardenas\nBy Ted Hesson and Kristina Cooke WASHINGTON (Reuters) -The U.S. will reopen four legal U.S.-Mexico border crossings on Thursday as high levels of illegal immigration have receded and freed up personnel, U.S. border authorities said on Tuesday. The U.S. will resume operations at an international bridge in Eagle Pass, Texas, two crossings in Arizona and another near San Diego, California, U.S. Customs and Border Protection (CBP) said in a press release, adding that it will continue to prioritize border security \"as necessary.\" U.S. border authorities struggled in December to process migrants as apprehensions reached nearly 11,000 in a single day, which several current and former officials said was near or at a record high.  Lawmakers remain in talks over a possible deal that would combine increased border security measures with foreign aid, including military funding for Ukraine, U.S. officials said. \"We gotta do something. They ought to give me the money I need to protect the border,\" U.S. President Joe Biden told reporters on his arrival at the White House on Tuesday evening, apparently referring to members of Congress. Mexican and U.S. officials pledged last week to work together more closely to tackle record migration at their shared border after top U.S. officials traveled to Mexico to meet with Mexican President Andres Manuel Lopez Obrador. Mexican officials have stepped up immigration enforcement in recent weeks, including moving migrants to southern Mexico and resuming deportation flights to Venezuela, a senior U.S. official said during a call with reporters on Tuesday, requesting anonymity as a condition of the briefing. Mexico on Tuesday evening cheered the reopening of the border crossings.  \"This will benefit the economies of both countries,\" Mexico's foreign ministry, which had previously called for the reopening of crossings between the two nations, said in a statement. U.S. border authorities arrested an average of 6,400 migrants per day over the past week, according to an internal U.S. government report reviewed by Reuters, a steep decline from the levels before Christmas. \nA separate U.S. official on the call cautioned that migrant crossings have historically dropped between Christmas and New Year's Day.  \"We have seen over the last year periods of increased encounters and periods of decreased encounters,\" the official said. \"We will continue to stand ready to respond to these kinds of surges.\""
}