{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK030D9_L.jpg",
  "title": "Vatican moves to calm bishops over same-sex blessings approval",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 04, 2024 07:04AM ET",
    "Updated Jan 04, 2024 09:57AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/vatican-moves-to-calm-bishops-over-samesex-blessings-approval-3267153",
  "paragraph": "© Reuters. FILE PHOTO: A rainbow flag is seen on the wall of a Catholic church as the building is open for same-sex couples to receive a blessing in Cologne, Germany, May 10, 2021. REUTERS/Thilo Schmuelgen/File Photo\nBy Philip Pullella VATICAN CITY (Reuters) - The Vatican on Thursday moved to calm Catholic bishops in some countries who have balked over last month's approval of blessings for same-sex couples, telling them that the measure is not \"heretical\" or \"blasphemous\". In a five-page statement, the Vatican's doctrinal office also acknowledged that such blessings could be \"imprudent\" in some countries where people who receive them might become targets of violence, or risk prison or even death. Catholic bishops in some countries, particularly in Africa, have expressed various degrees of dissent over the Dec. 18 declaration, known by its Latin title Fiducia Supplicans (Supplicating Trust), which was approved by Pope Francis. The fact that the Vatican needed to issue a five-page clarification of an eight-page declaration - little more than two weeks after it was issued - appeared to underscore the extent of the confusion it caused in many countries. After the original declaration was issued, a number of Catholic bishops' conferences issued statements stressing that the blessings did not amount to an official approval of gay sex or a sacrament of marriage for same-sex couples. The doctrinal office, known as the Dicastery for the Doctrine of the Faith, stressed these aspects in its statement on Thursday, saying that blessings for same-sex couples should not be seen as \"a justification of all their actions, and they are not an endorsement of the life that they lead\". The office said it wanted \"to clarify the reception of Fiducia Supplicans while recommending at the same time a full and calm reading\" of the Dec. 18 declaration, which it said is \"clear and definitive about marriage and sexuality\". It added: \"Evidently, there is no room to distance ourselves doctrinally from this declaration or to consider it heretical, contrary to the Tradition of the Church or Blasphemous.\" AFRICAN BISHOPS LEAD DISSENT The Church teaches that same-sex attraction is not sinful but homosexual acts are. Since his election in 2013, Francis has tried to make the more than 1.35-billion-member Church more welcoming to LGBT people, without changing moral doctrine. Still, some African bishops' conferences have made clear that they will not allow their priests to conduct such blessings. Thursday's statement advised \"pastoral prudence\" depending on local laws and circumstances. Last week, Burundi's President Evariste Ndayishimiye called on citizens to stone gay people. Uganda passed a law last May that carries the death sentence for certain categories of same-sex offences and lengthy jail sentences for others - a move that was widely condemned by Western governments and human rights activists. \"If there are laws that condemn the mere act of declaring oneself as a homosexual with prison and in some cases with torture and even death, it goes without saying that a blessing would be imprudent,\" the Vatican statement said. \nThe original declaration and Thursday's statement both said blessings of people in same-sex relationships should not be included in Church rituals or in any way resemble a wedding. Thursday's statement said they should be short. \"We are talking about something that lasts about 10 or 15 seconds. Does it make sense to deny these kinds of blessings to these two people who ask for them?\" it said."
}