{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBT04A_L.jpg",
  "title": "Ukraine death toll after massive Russian air attack rises to 39",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Dec 30, 2023 10:03AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/ukraine-death-toll-after-massive-russian-air-attack-rises-to-39-3264899",
  "paragraph": "© Reuters. A general view shows a shopping mall heavily damaged by a Russian missile strike, amid Russia's attack on Ukraine, in Dnipro, Ukraine December 29, 2023. Press service of the State Emergency Service of Ukraine in Dnipropetrovsk region/Handout via REUTERS/F\nKYIV (Reuters) - The death toll from Russia's largest air attack on Ukraine rose to 39 on Saturday as rescuers continued to clear debris and rubble from the bombardment, President Volodymyr Zelenskiy said. Russia launched 158 missiles and drones on cities and towns across Ukraine on Friday in what Ukrainian officials described as the worst aerial bombardment since the start of the war in February 2022. \"Works to clear up the consequences of yesterday's Russian attack are still underway. Almost 120 cities and villages, hundreds of civilian objects have suffered,\" Zelenskiy said on the Telegram messaging app. Zelenskiy said 39 people were killed and 159 injured in the strikes that involved different types of ballistic and cruise missiles and Iranian-made drones. Ukrainian air defence said it shot down 87 Russian missiles and over 30 drones.  In the capital Kyiv, at least 16 people were killed, the largest civilian death toll in the city during nearly 22 months of the war, said mayor Vitali Klitschko. The city announced a day of mourning for the victims on Jan. 1. Klitschko said rescuers were continuing to pick through rubble in Kyiv where a warehouse and several residential and commercial buildings were hit.  \nRescue efforts continued in other cities and villages in the centre, south, and west of the country, local officials said. Local authorities raced to help repair thousands of smashed windows in residential buildings and to restore heating. The weather is unseasonably warm in most of Ukraine with temperatures hovering around 4 Celsius (39 degrees Fahrenheit) but forecasters expect a dip to zero later in the week."
}