{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0L0SI_L.jpg",
  "title": "Latest strikes on Yemen's Houthis destroyed intended targets, UK says",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 22, 2024 06:10PM ET",
    "Updated Jan 23, 2024 09:19AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-british-forces-carry-out-new-strikes-in-yemen-3280109",
  "paragraph": "3/3\n© Reuters. Royal Air Force Typhoon FGR4 being preparded to take off. Royal Air Force Typhoon aircraft have conducted precision strike operations against Houthi military targets in response to further attacks on shipping in the Red Sea, in this undated handout image.\n2/3\nBy Phil Stewart and Idrees Ali WASHINGTON (Reuters) -U.S. and British forces carried out a new round of strikes on Monday in Yemen, targeting a Houthi underground storage site as well as missile and surveillance capabilities used by the Iran-aligned group against Red Sea shipping, the Pentagon said. The Houthis, who control the most populous parts of Yemen, have said their attacks are in solidarity with Palestinians as Israel strikes Gaza. The Houthi attacks have disrupted global shipping and stoked fears of global inflation. They have also deepened concern that fallout from the Israel-Hamas war could destabilize the Middle East. In the latest response, U.S. and British forces carried out strikes at eight different locations in Yemen, with support from Australia, Bahrain, Canada and the Netherlands, according to a joint statement signed by the six countries. \"Our initial evidence from last night's strikes is...that all intended targets were destroyed,\" British Prime Minister Rishi Sunak told parliament on Tuesday.  A senior U.S. military official, speaking on condition of anonymity, said roughly 25 to 30 munitions were fired, some of them from warplanes launched from a U.S. aircraft carrier. Eight rounds of strikes over the past month have failed so far to stop Houthi attacks against shipping. The Houthis' military spokesman, Yahya Sarea, said on Tuesday that the U.S.-British alliance had carried out 18 air strikes: 12 in the capital Sanaa, three in the port city of Hodeidah, two in Taiz and one in Al-Bayda province. \"These attacks will not go unanswered or unpunished\", he said. 'MESSAGE' SENT TO HOUTHIS U.S. officials say the strikes have degraded the Houthis' ability to carry out complex attacks. But they have declined to offer any specific numbers of missiles, radar, drones or other military capabilities destroyed so far. \"We are having the intended effect,\" the U.S. military official told Pentagon reporters. Speaking after the latest strikes, British foreign minister David Cameron said the action had sent a clear message to the Houthis. \"We will continue to degrade their ability to carry out these attacks whilst sending the clearest possible message that we back our words and our warnings with action,\" he said. President Joe Biden said last week that air strikes would continue while acknowledging they might not be halting the Houthi attacks. Last week, the Houthis fired two anti-ship ballistic missiles at a U.S.-owned tanker ship that hit the water near the vessel but caused no injuries or damage. Biden's emerging strategy on Yemen aims to weaken the Houthi militants but stops well short of trying to defeat the group or directly address Iran, the Houthis' main sponsor, experts say. The strategy - a blend of limited military strikes and sanctions - appears aimed at punishing the Houthis while limiting the danger of a wider Middle East conflict. \nSunak said Britain and the U.S. were working closely on new sanctions measures to be announced in the coming days.  Container vessels have been pausing or diverting from the Red Sea, which leads to the Suez Canal, the fastest freight route from Asia to Europe. Many have taken the longer route around Africa instead."
}