{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0G004_L.jpg",
  "title": "Colorado gay nightclub shooter to plead guilty to hate crime charges",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 16, 2024 07:03PM ET",
    "Updated Jan 16, 2024 07:46PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/colorado-gay-nightclub-shooter-to-plead-guilty-to-hate-crime-charges-3275652",
  "paragraph": "3/3\n© Reuters. Flowers, candles, and mementos are left at a memorial after a mass shooting at LGBTQ nightclub Club Q in Colorado Springs, Colorado, U.S. November 26, 2022. REUTERS/Isaiah J. Downing/File Photo\n2/3\nBy Brad Brooks LONGMONT, Colorado (Reuters) - A Colorado man who killed five people in a 2022 mass shooting at a gay nightclub has agreed to plead guilty to federal hate crime and gun charges, according to court documents unsealed on Tuesday.  Anderson Lee Aldrich, 23, will plead guilty to 74 federal charges, according to court documents unsealed in U.S. District Court in the District of Colorado. That will result in \"multiple concurrent life sentences plus additional consecutive sentences totaling 190 years imprisonment,\" according to the filings.  The documents state that Aldrich chose his targets \"because of the actual and perceived sexual orientation and gender identity\" of those in the nightclub where he opened fire. The shooting was reminiscent of a 2016 massacre at Pulse, a gay nightclub in Orlando, Florida, where a gunman killed 49 people before police shot him dead.  The federal government will not seek the death penalty for Aldrich, the documents show.  The federal public defender listed in the court documents as representing Aldrich did not immediately respond to requests for comment. The U.S. Department of Justice confirmed in a statement that a plea deal had been reached.  Aldrich pleaded guilty to charges in state court last year and was sentenced to life in prison without the possibility of parole for carrying out the killings at Club Q, an LGBTQ nightclub in Colorado Springs.  Aldrich appeared remotely before a federal judge on Tuesday and entered a plea of not guilty, but his legal team has filed a document stating that he would plead guilty at a future appearance, once the judge sets a hearing date.  On Nov. 19, 2022, Aldrich, wearing body armor and armed with a rifle and a handgun, opened fire at Club Q. In addition to those killed, nearly two dozen others were wounded by gunfire or otherwise injured before \"heroic\" patrons stopped the rampage.  \nBefore his sentencing, Aldrich told the state court that they identify as nonbinary. He declined to speak during the hearing, but their defense lawyer, Joseph Archambault, said Aldrich wanted the court to know that \"they are deeply remorseful.\"  Aldrich had been known to law enforcement, having been arrested in June 2021 after his mother reported he had threatened to detonate a bomb and harm her with multiple weapons, according to a press release from the El Paso County Sheriff's Office. But she declined to testify for the prosecution, and the case was dismissed."
}