{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBP082_L.jpg",
  "title": "Anti-war candidate barred from running against Putin lodges appeal",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 26, 2023 08:40AM ET",
    "Updated Dec 26, 2023 08:57AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/antiwar-candidate-barred-from-running-against-putin-lodges-appeal-3263569",
  "paragraph": "2/2\n© Reuters. FILE PHOTO: Yekaterina Duntsova, a former regional journalist who plans to run for Russian president in the March 2024 election, speaks with journalists after meeting officials of the Central Election Commission to submit documents at an office in Moscow,\n2/2\nMOSCOW (Reuters) - A former TV journalist who opposes Russia's war in Ukraine and who was disqualified on Saturday as a candidate for Russia's upcoming presidential election has lodged an appeal with the Supreme Court.  Members of the central electoral commission voted unanimously to reject the candidacy of Yekaterina Duntsova, citing \"numerous violations\" in the papers she had submitted in support of her bid. Speaking to Reuters after submitting an appeal to the Supreme Court, Duntsova - who is not well known across Russia and by her own admission commands a core support base of thousands in a country of over 140 million people - made it clear that she did not expect her appeal to be successful.  But the 40-year-old said she had been unfairly barred from taking part in a contest widely expected to be won by incumbent Vladimir Putin who has been in power as either president or prime minister for more than 20 years.  By not letting her run, she said the authorities had deprived some young Russians of a way of expressing their views within what is a tightly controlled political system. That, she asserted, risked stoking apathy and a boycott of the March election by some voters. \"I have a sense that the field (of candidates) is being cleared... It's not advantageous to you (the authorities) above all that nobody is left, that the list of candidates (only) lists people aged over 70,\" she said.  \"Where are the representatives of young people? Where are the representatives of people who want to talk about peace, about democratic values, about reform, about trust in the institute of power?\" The central election commission says its decisions are purely rules-based and that its job is to make sure that would-be candidates follow the right procedures.  Speaking on Tuesday, Kremlin spokesman Dmitry Peskov did not mention Duntsova by name, but said the constitution allowed people with political ambitions to run for president if they met the legal criteria to do so.  The Kremlin points to opinion polls which give Putin, 71, an approval rating of around 80% and says most Russians support what it calls Russia's \"special military operation\" in Ukraine.  Putin has cast the war in Ukraine as an existential struggle for a new world order with the West and portrayed himself as the right person to steer Russia to a promised victory. Tough laws on \"fake news\" introduced after Putin sent tens of thousands of troops into Ukraine in February 2022 mandate long jail terms for anyone judged to have spread false reports about the Russian military. Putin's critics have either fled the country or, like Alexei Navalny, are doing time in prison.  Duntsova, who said her supporters would try to monitor the way the election was held, said it was obvious that some people would spoil their ballot papers in protest over what she said was the narrow selection of candidates. \n\"Why do this (disqualify me) and provoke citizens? They should come to polling booths with a sense that they are making a real contribution,\" said Duntsova. She chose her words carefully. When Duntsova said last month that she wanted to stand, she said that \"any sane person taking this step would be afraid\"."
}