{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK080GS_L.jpg",
  "title": "Russia's Navalny jokes about freezing 'Polar Wolf' prison conditions",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 09, 2024 08:33AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/russias-navalny-jokes-about-freezing-polar-wolf-prison-conditions-3270304",
  "paragraph": "© Reuters. Russian opposition leader Alexei Navalny is seen on a screen via video link from a penal colony in the Vladimir Region during a hearing at the Basmanny district court in Moscow, Russia April 26, 2023. REUTERS/Yulia Morozova/ File Photo\nMOSCOW (Reuters) - Russia's most prominent jailed opposition politician, Alexei Navalny, heaped ironic praise on Tuesday on the polar conditions at the prison north of the Arctic Circle where he was moved to shortly before Christmas. Navalny, 47, was tracked down to the IK-3 penal colony in Kharp in the Yamal-Nenets region, about 1,900 km (1200 miles) northeast of Moscow, his supporters said on December 25. In a post on the Telegram messaging app, Navalny said he had been put in a punishment cell for his attitude as soon as he left quarantine at the so-called \"Polar Wolf\" prison colony.  \"It has not been colder than -32°C yet,\" Navalny said in the post which was laden with sarcasm. \"Nothing quite invigorates you like a walk in Yamal at 6:30 in the morning.\" \"Even at this temperature, you can walk for more than half an hour only if you manage to grow a new nose, new ears and new fingers.\" He posted a picture of his walking yard - concrete walled, topped with metal bars, 11 steps long and three steps wide.  Navalny mentioned a scene in the 2015 film, The Revenant, in which Leonardo DiCaprio shelters in the carcass of a horse. \"I don't think that would have worked here. A dead horse would freeze in 15 minutes,\" Navalny said. \"We need an elephant here, a hot elephant, a fried one.\" The Polar Wolf colony, is considered to be one of the toughest prisons in Russia. Most prisoners there have been convicted of grave crimes.  \nWinters are harsh - and temperatures are due to drop to around minus 28 Celsius (minus 18.4 Fahrenheit) there over the next week. About 60 km (40 miles) north of the Arctic Circle, the prison was founded in the 1960s as part of what was once the GULAG system of forced Soviet labour camps, according to the Moskovsky Komsomolets newspaper."
}