{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "Myanmar's 'watermelons': Soldier on the outside, rebel inside",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 01, 2024 08:08PM ET",
    "Updated Jan 03, 2024 02:06AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/myanmars-watermelons-soldier-on-the-outside-rebel-inside-3265159",
  "paragraph": "(Reuters) -For about two years, says 24-year-old Yan, a former Myanmar police officer, he risked his life pretending to serve the military junta while secretly spying for the armed resistance.     “I freed myself from unfair orders,” he told Reuters from a room in a town near the Myanmar border where he said he was taking refuge after fleeing the country in April. Yan declined to give his full name because of the threat to his life.     Myanmar's junta is facing the fiercest threat to its power since seizing control in a 2021 coup as it battles an unprecedented alliance of opponents while weakened by some internal dissent and defections.     The junta did not respond to requests for comment by Reuters. It has acknowledged some loss of control. The junta has not commented on spies within its ranks, but pro-military social media channels have exposed soldiers who appear sympathetic to the rebels. Opposition groups said it was difficult to determine how many members of the security forces supplied information to the resistance, and their number was likely small given the risk, but they play a crucial role. They have supplied intelligence, including about the transportation of military supplies, that has helped opposition groups plan attacks, a spokesperson for People’s Goal, a group that supports defectors, told Reuters.  “We have received information which has saved lives,” the spokesperson said, referring to tip-offs about impending attacks or air strikes.     ‘WATERMELONS’     Yan, who joined the police force in late 2020, following in the footsteps of his brother, said he became disillusioned after the coup when he witnessed the arbitrary arrest of protesters during a brutal military crackdown.     “People started treating us like ghosts,” Yan said. “They hated us.”     He said his brother fled the country and connected Yan to opposition groups cultivating sources inside the security forces known in Burmese as “watermelons” – green on the outside, appearing loyal to the army, but red, the colour of the ousted National League for Democracy government, on the inside.     Yan said he crept out of the police station and sent messages by phone out of sight of his colleagues, including about routes taken by senior junta figures and the number of police, fuel, and weapons in various places. He said he did not know how the rebel groups used the information he supplied. Reuters could not independently confirm his account. One military defector told Reuters it was rare for members of the armed forces to spy for rebel groups but there were many who “turned a blind eye” to rebel activities.     MASS DEFECTIONS Internal dissent poses a serious problem for the junta, some analysts say. Washington D.C-based think-tank the United States Institute for Peace estimates as many as 8,000 people have fled the security forces. Yan and his brother, Ye, said the junta was struggling to recruit while police were poorly equipped and trained, making them reluctant to fight and quick to surrender, the pair said. Previously, military battalions were made up of several hundred members but now most number little more than 130, a figure analysts agree with, former army captain Htet Myat told Reuters by phone.     Htet Myat, now a prominent opposition figure helping defectors, said the recent offensive had accelerated defections.     But, stranded in a foreign country, life can be a hard scrabble. Yan, who is single, and his brother and sister-in-law have started a business making and selling fabric printed with leaves from their home country. \n    Yan said their sacrifice amounted to a fraction of that made by others.      “I did what I had to do,” he said."
}