{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK12026_L.jpg",
  "title": "Polish president criticised for doubting Ukraine can retake Crimea",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Feb 03, 2024 08:08AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/polish-president-criticised-for-doubting-ukraine-can-retake-crimea-3291891",
  "paragraph": "© Reuters. FILE PHOTO: Ukraine's President Volodymyr Zelenskiy and Poland's President Andrzej Duda attend a meeting during the World Economic Forum (WEF) in Davos, Switzerland January 16, 2024. Ukrainian Presidential Press Service/Handout via REUTERS \nWARSAW (Reuters) -Poland's president declared on Saturday he had always been unwavering in his support for Ukraine after coming under strong criticism for saying he was unsure whether Kyiv would be able to regain control over Russian-occupied Crimea. Warsaw has been one of Kyiv's staunchest supporters since Russia's February 2022 invasion and has said Ukraine must regain control over all of its territory in order to deter Moscow from further aggression. President Andrzej Duda reiterated this position during an interview on YouTube channel Kanal Zero late on Friday. However, when asked if he believed Ukraine would really be able to retake Crimea, he said, \"It is hard for me to answer that question\". \"I don't know if (Ukraine) will regain Crimea, but I believe it will regain Donetsk and Luhansk,\" he said. He said the Crimean peninsula, which Russia seized in 2014, eight years before launching its full-scale invasion, \"is a special place... also for historical reasons. Because in fact, if we look historically, it was in Russia's hands for most of the time.\"  Parts of the Donetsk and Luhansk regions in eastern Ukraine were also taken by Moscow-backed forces in 2014 and have been embattled during the course of the current war, unlike Crimea. Ukraine has vowed to recover every inch of its territory including Crimea in the war with Russia.  Ukraine's Ambassador to Poland, Vasyl Zvarych, wrote on X on Saturday that \"Crimea is Ukraine: it is and will remain so\".  Polish Foreign Minister Radoslaw Sikorski, a member of the new pro-European governing coalition that has been at odds with the nationalist Duda, said Warsaw \"recognises the independence of Ukraine within its internationally established borders\". SHOULDER TO SHOULDER On Saturday Duda sought to defuse the row over his statement on Friday, saying in a post on X that his \"actions and position on Russia's brutal aggression against Ukraine have been and are clear from day one\". He added: \"Russia's attack on Ukraine and occupation of internationally recognised territories of Ukraine, including Crimea, is a crime... We all stand shoulder to shoulder for a free, sovereign and independent Ukraine against aggression and brutal imperialism!\" Duda's earlier remarks were sharply criticised by lawmakers from Poland's pro-European ruling coalition.  He is an ally of the nationalist Law and Justice (PiS) party which lost power December after failing to build a coalition following the loss of its majority in an October election. \"I would like to remind Mr Duda that there are cities in our country that in their history belonged to Poland for a shorter time than to another country,\" Roman Giertych, a lawmaker from the largest grouping in the government, Civic Coalition (KO), wrote on social media platform X. \n\"What an incredibly stupid statement!\" PiS lawmaker Radoslaw Fogiel said such criticism of Duda's words was unfounded. \"He answered directly to the question about Ukraine regaining Crimea by saying that he didn't know,\" Fogiel wrote on X."
}