{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0C06T_L.jpg",
  "title": "Protest in Georgian capital amid anger over 'desecration' of Stalin icon",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 13, 2024 01:11PM ET",
    "Updated Jan 13, 2024 01:17PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Benjamin USA",
        "2024-01-13 18:25:11",
        "Mass murderer and human disgrace. ",
        "https://www.investing.com/members/200821892"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/protest-in-georgian-capital-amid-anger-over-desecration-of-stalin-icon-3273996",
  "paragraph": "5/5\n© Reuters. FILE PHOTO: A view shows an icon, an element of which depicts Soviet leader Joseph Stalin being blessed by Russian Orthodox saint Matrona of Moscow, and that was recently defaced with paint in an act of protest amid controversy over the icon’s apparent \n2/5\nBy Felix Light TBILISI (Reuters) - A large protest was held in Tbilisi on Saturday to demand harsh punishment for a woman accused of defacing a religious icon depicting Soviet dictator Josef Stalin which was recently-installed in the Georgian capital. The suspect is alleged to have splashed paint on the icon, which was on display in the city's main Holy Trinity Cathedral, on Tuesday in an act of protest that exposed deep divisions in Georgia over the former Soviet dictator's legacy in his homeland. Alt-Info, the pro-Russian ultra-conservative movement that organised the protest, used a post on the Telegram messaging app to compare the \"desecration\" of the icon to repression of religion that occurred under Stalin's regime. \"We express our position regarding the current events and emphasize that the fact of pouring paint on the icon in the Patriarchal Church is a kind of raid on the church and repeats the experience of the Bolshevik past,\" it said. Thousands of Orthodox believers and Alt-Info supporters gathered on Saturday in front of the country's parliament before matching through the city to the cathedral to pray before the Stalin icon. The crowd - estimated by a Reuters reporter to be up to 3,000-strong - was monitored by the police and addressed by a speaker critical of the attack on the icon.  A Georgian nationalist party, called the Alliance of Patriots, which has also expressed pro-Russian views, said it had gifted the icon to the cathedral. A side panel of the icon includes a depiction of the Georgian-born Stalin - an avowed atheist who violently repressed religion across the Soviet Union - being blessed by St Matrona of Moscow, a Russian Orthodox saint, during World War Two. Georgia's Orthodox church authorities were cited by the Interpress news agency on Thursday as saying \"appropriate changes\" should be made to the icon, adding there was insufficient evidence that Stalin ever actually met St Matrona. The police have opened an investigation into \"petty hooliganism\" and have questioned a suspect following the incident.  But some Orthodox Church activists and believers want the woman, who has been named in Georgia media, to be subject to a criminal investigation and be potentially jailed for what they say was an act that insulted the icon and their beliefs.  They also want the law which deals with such incidents to be made tougher, according to local reports. \nFlowers were placed by the icon on Saturday as believers lined up to kiss the part of it depicting Stalin.  Some Georgian media outlets reported on Tuesday that Orthodox activists had previously tried to storm the woman's apartment in Tbilisi, but were prevented by the police."
}