{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK090KV_L.jpg",
  "title": "Ecuador battles drug gangs behind surge of violence",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 10, 2024 10:25AM ET",
    "Updated Jan 11, 2024 12:29PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/more-than-130-ecuador-prison-staff-held-hostage-as-armed-forces-target-crime-gangs-3271676",
  "paragraph": "5/5\n© Reuters. Soldiers in an armoured vehicle patrol the city's historic centre following an outbreak of violence a day after Ecuador's President Daniel Noboa declared a 60-day state of emergency following the disappearance of Adolfo Macias, leader of the Los Choneros \n2/5\nBy Alexandra Valencia QUITO (Reuters) - Ecuador's president has declared war on drugs gangs holding scores of prison guards hostage in a wave of violence that saw the storming of a TV station on-air and explosions around the nation. The unrest appears to be in response to President Daniel Noboa's efforts to tackle cocaine trafficking, in particular by putting gang leaders in new high-security prisons. \"We are at war and we cannot cede in the face of these terrorist groups,\" Noboa, the 36-year-old son of a banana baron in power since November, said on Wednesday. His government has declared a state of emergency, sent the military after 22 gangs named as terrorist organizations, and said about 20,000 criminals are involved. Since Monday, gangs have kidnapped more than 130 prison guards and staff. That followed the apparent escape of notorious \"Los Choneros\" gang leader Adolfo Macias from prison. With unexplained blasts occurring in various cities, balaclava-clad gunmen with grenades and dynamite briefly took over the TC broadcaster in the Pacific Ocean port city Guayaquil on Tuesday during a news program, before police arrested them and freed the media staff. \"It was surreal,\" said journalist Jose Luis Calderon, 47, who at one point was obliged to appear on camera at gunpoint at the TV studio. Calderon told Reuters that at first he hid in the bathroom with others, but they were found and forced into the studio by the assailants. When police gunshots were heard outside, some colleagues begged for their lives. \"The individuals shot their guns, I think in reaction to the police, and they shot a door and one of the bullets ricocheted and injured the leg of a cameraman,\" Calderon said. HUNDREDS OF DETENTIONS A colleague recounted how dozens of journalists cowered on the floor, some praying. \"I thought it was my last day on earth and I wouldn’t see my children again,\" Alina Manrique said. The armed forces commander, Rear Admiral Jaime Vela, told a news conference late on Wednesday that 329 people, mostly from gangs including Los Choneros, Los Lobos and Los Tiguerones, have been detained since the state of emergency began this week. In response to videos purporting to show prison staff being subjected to extreme violence, including shooting and hanging, he said no hostage had been killed.  Reuters could not immediately verify the videos. Prisons agency SNAI said 125 guards and 14 administrative staff remain hostages, with 11 people freed on Tuesday.  Police said nine officers were kidnapped in recent days, with three still being held. Showing determination to press on with his security policies, Noboa told Canela Radio a design for two new prison facilities would be made public on Thursday.  The president said deportations of foreign prisoners, especially Colombians who number 1,500 in Ecuador's jails, would begin this week to ease overcrowding and costs.  \"We are investing more on those 1,500 people than on school breakfasts for our children,\" he said.  INTERNATIONAL ALARM Ecuador borders cocaine-producing Colombia and Peru and has become a major shipment point. Both its neighbors have stepped up controls on their frontiers. China, a major investor, has closed its embassy and consulates. Washington has pledged aid, said Noboa, whose $800 million security plan includes $200 million of weapons from the U.S. Peru is investigating possible smuggling by its military of explosives and grenades for Ecuador's gangs.  Ecuador's government says the oil and mining sectors are functioning normally and has sent security forces to ports to protect exports like fruit and cocoa.  Soldiers and police have been raiding homes, beefing up checkpoints, and entering prisons. \"The challenge for Noboa will be to make lasting headway in the fight against crime beyond any immediate-term, military-led pacification,\" consulting firm Teneo said in a note. Many businesses and schools have closed, with city streets quiet as police and soldiers patrolled.  \"It's a very cold environment, as if there were a new COVID,\" said Guayaquil security guard Rodolfo Tuaz, 40. \"It's nerve-racking, we cannot work in these conditions,\" said another resident, Gabriel Narvaez.  \nIn anti-gang operations, five gang members were killed in Esmeraldas province, national police commander General Cesar Zapata said, without giving more details. Police were also seeking to identify three bodies in a burned-out car south of Guayaquil, and two officers were killed by armed men in Guayas province where Guayaquil is located."
}