{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK070BU_L.jpg",
  "title": "'Indiscriminately striking' civilians is war crime, pope says in major speech",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 08, 2024 05:46AM ET",
    "Updated Jan 08, 2024 11:21AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Bolivar Altamirano",
        "2024-01-08 17:27:53",
        "hypocrite!",
        "https://www.investing.com/members/240569393"
      ],
      [
        "Brad Albright",
        "2024-01-08 20:19:43",
        "Yeah! All those civilians the Vatican had bombed. Atrocious. No better than Russian scum.",
        "https://www.investing.com/members/236251128"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/indiscriminately-striking-civilians-is-war-crime-pope-says-in-major-speech-3269091",
  "paragraph": "© Reuters. Pope Francis leads the Angelus prayer at the Vatican, January 7, 2024. Vatican Media/­Handout via REUTERS / File Photo\nBy Philip Pullella VATICAN CITY (Reuters) -Pope Francis, tackling conflicts in the Middle East and Ukraine in his yearly address to diplomats, said on Monday that \"indiscriminately striking\" civilians is a war crime because it violates international humanitarian law. Francis, 87, made his comments in a 45-minute address to Vatican-accredited envoys from 184 countries that is sometimes called his \"state of the world\" speech. In it, he also talked about conflicts in Africa and Asia, migration crises in the United States and Latin America, climate change and the persecution of Christians. Expressing concern that the war between Israel and the Palestinian Islamist group Hamas in the Gaza Strip could spread in the wider Middle East, he called for a \"ceasefire on every front, including Lebanon\". He condemned Hamas' Oct. 7 cross-border attack from Gaza into southern Israel as an \"atrocious\" act of \"terrorism and extremism\", and renewed a call for the immediate liberation of those still being held by militants in Gaza. In remarks linking the two high profile conflicts, Francis said modern warfare often does not distinguish between military and civilian objectives. There is no conflict that does not end up in some way \"indiscriminately striking\" the civilian population, he said. \"The events in Ukraine and Gaza are clear proof of this. We must not forget that grave violations of international humanitarian law are war crimes, and that it is not sufficient to point them out, but also necessary to prevent them. \"There is a need for greater effort on the part of the international community to defend and implement humanitarian law, which seems to be the only way to ensure the defence of human dignity in situations of warfare,\" he said. Israel's military campaign in densely populated Gaza has so far killed 22,835 Palestinians, according to Palestinian health officials. Israel says 1,200 people were killed in Hamas' Oct. 7 rampage and around 240 were taken hostage. Thousands of Ukrainian civilians have been killed since Russia's full-scale invasion of Ukraine in 2022. \"Perhaps we need to realise more clearly that civilian victims are not 'collateral damage', but men and women, with names and surnames, who lose their lives,\" Francis said.  The pontiff also said a resurgence of antisemitism since the start of the Gaza war was a \"scourge\" that must be eliminated from society. \nIn other parts of his address, Francis took another swipe at the armaments industry, calling for the establishment of a fund where money saved by reducing weapons stockpiles is diverted to eliminate hunger. He also called for the universal prohibition of surrogate motherhood, calling it \"deplorable\" and a grave violation of the dignity of both the woman and the child. \"A child is always a gift and never the basis of a commercial contract,\" he said."
}