{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0Q0B2_L.jpg",
  "title": "Ukraine says it uncovers mass fraud in weapons procurement",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 27, 2024 05:57PM ET",
    "Updated Jan 28, 2024 01:40PM ET"
  ],
  "comments": [
    11,
    [
      [
        "Mal Vic",
        "2024-01-28 20:38:11",
        "Corruption - self over others. Happens all the time in Africa",
        "https://www.investing.com/members/215560249"
      ],
      [
        "Tommy Lambert",
        "2024-01-28 20:18:47",
        "Wjlho's surprised???",
        "https://www.investing.com/members/206291862"
      ],
      [
        "Roger Miller",
        "2024-01-28 20:02:42",
        "Nice to see Ukrainian officials using Biden and the Democrats as role models, unfortunately at the expense of innocent Ukrainian people.",
        "https://www.investing.com/members/205083859"
      ],
      [
        "Ken Chao",
        "2024-01-28 13:55:05",
        "does it mean in future, US has to make extra and bigger financial provision for possible corrupt practice in its financial support to ukraine ",
        "https://www.investing.com/members/206314812"
      ],
      [
        "Mark Jannetty",
        "2024-01-28 17:27:45",
        "that's where Biden gets his 10% from",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Matt Voo",
        "2024-01-28 08:51:05",
        "Crazy, how much more is going missing?",
        "https://www.investing.com/members/213276331"
      ],
      [
        "dave winner",
        "2024-01-28 07:11:36",
        "US needs to finance Ukraine as long as they needs.",
        "https://www.investing.com/members/219054480"
      ],
      [
        "coola dodo",
        "2024-01-28 10:58:22",
        "loser",
        "https://www.investing.com/members/209236731"
      ],
      [
        "Mark Jannetty",
        "2024-01-28 17:29:22",
        "US should do what Poland did, say we are done helping ",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Dave Bixler",
        "2024-01-28 18:57:10",
        "absolutely. anyone who's aware of history and geopolitics and this kind of a war realizes that either Ukraine can fight them with their money and our money and NATO's money, or we can fight them later with our money NATO's money and our men and women in the military's lives. anyone's denial of this doesn't understand Putin. I suggest you go back and read history because obviously nobody else in this comment section seems to understand that except for me in this other guy Dave.",
        "https://www.investing.com/members/239698618"
      ],
      [
        "Roger Miller",
        "2024-01-28 19:55:38",
        "Dave Bixler",
        "https://www.investing.com/members/205083859"
      ],
      [
        "Tommy Lambert",
        "2024-01-28 20:20:37",
        " sure, we're $33 trillion in debt but let's keep sending hudreds of millions to the most corrupt country in the world. ",
        "https://www.investing.com/members/206291862"
      ],
      [
        "Mark Gesswein",
        "2024-01-28 02:30:12",
        "Hell, I’d be willing to bet less than HALF of all the money and weapons the US sent to Ukraine actually made it to the front lines. Ukraine has been a money laundering operation since before Russia invaded Crimea.",
        "https://www.investing.com/members/245851936"
      ],
      [
        "Dave Bixler",
        "2024-01-28 19:00:49",
        "You'd bet? How much and where's the proof? honestly either put up or shut up. Oh I'm sorry, there isn't any. less than half? I don't think you understand how the procurement process works but whatever. in this comment section I feel like I'm talking to it bunch of high school kids that just got out of their first history class and doesn't understand how geopolitics actually works. You were probably all for the war in Afghanistan and how many lives did we lose in it and over a trillion dollars missing. I think that's a bigger fish to fry then what's going on with Ukraine. at least we're not the one losing lives.",
        "https://www.investing.com/members/239698618"
      ],
      [
        "Tom Paj",
        "2024-01-28 00:40:12",
        "40mil? That was just only one pocket… check suitcases…",
        "https://www.investing.com/members/246866671"
      ],
      [
        "Sien Hii",
        "2024-01-28 00:10:08",
        "40mil only tip of the iceberg",
        "https://www.investing.com/members/203187810"
      ],
      [
        "Mark Jannetty",
        "2024-01-28 00:03:24",
        "corruption in Ukraine? you don't say🤣",
        "https://www.investing.com/members/241633026"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/ukraine-says-it-uncovers-mass-fraud-in-weapons-procurement-3285022",
  "paragraph": "© Reuters. A Ukrainian serviceman of 80th Separate Galician Air Assault Brigade prepares shells to fire a L119 howitzer towards Russian troops, amid Russia's attack on Ukraine, at a position near Bakhmut in Donetsk region, Ukraine January 25, 2024. REUTERS/Inna Vare\n(Reuters) - Ukraine's SBU security service said on Saturday it had uncovered a corruption scheme in the purchase of arms by the country's military totalling the equivalent of about $40 million. The announcement of mass procurement fraud, confirmed by Ukraine's Defence Ministry, will have a huge resonance in a country beleaguered by Russia's nearly two-year-old invasion. The fight to root out endemic corruption remains a major issue as Ukraine presses its bid to secure membership in the European Union. The SBU said an investigation had \"exposed officials of the Ministry of Defence and managers of arms supplier Lviv Arsenal, who stole nearly 1.5 billion hryvnias in the purchase of shells.\" \"According to the investigation, former and current high-ranking officials of the Ministry of Defence and heads of affiliated companies are involved in the embezzlement.\" The embezzlement, it said, involved the purchase of 100,000 mortar shells for the military. The SBU said a contract for the shells was clinched with Lviv Arsenal in August 2022 - six months into the war - and payment was made in advance, with some funds transferred abroad. But no arms were ever provided, the statement said, with some funds then moved to other foreign accounts. The statement said five individuals had been served \"notices of suspicion\" - the first stage in Ukrainian legal proceedings - both in the ministry and the arms supplier. One suspect, it said, was detained while trying to cross the Ukrainian border. Corruption within the military has been a particularly sensitive issue in Ukraine as it tries to maintain wartime public morale and present its case to join the 27-nation EU. \nDefence Minister Oleksii Reznikov was dismissed last September over various corruption cases despite enjoying a solid reputation in representing Ukraine in its discussions with Western allies. Although he was not alleged to have engaged personally in corruption, several cases hit the military under his stewardship, one for supplying troops with food, another over procuring suitable clothing for servicemen."
}