{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBU08E_L.jpg",
  "title": "German police arrest three more over alleged Cologne Cathedral attack plot",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 31, 2023 07:11PM ET",
    "Updated Dec 31, 2023 07:21PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Kiku Alex",
        "2024-01-01 07:44:10",
        "what are these Muslims looking for in the Satanist West?\nthey want to colonize Europe, thanks to Merkel and the socialist parties that welcomed these primitives.",
        "https://www.investing.com/members/255559667"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/german-police-arrest-three-more-over-alleged-cologne-cathedral-attack-plot-3264993",
  "paragraph": "© Reuters. FILE PHOTO: German police secure the cathedral in central Cologne, Germany, December 23, 2023. REUTERS/Thilo Schmuelgen/File Photo\n(Reuters) - Police on Sunday detained three further suspects in an alleged Islamist plot to attack Germany's famed Cologne Cathedral on New Year's Eve, authorities said. The alleged attackers had planned to use a car to attack the 800-year-old Gothic edifice by the Rhine river, Cologne police director Frank Wissbaum told a news conference.  The method of the planned attack was unclear, but an underground car park below the cathedral had been searched with explosives sniffer dogs overnight, he told reporters. \"The three people are now securely in custody, which we are very glad about since they can no longer communicate with each other,\" he said. Wissbaum said investigators had found evidence late on Saturday that linked the three to a 30-year-old Tajik man with alleged ties to the Islamic State militant movement, who has been in custody since Dec. 24. Federal authorities were continuing their investigation into what he termed a \"network of individuals\" from Central Asia with links to several German states and European countries. No details were given on the identity or background of the people now in custody. The suspects were detained in the western cities of Duisburg, Herne and Noervenich, police said, and communications devices were seized during searches of their apartments. Security has been stepped up in and around the cathedral ahead of a New Year's Eve service. Police warned the public not to be concerned if they saw officers carrying machine guns and body armour. \nThousands of extra police are also patrolling in Berlin, where celebrations last year were overshadowed by violent clashes, with revelers barracking first responders attempting to reach the sick. Police in the capital are also on guard after a pro-Palestinian solidarity demonstration scheduled for midnight was banned. Many Muslims in Germany are unhappy with the support shown for Tel Aviv in its war against Hamas."
}