{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBO04N_L.jpg",
  "title": "Hamas, Islamic Jihad reject Gaza gov. overhaul for permanent ceasefire - Egyptian sources",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 25, 2023 08:05AM ET",
    "Updated Dec 25, 2023 12:25PM ET"
  ],
  "comments": [
    3,
    [
      [
        "chess reed",
        "2023-12-25 18:32:15",
        "How long more will it take for the world to acknowledge that piece is IMPOSSIBLE with muslims FULL STOP. Even egypt with israel is not at piece but made a 'long term truce' there own sake. I promise if egypt (or even Saudis) think they have the power to destroy israel, there WOULD do it. The 'piece makers' are living in illusion!",
        "https://www.investing.com/members/207347322"
      ],
      [
        "Jimmy Doodoo",
        "2023-12-25 16:36:00",
        "K.i.l.l. them all then.",
        "https://www.investing.com/members/240314649"
      ],
      [
        "Alex Zlotnikov",
        "2023-12-25 14:03:50",
        "Hammas are expert rejects ",
        "https://www.investing.com/members/230319322"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/hamas-islamic-jihad-reject-giving-up-power-in-return-for-permanent-ceasefire--egyptian-sources-3263249",
  "paragraph": "© Reuters. Smoke rises over Gaza, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, as seen from southern Israel, December 25, 2023. REUTERS/Violeta Santos Moura\nBy Ahmed Mohamed Hassan and Nidal al-Mughrabi CAIRO (Reuters) -Hamas and the allied Islamic Jihad have rejected an Egyptian proposal that they relinquish power in the Gaza Strip in return for a permanent ceasefire, two Egyptian security sources told Reuters on Monday. Two officials from Hamas and the Islamic Jihad groups later separately denied what the sources said about the talks. Izzat al-Rishq, a member of Hamas' political bureau, added: \"There can be no negotiations without a complete stop to the aggression.\" \"The Hamas leadership is aiming with all its might for a complete, not temporary, end to the aggression and massacres of our people,\" he said, referring to the more than 20,000 Palestinians killed during the 11-week war with Israel. Speaking on condition of anonymity, a senior Islamic Jihad official familiar with the Cairo talks echoed al-Rishq's denial. The Egyptian sources said that both Hamas and Islamic Jihad, which have been holding separate talks with Egyptian mediators in Cairo, had rejected offering any concessions beyond the possible release of more hostages seized on Oct. 7 when militants broke into southern Israel, killing 1,200 people. Egypt proposed a \"vision\" rather than a concrete plan, also backed by Qatari mediators, that would involve a ceasefire in exchange for the release of more hostages, and lead to a broader agreement involving a permanent ceasefire along with an overhaul of leadership in Gaza, which is currently led by Hamas. Egypt proposed elections while offering assurances to Hamas that its members would not be chased or prosecuted, but the Islamist group rejected any concessions other than hostage releases, the sources said. More than 100 hostages are still believed to be held in Gaza. A Hamas official who recently visited Cairo had earlier declined to comment directly on specific offers of more temporary humanitarian truces and indicated the group's rejection by repeating its official stance. \"We also said (to Egyptian officials) that the aid for our people must keep going and must increase and it must reach all the population in the north and the south,\" the official said. \"After the aggression is stopped and the aid increased we are ready to discuss prisoner swaps,\" the official added. ISLAMIC JIHAD Islamic Jihad, which also holds hostages in custody in Gaza, has echoed that stance. An Islamic Jihad delegation led by its leader Ziad al-Nakhala is currently in Cairo to exchange ideas with Egyptian officials over prisoner swap offers and other issues, but an official said the group had set an end to Israel's military offensive as a pre-condition for further negotiations.  Islamic Jihad insists, the official said, that any prisoner swap must be based on the principle of \"all for all\", meaning the release of all hostages held in Gaza by Hamas and Islamic Jihad in return for freeing all Palestinians jailed in Israel. Separately, Islamic Jihad official Ali Abu Shaheen later told Reuters by phone from Lebanon: \"The movement reaffirmed its position that the aggression against the Palestinian people must be ended and that it wasn't in favour of temporary truces.\"  Abu Shaheen confirmed that Egyptian officials had presented a set of ideas but did not provide any details. \"The Egyptian brothers presented a paper, of ideas and general principles for discussion. We will study those ideas at the level of the leadership of the movement and in consultation with other Palestinian factions to reach a unified position,\" said Abu Shaheen. \nBefore the war, there were 5,250 Palestinians in Israeli jails, but the number has now grown to around 10,000 as Israel has arrested thousands more in the West Bank and Gaza since Oct 7, according to the Palestinian Prisoners Association. Overnight into Monday, Gaza endured one of its deadliest nights in the 11-week-old war. Palestinian health officials said at least 70 people had been killed by an Israeli airstrike in the centre of the tiny, besieged Gaza Strip."
}