{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK101H1_L.jpg",
  "title": "Factbox-Who are Trump's top presidential campaign aides?",
  "category": "Politics",
  "publisher": "Reuters",
  "date": "Published Feb 01, 2024 06:37AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/politics/factboxwho-are-trumps-top-presidential-campaign-aides-3289684",
  "paragraph": "© Reuters. FILE PHOTO: Chris LaCivita, co-manager of Republican presidential candidate former U.S. President Donald Trump’s campaign, talks to reporters before a campaign rally in Durham, New Hampshire, U.S., December 16, 2023. REUTERS/Brian Snyder/File Photo\n(Reuters) - A tight, disciplined inner of circle of fiercely loyal aides have helped propel former President Donald Trump to the forefront of the Republican Party's White House contest, putting him on the verge of securing the nomination. See main story. Here's the lowdown on six of those figures:  SUSIE WILES As co-campaign manager of Trump's 2024 bid alongside Chris LaCivita, Wiles oversees all aspects of the campaign, ensuring the candidate's message is reaching the target audience as well as supervising the budget, hiring, travel and the broader team. The 66-year-old is a well-regarded Florida strategist who has worked in Republican politics for more than four decades. One of her first experiences, according to her LinkedIn profile, was working as deputy director of scheduling for Ronald Reagan's 1980 presidential campaign. She went on to become scheduler for Reagan during his first year in office. Wiles was hired to help Trump's campaign win Florida in the 2016 election, securing a major upset against Democrat Hillary Clinton. In 2020 Wiles helped him win Florida again. On her LinkedIn profile, she says she thrives under pressure and lists critical thinking as her top specialty. She counts herself as a fan of the Jacksonville Jaguars football team. On the rare occasions she engages with the press, she is usually brief and careful with her remarks. CHRIS LACIVITA LaCivita, 57, is co-campaign manager, sharing broad oversight and strategic duties with Wiles. A former U.S. Marine, LaCivita was awarded the Purple Heart in 1991 for wounds suffered in the Gulf War. He has since become a veteran Republican operative who has worked on a number of state and federal campaigns, including the 2016 presidential bid of Kentucky Senator Rand Paul and the re-election campaign of Wisconsin Senator Ron Johnson in 2022. After Paul dropped out of the 2016 contest, LaCivita joined the Republican National Committee and helped thwart a challenge to Trump's nomination on the convention floor. During the 2020 presidential race, LaCivita ran a pro-Trump super PAC. He later joined Make America Great Again Inc - another Trump-aligned outside group - as a strategist before being hired by the former president's campaign in late 2022. LaCivita can be brash in attacking political foes. He repeatedly mocked the Never Back Down super PAC backing Ron DeSantis as \"Always Back Down\". This week he posted a poster for the 1994 comedy classic \"Dumb and Dumber\" on social media in reference to Trump rival Nikki Haley and a group backing her. Prior to his work for Trump, he was best known as an adviser to the Swift Boat Veterans group, which attacked the Vietnam War record of Democrat John Kerry during his presidential campaign in 2004.  DAN SCAVINO Dan Scavino, 48, is one of Trump's longest-serving aides, going back to the 1990s when he served as a golf caddie. Scavino has been at Trump's side throughout three campaigns for president and four years in the White House, where he occupied a tiny office just steps away from the Oval Office. He is a close confidant of the former president and a digital expert, recording videos of Trump's campaign appearances for use on social media. A source familiar with the inner workings of the campaign operation said Scavino is one of the few people around Trump who goes back to the years before the Republican immersed himself in politics. Trump often credits Scavino for playing a major role in helping him win the presidency in 2016. \"Trump likes having reliable people around him who are not there to manipulate him or make money off him and Dan fits into this category,\" the source said.  JASON MILLER Jason Miller is a senior campaign adviser with a focus on communications strategy and trying to shape reporting on Trump through frequent contacts with reporters. A longtime political strategist, Miller initially worked for Texas Senator Ted Cruz in the 2016 presidential campaign, which pitted him against Trump. Cruz eventually dropped out of the Republican primary, and Miller joined Trump's team. He also worked on Trump's unsuccessful 2020 campaign. Like his boss, Miller is nearly always dressed in a full suit and tie, and often appears on cable TV news to defend Trump and attack his political opponents. In the past Miller has been an on-air contributor to both CNN and Newsmax, a conservative network that is often supportive of Trump.  STEVEN CHEUNG Steven Cheung, 41, has worked on all three of Trump's campaigns for president starting in 2016. He is currently a communications director who works closely with Jason Miller to handle the press. Cheung had cut his teeth as a communications and speechwriting intern in the California governor's office. He went on to work on a series of political campaigns before joining the Ultimate Fighting Championship (UFC) mixed martial arts franchise as director of communications and public affairs. While softly spoken and outwardly polite, he is one of Trump's chief attack dogs and his statements can take on a biting and acerbic tone when he is defending his boss. For example, last year when asked by the media for comment about a book critical of Trump by an ex-Trump administration, Cheung called him a \"sack of shit\" and said his book belonged in the trash or \"should be repurposed as toilet paper.\"  BRIAN JACK \nBrian Jack, 35, has taken the lead in coordinating a state-by-state effort to round up endorsements from lawmakers - a critical component of the campaign's effort to elicit support within the party. He held a series of positions during the Trump administration, including White House political director. Jack started out in the 2016 presidential campaign working for Ben Carson, a retired neurosurgeon who went on to become Housing and Urban Development Secretary in the Trump administration. Once Carson dropped out of the 2016 race, Jack joined the Trump campaign as delegate director and later oversaw operations in battleground states, according to his LinkedIn page."
}