{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0F0XF_L.jpg",
  "title": "Lithuania broke human rights laws in case tied to CIA detention program, European court rules",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 16, 2024 04:50PM ET",
    "Updated Jan 16, 2024 04:56PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/lithuania-broke-human-rights-laws-in-case-tied-to-cia-detention-program-european-court-rules-3275611",
  "paragraph": "2/2\n© Reuters. FILE PHOTO: Empty room inside building used by CIA to house Iraq and Afghanistan extraordinary rendition prisoners in Vilnius, Lithuania, January 20, 2022. REUTERS/Janis Laizans/File Photo\n2/2\nWASHINGTON (Reuters) - Lithuania broke European human rights laws by allowing the CIA to subject an alleged 9/11 suspect to \"inhuman treatment\" in a secret interrogation center in the Baltic country, the European Court of Human Rights ruled on Tuesday. In a press release issued on Tuesday, the court said Mustafa Ahmed Adam al-Hawsawi raised multiple complaints of torture, ill treatment and unacknowledged detention in 2005-2006 when he was held at a secret facility in Lithuania run by the CIA. Al-Hawsawi is now held in Guantanamo Bay on suspicion of being a facilitator and financial manager of al Qaeda. While held in Lithuania, he experienced an extremely harsh detention regime, according to the press release, including solitary confinement, the continuous use of leg shackles and exposure to noise and light. \"The cumulative effects of such a detention regime had amounted to inhuman treatment within the meaning of the Convention, which the Lithuanian authorities had enabled by cooperating with the CIA,\" the release said. Asked for comment, the Lithuanian embassy in Washington pointed to an article published by the Baltic News Service quoting Lithuania's Justice Ministry as saying Lithuania would comply with the court's decision to award Hawsawi 100,000 Euros ($108,750) in compensation.  The chamber held unanimously that there had been violations of the prohibition of inhuman or degrading treatment/investigation because of Lithuania's failure to effectively investigate al-Hawsawi's allegations \"and because of its complicity in the CIA secret detainee programme.\" It also held that there were violations to articles relating to the rights to a fair trial and life, as well as abolition of the death penalty, according to the press release, because Lithuania assisted al-Hawsawi's \"transfer from its territory in spite of a real risk that he could face a flagrant denial of justice and the death penalty.\" The release said the chamber held there also have been violations to right to liberty and security, right to respect for private life and right to an effective remedy. The court said it gained key information from a U.S. Senate panel report from 2014 that said the CIA's interrogation of al Qaeda terrorism suspects in secret prisons was more brutal than policymakers were told and in some cases amounted to torture that failed to generate effective intelligence. “While not commenting on the specific case, I’d note that CIA’s detention and interrogation program ended in 2009,\" a CIA spokesperson said. The Guantanamo detention center in Cuba was established by Republican President George W. Bush in 2002 to house foreign terrorism suspects following the 2001 hijacked plane attacks on New York and the Pentagon that killed about 3,000 people. Its population grew to a peak of about 800 inmates before it started to shrink. \nIt came to symbolize the excesses of the U.S. \"war on terror\" because of harsh interrogation methods that critics have said amounted to torture. ($1 = 0.9195 euros)"
}