{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK150LM_L.jpg",
  "title": "Fake Biden robocall traced to Texas-based Life Corp, officials say",
  "category": "Politics",
  "publisher": "Reuters",
  "date": [
    "Published Feb 06, 2024 10:52AM ET",
    "Updated Feb 06, 2024 01:50PM ET"
  ],
  "comments": [
    5,
    [
      [
        "rob finch",
        "2024-02-07 00:56:34",
        "they are only pretending the robocaller is Biden so they can use less AI chips.",
        "https://www.investing.com/members/207168654"
      ],
      [
        "Barry Nickerson",
        "2024-02-06 23:25:34",
        "I told you all the day this story broke that this would be the one robo-caller that they would nab.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "EL LA",
        "2024-02-06 18:31:39",
        "We also have a US border pretending to be a US border.",
        "https://www.investing.com/members/240182636"
      ],
      [
        "First Last",
        "2024-02-06 19:09:22",
        "If only the retrumplicans prioritize country over party and quit reneging on the immigration/funding deal to leave it for Trump to manipulate as an election wedge issue.  He's not even qualified to run.",
        "https://www.investing.com/members/200601457"
      ],
      [
        "Barry Nickerson",
        "2024-02-06 23:26:34",
        "First Last",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Alejandro Pieroni",
        "2024-02-07 02:50:44",
        "Dont complain european invader",
        "https://www.investing.com/members/205011039"
      ],
      [
        "First Last",
        "2024-02-07 03:36:10",
        "Barry Nickerson",
        "https://www.investing.com/members/200601457"
      ],
      [
        "Ac Tektrader",
        "2024-02-06 18:22:11",
        "more election fraud and voter suppression by Trump's maga Republican party and it's fanatical cult members.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "First Last",
        "2024-02-06 18:12:23",
        "Retrumplicans have for years been the main source of election interference in the US.",
        "https://www.investing.com/members/200601457"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/politics/new-hampshire-attorney-general-fake-biden-robocall-traced-to-texasbased-life-corp-3294211",
  "paragraph": "© Reuters. FILE PHOTO: U.S. President Joe Biden departs after attending Mass at St. Edmond's Catholic Church in Rehoboth Beach, Delaware, U.S., January 20, 2024. REUTERS/Joshua Roberts/File Photo\nBy Steve Holland (Reuters) -A fake robocall imitating President Joe Biden's voice and attempting to dissuade people from voting for him in New Hampshire's primary election has been traced back to Texas-based Life Corp, the state attorney general said on Tuesday. Attorney General John Formella told a news conference in Concord, New Hampshire, that a cease-and-desist letter has been sent to the company, run by Walter Monk, and a criminal investigation is under way. \"We are committed to keeping our elections free and fair,\" Formella said, noting that the robocall appeared to be an attempt to use artificial intelligence to interfere with New Hampshire's Democratic primary election. Biden won the Jan. 23 nominating contest by a wide margin despite being a write-in candidate. Neither Life Corp nor Monk immediately responded to requests for comment. Formella, a Republican, said the robocall was made on Jan. 21 to thousands of Democratic voters and was being investigated as an attempt to suppress voting in the nominating contest. \"It's important that you save your vote for the November election ... voting this Tuesday only enables the Republicans in their quest to elect Donald Trump again,\" the call had said. Formella said traceback technology was used to trace the call back to the originating provider and identified the source as Life Corporation. The originating voice service provider was Lingo Telecom, a Texas-based service provider, he said. Lingo Telecom did not immediately respond to a request for comment. The New Hampshire attorney general's office said that after Lingo Telecom was informed that the calls were being investigated, Lingo Telecom suspended services to Life Corp.  \"At the New Hampshire Department of Justice, we have issued a cease-and-desist letter to Life Corporation, which orders the company to immediately cease violating New Hampshire election laws,\" said Formella. \"We have also ordered a criminal investigation.\" The Federal Communications Commission said its enforcement bureau had issued a cease-and-desist letter against Lingo Telecom demanding it \"immediately stop supporting unlawful robocall traffic on its networks.\" Biden reelection campaign chair Julie Chavez Rodriguez issued a statement thanking New Hampshire authorities for moving quickly on the robocall. “Disinformation aimed at suppressing voting and deliberately undermining free and fair elections is an unacceptable threat, and we commend the New Hampshire attorney general for taking the matter seriously and moving swiftly as a powerful example against further efforts to disrupt democratic elections,\" she said. \nNew Hampshire officials said they were also looking into allegations that \"the recorded message was likely made using software from ElevenLabs\" but could not confirm that now. In a statement, a spokesperson for ElevenLabs said it could not comment on specific incidents but takes \"any incidents of misuse extremely seriously\" and has \"mechanisms in place to assist authorities or relevant parties in taking steps to address them.\""
}