{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0A0XH_L.jpg",
  "title": "Some US aid to Ukraine poorly tracked -Pentagon inspector general",
  "category": "World news",
  "publisher": "Investing.com",
  "date": [
    "Published Jan 11, 2024 02:55PM ET",
    "Updated Jan 11, 2024 11:26PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Mark Jannetty",
        "2024-01-11 21:29:47",
        "check Bidens bank account ",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Stephen Fa",
        "2024-01-12 13:51:43",
        "exactly",
        "https://www.investing.com/members/200910591"
      ],
      [
        "Brad Albright",
        "2024-01-12 18:15:26",
        "And the frivolous weigh in.",
        "https://www.investing.com/members/236251128"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/some-us-aid-to-ukraine-poorly-tracked-pentagon-inspector-general-3272801",
  "paragraph": "© Reuters. Military aid, delivered as part of the United States of America's security assistance to Ukraine, is unloaded from a plane at the Boryspil International Airport outside Kyiv, Ukraine February 11, 2022. REUTERS/Serhiy Takhmazov/File Photo\nWASHINGTON (Reuters) - The Pentagon's inspector general released a report on Thursday that said the United States military had not properly tracked about $1 billion in weapons sent to Ukraine.  WHY IT'S IMPORTANT  The inspector general's report found that prior to December 2022, the delinquency rate was at about 59% of weapons that required monitoring. That fell by 27 percentage points from February to June 2023 because of better processes. Weapons are delinquent if they have not been inventoried in a certain time.  The report did not determine whether any assistance had been diverted or not, saying it was beyond the scope of the review. KEY QUOTES \"While the DoD (Department of Defense) has improved execution of EEUM (enhanced end use monitoring) since the full‑scale invasion began in February 2022, the DoD did not fully comply with the EEUM program requirements for defense article accountability in a hostile environment.\" \"Office of Defense Cooperation–Ukraine (ODC‑Ukraine) personnel have not been able to conduct initial inventories on all EEUM‑designated defense articles within 90 days of arrival.\" CONTEXT \nThere is a battle brewing in Congress about the future of U.S. military assistance to Ukraine. Congress has approved more than $110 billion for Ukraine since Russia's invasion. President Joe Biden has asked Congress to provide another $61 billion in aid to Ukraine, but Republicans are refusing to approve the assistance without an agreement with Democrats to tighten security along the U.S.-Mexico border."
}