{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0E062_L.jpg",
  "title": "'Don't forget Ukraine,' UN urges in aid funding appeal",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 15, 2024 02:44AM ET",
    "Updated Jan 15, 2024 07:13AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/un-appeals-for-42-billion-to-support-warravaged-ukraine-refugees-3274237",
  "paragraph": "© Reuters. A local resident removes debris at the site where a residential building was destroyed during a Russian missile strike, amid Russia's attack on Ukraine, in Odesa, Ukraine December 29, 2023. REUTERS/Nina Liashonok\nBy Gabrielle Tétrault-Farber GENEVA (Reuters) - The United Nations appealed for $4.2 billion from donors on Monday to support war-ravaged communities in Ukraine and Ukrainian refugees in 2024, as war rages nearly two years on from Russia's invasion. \"Please do not forget Ukraine while there are many other places in the world that grab our attention,\" U.N. aid chief Martin Griffiths urged diplomats in Geneva.  As part of the appeal for funding, OCHA is asking for $3.1 billion to help 8.5 million people in dire need of humanitarian aid in 2024. The U.N. refugee agency is seeking $1.1 billion to support 2.3 million Ukrainian refugees and their host communities.  The United Nations Office for the Coordination of Humanitarian Affairs (OCHA) received 67% of the $3.9 billion it appealed for last year. It has reduced its appeal for 2024 to prioritise the people most in need as other humanitarian crises around the globe, including in Gaza and Sudan, require urgent funding. \"We are deliberately reducing the amount of money we are asking for -- not because we think the needs are diminishing or the war is getting any better for the people of Ukraine -- but because we need to prioritise,\" Griffiths said.  \"We understand well that we are up in a severe competition with other parts of the world, the brutal truth of the competition of aid programmes with each other.\" OCHA said more than 14.6 million people, or 40% of Ukraine's population, will need humanitarian assistance this year due to Russia's invasion and attacks. More than 3.3 million of the people in need live in front-line communities in the east and the south of the country, including in territories occupied by Russia, which OCHA humanitarian convoys have been unable to access since the start of the conflict. \"We continue to remain in negotiation with the Russian government about how to get access to those people who are perhaps in the most urgent of need, since it has now been two years since any real, effective, regular, reliable humanitarian aid has reached them,\" Griffiths told reporters. Russia's invasion, launched in February 2022, has forced some 6.3 million people to flee abroad. Four million people, including nearly one million children, remain displaced within the country, according to OCHA. \n\"Let us not forget. I'm very worried that two years into this crisis, we already have to say this,\" said Filippo Grandi, the U.N. High Commissioner for Refugees. \"We had to say, until recently, 'don't forget other crises' because everybody was focusing on this one. This volatility is a killer, literally.\""
}