{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0S03K_L.jpg",
  "title": "Anti-Muslim incidents jump in US amid Israel-Gaza war",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 29, 2024 12:03AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/antimuslim-incidents-jump-in-us-amid-israelgaza-war-3285421",
  "paragraph": "© Reuters. FILE PHOTO: People raise flags and posters during a rally held by American Muslims for Palestine calling for a cease fire in Gaza near the Washington Monument in in Washington, U.S., October 21, 2023. REUTERS/Bonnie Cash/File Photo\nBy Kanishka Singh WASHINGTON (Reuters) - Complaints of anti-Muslim and anti-Palestinian discrimination and hate in the U.S. rose by about 180% in the three months after Oct. 7 following Hamas' attack on Israel and Israel's subsequent assault on Hamas-governed Gaza, an advocacy group said on Monday. WHY IS IT IMPORTANT?  Rights advocates have noted a rise in Islamophobia and anti-Palestinian bias in the U.S. and elsewhere since the eruption of war in the Middle East. Among incidents in the U.S. that raised alarm were a November shooting in Vermont where three students of Palestinian descent were shot and the fatal stabbing of a 6-year-old Palestinian American child in Illinois in October. BY THE NUMBERS The Council on American-Islamic Relations (CAIR) said on Monday it has received 3,578 complaints during the last three months of 2023, amid what it called \"an ongoing wave of anti-Muslim and anti-Palestinian hate.\"  The figure is a 178% rise from complaints in the same period from a year earlier. Complaints of employment discrimination led the list with 662 instances; hate crimes and hate incidents were reported 472 times; and education discrimination 448 times, the organization said. Earlier this month, the Anti-Defamation League said that in the three months after Oct. 7, U.S. antisemitic incidents rose by 360% compared to the prior year. CONTEXT: US SECURITY ALERTS  \nThe U.S. government recently issued security guidance for faith-based communities amid heightened antisemitism and Islamophobia since the Oct. 7 attack on Israel by Palestinian Islamist group Hamas that killed 1,200, and Israel's subsequent military retaliation in Gaza that the local health ministry says has killed over 26,000 Palestinians or more than 1% of Gaza's 2.3 million population. The U.S. Justice Department is monitoring rising threats against Jews and Muslims amid the conflict. President Joe Biden has condemned antisemitism and Islamophobia."
}