{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0B0D5_L.jpg",
  "title": "US and Britain strike Yemen in reprisal for Houthi attacks on shipping",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 12, 2024 06:01AM ET",
    "Updated Jan 12, 2024 06:16PM ET"
  ],
  "comments": [
    3,
    [
      [
        "Leila Graf",
        "2024-01-13 01:49:25",
        "・●・○・●As a newbie about to invest, you must have a long term mindset. Be careful on money usage, if you're not spending to earn back, then stop spending. Never claim to know Ask questions and it's best you work with a financial advisor. I want to thank you PATRICIA For being my source of crypto education Get involve For more WHASPP +🄅🄅7,4,6,🄃2,1,2,3,4,0,・● - ・○",
        "https://www.investing.com/members/256262069"
      ],
      [
        "P Ch",
        "2024-01-12 20:31:15",
        "what's the big deal, take the longer route, whatever",
        "https://www.investing.com/members/238293765"
      ],
      [
        "Julio Osorio",
        "2024-01-12 13:01:44",
        "Oil prices will going over 100 again",
        "https://www.investing.com/members/200252605"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/us-britain-carry-out-strikes-across-yemen-in-retaliation-for-houthi-attacks-3273329",
  "paragraph": "By Phil Stewart, Idrees Ali and Mohammed Ghobari WASHINGTON/ADEN, Yemen (Reuters) -U.S. and British warplanes, ships and submarines launched dozens of air strikes across Yemen against Houthi forces in retaliation for months of attacks on Red Sea shipping that the Iran-backed fighters cast as a response to the war in Gaza. Witnesses confirmed explosions at military bases near airports in the capital Sanaa and Yemen's third city Taiz, a naval base at Yemen's main Red Sea port Hodeidah and military sites in the coastal Hajjah governorate. \"These targeted strikes are a clear message that the United States and our partners will not tolerate attacks on our personnel or allow hostile actors to imperil freedom of navigation,\" U.S. President Joe Biden said.  White House spokesperson John Kirby (NYSE:KEX) said the strikes in the early hours of Friday had targeted the Houthis' ability to store, launch and guide missiles or drones. The Pentagon said the U.S.-British assault reduced the Houthis' capacity to launch attacks, especially complex operations such as those they carried out earlier in the week.  The U.S. military said 60 targets in 28 locations had been hit, using more than 150 munitions.  \"I know we have degraded (their) capability,\" U.S. Lieutenant General Douglas Sims told a media briefing. \"I don't believe that they would be able to execute the same way they did the other day. But we will see.\"  The Houthis, who have controlled most of Yemen for nearly a decade, said five fighters were killed in 73 air strikes. They vowed to retaliate and continue their attacks on shipping, which they say are intended to support Palestinians against Israel. The UK Maritime Trade Operations information hub said it had received reports of a missile landing in the sea around 500 metres (1,600 feet) from a ship about 90 nautical miles southeast of the Yemeni port of Aden. The shipping security firm Ambrey identified it as a Panama-flagged tanker carrying Russian oil.  In Yemen, crowds gathered in cities. Drone footage on the Houthis' al-Masirah TV showed hundreds of thousands of people in Sanaa chanting slogans denouncing Israel and the United States. \"Your strikes on Yemen are terrorism,\" said Mohammed Ali al-Houthi, a member of the Houthi Supreme Political Council. \"The United States is the Devil.\" Biden, whose administration removed the Houthis from a State Department list of \"foreign terrorist organisations\" in 2021, was asked by reporters if he felt the term \"terrorist\" described the movement now. \"I think they are,\" he said.  At the United Nations, the Security Council was due to meet late on Friday about the Red Sea crisis. Sparked by Israel's onslaught on the Palestinian enclave of Gaza, which is ruled by another Iran-backed Islamist group, Hamas, it has raised concerns about the potential for a larger Middle East conflict.  Russia's U.N. Ambassador Vassily Nebenzia said the U.S. and Britain \"singlehandedly triggered a spillover of the conflict (in Gaza) to the entire region.\"  In Washington, Kirby said, \"We're not interested in ... a war with Yemen.\"  In Yemen, a poor country only just emerging from nearly a decade of war that brought millions to the brink of famine, people fearing an extended new conflict queued at gas stations. \"We are rushing to fuel our car and we bought flour and rice in case of any emergency because we are expecting the Houthis to respond and an escalation to take place,\" said Ali Ahmad, 52.  OIL PRICE JUMPS The price of Brent crude oil rose more than $2 on concern that supplies could be disrupted, before later giving up half its gain. Biden expressed concern about the impact of the Middle East conflict on oil prices. Commercial ship tracking data showed at least nine oil tankers stopping or diverting from the Red Sea. INTERTANKO, an oil tanker industry body, sent a note to members saying the U.S.-led Combined Maritime Forces had advised ships to \"stay well away from Bab al-Mandab\", the mouth of the Red Sea where 15% of global seaborne trade passes, for several days. Houthi attacks have forced commercial ships to take a longer, costlier route around Africa, creating fears of a new bout of inflation and supply chain disruption. Container shipping rates for key global routes have soared this week. Carmakers Tesla (NASDAQ:TSLA) and Volvo (OTC:VLVLY), owned by China's Geely, said delays to parts shipments from Asia had forced them to suspend some production in Germany and Belgium respectively, the first big manufacturers to make such announcements. MONTHS OF RAIDS The strikes follow months of raids by Houthi fighters, who have boarded ships they claimed were Israeli or heading for Israel. The United States and some allies sent a naval task force in December, and recent days saw increasing escalation. On Tuesday, the United States and Britain shot down 21 missiles and drones. However, not all major U.S. allies chose to back the strikes. The Netherlands, Australia, Canada and Bahrain provided logistical and intelligence support, while Germany, Denmark, New Zealand and South Korea signed a joint statement defending the attacks and warning of further action. But Italy, Spain and France chose not to sign or participate, fearing a wider escalation. Egypt, which controls the Suez Canal linking the Red Sea to the Mediterranean, expressed deep concern. A senior U.S. official accused Tehran of providing the Yemeni group with military capabilities and intelligence to carry out their attacks.  \nIran condemned the strikes. In a posting on the X platform, Iranian Foreign Minister Hossein Amirabdollahian said the White House could \"restore security across the region\" by stopping its \"all-out military and security cooperation\" with Israel against the people of Gaza and the West Bank. Iran-backed groups have increased attacks on U.S. targets in several countries since Hamas militants attacked Israel on Oct. 7, killing 1,200 people and precipitating the war in Gaza, which has so far killed more than 23,000."
}