{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "Yemen's Houthis claim responsibility for Red Sea container ship attack",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 26, 2023 08:05AM ET",
    "Updated Dec 26, 2023 06:15PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/explosions-reported-in-red-sea-shipping-lane-off-yemen-coast-3263536",
  "paragraph": "DUBAI (Reuters) - Yemen's Iran-backed Houthi militia claimed responsibility for a missile attack on Tuesday on a container ship in the Red Sea and for an attempt to attack Israel with drones. MSC Mediterranean Shipping said there were no injuries to its crew from the attack on its ship, the United VIII, en route from Saudi Arabia to Pakistan. It said the ship had informed a nearby coalition naval warship that it had come under attack and had taken evasive manoeuvres. Israel said separately that its aircraft had intercepted a hostile aerial target in the Red Sea area. Houthi military spokesman Yahya Sarea in a televised address said the group had targeted the vessel, which he identified as the MSC United, after the crew failed to respond to warnings. He also said the Houthis had carried out a military operation targeting Eilat and other areas in Israel, which he referred to as occupied Palestine. He did not say whether any of the targets were successfully hit. U.S. fighter jets, a navy destroyer and other assets shot down in the Red Sea 12 drones, three anti-ship ballistic missiles, and two cruise missiles fired by the Houthis, U.S. Central Command said. There was no damage to ships and no reported injuries, it wrote on social media platform X. The Houthis, who control much of Yemen including the capital, have since October attacked commercial vessels in the Red Sea they say have Israeli links or are sailing to Israel, in solidarity with Palestinians in Gaza. Britain's United Kingdom Maritime Trade Operations Authority earlier reported two incidents of explosions in the Red Sea off of the coast of Yemen involving missiles and drones near a vessel. It also said there were no reported injuries. The reported incidents come a week after the United States announced a multinational maritime security initiative in the Red Sea in response to attacks on vessels by Yemen's Houthis. \nSeveral shipping lines have suspended operations through the Red Sea waterway in response to the attacks, instead taking the longer journey around Africa. The Houthis have vowed to continue their attacks until Israel halts the conflict in Gaza, and warned that it would attack U.S. warships if the militia group itself was targeted."
}