{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0H0S2_L.jpg",
  "title": "North Korea threat could change 'drastically' given Russia cooperation-US official",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 18, 2024 12:29PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/north-korea-threat-could-change-drastically-given-russia-cooperationus-official-3277607",
  "paragraph": "© Reuters. FILE PHOTO: A view shows a part of an unidentified missile, which Ukrainian authorities believe to be made in North Korea and was used in a strike in Kharkiv earlier this week, amid Russia's attack on Ukraine, in Kharkiv, Ukraine January 6, 2024. REUTERS/\nBy David Brunnstrom and Arshad Mohammed WASHINGTON (Reuters) - The nature of the security threat posed by North Korea could change \"drastically\" in the coming decade as a result of its unprecedented cooperation with Russia, the White House's senior director for arms control Pranay Vaddi said on Thursday. \"What we're seeing between Russia and North Korea is an unprecedented level of cooperation in the military sphere,\" Vaddi told Washington's Center for Strategic and International Studies think tank. \"And I say unprecedented very deliberately - We have never seen this before.\" Vaddi said it was necessary to pay close attention not just to nuclear-armed North Korea's help for Russia war in Ukraine, primarily in the form of missile systems, but \"what could be going in the other direction as well.\" \"How could that improve North Korea's capabilities? And what does that mean for our own extended deterrence posture in the region with both Korea and Japan?\" \"I think the nature of North Korea as a threat in the region could drastically change over the coming decade as a result of this cooperation,\" Vaddi said. Vaddi said the United States would continue to work with South Korea to make sure their combined \"extended deterrence\" was as credible as possible in the face of the evolving North Korea threat - a reference to the U.S. \"nuclear umbrella\" protecting allies. Asked how much of a worry it was that such allies would pursue their own nuclear defense capabilities in the face of the growing North Korean threat, Vaddi said: \"We want to make sure that the U.S. nuclear umbrella system as it has existed remains sufficient for deterring threats, including emerging threats that are emanating in Europe and Asia.\" \nRussia said on Wednesday it was developing its relations with North Korea in all areas, including \"sensitive\" ones after the North Korean foreign minister held rare talks in the Kremlin with President Vladimir Putin, who has been invited to visit the reclusive nuclear-armed country. Putin has deepened ties with North Korea since sending troops into Ukraine in 2022, and Washington has condemned what it says have been significant North Korean missile deliveries to Russia, amid concerns that Russia could be sharing weapons technology with Pyongyang in return."
}