{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK040K0_L.jpg",
  "title": "The week the Ukraine war hit home in a Russian border city",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 05, 2024 12:37PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/the-week-the-ukraine-war-hit-home-in-a-russian-border-city-3268377",
  "paragraph": "2/2\n© Reuters. People gather in a courtyard of a multi-story apartment building following what local authorities say was a Ukrainian military strike in the city of Belgorod, Russia, January 5, 2024. A sign on the badge reads: \"Belgorod region\". REUTERS/Stringer\n2/2\nBy Mark Trevelyan and Anton Zverev (Reuters) - Air raid sirens blare, and people take cover in basements. Hundreds are evacuated from their homes while experts defuse unexploded bombs. Well-wishers place heaps of flowers, toys and sweets to share their grief over the deaths of children. Scenes long familiar to Ukrainians from 22 months of war are now playing out in one of Russia's own cities. A Ukrainian attack on Dec. 30 killed 25 civilians including five children in the Russian city of Belgorod, 40 km (25 miles) from the border, according to local officials. It came a day after Russia killed at least 39 Ukrainians in its largest air attack of the war. Thousands of Ukrainian civilians have been killed in the course of the conflict that has devastated Ukrainian cities such as Bakhmut and Avdiivka. Cross-border attacks into Russia, by contrast, have caused damage but few casualties until now. So the deadly strike on the centre of Belgorod, while not comparable with the razing of whole Ukrainian cities, came as a deep shock to its residents. \"People realised there really is a war going on and it's come now to Belgorod, maybe not for the first time but the most grave and frightening,\" one local person told Reuters. The central square where revellers usually gather on New Year's Eve to watch fireworks was empty this year. Sporadic attacks have continued throughout the past week, prompting people to stay off the streets in what the person said was reminiscent of COVID-19 lockdowns. \"All these days shelling was continuing with different degrees of intensity, air raid sirens were going off quite frequently, sometimes five times a day,\" the resident said. \"Clearly no one wants to go out and wander round a deserted city catching pieces of shrapnel flying past.\" The person said they had followed the advice of authorities and sealed their windows with scotch tape to reduce the risk of flying glass in the event of a missile or drone strike nearby, although very few neighbours seemed to have done the same. The advice drew sarcasm and ridicule from some users on social media, with one person asking \"Why do we need air defences if we've got scotch tape?\" Another resident, a business owner, said some people were wedging open the entrance doors to apartment blocks with bricks, or posting notices urging residents not to lock them, in case people needed to run inside quickly during an air raid. Business had dried up, they said, adding: \"I come to work, wait for customers but there is no one. I sit for three or four hours and close.\" Both residents asked not to be named because of the risk of speaking publicly about attitudes towards the war. BROKEN GLASS Belgorod mayor Valentin Demidov said on social media that nearly 700 apartments in 88 separate buildings had been damaged in the past week, and authorities were working to replace a total of 3,700 square metres of broken glass, with a target date of Jan. 12 to complete the task. Two people were taken to hospital with injuries from shelling late on Thursday, when officials said air defences shot down 10 incoming targets. One local man, Nikolai Orlenko, said he heard a loud bang and saw a burst of flame shortly before midnight, took cover for five minutes and then emerged to find his car overturned in the courtyard outside, its rear end twisted and mangled. The business owner who spoke to Reuters said the attacks of the past week had hardened some locals in their anger towards Ukraine and led to demands for revenge.  President Vladimir Putin has said the Dec. 30 strike on Belgorod would \"not go unpunished\". Putin told the nation last month that Russia's position in the war was improving and it would continue what he calls its \"special military operation\" until its goals had been achieved. The other Belgorod resident said they felt that most people were desperate for the war to end, by whatever means. \n\"People want peace and calm so things aren't going bang every day,\" this person said. But they added: \"There's no sense that something will improve any time soon, in the city or the country as a whole. People don't believe anything will change.\""
}