{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBT04P_L.jpg",
  "title": "Serbian opposition demands annulment of Dec. 17 vote",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Dec 30, 2023 09:54AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/serbian-opposition-demands-annulment-of-dec-17-vote-3264895",
  "paragraph": "5/5\n© Reuters. An aerial view of people attending a protest organised by ProGlas, the Serbian pro-democracy movement, amid opposition claims of major election law violations in the Belgrade city and parliament races, in Belgrade, Serbia, December 30, 2023. REUTERS/Fedja\n2/5\nBy Ivana Sekularac BELGRADE (Reuters) - Thousands gathered in a square in in central Belgrade on Saturday in the biggest protest yet over parliamentary and municipal elections on Dec. 17, results of which the demonstrators want anulled. Protesters waving Serbian flags and holding a banner reading \"We do not accept\" cheered Marinika Tepic, a leader of the opposition Serbia Against Violence alliance, who has been on hunger strike since Dec. 18. The ruling Serbian Progressive Party (SNS) won 46.72% of the votes in the Dec. 17 snap parliamentary election, according to preliminary results from the state election commission.  \"These elections must be annulled,\" Tepic, who came to the stage with the help of two colleagues, told the protesters, gathered in front of the landmark Moskva hotel.  Serbia Against Violence, which placed second in the general election, has accused the SNS of widespread vote fraud, which the authorities deny.  An international monitoring mission following the vote said the SNS had gained an unfair advantage through media bias, the improper influence of President Aleksandar Vucic, and voting irregularities such as vote buying. Serbian authorities deny any irregularities. Jovana Djokovic, a 29 year old software developer, said she had come to the protest with her parents who drove to Belgrade from the central town of Kraljevo, 177 kilometres south.  \"I came here to express my disagreement with election result. I feel responsibility to be here,\" Djokovic said. \"Elections were not fair.\" The opposition has since Dec. 17 held daily protests against the election results in front of the election commission, mostly attracting several hundred people.  The Saturday protest was supported by students' organisations and by an initiative gathering public figures including prominent intellectuals and actors dubbed ProGlas.  \nSerbia Against Violence came second in the election with 23.56% of the vote. The Socialist Party of Serbia was third with 6.56%. Full results of the elections are not likely to be published until some time next month."
}