{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0A006_L.jpg",
  "title": "Russian missiles hit hotel in Ukraine's Kharkiv, 11 injured -regional governor",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 10, 2024 09:07PM ET",
    "Updated Jan 10, 2024 09:13PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/russian-missiles-hit-hotel-in-ukraines-kharkiv-11-injured-regional-governor-3271923",
  "paragraph": "5/5\n© Reuters. Rescuers stand at the site in the aftermath of a Russian missile strike on a hotel in Kharkiv, Ukraine, in this handout image released January 11, 2024. State Emergency Service of Ukraine/Handout via REUTERS \n2/5\n(Reuters) -Two Russian missiles struck a hotel late on Wednesday in the centre of Ukraine's second largest city, Kharkiv, injuring 11 people, one person seriously, the regional governor said. Pictures posted online showed many of the windows blown out and balconies destroyed with large piles of rubble in the street below. Emergency teams made their way through gaping holes in the facade to sift through rubble inside. Kharkiv Governor Oleh Synehubov, writing on Telegram, said the strike at about 10.30 p.m. local time involved S-300 missiles in the city's Kyiv district. \"Nine of those injured have been taken to medical facilities,\" Synehubov wrote on the Telegram messaging app. \"One of them, a 35-year-old man, is in serious condition.\" Visiting Turkish journalists were among the injured, he wrote. \"One missile hit next to the hotel, right by a fence. The other one hit a nearby annex,\" Kharkiv Police Chief Volodymyr Tymoshko told public broadcaster Suspilne. \"Servicemen never stayed in this hotel and just about everyone in Kharkiv knows this. It was used by journalists.\" Psychiatrist Mykhailo Bebeshko, a hotel guest, told Suspilne that he had heard no air raid alert before the missile struck. \"I was in the bathroom and that was what saved me. I fell, hit my head and then lay on the floor,\" he said. \"With a second explosion, all the doors were blown out and it was fortunate that I had been on the floor. And I shouted out to my colleagues: Everyone ok? Everyone still alive?\" Oleksandr Filchakov, head of the Kharkiv prosecutor's office, said in a video posted on Telegram, that 23 guests and eight staff were in the hotel when the missiles struck. \nKharkiv Mayor Ihor Terekhov said several homes in the district had been damaged as well as a manufacturing plant and a car showroom. The Russian Defence Ministry did not immediately respond to a request for comment."
}