{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0O0HX_L.jpg",
  "title": "Alabama gasses prisoner with nitrogen in first new execution method in decades",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 25, 2024 08:08AM ET",
    "Updated Jan 26, 2024 05:02AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Mark Jannetty",
        "2024-01-25 22:12:52",
        "why do they keep moving this story to the top? no one cares",
        "https://www.investing.com/members/241633026"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/alabama-prepares-to-carry-out-first-execution-by-nitrogen-asphyxiation-3282944",
  "paragraph": "© Reuters. Kenneth Eugene Smith, convicted for a murder-for-hire committed in 1988, and who is scheduled to be executed in the U.S. state of Alabama by asphyxiation using pure nitrogen, poses for an undated booking photo at Holman Prison in Atmore, Alabama, U.S. \nBy Evan Garcia and Jonathan Allen ATMORE, Alabama (Reuters) -Alabama on Thursday executed convicted murderer Kenneth Smith, who held his breath in vain as officials asphyxiated him with nitrogen gas, the first use of a new method of capital punishment since lethal injections began in the U.S. four decades ago. Smith, convicted of a 1988 murder-for-hire, was a rare prisoner who had already survived one execution attempt. In November 2022, Alabama officials aborted his execution by lethal injection after struggling for hours to insert an intravenous line's needle in his body.  The state has called its new closely watched protocol \"the most painless and humane method of execution known to man.\" It predicted Smith would lose consciousness in under a minute and die soon after, although witnesses on Thursday said it appeared to take several minutes longer.  Alabama has touted asphyxiation as a simpler alternative for prison systems that struggle to find either veins or the required drugs for lethal injections.  Human rights groups, United Nations torture experts and lawyers for Smith had sought to prevent it, saying the method was risky, experimental and could lead to an agonizing death or non-fatal injury. In Smith's second and final trip to the execution chamber on Thursday, executioners restrained him in a gurney and strapped a commercial industrial-safety respirator mask to his face. A canister of pure nitrogen was attached to the mask that, once flowing, deprived him of oxygen.  The execution began at 7:53 p.m. (0153 GMT Friday) and Smith was declared dead at 8:25 p.m. (0225 GMT), prison officials said. Smith appeared to remain conscious for several minutes after the nitrogen was activated, according to five journalists who were allowed to watch the execution through glass as media witnesses. Although the mask was also secured to the gurney, he then began shaking his head and writhing for about two minutes, and then could be seen breathing deeply for several minutes before his breathing slowed and became imperceptible, the witnesses said. \"It appeared that Smith was holding his breath as long as he could,\" Alabama Corrections Commissioner John Hamm told a press conference. \"He struggled against the restraints a little bit but it's an involuntary movement and some agonal breathing. So that was all expected.\" Rev. Jeff Hood, Smith's spiritual adviser, was at Smith's side for the execution, and said prison officials in the room \"were visibly surprised at how bad this thing went.\" \"What we saw was minutes of someone struggling for their life,\" Hood, attending his fifth execution in the last 15 months, told reporters. \"We saw minutes of someone heaving back and forth. We saw spit. We saw all sorts of stuff from his mouth develop on the mask. We saw this mask tied to the gurney, and him ripping his head forward over and over and over again.\" Before the nitrogen was switched on, Smith made a lengthy final statement that began: \"Tonight, Alabama caused humanity to take a step backward.\" His wife and other relatives attended and he gestured towards them. \"I'm leaving with love, peace and light,\" he said, according to media witnesses. \"Love all of you.\" FAILED CHALLENGES Smith mounted legal challenges in federal courts arguing that Alabama's new method amounted to unconstitutional \"cruel and unusual punishment,\" but he failed to cross the high bar needed to have a judge order a delay of his execution. His lawyers raised fears the mask would not properly seal against Smith's face, allowing oxygen to seep in, delaying or even averting the moment of unconsciousness but risking serious brain injury.  Though poisonous gases such as hydrogen cyanide have been used in executions in the U.S. and beyond in the past, this was the first time a death sentence was carried out anywhere using an inert gas to suffocate someone, capital punishment experts say. Oklahoma and Mississippi have also approved nitrogen asphyxiation methods for executions, but have yet to deploy it. Smith, who has suffered from nausea since he survived his first execution attempt, also raised concerns he would vomit into the mask and choke. In response, prison officials said they would serve him his final meal on Thursday morning and forbid any solid foods after 10 a.m.. His final meal was steak, hash browns and eggs. The U.S. Supreme Court's conservative majority rejected Smith's final appeal to delay his death on Thursday evening, and the execution began soon after. \"On March 18, 1988, 45-year-old Elizabeth Sennett's life was brutally taken from her by Kenneth Eugene Smith,\" Alabama Governor Kay Ivey, a Republican, said in a statement. \"After more than 30 years and attempt after attempt to game the system, Mr. Smith has answered for his horrendous crimes.\" Smith was convicted of murdering Sennett, a preacher's wife, after he and accomplices each accepted a $1,000 fee from her husband to kill her, according to trial testimony. Eleven of 12 jurors voted to sentence Smith to life in prison, but an Alabama judge overruled their recommendation under a law that has since been abolished as unconstitutional. \nSeveral of Sennett's relatives attended the execution and told reporters they had forgiven Sennett's killers. \"Nothing that happened here today is going to bring mom back,\" Mike Sennett said. \"It's a bittersweet day, we're not going to be jumping around, hooping and hollering, hooraying and all that, that's not us. We're glad this day is over.\""
}