{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0R05F_L.jpg",
  "title": "US says its Israel policy unchanged after report on leveraging weapon sales",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 28, 2024 10:42AM ET",
    "Updated Jan 28, 2024 11:10AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-says-its-israel-policy-unchanged-after-report-on-leveraging-weapon-sales-3285321",
  "paragraph": "© Reuters. A general view of the White House in the early morning prior to U.S. President Joe Biden visiting Arlington Cemetery for Veterans Day, in Washington, U.S., November 11, 2023. REUTERS/Ken Cedeno/File Photo\nBy Kanishka Singh and Steve Holland WASHINGTON (Reuters) -The White House said on Sunday there was no change in its Israel policy after NBC News reported the United States was discussing using weapon sales to Israel as leverage to convince the Israeli government to scale back its military assault in Gaza. \"Israel has a right and obligation to defend themselves against the threat of Hamas, while abiding by international humanitarian law and protecting civilian lives, and we remain committed to support Israel in its fight against Hamas,\" a spokesperson for the White House National Security Council said. \"We have done so since Oct. 7, and will continue to. There has not been a change in our policy.\"  NBC News reported earlier on Sunday that at the direction of the White House, the Pentagon has been reviewing what weaponry Israel has requested that could be used as leverage. The report cited sources and said no final decisions were made. The report added that the U.S. is considering slowing or pausing the deliveries in hopes that doing so will make the Israelis take actions such as opening humanitarian corridors to provide more aid to Palestinian civilians. \"There has been no request from the White House for DoD (Department of Defense) to slow down weapons deliveries to Israel,\" a White House official said when asked about the NBC News report. \"And not aware of any request to review weapons to potentially slow walk deliveries either.\"  Among the weaponry the U.S. discussed using as leverage, the NBC News report added, were 155 mm artillery rounds and joint direct attack munitions (JDAMs), which are guidance kits that convert dumb bombs into precision-guided munitions. \nThe heavy death toll from Israel's war in Gaza has led to much international alarm. President Joe Biden has previously referred to Israeli bombing as \"indiscriminate\" but Washington has not called for a ceasefire, saying such a measure would benefit Palestinian Islamist group Hamas, which governs Gaza. Hamas' Oct. 7 attack on Israel killed 1,200 people, according to Israeli tallies. Israel's subsequent assault on Gaza has killed more than 26,000 Palestinians, over 1% of the 2.3 million population there, according to Gaza's health ministry. Many are feared buried in rubble."
}