{
  "image": "https://i-invdn-com.investing.com/news/moved_LYNXMPEI7L03X_L.jpg",
  "title": "Dollar steadies ahead of key inflation data; euro slips post ECB",
  "category": "Forex news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 26, 2024 03:48AM ET",
    "Updated Jan 26, 2024 03:53AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Frederick Jacobs",
        "2024-01-26 09:56:25",
        "Hello...",
        "https://www.investing.com/members/256593136"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/forex-news/dollar-steadies-ahead-of-key-inflation-data-euro-slips-post-ecb-3283764",
  "paragraph": "Investing.com - The U.S. dollar steadied in early European trade Friday after gains on the back of strong U.S. growth data, while the euro retreated in the wake of the latest European Central Bank meeting.\nAt 03:50 ET (08:50 GMT), the Dollar Index, which tracks the greenback against a basket of six other currencies, traded flat at 103.372, on course for a small weekly gain after climbing about 0.2% overnight.\nFed’s favorite inflation guide due \nThe dollar has generally retained the positive tone generated by Thursday’s advance U.S. GDP estimate, indicating the U.S. economy grew at a 3.3% annualized rate in the last quarter of 2023, overshooting the consensus forecast of 2% growth. \nThe data pointed towards a soft landing for the U.S. economy this year after a period of severe monetary tightening. It also showed inflation pressures subsiding further, putting early Fed rate cuts back on the agenda, but the dollar managed to hold up as yields fell.\nLater in the session comes the release of PCE price index data, the Fed’s preferred inflation gauge, which could offer more cues on the bank’s plans to cut rates.\nThe data comes just a few days before the Fed’s first meeting in 2024, where the central bank is widely expected to keep rates on hold. \nEuro on backfoot after ECB meeting\nIn Europe, EUR/USD traded 0.2% lower at 1.0827, with the euro on the backfoot following Thursday’s European Central Bank monetary policy meeting.\nThe ECB kept interest rates unchanged at a record-high 4%, but the central bank recognised that inflation had fallen faster than it expected last autumn, suggesting that the time to start discussing a first rate cut is fast approaching.\nThe euro “lurched lower after President Christine Lagarde said she stood by the comments that she made last week that the ECB could cut this summer,” said analysts at ING, in a note.\n“The downside for EUR/USD looks open to the 1.0790/1.0800 area now and 1.0875/1.0900 looks like stronger resistance. And risks next week warn that EUR/USD could be a 1.0715/25 story.”\nData released earlier Friday showed that the GfK German consumer sentiment index fell to -29.7 points heading into February from a revised -25.4 the previous month, suggesting a sustained recovery for Europe's biggest economy remains some way away.\nGBP/USD traded 0.1% lower at 1.2693, with the Bank of England set to announce its latest decision on interest rates next week.\nYuan hands back some gains\nIn Asia, USD/JPY rose 0.1% to 147.82, with the yen slightly lower as data showed consumer price index inflation in Tokyo fell more than expected in January, heralding a similar trend in countrywide inflation.\nUSD/CNY traded 0.2% higher to 7.1809, with the yuan retreating slightly after earlier gains this week in the wake of the PBOC reducing banking reserve requirements, which inspired some optimism about a Chinese economic recovery."
}