{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK1017H_L.jpg",
  "title": "The fisherman from Senegal keeping Spain's vessels afloat",
  "category": "Commodities news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 01, 2024 03:04AM ET",
    "Updated Feb 01, 2024 08:20AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Norbert Be",
        "2024-02-01 09:14:06",
        "We do not have problems with 1000 migrants who earn theirs salary by work.\nwe have a problem of the rest 29000 which began to rob and r*pe.",
        "https://www.investing.com/members/242518630"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/commodities-news/the-fisherman-from-senegal-keeping-spains-vessels-afloat-3289411",
  "paragraph": "© Reuters. Babou Diouf, 46, a fisherman from Senegal, rolls up a fishing net on the Sarridal ship at the Cantabrian Sea, near Burela, Galicia, Spain, December 11, 2023. Diouf was part of a migration surge in 2006 from West Africa through Spain's Canary Islands, with\nBy Nacho Doce and Charlie Devereux BURELA, Spain (Reuters) - Watching news of Senegalese migrants arriving on the Canary Islands stirs memories for Babou Diouf of the same perilous journey he undertook 17 years ago and his arduous path to his new home - Burela, on Spain's northern coast.  Diouf, 46, a fisherman from Bassoul in Senegal's Sine Saloum delta, was part of a migration surge in 2006 from West Africa through Spain's Canary Islands, which lie around 100 kms (60 miles) off Africa's northwestern coast.  More than 30,000 migrants arrived that year, fleeing poverty exacerbated by a dramatic plunge in coastal fish stocks, partly due to industrial fishing by European Union states, according to academics, NGOs and migrants. The 2006 record for migrant arrivals through the Canaries was broken last year. Nearly 7,000 died attempting the crossing in 2023, according to rights group Caminando Fronteras (Walking Borders). \"To see rafts arriving in Spain is very difficult,\" said Diouf. \"To cross the ocean without knowing what you're facing - you're facing death.\" Deprived of his livelihood in Senegal, Diouf ventured north. Today it is his fishing experience which has secured him a new life in Spain, where the EU's largest fishing fleet, shunned by ever more Spanish workers, is recruiting foreigners to survive.  The fishing port of Burela has 44 nationalities among its 9,450 residents, including 90 men from Senegal and 244 from Cape Verde, according to the mayor's office. Foreign workers make up about seven out of ten crew in Burela's fishing fleet, said Juan Carlos Otero of Burela's boat owners' association. The Peruvians were the first to arrive in 2000 when locals left to work in a new steel plant, said Otero. Indonesians are so valued for their longline fishing skills that boat owners pay for their flights to Spain. Others, like the Senegalese, find work through word of mouth or by turning up at the dock where, if they have residence permits, they are then offered contracts.  Immigration, largely welcomed by locals, is changing the town. Diouf regularly visits a recently-built mosque. Cape Verdean women serve coffee and breakfast at A'Mares, a restaurant in the port. AT SEA Working alongside Indonesians, Senegalese and Spaniards on the Sarridal vessel, Diouf is a whirl of activity, hauling in nets and cleaning and boxing hake during 14-hour shifts. The boat's captain, Francisco Gonzalez, said Spain's fishing industry can't survive without migrants. \"There are very few young Spaniards so the future is in training immigrants,\" he said. In Senegal, Diouf tried to provide for his family, fishing from pirogues, or dugout canoes. He also worked on French and Spanish boats, picking up the Spanish language, but he struggled to make ends meet. Earning a living from fishing in Senegal and West Africa has become increasingly challenging as fish stocks decline, especially after the arrival of industrial fishing companies, mainly from Europe and China, which have signed commercial fishing rights agreements with West African countries. The EU pays Senegal 1.7 million euros ($1.85 million) a year for the rights to fish about 10,000 tonnes of tuna. Two vessels are also authorised to fish for hake.  Ignacio Fresco Vanzini, senior policy advisor at Oceana, an ocean conservation NGO, said some 57% of the stocks in Senegalese waters are estimated to have collapsed.  Two boats from Burela currently operate off the Mauritanian coast under an EU fisheries agreement, said Sergio Lopez, manager of Burela's fish producers' organisation. Diouf blames his government for selling the best fishing zones to international operators.  \"What do the Senegalese get from this? Nothing,\" he said. \"They take resources from Africans and now they say Africans arriving in Europe are a headache.\"  A European Commission spokesperson said EU vessels from Spain and France fish under agreements that follow international rules. \"The EU fleet is only fishing on the surplus of the allowable catch the coastal state considers that its fleet is not able to harvest,\" the spokesperson said. PATH TO BURELA It took Diouf more than a decade to reach the northern port. He paid 500,000 West African francs ($830) for a place on a pirogue from Mauritania to the Canaries. After a three-day journey, he spent a month on Gran Canaria before being flown by authorities to mainland Spain. He said police in Madrid released him as an undocumented immigrant, warning him not to steal or sell drugs and wishing him good luck. He found his way to Almeria in the south to work picking vegetables. The work was inconsistent, poorly paid and grueling. One courgette farmer trained his dog to bark if he took a break.  Diouf, bursting into tears, said 2008 was the worst year of life when he had only three weeks of work. His luck turned in 2010 when another farmer helped him apply for legal residency. He then heard of the chance to work in fishing and in 2018 made his way to Burela.  He now makes enough to rent a three-bedroom apartment where he lives with his Spanish wife Silvia, his two-year-old daughter Saly and 11-year-old stepdaughter Itziar, while also sending money home to his older children in Senegal. His brother, who arrived from Morocco to mainland Spain on a raft and two nephews, who made the same journey as Diouf via the Canary Islands, have since joined him in Burela. But even with workers such as Diouf, Spain's fishing industry may not survive, some experts warn.  In Burela, where about half of the fleet practices longline hake fishing, the industry could collapse within three years after the EU included the practise within its restrictions on bottom trawling, said Lopez. Diouf is now preparing for the day when he can no longer fish, learning how to handle chainsaws and strimmers, and drive trucks when he is not working at sea. The exhaustion and lack of sleep don't faze him. \n\"It's been like that all my life,\" he said. \"I sleep when I can, not when I want.\"  ($1 = 0.9185 euros)"
}