{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK01079_L.jpg",
  "title": "Five dead after JAL airliner crashes into quake aid plane at Tokyo airport",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 02, 2024 05:10AM ET",
    "Updated Jan 03, 2024 05:57AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/all-passengers-crew-on-jal-plane-escape-blaze-at-tokyo-airport-3265319",
  "paragraph": "4/4\n© Reuters. Japan Airlines' A350 airplane is on fire at Haneda international airport in Tokyo, Japan January 2, 2024. REUTERS/Issei Kato\n2/4\nBy Daniel Leussink and Satoshi Sugiyama TOKYO (Reuters) -All 379 people aboard a Japan Airlines (JAL) plane escaped the burning airliner after a collision with a Coast Guard aircraft at Tokyo's Haneda airport that killed five of six crew on the smaller aircraft on Tuesday. Live footage on public broadcaster NHK showed the JAL Airbus A350 airliner burst into flames as it skidded down the tarmac shortly before 6 p.m. (0900 GMT). Video and images shared on social media showed passengers shouting inside the plane's smoke-filled cabin and running across the tarmac after escaping via an evacuation slide. At one point a child's voice can be heard shouting: \"Let us get out quickly! Let us get out quickly!\" All 367 passengers and 12 crew were evacuated from the blazing airliner, but the fire was not extinguished until shortly after midnight, after burning for more than six hours, broadcaster TBS reported citing the fire department. \"I was wondering what happened and then I felt the airplane tilted to the side at the runway and felt a big bump,\" said Satoshi Yamake, 59, a telecommunications company worker who was on board. \"The flight attendants told us to stay calm and instructed us to get off the plane.\" Fourteen people on the passenger plane were injured, according to Japan Airlines, but none of the injuries appeared to be life-threatening. Transport Minister Tetsuo Saito confirmed that five of the Coast Guard aircraft's crew had died, while the 39-year-old captain of the plane escaped but was injured. A ministry official told a press briefing the JAL plane was attempting to land normally when it collided with the Coast Guard's Bombardier-built Dash-8 maritime patrol plane on the runway. There had been no reports of engine or other problems on the airliner before the landing, the official said. The Coast Guard said its plane was headed to Niigata on Japan's west coast to deliver aid to those caught up in a powerful earthquake that struck on New Year's Day, killing at least 55 people. A JAL official told a press briefing it was the airline's understanding that the flight had received permission to land, although he added that exchanges with flight control were still under investigation. 'IT WAS A MIRACLE' Passengers and aviation experts praised the speed of the evacuation. \"I heard an explosion about 10 minutes after everyone and I got off the plane,\" said 28-year-old passenger Tsubasa Sawada. \"I can only say it was a miracle, we could have died if we were late.\" Paul Hayes, director of air safety at UK-based aviation consultancy Ascend by Cirium, noted that no-one leaving the plane appeared to be carrying hand luggage - safety agencies have warned for years that pausing to collect carry-on bags during an evacuation risks lives. \"The cabin crew must have done an excellent job... It was a miracle that all the passengers got off,\" he said. The aircraft's in-flight announcement system did not work during the evacuation, so crew members used megaphones to give instructions, Japan Airlines said in a statement. Kaoru Ishii, who was waiting outside the arrival gate for her 29-year-old daughter and boyfriend, said she initially thought the flight was delayed until her daughter called to explain.  \"She said the plane had caught fire and she exited via a slide,\" Ishii said. \"I was really relieved that she was alright.\" A JAL spokesperson said its aircraft had departed from New Chitose airport on Japan's northern island of Hokkaido. CAUSE UNDER INVESTIGATION Based on interviews with the flight crew, the airline said the crew acknowledged landing clearance from air traffic control, repeated it back to confirm and then conducted approach and landing operations. \"There were no issues with the aircraft at the time of departure from the New Chitose Airport and during the flight,\" the airline said.  It was not immediately possible to determine clearly the sequence of instructions issued in the moments before the crash from multi-channel recordings available on liveatc.net.  The air traffic control monitoring website captured a controller telling all approaching pilots shortly after the impact: \"Airport is closed, Haneda airport is closed\". Transport Minister Saito said the cause of the accident was unclear and the Japan Transport Safety Board, police and other departments would continue to investigate. The JTSB air accident agency has launched an investigation, to be joined by representatives from France, where the airplane was built, and Britain where its two Rolls-Royce (OTC:RYCEY) Trent XWB engines were manufactured. Airbus said it was also sending technical advisers. Haneda, one of the two main airports serving the Japanese capital Tokyo, was closed for several hours following the accident, but the transport ministry official said three runways had since resumed operations. JAL's Japanese rival ANA had earlier said it had cancelled 110 domestic flights departing and landing at Haneda for the rest of Tuesday. \nPrime Minister Fumio Kishida said authorities were working to ensure the accident did not affect deliveries of earthquake relief supplies, and expressed sorrow over the deaths of the Coast Guard crew.  \"This is a great regret as the crew members performed their duties with a strong sense of mission and responsibility for the victims of the disaster area,\" he said."
}