{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "US strikes targets in Iraq after forces wounded",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 23, 2024 05:07PM ET",
    "Updated Jan 23, 2024 06:21PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-strikes-targets-in-iraq-after-us-forces-wounded-officials-3281109",
  "paragraph": "By Idrees Ali, Phil Stewart and Timour Azhari WASHINGTON/BAGHDAD (Reuters) -The United States carried out strikes in Iraq against three facilities linked to Iran-backed militia on Tuesday, the Pentagon said, after a weekend attack on an Iraqi air base that wounded U.S. forces. U.S. troops in Iraq and Syria have been attacked about 150 times by Iran-aligned militants since the Israel-Gaza war started in October, creating pressure on President Joe Biden to respond militarily, despite political sensitivities in Baghdad. On Saturday, four U.S. personnel suffered traumatic brain injuries after Iraq's Ain al-Asad air base was hit by multiple ballistic missiles and rockets fired by Iranian-backed militants from inside Iraq. \"U.S. military forces conducted necessary and proportionate strikes on three facilities used by the Iranian-backed Kataib Hezbollah militia group and other Iran-affiliated groups in Iraq,\" U.S. Defense Secretary Lloyd Austin said in a statement. \"These precision strikes are in direct response to a series of escalatory attacks against U.S. and Coalition personnel in Iraq and Syria by Iranian-sponsored militias,\" Austin added.  U.S. Central Command, which carries out operations in the Middle East, said the strikes targeted Kataib Hezbollah \"headquarters, storage, and training locations for rocket, missile\" and drone capabilities. In Iraq, a medical source and a militant source said the U.S. strikes killed at least two militants and that four other people were wounded.  Kataib Hezbollah military spokesperson Jaafar al-Husseini said in a post on X that the group would continue to target \"enemy bases\" until the end of Israel's seige in Gaza and singled out U.S. support for Israel's campaign. The attacks against the United States are seen as retaliation for its support of Israel in its war against Iran-backed Palestinian militant group Hamas. The war in Gaza has been spreading, with U.S. forces hitting Houthi targets who have launched attacks on ships in the Red Sea.  The U.S. has 900 troops in Syria and 2,500 in Iraq, advising and assisting local forces to prevent a resurgence of Islamic State, which in 2014 seized large parts of both countries before being defeated. Iraqi Prime Minister Mohammed Shia al-Sudani's office announced moves to evict U.S. forces following a U.S. drone strike in Baghdad earlier this month that was condemned by the government. The Pentagon said that strike killed a militia leader responsible for recent attacks on U.S. personnel. Sudani has limited control over some Iran-backed factions, whose support he needed to win power a year ago and who now form a powerful bloc in his governing coalition. The Pentagon has said it has not been formally notified of any plans to end the U.S. troop presence in the country, and says its troops are deployed to Iraq at the invitation of the government in Baghdad. Following the U.S. strike, Abo Alaa al-Walai, a militia commander sanctioned by the U.S. last year for involvement in attacks on U.S. forces, said Iran-backed Iraqi militias operating under the banner of the Islamic Resistance in Iraq should expand operations by \"enforcing a blockade on Zionist maritime navigation in the Mediterranean Sea.\""
}