{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK06038_L.jpg",
  "title": "North Korea vows military strike if any provocation, fires artillery rounds",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 07, 2024 09:37AM ET",
  "comments": [
    3,
    [
      [
        "Ken Roth",
        "2024-01-07 19:53:20",
        "The ant is pissing in the wind",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Otis Grant",
        "2024-01-07 17:23:52",
        "Does NK realize how close they are coming to being wiped off the map in self defense? That sad dictator is a complete lune ",
        "https://www.investing.com/members/251132356"
      ],
      [
        "Robert Fortin",
        "2024-01-07 15:24:48",
        "the martians live in NK",
        "https://www.investing.com/members/206264294"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/north-korea-vows-military-strike-if-any-provocation-fires-artillery-rounds-3268702",
  "paragraph": "© Reuters. Kim Yo Jong, sister of North Korea's leader Kim Jong Un, arrives at the Vostochny Сosmodrome before a meeting of Russia's President Vladimir Putin with North Korea's leader Kim Jong Un, in the far eastern Amur region, Russia, September 13, 2023. Sputnik/\nSEOUL (Reuters) -North Korea will launch a military strike immediately in response to any provocation, Kim Yo Jong, the sister and key ally of leader Kim Jong Un, said on Sunday, as it fired artillery shells near its border with the South for the third day in a row.  The remarks come after South Korea's military said the North had fired more than 60 artillery rounds on Saturday near their disputed maritime border, following a similar volley of more than 200 the previous day. North Korea again fired about 90 rounds on Sunday, the South said. The North's army said they did not pose any threat to the South as the firing drill was conducted parallel to the border.  \"I make myself clear once again that the safety catch of trigger of the Korean People's Army (KPA) had already been slipped,\" Kim Yo Jong, one of the most powerful members of Kim Jong Un's regime, said in a statement carried by state news agency KCNA. \"As already declared, the KPA will launch an immediate military strike if the enemy makes even a slight provocation,\" Kim said, using the official name of the North Korean army.  Although South Korea held its own fire drills in the sea on Friday in response to the artillery shells, South Korea's Yonhap news agency said there was no plan to do so after Saturday's events. The drills on both sides of the border on Friday sparked warnings for residents of South Korean border islands to seek cover in bomb shelters, although there were no reports of shells crossing the maritime border. \nIn the statement, Kim denied the artillery shell firings on Saturday and said the North had detonated explosives as a deception tactic. South Korea's military rejected Kim's statement as low-level psychological warfare, urging North Korea to cease military activity that raises tension near the border."
}