{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBO04K_L.jpg",
  "title": "Russia's Navalny tracked down to 'Polar Wolf' prison in the Arctic",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 25, 2023 07:49AM ET",
    "Updated Dec 25, 2023 03:10PM ET"
  ],
  "comments": [
    3,
    [
      [
        "Ken Roth",
        "2023-12-26 17:04:14",
        "Trump has done this to himself by trying to overthrow our democracy. Trump belongs behind bars for his crimes against the american people. Those who support him will find the love is one sided",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Bobby Hall",
        "2023-12-25 17:11:49",
        "Sounds just like Biden trying to put Trump in prison to keep him out of the election, doesn't it?",
        "https://www.investing.com/members/205103817"
      ],
      [
        "Adrian White",
        "2023-12-25 19:46:18",
        "No, it doesn't sound like that at all. Biden has nothing to do with the prosecutions against Trump. Plenty of other people who are just doing their jobs, and upholding the law, are the ones prosecuting Trump. American presidents don't have the power to put people in prison. Only to commute sentences or pardon. (Of course Trump wants the power to do both which is why he admires people like Putin and North Korea's Kim so much).",
        "https://www.investing.com/members/202315569"
      ],
      [
        "Jan Buyle",
        "2023-12-25 16:47:30",
        "Authocrats at work.... they destroy all opponents... sure you want this type of leadership in the US too??",
        "https://www.investing.com/members/200232963"
      ],
      [
        "David JC",
        "2023-12-26 12:22:30",
        "Unfortunately this is exactly what the Dems want in the US. Alaska will be the spot for US Constitution loving Americans.",
        "https://www.investing.com/members/204737048"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/russias-navalny-is-in-a-prison-colony-in-the-yamalnenets-region--spokeswoman-3263245",
  "paragraph": "© Reuters. FILE PHOTO: Russian opposition politician Alexei Navalny is seen on a screen via a video link during a court hearing to consider his claims against the administration of a penal colony, where he serves a sentence after being found guilty of parole violati\nBy Guy Faulconbridge and Andrius Sytas MOSCOW (Reuters) -Jailed Russian opposition politician Alexei Navalny has been tracked down to a penal colony north of the Arctic Circle, his spokeswoman said on Monday, after supporters lost touch with him for more than two weeks.  Navalny, 47, was tracked down to the IK-3 penal colony in Kharp in the Yamal-Nenets region, about 1,900 km (1200 miles) north east of Moscow, spokeswoman Kira Yarmysh said. Navalny's lawyer managed to see him on Monday, Yarmysh said. \"This prison will be much worse than the one that was before,\" Yarmysh told Reuters TV in Vilnius via video call. \"They are trying to make his life as unbearable as it possibly can be.\" \"They definitely try to isolate Alexei and to make it more difficult to access him,\" said Yarmysh, who refused to disclose her location due to security concerns.  Navalny's allies, who had been preparing for his expected transfer to a \"special regime\" colony, the harshest grade in Russia's prison system, said he had not been seen by his lawyers since Dec. 6 and raised the alarm about his fate. Navalny's new home, known as \"the Polar Wolf\" colony, is considered to be one of the toughest prisons in Russia. Most prisoners there have been convicted of grave crimes. Winters are harsh - and temperatures are due to drop to around minus 28 Celsius (minus 18.4 Fahrenheit) there over the next week.  About 60 km (40 miles) north of the Arctic Circle, the prison was founded in the 1960s as part of what was once the GULAG system of forced Soviet labour camps, according to the Moskovsky Komsomolets newspaper. \"The conditions there are harsh, with a special regime in the permafrost,\" said Leonid Volkov, an aide to Navalny. He said it was difficult to communicate with prisoners held at the remote site. The United States welcomed reports that Navalny had been located but remained \"deeply concerned\" about his well-being, the U.S. State Department said, calling for his immediate release and describing his detention as \"unjust.\" 'POLAR WOLF'  Navalny's lawyer, Ivan Zhdanov, said his supporters had sent 618 requests for information about his location and suggested that the Russian authorities wanted to isolate Navalny ahead of the March presidential election.  Navalny, who had been held at a penal colony 235 km (145 miles) east of Moscow, says he has been imprisoned because he is viewed as a threat by the Russian political elite. As a prisoner, he is unable to run in the election.  He denies all the charges he has been convicted of and casts Russia's judicial system as deeply corrupt. Russia says he is a convicted criminal.  Navalny earned admiration from Russia's disparate opposition for voluntarily returning to Russia in 2021 from Germany, where he had been treated for what Western laboratory tests showed was an attempt to poison him with a nerve agent. Navalny says he was poisoned in Siberia in August 2020. The Kremlin denied trying to kill him and said there was no evidence he was poisoned with a nerve agent. His supporters cast him as a future leader of Russia who will one day walk free from jail to lead his country, though it is unclear how much popular support Navalny has inside Russia.  The authorities view him and his supporters as extremists with links to the CIA intelligence agency who they say is seeking to destabilise Russia. They have outlawed his movement, forcing many of his followers to flee abroad. \nLast month Navalny lamented the terrible state of inmates' teeth in Russian prison. \"Poor nutrition, a lack of solid food, lots of sweet stuff (the most affordable food), a lot of strong tea, smoking, and a complete absence of dental care do them in,\" he said at the time."
}