{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0409C_L.jpg",
  "title": "Pakistan's senate approves delaying elections, but decision not binding",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 05, 2024 05:45AM ET",
    "Updated Jan 05, 2024 05:51AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/pakistans-senate-approves-delaying-elections-but-decision-not-binding-3267953",
  "paragraph": "© Reuters. FILE PHOTO: Election officials count votes after polling stations closed during the general election in Karachi, Pakistan, July 25, 2018. REUTERS/Akhtar Soomro/File Photo\nKARACHI, Pakistan (Reuters) -Pakistan's senate approved a resolution on Friday to further delay national elections which had been scheduled to take place on Feb. 8, the chairman of the senate said while addressing senators.  The resolution passed by the senate, however, is not binding and does not necessarily mean elections will be further delayed. There was no immediate comment from the election commission, the body that conducts elections in the country. Elections in the politically and economically troubled South Asian nation were originally due to be held in November, 90 days after the dissolution of the lower house of parliament in August, but were first delayed to February due to the fresh demarcation of constituencies under a new census. \"January and February are the coldest months in majority areas in Balochistan and Khyber Pakhtunkhwa (provinces),” said independent Senator Dilawar Khan, who moved the resolution during a session with only 14 lawmakers in attendance, adding that there were security concerns too. Pakistan is currently being run by a caretaker government under interim Prime Minister Anwaar ul Haq Kakar that is meant to oversee a general election.  Caretakers are usually limited to overseeing elections, but Kakar's set-up is the most empowered in Pakistan's history thanks to recent legislation that allows it to make policy decisions on economic matters. \nThe legislation is aimed at keeping on track the conditions for a $3 billion International Monetary Fund (IMF) bailout secured in June.  Political analysts fear that a prolonged period without an elected government would allow the military, which has ruled Pakistan for over three decades since independence in 1947 and wields considerable control even if not in power, to consolidate control."
}