{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0I0FQ_L.jpg",
  "title": "Non-Aligned Movement leaders denounce Israel's military campaign in Gaza",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 19, 2024 08:09AM ET",
    "Updated Jan 20, 2024 04:31PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/nonaligned-movement-leaders-denounce-israels-military-campaign-in-gaza-3278274",
  "paragraph": "4/4\n© Reuters. Leaders from member countries of the Non-Aligned Movement (NAM) pose for a family photograph at the 19th summit, where several issues including global conflicts, climate change, UN reform and others are on the agenda for discussion, in Munyonyo suburb, of\n2/4\nBy Elias Biryabarema KAMPALA (Reuters) - Leaders of Non-Aligned Movement (NAM) countries on Friday denounced Israel's military campaign in Gaza and demanded an immediate ceasefire there, during the annual summit of the 120-member bloc. Dozens of heads of state and other senior officials from the NAM, formed officially in 1961 by countries opposed to joining either of the two major Cold War-era military and political blocs, are attending a summit in Uganda. Israel launched its offensive in Gaza after the Islamist militant group Hamas' Oct. 7 attack in which Israeli officials say more than 1,200 Israelis and foreigners were killed and 240 taken hostage. The military campaign has killed more than 24,000 Palestinians, according to Gaza health authorities. \"Since Oct. 7 we have witnessed one of the cruellest genocidal acts ever to be recorded by history,\" Cuba's vice president, Salvador Valdes Mesa, said in a speech to delegates. \"How can the Western countries, who claim to be so civilised, justify the murder of women and children in Gaza, the indiscriminate bombings of hospitals and schools and deprivation of access to safe water and food?\" he said.  Moussa Faki Mahamat, chairperson of the African Union commission, called for an immediate end to what he called the \"unjust war against the Palestinian people.\" Nearly all African countries belong to the NAM, comprising nearly half of its members, while other members range from India and Indonesia to Saudi Arabia and Iran, Chile, Peru and Colombia. Israel has said it is acting in self-defence and rejected accusations of genocide, including in a case brought against it by South Africa at the United Nations' top court. \nSpeaking at the summit, South African President Cyril Ramaphosa, said the war in Gaza had demonstrated the inadequacy of the United Nations, particularly the Security Council, where the United States has vetoed several resolutions critical of Israel. \"We should establish a system of global governance that is fair and equitable, and has the capacity to respond to the needs of all persons in situations of threat and harm,\" said Ramaphosa."
}