{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK040BN_L.jpg",
  "title": "UK police say no new investigation into Prince Andrew allegations",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 05, 2024 06:38AM ET",
    "Updated Jan 05, 2024 06:56AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/uk-police-say-no-new-investigation-into-prince-andrew-allegations-3268032",
  "paragraph": "© Reuters. FILE PHOTO: Britain's Prince Andrew, Duke of York attends the Royal Family's Christmas Day service at St. Mary Magdalene's church, as the Royals take residence at the Sandringham estate in eastern England, Britain December 25, 2022. REUTERS/Toby Melville/\nLONDON (Reuters) - British police said on Friday no new investigation had been launched into allegations relating to Prince Andrew following the release this week of court documents relating to the late sex offender Jeffrey Epstein. Andrew, 63, a younger brother of King Charles, has always denied accusations of sexual wrongdoing and in February 2022 settled a U.S. lawsuit brought by Virginia Giuffre accusing him of sexually abusing her when she was a teenager. Details of Giuffre's allegations and those made by another Epstein accuser against the British royal have been previously reported, but featured in previously redacted court documents detailing the extent of Epstein's alleged sex trafficking activities which were unsealed on Wednesday. In October 2021, London's Metropolitan Police (MPS) said it would not be taking any action against the prince following a review of the evidence in the wake of Giuffre filing her lawsuit. The anti-monarchy group Republic said on Thursday it had reported Andrew again to detectives, saying the authorities had not properly looked into the allegations and the case should be reopened.  However, the MPS said no new inquiry had been started. \"We are aware of the release of court documents in relation to Jeffrey Epstein,\" the MPS said in a statement. \"As with any matter, should new and relevant information be brought to our attention we will assess it.\" Andrew, the Duke of York, was stripped of most of his titles and removed from official royal duties due to the scandal caused by his friendship with Epstein. The eighth in line to the throne has always denied any accusations of wrongdoing or having any relationship with Giuffre, who said he abused her at Epstein's mansion in Manhattan, and on Epstein's private island in the U.S. Virgin Islands. \nHowever, the allegations have destroyed his reputation and despite occasional appearances at family events, such as the 2022 funeral of Queen Elizabeth and annual Christmas get-togethers, he has been frozen out of holding any public role. Buckingham Palace has not commented on the latest furore, saying he was no longer a working royal."
}