{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "Russia says 28 people killed by Ukrainian shelling of bakery in Russian-controlled city",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 03, 2024 11:21AM ET",
    "Updated Feb 04, 2024 04:35AM ET"
  ],
  "comments": [
    7,
    [
      [
        "Ken Roth",
        "2024-02-04 18:30:22",
        "All you need to know about russia is If you see a russian move his/her lips you know he/she is lying.",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Mark Jannetty",
        "2024-02-04 20:56:01",
        "all you need to know about Ukraine is they are as corrupt as the Biden family ",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Gary Piccone",
        "2024-02-04 11:44:38",
        "They found a hair in their bread ",
        "https://www.investing.com/members/239243214"
      ],
      [
        "Barry Nickerson",
        "2024-02-04 11:25:41",
        "The bakery was making torpedo rolls.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Rob Roy",
        "2024-02-04 06:15:04",
        "The West sees Russia as an enemy. On the other hand, Russia see NATO on its' borders as a severe national security threat. The American and Russian \"big boys\" have to sit together and sort all the disputes down.",
        "https://www.investing.com/members/250189184"
      ],
      [
        "Mark Jannetty",
        "2024-02-04 11:55:02",
        "if the US had a president, instead of a potato as their leader, I am sure that would happen ",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Brad Albright",
        "2024-02-04 15:31:04",
        "If the US had an appeaser of unlawful aggression against sovereign democracies, I'm sure that would happen. ",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Mark Jannetty",
        "2024-02-04 20:57:09",
        " how many wars under Trump?",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Saul Goodman",
        "2024-02-04 00:02:22",
        "Yes, that bakery is a big win for your war effort. Making more friends in these provinces, or driving them into the arms of Russian control? State Dept posters",
        "https://www.investing.com/members/249494160"
      ],
      [
        "Ac Tektrader",
        "2024-02-03 23:15:51",
        "the fact that Moscow refuses to verify the.report, makes it very doubtful ..probably just another propaganda ploy.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Benjamin USA",
        "2024-02-03 21:21:00",
        "Russia always lies",
        "https://www.investing.com/members/200821892"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/russiaappointed-official-says-ukraine-shells-bakery-in-occupied-eastern-ukraine-3291920",
  "paragraph": "By Guy Faulconbridge MOSCOW (Reuters) -Russia said on Sunday that Ukraine killed at least 28 people, including nine women and a child, when its armed forces struck a bakery and restaurant in Russian-controlled eastern Ukraine with Western-supplied rockets. Russian-backed officials said that Ukraine struck the bakery in the city of Lysychansk at about 1230 GMT on Saturday with U.S.-supplied High Mobility Artillery Rocket System (HIMARS). Emergency workers worked through the night searching for survivors in the rubble of what remained of the shattered Adriatic Restaurant on Moskovska Street, where Russian officials said a bakery had been set up for civilians. \"The armed forces of Ukraine opened fire on a bakery in Lysychansk,\" said Leonid Pasechnik, the Russian-installed head of the Luhansk region which is now controlled by Russian forces. Pasechnik said the bakery was crowded with civilians when it was struck. Russia's emergency ministry said 10 people had been pulled from the rubble alive.  But the ministry said four more people were in an \"extremely grave condition\" and that it was still searching for people. Ukraine has not yet commented on the attack. Reuters was unable to immediately verify what weapons had been used in the attack.  Russia took control of swathes of eastern Ukraine after President Vladimir Putin ordered an invasion in February 2022, triggering the biggest land war in Europe since World War Two. Russia now controls around 18% of its neighbour - and considers the land it holds part of Russia. Ukraine and the West say they will never accept the annexation of that territory.  BAKERY Russia's foreign ministry condemned the Ukrainian attack, saying the West should think about why its financial support to Kyiv was being used to kill civilians. \"According to preliminary data, the strike was carried out using Western weapons,\" Foreign Ministry Spokeswoman Maria Zakharova said.  \"EU citizens should know how their taxes are used - they are used to buy deadly weapons systems and send them to the Kyiv regime which uses them to kill civilians.\" From the design and colour of the wrecked building and a sign matching file imagery of the area, Reuters was able to confirm the location of a video the Russian emergencies ministry shared. It matches a location on Google (NASDAQ:GOOGL) Maps identified as the Adriatic Restaurant on Moskovska Street, Lysychansk. However, Reuters was unable to independently verify the date of the footage or of any other details of the report coming out of an area Russia annexed in July 2022 after months of heavy fighting.  Only about a tenth of Lysychansk's pre-war population of 110,000 remain in the city, according to Ukrainian officials.  \nThough Ukraine took back a chunk of territory from Russian forces in 2022, its 2023 counter-offensive failed to make any significant dent in fortified Russian lines, and there is a debate among Kyiv's Western backers on how Ukraine should fight on. In the past month, Russian forces have grabbed 56 square miles (140 square kilometres) of Ukrainian territory, according to the Belfer Center at Harvard's Kennedy School."
}