{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "Russia pounds Ukraine's two biggest cities in new wave of attacks",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 01, 2024 09:41PM ET",
    "Updated Jan 02, 2024 04:17PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/russia-launches-drone-attack-on-kyiv-ukraine-says-3265176",
  "paragraph": "By Olena Harmash and Tom Balmforth KYIV (Reuters) -Russia pounded Ukraine's two biggest cities on Tuesday in a new wave of heavy air strikes that killed at least five civilians and prompted calls for the West to quickly provide more military assistance. Ukraine's Interior Ministry said 135 people had been injured in the latest missile and drone attacks, including 61 in and around Kharkiv, Ukraine's second city in the northeast and 17 in and around the capital, Kyiv. President Volodymyr Zelenskiy said rescue operations continued into the late evening as the assaults also caused widespread damage and hit power supplies.  Russia has intensified attacks over the New Year period, with President Vladimir Putin warning on Monday that a Ukrainian air strike on the Russian city of Belgorod, which Moscow said killed 25 civilians, would \"not go unpunished\".  Smoke belched out of the charred side of a high-rise residential building in Kyiv where mayor Vitali Klitschko said an elderly woman had been killed and 49 people hurt. Emergency services later recovered another corpse from the building.  A 91-year-old woman was killed in a missile strike on Kharkiv that also wounded dozens and a married couple was killed in an attack in the area around Kyiv, local officials said.  \"Russia will answer for every life (that it has) taken away,\" Zelenskiy said on the Telegram messenger. Russia later said one man had been killed and 11 people injured in a series of attacks on Belgorod. Zelenskiy, in his nightly video address, later said Russia had deployed almost 300 missiles and more than 200 drones in attacks over the last three days. The latest assaults, he said were intended to cause maximum destruction. \"...The trajectories have been specially calculated by the enemy to cause as much damage as possible,\" he said. \"No other country has yet repelled similar attacks by combined drones and missiles, including ballistic missiles.\"  Russia stepped up missile and drone strikes on Dec. 29, when it launched its largest air attack of the war, killing at least 39 people. Kyiv had warned for weeks that Russia appeared to be stockpiling missiles for big attacks.  Russia holds swathes of territory in eastern and southern Ukraine, and there is no end in sight to the war as next month's second anniversary of Moscow's full-scale invasion approaches. Russia depicts a Ukrainian counteroffensive launched in mid-2023 as a failure. Front lines have changed little in recent months.  Ukraine relies on military and financial support from allies, but political wrangling in the U.S. and the European Union has delayed over $110 billion in aid. MORE AIR DEFENCE Zelenskiy wrote on Telegram that he had discussed upgrading Ukraine's air defence systems with British Prime Minister Rishi Sunak. Several Western leaders and foreign diplomats in Kyiv said it was critical for Ukraine to receive more support.  \"Ukrainian air defence works well but Ukraine must get more help. New Year's celebrations are over and the West must get serious and act now,\" Latvian President Edgars Rinkevics wrote on social media platform X. Ukraine downed all 10 incoming \"Kinzhal\" missiles fired in the latest attack as well as 59 of the 70 cruise missiles and all three Kalibr cruise missiles, army chief General Valeriy Zaluzhnyi said.  But he added: \"There is no reason to believe that the enemy will stop here. Therefore, we need more systems and munitions for them.\" \nKlitschko said gas pipelines had been damaged in Kyiv's Pecherskyi district, and electricity and water had been cut off in several districts. Heating and water supplies were damaged in Kharkiv, mayor Ihor Terekhov said. The outages revived memories of last winter when air strikes on the energy grid caused frequent power cuts."
}