{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0T0NQ_L.jpg",
  "title": "Factbox-Key dates in the 2024 US presidential race",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 30, 2024 01:17PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/factboxkey-dates-in-the-2024-us-presidential-race-3287347",
  "paragraph": "© Reuters. A voter casts her ballot at a polling station on Election Day in Falls Church, Virginia, U.S., November 7, 2023. REUTERS/Kevin Lamarque/ File photo\n(Reuters) - Former President Donald Trump is the frontrunner to be the Republican presidential nominee in the 2024 election, while President Joe Biden faces little opposition in the Democratic Party in his campaign for a second term. Here is a timeline of events related to the Nov. 5, 2024, election between now and Inauguration Day in January 2025. 2024     - Jan. 31: Federal Election Commission 2023 year-end filing deadline for candidates to declare the money they have raised and spent - Feb. 3: Democratic presidential primary in South Carolina - Feb. 6: Democratic primary in Nevada - Feb. 6: Nikki Haley has filed to take part in the Nevada state-run primary, two days ahead of the Republican Party's caucuses in the state. - Feb. 8: Nevada caucuses for Republicans - Feb. 24: South Carolina Republican primary - Feb. 27: Democrats and Republicans vote in the Michigan state-run primary, which was brought forward by the Democratic-controlled state in a move opposed by Republicans. Republicans will instead choose the majority of their delegates during caucuses in March.   - March 2: Republicans in Michigan pick most of their delegates during party-run caucuses. - March 5: Known as Super Tuesday, this is the biggest single day of primaries and often helps whittle down the field of candidates. Both parties hold them in Alabama, Arkansas, California, Colorado, Maine, Massachusetts, Minnesota, North Carolina, Oklahoma, Tennessee, Texas, Vermont and Virginia. Democrats in Utah will also vote in their primary while Republicans hold their caucuses in the state. Republicans in Alaska vote in their primary. Iowa Democrats hold the final day of their mail-in caucuses and U.S. territory American Samoa has its caucuses on this date too. - March 12: Primaries held in the states of Georgia, Mississippi and Washington. Republicans in Hawaii hold caucuses. - March 19: Primaries held in Arizona, Florida, Illinois, Kansas and Ohio. - June 4: The final state primaries are scheduled for this date. - July 15-18: Republican National Convention in Milwaukee, Wisconsin, where the party formally chooses its candidate. - Aug. 19-22: Democratic National Convention in Chicago, where the party formally chooses its candidate. - Sept. 16: The date set by the Commission on Presidential Debates for the first presidential debate to take place. It will be held at Texas State University in San Marcos, Texas. - Sept. 25: The date set for the only vice presidential debate, to be held at Lafayette College in Easton, Pennsylvania. - Oct. 1: The date set for the second presidential debate, to be held at Virginia State University in Petersburg, Virginia. - Oct. 9: The date set for the third and final presidential debate, to be held at the University of Utah in Salt Lake City, Utah. - Nov. 5: Election Day - Later in November: It could take days for the election result to be known, especially if it is close and mail-in ballots are a factor. 2025  - Jan. 6: The vice president presides over the Electoral College vote count at a joint session of Congress, announces the results and declares who has been elected. Ahead of the count on Jan. 6, 2021, then-President Trump lambasted his vice president, Mike Pence, for refusing to try to prevent Congress from certifying Biden's win. On that day, the U.S. Capitol was attacked by rioters and some people chanted, \"hang Mike Pence\" as they tried to stop the count. Both chambers of Congress later resumed their work and certified Biden's win. \nCongress has since passed the Electoral Count Reform Act of 2022, which requires approval of one-fifth of the House and Senate to consider a challenge to a state's results - a much higher bar than existed before, when any single lawmaker from each chamber could trigger a challenge. - Jan. 20: The inauguration of the election winner and their vice president takes place. At this ceremony, the victor is officially sworn in and takes office."
}