{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0O041_L.jpg",
  "title": "Florida lawmakers vote to restrict children's access to social media",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 25, 2024 12:10AM ET",
    "Updated Jan 25, 2024 04:11PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Keith Dunkelbarger",
        "2024-01-25 23:41:23",
        "once again these decisions need to be made by the State.",
        "https://www.investing.com/members/255800168"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/florida-lawmakers-vote-to-restrict-childrens-access-to-social-media-3282417",
  "paragraph": "By Steve Gorman (Reuters) - The Florida House of Representatives approved on Wednesday a bill aimed at barring children aged 16 and younger from social media platforms, following similar action in several states to limit online risks to young teenagers. Passed by a bipartisan vote of 106 to 13, the measure would require social media platforms to terminate the accounts of anyone under 17 years old and use a third-party verification system to screen out the underaged. \"We must address the harmful effects social media platforms have on the development and well-being of our kids,\" said Florida House Speaker Paul Renner. \"Florida has a compelling state interest and duty to protect our children, their mental health, and their childhood.\" The bill would also require firms to permanently delete personal information collected from the terminated accounts and let parents bring civil suits against those failing to do so. The legislation now goes to the Florida state Senate for consideration. Republicans control both chambers of the state legislature. Sponsors said the measure was necessary to protect children from depression, anxiety and other mental health woes they say are linked to excessive use of social media, whose addictive aspects critics say make children especially vulnerable. Opponents argued that the bill goes too far, with some urging less restrictive measures, such as letting parents opt in or out of allowing their children to use social media.  Meta, the parent company of Instagram and Facebook (NASDAQ:META), opposed the legislation, usually referred to as HB1, saying it would limit parental discretion and raise data privacy concerns. \"HB 1 would require each new social media user, from a 13-year-old in Miami to a 73-year-old from Boca Raton, to provide possibly sensitive identifying information, such as a driver's license or birth certificate to a third-party organization to verify their age,\" Meta's Caulder Childs told the House's Judiciary Committee at a hearing on Jan. 17. Meta says it supports federal legislation for online app stores to secure parents' approval for downloads by teenagers younger than 16. The Florida measure does not identify any internet companies by name. Instead it defines a social media platform as an online forum that tracks account holders' activity by letting them create user profiles, then upload content or view the content or activities of other users and interact with, or track, them. Among the defining social media functions highlighted by the bill are \"addictive, harmful or deceptive design features\" or those that induce \"an excessive or compulsive need to use or engage with\" the platform. But the measure exempts websites and applications whose predominant function is email, messaging or texting, as well as streaming services, news, sports and entertainment sites, along with online shopping, gaming and academic sites. Utah became the first U.S. state to adopt laws regulating children's access to social media in March 2023, followed by others, such as Arkansas, Louisiana, Ohio and Texas, according to a legislative analysis prepared for the Florida bill.  \nIt said numerous other states were also contemplating similar regulations. In 2015 the European Union in 2015 passed a law requiring parental consent for a child to access social media, the analysis added."
}