{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK1300A_L.jpg",
  "title": "Russian cosmonaut sets record for most time in space - more than 878 days",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Feb 04, 2024 07:32AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/russian-cosmonaut-sets-record-for-most-time-in-space--more-than-878-days-3292008",
  "paragraph": "2/2\n© Reuters. FILE PHOTO: Roscosmos cosmonaut Oleg Kononenko reacts in the bus just before the departure to the launchpad at the Baikonur Cosmodrome, Kazakhstan September 15, 2023. REUTERS/Maxim Shemetov/Pool/File Photo\n2/2\nBy Guy Faulconbridge and Lidia Kelly MOSCOW (Reuters) -Russian cosmonaut Oleg Kononenko on Sunday set a world record for total time spent in space, surpassing his compatriot Gennady Padalka who logged more than 878 days in orbit, Russia's space corporation said. At 0830 GMT Kononenko broke the record, Roscosmos said. Kononenko is expected to reach a total of 1,000 days in space on June 5 and by late September he will have clocked 1,110 days. \"I fly into space to do my favourite thing, not to set records,\" Kononenko told TASS in an interview from the International Space Station (ISS) where he is orbiting about 263 miles (423 km) from the earth.  \"I am proud of all my achievements, but I am more proud that the record for the total duration of human stay in space is still held by a Russian cosmonaut.\" The 59-year-old took the top spot from Padalka, who accumulated a total of 878 days, 11 hours, 29 minutes and 48 seconds, Roscosmos said. The Soviet Union spooked the West in the early years of the space race by being first to launch a satellite to orbit the Earth - Sputnik 1, in 1957 - and then Soviet cosmonaut Yuri Gagarin became the first man to travel into space in 1961. But after the 1991 collapse of the Soviet Union, Russia's space programme grappled with massive funding shortages and corruption.  Officials under President Vladimir Putin have repeatedly vowed to turn around the decline of Russia's space programmes, though serious problems still remain, according to officials and space analysts.  LIFE IN SPACE Kononenko said that he worked out regularly to counter the physical effects of \"insidious\" weightlessness, but that it was on returning to earth that the realisation came of how much life he had missed out on. \"I do not feel deprived or isolated,\" he said.  \"It is only upon returning home that the realisation comes that for hundreds of days in my absence the children have been growing up without a papa. No one will return this time to me.\" He said cosmonauts could now use video calls and messaging to keep in touch with relatives but getting ready for each new space flight became more difficult due to technological advances.  \"The profession of a cosmonaut is becoming more complicated. The systems and experiments are becoming more complicated. I repeat, the preparation has not become easier,\" he said. Kononenko dreamed of going to space as a child and enrolled in an engineering institute, before undergoing cosmonaut training. His first space flight was in 2008. His current trip to the ISS launched last year on a Soyuz MS-24. \nThe ISS is one of the few international projects on which the United States and Russia still cooperate closely. In December, Roscosmos said that a cross-flight programme with NASA to the ISS had been extended until 2025. Relations in other areas between the two countries have broken down since Russia's invasion of Ukraine nearly two years ago, to which Washington responded by sending arms to Kyiv and imposing successive rounds of sanctions on Moscow."
}