{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK04099_L.jpg",
  "title": "Iraq prepares to close down US-led coalition's mission - PM",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 05, 2024 04:57AM ET",
    "Updated Jan 05, 2024 12:51PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/iraq-prepares-to-close-down-usled-coalitions-mission--pm-statement-3267879",
  "paragraph": "© Reuters. Iraqi Prime Minister Mohammed Shia al-Sudani speaks during a press conference with Spain's Prime Minister Pedro Sanchez (not seen) in Baghdad, Iraq, December 28, 2023. REUTERS/Thaier Al-Sudani/Pool/ File Photo\nBy Ahmed Rasheed and Phil Stewart BAGHDAD/WASHINGTON (Reuters) -The Iraqi government is beginning the process to remove the U.S.-led international military coalition from the country, Prime Minister Mohammed Shia al-Sudani's office said on Friday. The U.S. has 900 troops in Syria and 2,500 in Iraq on a mission it says advises and assists local forces trying to prevent a resurgence of Islamic State, which in 2014 seized large parts of both countries before being defeated. Sudani's statement came a day after a U.S. strike killed a militia leader in Baghdad, prompting anger among Iran-aligned groups which demanded the government end the presence of the coalition in Iraq. \"Government is setting the date for the start of the bilateral committee to put arrangements to end the presence of the international coalition forces in Iraq permanently,\" a statement from the prime minister's office said. The committee would include representatives of the military coalition, a government official said. The U.S. military launched Thursday's strike in retaliation against recent attacks on U.S. personnel, the Pentagon said. Iran-aligned militia groups in Iraq and Syria oppose Israel's campaign in the Gaza Strip and hold the U.S. partly responsible. Iraqi PM Sudani has limited control over some Iran-backed factions, whose support he needed to win power a year ago and who now form a powerful bloc in his governing coalition. \"We stress our firm position in ending the existence of the international coalition after the justifications for its existence have ended,\" Sudani was quoted as saying in the statement. Islamic State claimed responsibility on Thursday for two explosions in Iran that killed nearly 100 people and wounded scores at a memorial for top commander Qassem Soleimani. A political adviser close to the Iraqi prime minister said Sudani was falling under huge pressure from powerful Shi'ite parties close to Iran seeking to end the U.S. presence in Iraq and his recent statement was aimed at \"appeasing angry parties within the governing Shi'ite coalition against the United States\".  Still, it was unclear if Baghdad's announcement on Friday was mainly posturing for internal, political purposes or if the newly announced committee would truly set into motion an inexorable process to end America's military presence in Iraq, a longtime goal of Iran and groups Iran supports. U.S. PRESENCE U.S. President Joe Biden's administration had initially avoided any response to wave after wave of attacks in Iraq due to fears about a political backlash there, U.S. officials told Reuters, speaking on condition of anonymity. But Iraq's failure to rein in the militia amid escalating attacks against American personnel, including mortar fire against the U.S. embassy compound last month, appears to have pushed Washington into a more aggressive approach. The U.S. strike in Baghdad on Thursday targeted Mushtaq Jawad Kazim al-Jawari, who the Pentagon said was a leader of an Iran-backed terrorist group involved in planning and carrying out attacks against American personnel. The Pentagon declined to respond to Iraqi government comments suggesting he was part of its security forces, which include formal, legitimate institutions like the police and the Army. The Iraqi government said the killed commander was part of the Popular Mobilisation Forces (PMF), a group of many mainly Shi'ite Muslim armed groups formed in 2014 to fight Islamic State and subsequently recognised as an official security agency by Iraq's government.  In a sign that U.S. military sought to publicly acknowledge efforts by Iraq's formal security forces to address attacks against U.S. personnel, its Central Command thanked Iraq's police for their Jan. 3 discovery of a land-based cruise missile that a U.S. official said was aimed at American troops in the country. \"The Coalition is appreciative of the efforts of the legitimate security forces in Iraq for their efforts to prevent future attacks,\" it said in a post on social media platform X. \nThe Pentagon did not respond to requests for comment following the announcement from Sudani's office, referring journalists instead to comments on Thursday by the top U.S. military spokesperson calling Iraq a \"valued partner.\" \"We will continue to consult closely with the Iraqi government about the safety and security of U.S. forces. In the meantime, we will continue to stay very focused on that Defeat ISIS mission,\" Major General Patrick Ryder told a news briefing on Thursday."
}