{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0J09G_L.jpg",
  "title": "Residents of southern Mexican town set govt palace on fire after police kill young man",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 20, 2024 05:53PM ET",
    "Updated Jan 21, 2024 03:30AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Randy Randy",
        "2024-01-21 00:26:50",
        "Palace?",
        "https://www.investing.com/members/206014687"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/residents-of-southern-mexican-town-set-govt-palace-on-fire-after-police-kill-young-man-3278904",
  "paragraph": "2/2\n© Reuters. A burnt police car lies overturned, following the death of Brandon de Jesus Arellano, in Lerdo de Tejada, Veracruz, Mexico January 19, 2024 in this image obtained from social media by Reuters on January 20, 2024. OLIVIA HERNANDEZ/IMAGEN DE VERACRUZ/ vi\n2/2\nLERDO DE TEJADA, Mexico (Reuters) - Residents of a Mexican town set fire to the municipal palace overnight on Friday in a violent protest after local police shot a young man in the neck, according to his relatives, after he did not stop his car at a checkpoint. National media reported that police shot dead 27-year-old Brandon Arellano, the son of a local teacher, as he arrived outside his grandmother's house. Videos shared online show his father attempting to revive him at the scene.  \"Once he had parked, they opened fire against the car and killed him instantly, shooting him in the jugular like cowards,\" father Delfino Arellano said on video. \"My son died instantly.\" Authorities did not disclose why Arellano had been stopped. Residents of Lerdo de Tejada, a town in the Gulf coast state of Veracruz, overturned a police car and set it on fire and clashed with police officers at the scene. They also broke windows at the local government palace and set it on fire. \nA social media post from the state's public security ministry shortly after the killing said four municipal police officers had been detained for suspected homicide and would make their statements to state prosecutors. \"There will be no impunity,\" the ministry said."
}