{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK140PA_L.jpg",
  "title": "King Charles diagnosed with cancer, will postpone duties and undergo treatment",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 05, 2024 01:08PM ET",
    "Updated Feb 06, 2024 12:51AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/britains-king-charles-diagnosed-with-cancer--buckingham-palace-3293045",
  "paragraph": "© Reuters. Britain's King Charles reacts after unveiling statues of Britain's Queen Elizabeth and Prince Phillip upon his and Queen Camilla arrival to attend the Royal British Legion Festival of Remembrance at the Royal Albert Hall in London, Britain, November 11, 2\nBy Michael Holden and Muvija M LONDON (Reuters) -King Charles has been diagnosed with a form of cancer and will postpone public engagements to undergo treatment, Buckingham Palace said on Monday, but added he remained \"wholly positive\" about the scare less than 18 months into his reign.  Charles, 75, who became king in September 2022 following the death of his mother Queen Elizabeth, has begun a series of treatments, the palace said, adding he was looking forward to returning to fulltime duties as soon as possible. The cancer revelation comes after Charles spent three nights in hospital last month where he underwent a corrective procedure for a benign enlarged prostate. The palace said a separate issue of concern had been spotted during that hospital stay, but did not given any further details beyond saying tests had revealed the king had a \"form of cancer\". \"No further details are being shared at this stage, except to confirm that his majesty does not have prostate cancer,\" the palace said. \"Throughout this period, his majesty will continue to undertake State business and official paperwork as usual.\" As such, Charles will continue to have meetings with Prime Minister Rishi Sunak, while his wife Queen Camilla will continue with her engagements. SMILING On Sunday, the king gave no indication of the diagnosis when he was pictured smiling and waving to onlookers as he attended a church service with Camilla.  It was his first public outing since he and his daughter-in-law Kate left the same London hospital a week ago where they had both undergone planned treatments. Kate, the Princess of Wales and wife to heir to the British throne Prince William, spent two weeks at the London clinic following abdominal surgery for an unspecified but non-cancerous condition. She will not be returning to royal duties until after Easter. William, who has been looking after their three children as she recovers, will carry out his first public engagement since her operation on Wednesday. While the royals usually closely guard details of their health, regarding it as a private matter, Charles has been open about his recent treatment. \"His Majesty has chosen to share his diagnosis to prevent speculation and in the hope it may assist public understanding for all those around the world who are affected by cancer,\" Buckingham Palace said. Sunak sent his best wishes to the King on X. \"I have no doubt he'll be back to full strength in no time and I know the whole country will be wishing him well,\" he said. BIDEN CONCERN The leaders of Australia and Canada, where Charles is also head of state, expressed their best wishes and hopes for the king to make a speedy recovery, while U.S. President Joe Biden said he was concerned by the news and planned to call Charles later.  \"Navigating a cancer diagnosis, treatment, and survivorship takes hope and absolute courage,\" Biden said. \"Jill and I join the people of the United Kingdom in praying that His Majesty experiences a swift and full recovery.\" The monarch told his immediate family personally about his cancer diagnosis, and Prince Harry, his younger son, will travel to the UK to see him in the coming days, a source close to the Duke of Sussex said. Harry now lives in California with his American wife Meghan and their two children after the couple stepped down from royal duties in 2020. After waiting longer than any heir in British history to become king, Charles' first year on the throne was dominated by his coronation - Britain's biggest ceremonial event for generations, full of pomp and pageantry. While before he became sovereign there were suggestions that the long-time environmental campaigner would bring a radical overhaul of the monarchy, Charles has generally followed in the style of his mother, while trying to add some of his own touches. Polls suggest most Britons have a favourable view of his reign so far, although younger generations appear much less enthusiastic about the royal family in general. Prior to his recent health issues, the biggest shadow over the royals was the ongoing fallout between his son Harry and the rest of his family, most notably Harry's elder brother Prince William. Ingrid Seward, editor-in-chief of Majesty Magazine, said that for Charles, a workaholic who often worked until midnight on his papers, his recent health issues would mean he would have to take it more slowly now.  \"His body will tell him he has to, and Camilla certainly will,\" she said. \"I think he's mentally exhausted since the death of the queen. It's been non-stop for him since then.\" \nWhile Queen Margrethe II of Denmark abdicated last month in favour of her son King Frederik X after 52 years on the throne, Seward said there was no chance Charles would follow suit. \"Absolutely not, 100% no,\" she said."
}