{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBQ0EL_L.jpg",
  "title": "Jacques Delors, father of European integration, dies at 98",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 27, 2023 12:54PM ET",
    "Updated Dec 27, 2023 01:41PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/jacques-delors-father-of-european-integration-dies-at-98-3264105",
  "paragraph": "© Reuters. FILE PHOTO: European Union President Jacques Delors listens to a question during a press conference on the book \"In search of Europe\" October 21, 1994, at the EU headquarters. REUTERS/Nathalie Koulischer/File Photo\n(Reuters) -Jacques Delors, a passionate advocate of post-war European integration and a founding father of the European Union's single currency project, has died, his family said. He was 98. The French socialist served as president of the European Commission, the EU executive, for three terms - longer than any other holder of the office - from January 1985 until the end of 1994, a time of rapid change for Europe's emerging union.  The era was marked by forthright clashes of vision between federalists such as Delors, who believed passionately in an \"ever closer union\", and Britain's then prime minister Margaret Thatcher, who firmly resisted any shift of power to Brussels. So antagonistic did relations between London and Brussels become towards the end of Thatcher's time in office, especially over the plans for monetary union, that The Sun tabloid famously ran a front page headline reading: \"Up Yours Delors\". Delors' death came three years after Britain fully exited the EU on Dec. 31, 2020, following tortuous negotiations and 47 years of membership.  Delors, a Catholic trade unionist with a background in economic planning, was an outspoken force at the heart of the Brussels bureaucracy, tirelessly crafting compromises among member states to build the European single market, one of the EU's defining achievements.  He oversaw a period of rapid enlargement, with the 10-member European Community, as it was then called, growing to 12 with the accession in 1986 of Spain and Portugal and then adding Sweden, Austria and Finland in 1995. The era was defined by the fall of the Berlin Wall and the reunification of Germany, as the tectonic plates underpinning modern Europe shifted. The post-war ideal of a unified continent - the dream of federalists - began to seem real. Delors' commitment to a united Germany led to a close bond with then German chancellor Helmut Kohl and helped to cement the Franco-German relationship that remains critical to the EU. 'COILED SPRING' Those who worked with Delors recall a man with endless energy and drive who was not afraid to lose his temper or twist the right arm if it might get the deal he believed possible.  \"I like Delors above all for his intellect. He had the most formidable brain I ever encountered,\" Peter Sutherland, a former commissioner from Ireland, said of him in the 1990s. \"But he was extremely tense, like a coiled spring.\" Others describe the small, dapper man with heavy-framed glasses and grey hair swept back as someone capable of applying \"rudeness, finesse, insight and diplomatic skill\" all at the same time \"while promising more than there really was\". Of himself, Delors once said: \"I don't hide. I make mistakes, I lose my temper. But people say, 'that guy, he's human.' I shall never be a great politician because I cannot get concerned about my image.\" Jacques Lucien Jean Delors was born in Paris in 1925 to a devoutly Catholic family. He earned a degree in economics from the Sorbonne and followed his father into a career at the central bank. A union member from a young age and a staunch defender of labour rights throughout his life, Delors joined the Socialist Party in the 1970s, carefully balancing his politics with his religious faith and a belief in a market economy. After a two-year stint in the European Parliament, where he headed the economic affairs committee, he served as minister of finance, economics and budget under President Francois Mitterand, gaining a front-row seat on the shaping of economic policy in Europe in the early 1980s. COLLISION COURSE As president of the Commission from 1985 he was convinced of the need to forge deeper economic and monetary ties among the member states of the European Community. That passion for integration is what would set him on a collision course with Thatcher, who saw in Delors all the dangers of a French-dominated European superstate. Their bristling animosity came to a head in 1988, after Delors made a pro-Europe speech to Britain's Trade Union Congress, an enemy of Thatcherism, prompting a severe retort from Thatcher in a speech in Bruges weeks later. The blood rose again in 1990, when Thatcher's government was on its last legs and Britain was becoming isolated in Europe.  Challenged in parliament over her Europe policy, Thatcher said: \"The president of the Commission, Mr Delors, said... he wanted the European Parliament to be the democratic body of the Community, he wanted the Commission to be the executive and he wanted the Council of Ministers to be the senate. No! No! No!\" Delors ushered through the Maastricht Treaty in 1992, which established the European Union, and launched the single market in 1993, finally stepping down in December 1994. He decided not to run for the French presidency in the 1995 election and remained mostly preoccupied with European issues, setting up his own think-tank, Notre Europe, and supporting groups dedicated to federalism. \nHe spoke often during Europe's 2010-2013 debt crisis about his belief in the single currency, the euro, while acknowledging its faults as a project launched with strong political will but insufficient economic underpinning. Delors is survived by his daughter Martine Aubry, a French politician who is mayor of Lille and who campaigned to be the socialist candidate for the French presidency in 2011, losing to Francois Hollande."
}