{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK02038_L.jpg",
  "title": "Yemen's Houthis say they 'targeted' container ship, no damage reported",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 02, 2024 11:53PM ET",
    "Updated Jan 03, 2024 09:15AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-says-no-damage-reported-after-latest-houthi-attack-in-red-sea-3265853",
  "paragraph": "© Reuters. FILE PHOTO: FILE PHOTO: Houthi military helicopter flies over the Galaxy Leader cargo ship in the Red Sea in this photo released November 20, 2023. Houthi Military Media/Handout via REUTERS THIS IMAGE HAS BEEN SUPPLIED BY A THIRD PARTY/File Photo/File \nDUBAI (Reuters) -Yemen's Iran-backed Houthis said on Wednesday they had \"targeted\" a container ship bound for Israel, a day after the U.S. Central Command (CENTCOM) said the militant group had fired two anti-ship ballistic missiles in the southern Red Sea. The Houthis, who control much of Yemen including the capital, have since October attacked in the Red Sea commercial vessels they say have Israeli links or are sailing to Israel, in solidarity with Palestinians in Gaza. The Houthis' military spokesman Yahya Sarea said in a televised speech the group had \"targeted\" the CMA CGM Tage container ship without elaborating. He did not say when or where the incident took place. Sarea also said the Houthis had sent out warning messages to the ship and that its crew had paid no heed. Asked about the Houthis' claim, the French shipping firm CMA CGM told Reuters the vessel was unharmed and had suffered no incident. The company also said the ship had been headed for Egypt, not Israel. In his speech, Sarea reiterated the Houthis' stance that they would continue their attacks until aid enters Gaza and issued another warning to the United States. \"No U.S attack will pass without a response or punishment,\" he added. CENTCOM had said in its statement late on Tuesday that there were no reports of any damage caused by the two missiles it said the Houthis had fired in the area. Multiple commercial ships in the area reported the impact of the missiles in surrounding waters, CENTCOM added. \nThe United Kingdom Maritime Trade Operations Authority had earlier reported up to three explosions one to five nautical miles from a merchant vessel in the Bab al-Mandab strait, 33 nautical miles east of Eritrea's Assab, adding there were no reports of damage.  Several shipping lines have suspended operations through the Red Sea waterway in response to the attacks, instead taking the longer journey around Africa."
}