{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0U0U6_L.jpg",
  "title": "White House's Podesta to replace Kerry as top US climate diplomat",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 31, 2024 03:11PM ET",
    "Updated Feb 01, 2024 11:01AM ET"
  ],
  "comments": [
    4,
    [
      [
        "Rakesh Mital",
        "2024-02-06 14:36:39",
        "fossil fuels should remain till the time these multi-millionaire climate czars commercialize nuclear fission technology for full-scale use by humanity....till then they can climb a tree",
        "https://www.investing.com/members/227776711"
      ],
      [
        "Yogi Bear",
        "2024-02-05 20:24:24",
        "It amazes me that a loser like Podesta would want to follow in the footsteps of an even bigger blowhard like Kerry.  Tweedle Dum takes over for Tweedle Dee.  This climate scam has the potential to throw millions out of work and wreck most of the world's economy to solve a problem that doesn't exits.  Wow.",
        "https://www.investing.com/members/205793185"
      ],
      [
        "Barry Nickerson",
        "2024-02-02 11:17:13",
        "Ack!  This means that there are at least two people in D.C, that believe this climate stuff.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Ian Salter",
        "2024-02-04 23:40:18",
        "And a bunch of moronic idiots who don't!",
        "https://www.investing.com/members/204927494"
      ],
      [
        "Mark Gesswein",
        "2024-02-01 16:16:23",
        "Pedo Podesta gotta keep getting paid. Climate Czar?? Wow… 🙄",
        "https://www.investing.com/members/245851936"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/white-houses-podesta-to-replace-kerry-as-us-climate-envoy-wash-post-3288815",
  "paragraph": "By Steve Holland and Valerie Volcovici WASHINGTON (Reuters) -White House senior adviser John Podesta will replace John Kerry as the U.S. climate change diplomat, the White House said on Wednesday. Kerry, a former senator and secretary of state who for decades has engaged in global climate policy, announced earlier this month that he would step down from the diplomatic role to work on President Joe Biden's reelection campaign.  Podesta, 75, has served several Democratic U.S. presidents, including as White House chief of staff to Bill Clinton and as an adviser to Barack Obama. He was chairman of former Secretary of State Hillary Clinton's 2016 presidential run and currently oversees the implementation of the Biden administration's sweeping climate bill, the Inflation Reduction Act. \"Secretary Kerry has put the U.S. back in leadership on climate around the world,\" Podesta told the Washington Post in an interview on Wednesday. \"And we’ll ensure that we keep up the momentum that has been built up through his efforts.\" Podesta steps into the role after the COP28 climate summit in Dubai concluded with a global deal for countries to transition away from fossil fuels just as the U.S. became the world's largest producer of oil and natural gas. Biden last week paused approvals for pending and future applications to export liquefied natural gas (LNG) from new projects, a move cheered by climate and environmental justice activists, who have previously criticized the administration for approving a controversial oil drilling project in Alaska. \"Podesta needs to take the baton from Kerry and lead the U.S. on a furious sprint to end oil and gas expansion while we still have time to prevent the worst climate catastrophes,\" Jean Su, director of energy justice at the Center for Biological Diversity, said in a statement. Podesta brings decades of experience - and close contacts with climate diplomats in China - to the role. Kerry and Podesta had a long-standing, warm relationship with former Chinese climate envoy Xie Zhenhua, who stepped down from his role after COP28. Podesta played a central role alongside Kerry and former U.S. climate envoy Todd Stern in brokering the first U.S.-China bilateral agreement on climate change in 2014, a diplomatic breakthrough credited for paving the way for the 2015 Paris climate agreement. \n\"He will bring important expertise to the work ahead, particularly in respect to the down-to-earth challenges of implementing COP28,\" Kerry said in a statement on Wednesday. A White House official said Podesta will assume the role of senior advisor to the president for international climate policy while continuing to work with a team implementing the Inflation Reduction Act. The role does not require a Senate confirmation."
}