{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0202I_L.jpg",
  "title": "Indonesia election watchdog summons president's son over alleged violation",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 02, 2024 10:45PM ET",
    "Updated Jan 02, 2024 10:50PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/indonesia-election-watchdog-summons-presidents-son-over-alleged-violation-3265832",
  "paragraph": "© Reuters. FILE PHOTO: The eldest son of Indonesian President Joko Widodo, vice presidential candidate Gibran Rakabuming Raka, gestures during a televised debate at the Jakarta Convention Center in Jakarta, Indonesia, December 22, 2023. REUTERS/Ajeng Dinar Ulfiana/F\nJAKARTA (Reuters) - Indonesia's election watchdog has summoned President Joko Widodo's son, the leading presidential candidate's running mate, for questioning over an alleged campaign violation, an election official said. Gibran Rakabuming Raka is seeking to be vice-president with Defence Minister Prabowo Subianto as his running mate in the Feb. 14 election, and the pair command a solid lead over teams led by rival presidential candidates Anies Baswedan and Ganjar Pranowo. The election watchdog (Bawaslu) chapter in Central Jakarta summoned Gibran for allegedly violating campaign rules by handing out free milk to people at a public \"car-free day\" event last month, the official said on Tuesday. \"We need to have clarification from Gibran, we want to make sure whether it (the allegation) is right or not,\" Dimas Trianto Putro, an official at Bawaslu, told reporters.  A 2016 Jakarta gubernatorial regulation bars \"events for the interests of political parties\" at car-free day events, during which vehicles are banned from entering major thoroughfares. Bawaslu does not have the authority to penalise Gibran, and it was not immediately clear if city authorities would mete out any punishment. Habiburokhman, a deputy head of Prabowo's campaign team, told Reuters that Gibran will attend Bawaslu's summons on Wednesday around 1 p.m. (0600 GMT) Another deputy at Prabowo's campaign team, Afriansyah Noor, said the team would honour the agency's ruling if the allegations are proven correct, adding it did not know the act was a violation. \nGibran's candidacy has been controversial because of a decision by the country's constitutional court last October removing an age bar that paved the way for him to run in the elections. While Prabowo is ahead of his opponents, there has been an uptick in popularity for Anies, with two polls in December by the Centre for Strategic and International Studies and Kompas newspaper showing he had overtaken Ganjar."
}