{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "North Korea says tests underwater nuclear drone, criticises US-led joint drills",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 18, 2024 10:29PM ET",
    "Updated Jan 19, 2024 04:17AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/north-korea-says-tests-underwater-nuclear-drone-criticises-usled-joint-drills-3277873",
  "paragraph": "By Hyonhee Shin SEOUL (Reuters) -North Korea has conducted a test of its underwater nuclear weapons system in a protest against this week's joint military drills by South Korea, the United States and Japan, state media KCNA said on Friday.  The test of the \"Haeil-5-23\" system, a name North Korea has given to its nuclear-capable underwater attack drones, was carried out by the defence ministry's think tank in the waters off its east coast, the report said, without specifying a date.  The ministry's unnamed spokesman accused the United States, South Korea and Japan of \"getting frantic\" with military exercises, warning of \"catastrophic consequences.\"  The three countries' navies held their three-day regular drills until Wednesday, alongside the U.S. aircraft carrier Carl Vinson, as part of efforts to improve their responses to Pyongyang's evolving nuclear and missile threats. \"Our army's underwater nuke-based countering posture is being further rounded off and its various maritime and underwater responsive actions will continue to deter the hostile military manoeuvres of the navies of the U.S. and its allies,\" the North Korean ministry spokesman said in a statement, according to KCNA. North Korean state television has aired previous atmospheric explosion tests, which have been monitored by U.S. and South Korean authorities, but the reported underwater weapon has not been independently verified. Later on Friday, South Korea's defence ministry issued a warning against the North's recent series of weapons tests, calling for an immediate halt.  \"Our military is thoroughly prepared for North Korea's provocations under a solid joint defence posture with the United States,\" it said in a statement, vowing \"overwhelming\" responses if North Korea stages a direct provocation.  Japan's foreign minister Yoko Kamikawa, when asked about the North's latest test at a news conference, declined to comment on \"each and every one of those activities\" but pledged continued efforts to curb its weapons development. Dubbed \"Haeil\", which means tsunami, the new drone system was first reportedly tested in March 2023, and state media said it was intended to make sneak attacks in enemy waters and destroy naval strike groups and major operational ports by creating a large radioactive wave through an underwater explosion. The latest reported underwater test came days after North Korea fired a new intermediate-range, solid-fuel hypersonic missile, which Washington, Seoul and Tokyo condemned as a serious violation of U.N. Security Council resolutions. The three allies' nuclear envoys gathered in Seoul on Thursday, also condemning Pyongyang's arms trade with Russia and increasingly hostile rhetoric, just as North Korea's foreign minister visited Moscow and met with President Vladimir Putin."
}