{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0M02N_L.jpg",
  "title": "Philippines will not 'lift a finger' to assist ICC's drug war probe",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 23, 2024 12:41AM ET",
    "Updated Jan 23, 2024 04:16AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/philippines-will-not-lift-a-finger-to-assist-iccs-drug-war-probe-3280225",
  "paragraph": "© Reuters. FILE PHOTO: Philippine President Ferdinand Marcos Jr. delivers a joint statement during the visit of Indonesian President Joko Widodo at the Malacanang Palace, in Manila, Philippines, January 10, 2024. Ezra Acayan/Pool via REUTERS/File Photo\nBy Neil Jerome Morales and Mikhail Flores MANILA (Reuters) -The Philippine government will not cooperate with the International Criminal Court's (ICC) investigation into a brutal anti-narcotics campaign, President Ferdinand Marcos Jr said on Tuesday. \"I consider it as a threat to our sovereignty. Therefore, the Philippine government will not lift a finger to help any investigation that the ICC conducts,\" Marcos told reporters, reiterating his earlier position. The ICC in July rejected an appeal by Manila and allowed an investigation to resume into the thousands of killings during former President Rodrigo Duterte's 'war on drugs' and other suspected rights abuses. Marcos said ICC investigators can come and visit \"as ordinary people\" but the government will not assist them. Marcos' remarks followed a statement made by his justice minister who last week told Kyodo News the government may allow an ICC probe if legal procedures were followed, a move which Duterte's camp maintained was illegal. In a statement, Vice President Sara Duterte echoed the position long held by her father that foreigners should not be allowed to meddle in the country's affairs, adding she will refuse to be a part of a process that would put shame the country's courts and judicial system. \"Allowing the ICC to conduct its probe in our country, in brazen violation of the constitution, is an absolute surrender of our birthright as a sovereign nation,\" Salvador Panelo, Duterte's former presidential spokesperson, said in a message. The Philippines officially withdrew from the international tribunal in 2019 after then President Duterte questioned its authority to investigate the campaign against illegal drugs that killed thousands of people. \nPolice say they killed 6,200 dealers who resisted arrest during anti-drug operations during Duterte's term. Many thousands more users and peddlers were gunned down during the crackdown, in what authorities said were vigilante killings. Rights groups and some victims accuse the police of systematic cover-ups and executions, which they deny. In November, Marcos said he was studying the Philippines' return to the ICC's fold, months after saying he would cut off contact with the tribunal."
}