{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0D012_L.jpg",
  "title": "Three migrants drown at US border as Texas, White House feud",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 16, 2024 04:58AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/three-migrants-drown-at-us-border-as-texas-white-house-feud-3274683",
  "paragraph": "© Reuters. FILE PHOTO: Texas National Guard troops watch a Mexican official prevent a group of people from entering the Rio Grande River across from Shelby Park at the U.S.-Mexico border in Eagle Pass, Texas, U.S., January 12, 2024. REUTERS/Kaylee Greenlee Beal/\nBy Jonathan Allen (Reuters) -A woman and two children drowned in the Rio Grande as they tried to the enter the U.S. from Mexico on Friday night after Texas military officers prevented federal border officials from aiding them, U.S. border officials and a member of Congress said. The deaths come as a dispute over immigration intensifies between Texas Governor Greg Abbott, a Republican, and the administration of U.S. President Joe Biden, a Democrat, with a record number of migrants having illegally crossed the border since Biden took office in 2021. Under Abbott, Texas has increasingly sought to implement its own border controls, which have historically been the legal domain of the federal government. Officials said the three were attempting to cross the river near Shelby Park in Eagle Pass, which is not a legal port of entry and is where the Texas National Guard this week added concertina wire and fencing.  In a filing in the U.S. Supreme Court on Friday, the federal government accused Texas of erecting the new barriers to block federal Border Patrol agents from reaching a boat ramp they use to access the Rio Grande.  Responding on Saturday, Texas said federal Border Patrol agents had largely stopped using the boat ramp in recent months and, until Friday's filing, it was \"unaware of federal law enforcement's current objections and was working promptly to address them.\" Federal Border Patrol agents learned around 9 p.m. Central Time on Friday (0300 GMT Saturday) of a group of migrants in distress as they attempted to cross the Rio Grande, according to the statement by U.S. Representative Henry Cuellar, a Democrat. Federal agents, failing to contact Texas officials by telephone, went in person to the Shelby Park entrance to speak to the Texas Military Department (TMD) and the Texas National Guard officials there. \"However, Texas Military Department soldiers stated they would not grant access to the migrants - even in the event of an emergency - and that they would send a soldier to investigate the situation,\" Cuellar's statement said. The Texas military officials \"physically barred\" U.S. border agents from entering the area and performing their roles of arresting people crossing the border illegally and providing humanitarian aid, said Luis Miranda, a spokesperson for the U.S. Department of Homeland Security. \"The Texas governor's policies are cruel, dangerous, and inhumane, and Texas's blatant disregard for federal authority over immigration poses grave risks,\" Miranda said in a statement. \"The State of Texas should stop interfering with the U.S. Border Patrol's enforcement of U.S. law.\" The bodies of the woman and two children were recovered on Saturday by Mexican authorities, Cuellar said. The identities of the three people have not been made public. \"This is a tragedy, and the State bears responsibility,\" Cuellar said. The TMD, offering a starkly different account, said it was contacted by Border Patrol around 9 p.m. for a migrant distress situation and a unit in the vicinity of the boat ramp actively searched the river but saw no migrants. When they saw Mexican authorities responding to an incident on their side of the river about 45 minutes later, they ceased search operations after reporting their observations to the Border Patrol, who confirmed that the Mexican authorities did not require additional assistance, the TMD said in a statement. \n\"At no time did TMD security personnel along the river observe any distressed migrants, nor did TMD turn back any illegal immigrants from the US during this period,\" the statement said.  \"Also, at no point was TMD made aware of any bodies in the area of Shelby Park, nor was TMD made aware of any bodies being discovered on the U.S. side of the border regarding this situation.\""
}