{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK070JF_L.jpg",
  "title": "Biden's infrastructure czar to help lead re-election effort",
  "category": "Economic indicators",
  "publisher": "Reuters",
  "date": "Published Jan 08, 2024 10:02AM ET",
  "comments": [
    1,
    [
      [
        "John Wim",
        "2024-01-08 16:29:17",
        "It will not be a rematch with the Donald. I much stronger candidate is appearing in the horizon. Watch out democrats ",
        "https://www.investing.com/members/204005689"
      ],
      [
        "Brad Albright",
        "2024-01-09 11:37:09",
        "I don't think the GOP magaloons will nominate her.",
        "https://www.investing.com/members/236251128"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/economic-indicators/bidens-infrastructure-czar-to-help-lead-reelection-effort-3269645",
  "paragraph": "© Reuters. White House Senior Advisor & Infrastructure Act Implementation Coordinator Mitch Landrieu joins Press Secretary Jen Psaki for the daily press briefing at the White House in Washington, U.S., January 18, 2022. REUTERS/Jonathan Ernst/ File Photo\nWASHINGTON (Reuters) - Joe Biden's infrastructure czar Mitch Landrieu is leaving his White House role to help lead the U.S. president's re-election campaign as Biden tries to energize his pitch for another term. In a statement, Biden praised Landrieu's work implementing a $1 trillion law aimed at building bridges, roads, electric vehicle charging stations and high-speed internet access, saying it shows \"we can do big things\". Landrieu's work \"to lift up how President Biden is investing in America and rebuilding the backbone of our economy is critical to our re-election effort,\" Biden campaign manager Julie Chavez Rodriguez said in a separate statement.  The shift comes as Biden attempts to ramp up his campaign ahead of the November election which is shaping up to be a rematch with former President Donald Trump, who is leading polls for the Republican nomination. Biden hopes to capitalize on the economy and his efforts to rebuild America. But polls showing a tight race have also prompted scrutiny of his campaign. Former President Barack Obama, who served eight years with Biden as vice president, recently met with Biden amid concerns that Trump could win, a source told Reuters.  Biden has kept long-serving senior advisers at the White House and Obama has told allies Biden's campaign must be able to make decisions without White House clearance, The Washington Post reported.  Biden's administration has touted more than 40,000 projects nationwide, though they will take three to five year to complete. Landrieu, as a White House adviser, was barred by law from making any comments tying the work to Biden's re-election. Biden has cast the 2024 presidential election as a test for Democracy after Trump's efforts to remain in power and overturn the 2020 election prompted federal and state criminal charges, which the former president has denied.  But he has also leaned on the nation's post-pandemic economic recovery, which has seen low unemployment and inflation stabilize even as consumers remained pessimistic over higher prices, though sentiments have risen.  \nTrump, who has pleaded not guilty to the election subversion and other charges, has warned as he did in 2020 that Biden's election would roil the economy.  Reuters/Ipsos polling last month showed a close rematch, with some 45% of respondents who said Trump handled the economy better compared to 33% who picked Biden."
}