{
  "image": "https://i-invdn-com.investing.com/news/World_News_10_800x533_L_1420026292.jpg",
  "title": "Mississippi authorities release footage of shooting of 11-year-old boy",
  "category": "General",
  "publisher": "Reuters",
  "date": "Published Jan 07, 2024 01:44PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/general/mississippi-authorities-release-footage-of-shooting-of-11yearold-boy-3268710",
  "paragraph": "(Reuters) - Body-camera footage of the shooting of an 11-year-old boy by a Mississippi police officer has been released by the state's department of public safety, according to ABC's \"Good Morning America,\" which aired an excerpt of the footage on Sunday. The clip showed Indianola Officer Greg Capers arriving at the home of Aderrien Murry early one morning last May, after the 11-year-old called police to his home because his father was threatening his mother. It also showed the moment Capers shot the unarmed boy in the chest, just as the boy entered the room and put his hands up. Murry survived but suffered extensive injuries and had to undergo costly medical treatment. A grand jury opted not to indict Capers in December, finding that he had no criminal intent when he shot Murry. The Murrys also filed a civil lawsuit in May against Capers, the city of Indianola, and its police chief, seeking $5 million in damages for Capers' alleged \"reckless disregard\" for the Murrys' rights and safety. Murry's mother and her attorney were allowed to view body-camera footage of the shooting in December, but they were prohibited from publicly releasing the video. The Mississippi Bureau of Investigation did not immediately respond on Sunday to a request for the body-camera footage of the shooting. \"The City of Indianola fought hard to prevent the release of the body camera footage of Officer Greg Capers shooting my unarmed client,\" wrote Murry's lawyer, Carlos Moore, in a post on the social media platform X on Saturday. \"I guess they forgot that the MBI investigation was over and that the media outlets could get it.\" The Indianola Police Department has referred requests for comment on the case to the Mississippi Attorney General's Office, which has said it will not take further criminal action in the matter after the grand jury's decision."
}