{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0H0F6_L.jpg",
  "title": "Analysis-Biden's strategy on Yemen aims to weaken, not destroy, Houthis",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 18, 2024 06:13AM ET",
    "Updated Jan 18, 2024 06:28AM ET"
  ],
  "comments": [
    2,
    [
      [
        "Ken Roth",
        "2024-01-18 16:28:12",
        "So mark would prefer that we invade Yemen would that be a good move for US?",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Mark Jannetty",
        "2024-01-18 16:44:40",
        "these conflicts around the world are only happening because they know the US has a potato as a leader. I don't think we should be involved at all. The UN and Nato should be the big brother for the world. We have our own crisis on the border here",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Mark Jannetty",
        "2024-01-18 14:50:35",
        "weakest president in US history ",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Ken Roth",
        "2024-01-18 16:27:06",
        "at least he is honest",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/analysisbidens-strategy-on-yemen-aims-to-weaken-not-destroy-houthis-3277156",
  "paragraph": "© Reuters. FILE PHOTO: U.S. President Joe Biden speaks to the press, as he visits Allentown Fire Training Academy, in Allentown, Pennsylvania, U.S., January 12, 2024. REUTERS/Leah Millis/File Photo\nBy Phil Stewart, Idrees Ali and Jonathan Landay WASHINGTON (Reuters) - U.S. President Joe Biden's emerging strategy on Yemen aims to weaken the Houthi militants but stops well short of trying to defeat the group or directly address Iran, the Houthi's main sponsor, raising risks of prolonged conflict, experts say. The strategy - a blend of limited military strikes and sanctions - appears aimed at preventing a wider Middle East conflict even as Washington seeks to punish the Houthis for their attacks on Red Sea shipping.  But it is unclear whether it will accomplish Biden's main goal: halting the militants' attacks.  Analysts warn a middle-road attempt could mean continued instability along a vital global shipping chokepoint without removing the risk of greater regional military confrontation. \"I think the strategy is sustainable. I just don't think it's going to work,\" said Seth Jones at the Center for Strategic and International Studies think tank.  \"Limited strikes against Houthi targets are not going to deter attacks around the Red Sea.\" The Houthis say their attacks on Red Sea shipping are intended to support Palestinians against Israel, a popular cause in Yemen. The Houthis' campaign has disrupted global commerce, stoked fears of inflation and deepened concern that fallout from the Israel-Hamas war could destabilize the Middle East.  After months of warnings, Biden last week authorized a wave of airstrikes against Houthi military targets, hitting missiles, drones and radar stations. But the Houthis have kept up their attacks. On Tuesday, the U.S. military struck four anti-ship ballistic missiles as they prepared to launch against Red Sea targets and on Wednesday strikes destroyed 14 more. Both actions suggest the U.S. is choosing military targets based on real-time intelligence.  \"If we see a target, we will hit it,\" one U.S. official said.  Biden's national security adviser has publicly hinted at the likely need for more military action. \"We anticipated the Houthis would continue to try to hold this critical artery at risk and we continue to reserve the right to take further action,\" Jake Sullivan said on Tuesday.  Some U.S. officials and experts believe the Houthis welcome the confrontation with the United States, saying it helps them win popular support in Yemen and burnishes their brand in the Middle East as part of the Iran-backed \"Axis of Resistance.\" And the Houthis appear to believe they can endure U.S. bombings, even if some stocks of missiles and drones are destroyed. \"The fact of the matter is that (drones and missiles are) relatively easily replaced,\" said Gerald Feierstein, a former U.S. ambassador to Yemen. \"Whether they get the motors or the guidance systems or something else from Iran, they can put together the pieces themselves.\" TERRORIST DESIGNATION The U.S. strategy of balanced escalation was apparent on Wednesday when the Biden administration returned the Houthis to a list of terrorist groups.  But it delayed implementation for 30 days, to help limit the impact on humanitarian aid to Yemen, and Biden also stopped short of relisting the group as a \"foreign terrorist organization (FTO).\"  The FTO designation includes far stricter measures than the Houthis new designation as a Specially Designated Global Terrorist\" (SDGT). Gregory Johnsen, a non-resident fellow with the Arab Gulf States Institute, said he doubted the step would be effective. \"This is largely a symbolic act that's going to have some humanitarian repercussions, but it's not going to do anything to prevent the Houthis from carrying out these attacks,\" he said. One senior Biden administration official, briefing reporters on the decision, said Washington was still \"committed to resolving the conflict in Yemen\" and to reach a durable ceasefire between Saudi Arabia and the Houthis. Jonathan Lord, director of the Middle East security program at the Center for a New American Security, said Biden was hoping to deter the Houthis and effectively \"stick the landing in some sort of negotiated peace in Yemen.\" But Lord, a former Pentagon official, said the strategy largely ignored the Houthis main backer - Iran - and would tie up valuable, and costly, U.S. Navy assets. \n\"Iran can provide the Houthis with capabilities that are asymmetrically cheaper,\" Lord said.  \"U.S. capabilities, by and large, live off of aircraft carriers and other naval vessels which need to go in and out of the region, but also are needed elsewhere in the world.\""
}