{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0L0B6_L.jpg",
  "title": "Israeli forces storm hospital as Khan Younis hit by bloodiest fighting of 2024",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 22, 2024 05:16AM ET",
    "Updated Jan 22, 2024 05:57PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/israeli-tanks-cut-off-two-hospitals-in-new-storming-of-gazas-khan-younis-3279299",
  "paragraph": "5/5\n© Reuters. Smoke rises during an Israeli ground operation in Khan Younis, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, as seen from Rafah in the southern Gaza Strip, January 22, 2024. REUTERS/Ibraheem Abu Mustafa\n2/5\nBy Bassam Masoud, Nidal al-Mughrabi and Dan Williams GAZA/DOHA/JERUSALEM (Reuters) - Israeli forces, advancing deep into western Khan Younis in Gaza's bloodiest fighting so far in January, stormed one hospital and put another under siege on Monday, cutting off the wounded from trauma care, Palestinian officials said. Troops advanced for the first time into the al-Mawasi district near the Mediterranean Coast, west of Khan Younis, the main city in southern Gaza. There, they stormed the Al-Khair hospital and were arresting medical staff, Gaza health ministry spokesman Ashraf al Qidra told Reuters. There was no word from Israel on the situation at the hospital, and the military spokesperson's office had no comment. The military said later that three Israeli soldiers were killed on Monday in southern Gaza. Qidra said at least 50 people were killed overnight in Khan Younis, while the sieges of medical facilities meant dozens of dead and wounded were beyond the reach of rescuers. \"The Israeli occupation is preventing ambulance vehicles from moving to recover bodies of martyrs and the wounded from western Khan Younis,\" he said. The Palestinian Red Crescent said tanks had surrounded another Khan Younis hospital, al-Amal, headquarters of the rescue agency, which had lost contact with staff there. \"We are deeply worried about what is happening around our hospital,\" said Tommaso Della Longa, spokesperson for the International Federation of Red Cross and Red Crescent Societies. Israel says Hamas fighters operate in and around hospitals, which Hamas and medical staff deny. Elad Goren of COGAT, the Israeli defence ministry branch that coordinates with the Palestinians, added that: \"A particular effort led by a dedicated team has been put on making sure civilians have access to medical care.\" White House National Security Council spokesman John Kirby (NYSE:KEX) on Monday said Israel had a right to defend itself but added: \"We expect them to do so in accordance with international law and to protect innocent people in hospitals, medical staff and patients as well, as much as possible.\"  Residents said the bombardment from air, land and sea was the most intense in southern Gaza since the war began in October. Video filmed from afar showed scattered civilians wandering around a ghost city crowded with tents, abandoned laundry flapping on lines as gunfire rattled and smoke rose into the sky. Israel launched an offensive last week to capture Khan Younis, which it now says is the principal headquarters of the Hamas militants responsible for the Oct. 7 attacks on southern Israel that killed 1,200 people, according to Israeli tallies. On Monday the Israeli Defense Forces said they had found weapons, explosives, rockets and a weapons facility and destroyed tunnel shafts and underground infrastructure in recent days in Khan Younis. PENNED IN The newest phase of the war has brought fighting deep into the last corners of the enclave packed with those fleeing bombardment. At least 25,295 Gazans have been killed since Oct. 7, Gaza health authorities said in an update on Monday. Most of Gaza's 2.3 million residents are now penned into Rafah just south of Khan Younis and Deir al-Balah just north of it, crammed into public buildings and camps of tents made from plastic sheets lashed to wooden frames. Lines of cars and donkey carts piled high with belongings pushed south as Gazans sought to flee the bombardments. \"This is the seventh time I get displaced,\" said Gazan Mariam Abu-Haleeb, weeping in a car surrounded by her possessions. Ahmad Abu-Shaweesh, a boy, described sheltering in the Al-Aqsa University only to find it coming under attack. \"We hardly made it out... We didn't expect the tanks at the university's gates.\" Gaza has had no communications or internet service for 10 days, hampering ambulance dispatches to areas targeted by Israel and preventing people from checking on one another and on the whereabouts of Israeli forces. At Nasser Hospital, the only major hospital still accessible in Khan Younis and the largest still functioning in Gaza, video showed the trauma ward overwhelmed with wounded being treated on a floor splashed with blood. Outside, men dug graves within the hospital grounds because it was not safe to venture out to the cemetery. Authorities said 40 people were buried there. In Brussels, Palestinian Authority Foreign Minister Riyad al-Maliki told reporters the situation in Gaza was out of control and asked the European Union to call for a ceasefire. \"The health system has collapsed. There is no way for injured Palestinians to be treated in the Gaza strip and they are not able to leave Gaza for treatment outside.\" Israel says it wants to annihilate Hamas. But Palestinians and some Western military experts say that may be unachievable given the group's diffuse structure and deep roots in Gaza, which it has ruled since 2007. Though Israelis overwhelmingly support the war, a growing number say the government should do more to reach a deal to free Israeli hostages, even if that means reining in its offensive. About 20 relatives of hostages stormed a parliamentary committee session in Jerusalem on Monday, demanding lawmakers do more to help free their loved ones. Prime Minister Benjamin Netanyahu told a group of relatives there was no truth to reports of a deal to free hostages in a ceasefire. Sami al-Zuhri, head of Hamas' political unit in exile, told Reuters Hamas was open to \"all initiatives and proposals, but any agreement must be based on ending the aggression and the occupation's complete withdrawal\" from Gaza. \nAt a press conference in Beirut, Hamas official Osama Hamdan echoed calls for a complete ceasefire and stressed Hamas, which has long vowed to destroy Israel, would not accept anything other than \"a fully sovereign Palestinian state with Jerusalem as its capital\". His comments come after Netanyahu at the weekend rejected the creation of a future independent Palestinian state, opening a rift with Israel's U.S. ally, which said again on Monday that it believes a two-state solution is still possible."
}