{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK1303F_L.jpg",
  "title": "El Salvador's Bukele re-elected as president in landslide win",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 04, 2024 07:03AM ET",
    "Updated Feb 05, 2024 09:48AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Fernando Saldanha",
        "2024-02-04 22:54:47",
        "How come you are not recommending a Mrs. Something? I thought that was mandatory for spammers.",
        "https://www.investing.com/members/210594431"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/el-salvador-president-bukele-poised-for-another-landslide-as-voters-head-to-polls-3291995",
  "paragraph": "By Nelson Renteria and Sarah Kinosian SAN SALVADOR (Reuters) -President Nayib Bukele on Sunday secured a thumping victory in El Salvador's elections after voters cast aside concerns about erosion of democracy to reward him for a fierce gang crackdown that transformed security in the Central American country.  Provisional results on Monday morning show Bukele winning 83% support with just over 70% of the ballots counted. Bukele declared himself the winner before official results were announced, claiming to have attained more than 85% of the vote.  Thousands of Bukele's supporters clad in cyan blue and waving flags thronged San Salvador's central square to celebrate his re-election, which the 42-year-old leader termed a \"referendum\" on his government. His New Ideas party is expected to win almost all of the 60 seats in the legislative body, tightening its grip on the country and bestowing even more sway on Bukele, the most powerful leader in El Salvador's modern history. \"All together the opposition was pulverized,\" Bukele, standing with his wife on the balcony of the National Palace, told his supporters. \"El Salvador went from being the most unsafe (country) to the safest. Now in these next five years, wait to see what we are going to do,\" Bukele added.  New Ideas' electoral success means Bukele will wield unprecedented power and be able to overhaul El Salvador's constitution, which his opponents fear will result in scrapping of term limits. Wildly popular, Bukele has campaigned on the success of his security strategy under which authorities suspended civil liberties to arrest more than 75,000 Salvadorans without charges. The detentions led to a sharp decline in nationwide murder rates and fundamentally altered a country of 6.3 million people that was once among the world's most dangerous.  But some analysts have said the mass incarceration of 1% of the population is not sustainable long-term.  Bukele earlier told a press conference his party needed all the support it could muster to maintain its anti-gang fight and continue reshaping El Salvador. \"So, if we have already overcome our cancer, with metastases that were the gangs, now we only have to recover and be the person we always wanted to be,\" said Bukele.  Few doubted the outcome of the elections. Polls showed most voters wanted to reward Bukele for decimating the crime groups that made life intolerable in El Salvador and fueled waves of migration to the United States. Guadalupe Guillen, a 55-year-old shopkeeper, showed up at the victory party dressed in a tunic and Arab scarf, a nod to Bukele's Palestinian family heritage. \"We are celebrating, thanking him, thanking God, for getting us out of this gang problem. We don't want to go back to that horrible past,\" said Guillen, who added she no longer pays $300 in extortion to the gangs every fortnight.  \"Democracy is not at risk because all the people have voted for him,\" said Guillen, echoing the government's stance regarding concerns by Western countries of authoritarian drift under Bukele. Candidates for FMLN and ARENA, two parties that rotated power between them until 2019, were set to receive single digit support as voters once again rejected traditional parties whose rule was marked by violence and corruption for decades.  ECONOMIC WOES  A firebrand politician who often spars with foreign leaders and critics on social media, Bukele came to power in 2019 trouncing traditional parties with a vow to eliminate gang violence and rejuvenate a stagnant economy. He used his New Ideas party's supermajority in the legislative assembly to pack the courts with loyalists and overhaul state institutions, solidifying his control of key parts of the government. He also championed the introduction of Bitcoin as legal tender, drawing criticism from the International Monetary Fund (IMF). El Salvador's Supreme Electoral Tribunal last year permitted him to run for a second term even though the country's constitution prohibits it. Opponents fear Bukele will seek to rule for life, following President Daniel Ortega from next-door Nicaragua. \"Everyone knows it is unconstitutional to re-elect the president but what people want is security. They don't care if it is unconstitutional, they just want to feel safe,\" said Josue Galdamez, 39, a businessman and trader who supported Bukele because of his crusade against gangs.  When asked on Sunday by reporters if he planned to reform the constitution to include indefinite re-election, Bukele said he \"didn't think a constitutional reform would be necessary,\" but did not directly answer questions on whether he would try to run for a third term.  The Chinese Embassy in San Salvador in a post on X congratulated Bukele and his party \"for the historic victory in these elections.\" Rights groups have said El Salvador's democracy is under attack. Bukele has taken such concerns in stride, at one point changing his profile on X to say: \"World's coolest dictator.\"  Bukele's biggest challenge in his second term is likely to be the economy, Central America's slowest growing during his time in power. More than a quarter of Salvadorans live in poverty.  \nExtreme poverty has doubled and private investment has tumbled under Bukele. There has not been much momentum on his highly publicized plans for Bitcoin City, a tax-free crypto haven powered by geothermal energy from a volcano. The IMF, which is negotiating a $1.3 billion bailout with El Salvador, in late 2023 described the country's fiscal situation as \"fragile.\""
}