{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK090CN_L.jpg",
  "title": "Judge postpones first conspiracy trial over Atlanta 'Cop City' protests",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 10, 2024 06:13AM ET",
    "Updated Jan 10, 2024 12:45PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/first-conspiracy-trial-over-atlanta-cop-city-protests-set-to-begin-3271205",
  "paragraph": "© Reuters. FILE PHOTO: A placard is seen on a fence as people protest at the site of the Atlanta police training center, derisively called \"Cop City\", days after more than five dozen activists were charged with an illegal conspiracy to stop construction of the facil\nBy Rich McKay ATLANTA (Reuters) -A judge on Wednesday postponed the trial of an activist charged with a conspiracy in trying to stop construction of an Atlanta police center, derisively called \"Cop City,\" in what is viewed as a test case over whether the protests constituted criminal racketeering. The defendant, Ayla King, 19, of Worcester, Massachusetts, is the first of five dozen activists due to stand trial on charges they violated the state's Racketeer Influenced and Corrupt Organizations Act, commonly known as the RICO act. The state law was modeled after the federal law designed as a tool to curb organized crime. The trial was due to start on Wednesday, but Fulton County Superior Court Judge Kimberly Esmond Adams sent the jury home before opening statements could begin after the defense announced it would appeal the judge's earlier denial of a request to have the case dismissed.  Lawyers for the defense have argued that their client has not received a speedy trial - as they had requested - saying the case had fallen outside the time limit set by state law.  Adams said she would delay the trial for at least two weeks while the motion is considered. King is accused of being part of a group called Defend the Atlanta Forest that police say has at times over the last two years illegally occupied the 85-acre (34.4 hectares) wooded site where the $90 million Atlanta Public Safety Training Center is being built.  The protesters, self-described social justice activists and environmentalists, have fiercely opposed the project and said it would increase the militarization of police and destroy parts of a forested area defenders call the \"lungs of Atlanta.\" Atlanta has said it needs the facility, which would include a mock city and emergency vehicle course, to replace a patchwork of substandard training sites and prepare recruits for urban law enforcement. \"The militant anarchists engaged in violence to bring attention to their own political goals,\" the indictment reads. Chris Timmons, an attorney who teaches law at Georgia State University and has followed the case, said it was the first time Georgia has applied the RICO Act to a protest group. \"Prosecutors are using a massively powerful law on what for some might be misdemeanors,\" Timmons said.  If prosecutors can prove that the actions of the group moved beyond protests into criminal activity, \"then that could be the proper use of it, like joining in a conspiracy to rob a bank,\" Timmons said. If King is acquitted, it won't stop the other cases from going to trial, Timmons said. \"At most, it might mean that some of the others might get sweeter plea deals.\"  King is specifically accused of joining \"an organized mob\" last March that tried to overwhelm police in a riot at the construction site. She has pleaded not guilty to the charge of racketeering. \nIn court papers, King's attorney wrote that her client was detained after merely being at a concert near the site. \"There is no evidence\" that she was part of a group that damaged construction equipment, according to the documents. Neither King's attorney, Suri Chadha Jimenez, nor prosecutors responded to requests for comment on the case."
}