{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0N0PF_L.jpg",
  "title": "How Biden plans to fight Trump in 2024, hoping for a repeat win",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 24, 2024 12:57PM ET",
    "Updated Jan 24, 2024 01:21PM ET"
  ],
  "comments": [
    3,
    [
      [
        "Ken Roth",
        "2024-01-26 07:10:02",
        "By the time we reach presidential election Trump will be a convicted felon in jail waiting for appeal.",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Charles Manson",
        "2024-01-24 21:40:34",
        "There's a Plan? Really?",
        "https://www.investing.com/members/249519852"
      ],
      [
        "Tre Hsi",
        "2024-01-25 15:11:29",
        "I bet you said that in 2020, didn't you?",
        "https://www.investing.com/members/203741693"
      ],
      [
        "Mark Jannetty",
        "2024-01-25 22:11:28",
        " they had a plan, it's called cheat",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Mark Jannetty",
        "2024-01-24 18:22:22",
        "hope in 1 hand 💩in the other. 47th President is Donald Trump 🇺🇲",
        "https://www.investing.com/members/241633026"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/how-biden-plans-to-fight-trump-in-2024-hoping-for-a-repeat-win-3282055",
  "paragraph": "© Reuters. FILE PHOTO: U.S. President Joe Biden gestures as he delivers a speech during a campaign event at the Mother Emanuel AME Church, the site of the 2015 mass shooting, in Charleston, South Carolina, U.S., January 8, 2024. REUTERS/Kevin Lamarque/File Photo\nBy Trevor Hunnicutt, Nandita Bose and Andrea Shalal WASHINGTON (Reuters) - U.S. President Joe Biden is getting the opponent he thinks he was made to beat in 2024. Donald Trump's decisive victory in the first two Republican presidential contests in Iowa and New Hampshire make almost certain what Biden's re-election campaign has predicted for months.  It's a rematch they say they are confident Biden will win, even as public opinion polls show him tied with Trump and Americans are angry over high prices and question his age, his economic plans and his policies on the border and in the Middle East. To beat Trump again, as he did in 2020, Biden's team is focused on warning that Trump poses a serious threat to U.S. democracy, and that abortion and other personal freedoms are at stake. They are banking on that approach winning over independents and sparking enthusiasm among lukewarm Democrats.  Biden, 81, made the controversial decision to run for a second term in large part because he was convinced he would face Trump, 77, and because he thinks he is the Democrat who can beat him in the November election.  \"If Trump wasn't running, I'm not sure I'd be running,\" Biden said at a fundraising event last month. \"We cannot let him win.\" Biden campaign manager Julie Chavez Rodriguez told reporters on Wednesday that \"the results out of New Hampshire confirm that Donald Trump has all but locked up the GOP nomination and the election-denying anti-freedom MAGA movement has completed its take over of the Republican Party.\" Exit polls show that most Republican voters don't care about Trump's string of criminal indictments and many believe untrue claims that Biden did not win the 2020 election fairly. That has persuaded many in Biden's camp that there is little reason to try to reach Trump supporters in a bruising campaign.  At this point, most Americans either love Trump or hate him, Biden campaign aides said - and the same is true of Biden. The 2024 election will be focused on who can find their voters and turn them out.  Trump has accused Biden and Democrats of \"fearmongering\" and this month called Biden's record \"an unbroken streak of weakness, incompetence, corruption and failure.\" The Trump campaign did not respond to a request for comment. Biden versus Trump would be the seventh U.S. presidential rematch in history, but the first since Republican President Dwight Eisenhower faced Democrat Adlai Stevenson for the second time in a row in the 1956 election. THE ECONOMY VS. DEMOCRACY Facing complaints from some Democrats that the campaign was unfocused, Biden's team has added election veterans.  Earlier this month, White House infrastructure coordinator and former New Orleans Mayor Mitch Landrieu became national co-chair of the campaign and a Democratic presidential campaign veteran, Dan Kanninen, came on to run efforts in the battleground states that are hotly contested because they can swing either to Republicans or Democrats. On Tuesday, the campaign pulled in White House deputy chief of staff Jen O'Malley Dillon and senior adviser Mike Donilon, both of them veterans who are regarded as having successfully piloted Biden's 2020 campaign. Biden and Vice President Kamala Harris in coming weeks will visit key states most likely to decide the election. The campaign now has staff in each of the seven closely contested states they regard as battlegrounds, including Pennsylvania, Michigan and Wisconsin. Biden will focus mostly on economic issues and also give more fiery speeches about the threat he believes Trump poses to democracy. Harris started a nationwide tour in the battleground state of Wisconsin on Monday focused on Republicans' anti-abortion measures. The campaign is focused on Americans impacted by the conservative Supreme Court's reversal of the landmark Roe V. Wade ruling that had guaranteed women's right to abortion services.  Harris, the country's first Black vice president, is also tasked with revving up support from young and Black voters, where support for Biden has waned.  TRUMP FEARS RAISE CASH  Biden's fundraising off Trump's Iowa and New Hampshire results started immediately. \"This election was always, going to be you and me vs. extreme MAGA Republicans,\" a Biden post on social media proclaimed the night of the Iowa results. \"It was true yesterday and it'll be true tomorrow. So if you're with us, chip in now.\"  Biden allies predict a new rush of funds will dwarf the $97 million that the campaign and the Democratic Party raised in the last three months of 2023. Trump raised $45 million in the third quarter, the latest figures available, not including Republican Party fundraising.  \"The Trump inevitability is a fundraising bonanza for Biden and I know a lot of Republicans who agree with that,\" said John Morgan, a Florida attorney and top fundraiser, who predicts the campaign could see $500 million in new cash.  \n\"People fear they will lose their country, their democracy, their rights and there is a very high-level of motivation around that,\" Morgan said.  Read Reuters' full U.S. election coverage here:"
}