{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0A0BR_L.jpg",
  "title": "At World Court, South Africa accuses Israel of genocide in Gaza",
  "category": "World news",
  "publisher": "Investing.com",
  "date": [
    "Published Jan 11, 2024 05:13AM ET",
    "Updated Jan 11, 2024 03:28PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/south-africa-accuses-israel-at-world-court-of-genocidal-acts-in-gaza-3272094",
  "paragraph": "2/2\n© Reuters. People sit inside the International Court of Justice (ICJ) on the day of the trial to hear a request for emergency measures by South Africa, who asked the court to order Israel to stop its military actions in Gaza and to desist from what South Africa says\n2/2\nBy Stephanie van den Berg, Anthony Deutsch, Toby Sterling THE HAGUE (Reuters) -South Africa accused Israel on Thursday of carrying out genocide in Gaza and demanded that the U.N.'s top court order an emergency suspension of Israel's devastating military campaign in the Palestinian enclave. On the first of two days of hearings at the International Court of Justice (ICJ), South Africa said Israel's offensive, which has demolished much of the coastal enclave and killed more than 23,000 people according to Gaza health authorities, aimed to bring about \"the destruction of the population\" of Gaza. \"The intent to destroy Gaza has been nurtured at the highest level of state,\" Tembeka Ngcukaitobi, advocate of the High Court of South Africa, told the court. He said Israel's political and military leaders, including Prime Minister Benjamin Netanyahu, were among \"the genocidal inciters\". \"That is evident from the way in which this military attack is being conducted,\" he said. Israel rejected the accusations of genocide as false and baseless and said South Africa was speaking on behalf of Hamas - which Pretoria said was untrue. Netanyahu said the court had been presented with hypocrisy and lies. \"Today we saw an upside-down world. Israel is accused of genocide while it is fighting against genocide,\" he said in a statement. \"Israel is fighting murderous terrorists who carried out crimes against humanity: They slaughtered, they raped, they burned, they dismembered, they beheaded - children, women, elderly, young men and women,\" he said. Israel launched its onslaught after a cross-border rampage on Oct. 7 by Hamas militants in which Israeli officials said 1,200 people were killed, mainly civilians, and 240 taken hostage back to Gaza. Israel says it is waging war against Palestinian militants, not the Palestinian people. Laying out its allegations of genocidal acts, South Africa also pointed to Israel's sustained bombing campaign and to comments by Israeli Defence Minister Yoav Gallant, who said early in the war that Israel would impose a total blockade as part of a battle against \"human animals\". \"The evidence of genocidal intent is not only chilling, it is also overwhelming and incontrovertible,\" Ngcukaitobi said. The 1948 Genocide Convention, enacted in the wake of the mass murder of Jews in the Nazi Holocaust, defines genocide as \"acts committed with intent to destroy, in whole or in part, a national, ethnical, racial or religious group\". EMERGENCY RULING Since Israeli forces launched their offensive, nearly all of Gaza's 2.3 million people in Gaza, one of the world's most densely populated places, have been driven from their homes at least once, causing a humanitarian catastrophe. \"Every day, there is mounting, irreparable loss of life, property, dignity, and humanity for the Palestinian people,\" said Adila Hassim, advocate of South Africa's high court. \"Nothing will stop the suffering, except an order from this court.\" Post-apartheid South Africa has long defended the Palestinian cause, a relationship forged when the African National Congress' struggle against white-minority rule was cheered on by Yasser Arafat's Palestine Liberation Organisation. South Africa concluded its arguments by requesting emergency measures to stop the war. The court will listen to Israel's response on Friday. The court is expected to rule on possible emergency measures later this month but will not rule at that time on the genocide allegations - those proceedings could take years. The ICJ's decisions are final and without appeal - but the court has no way to enforce them. PRO-PALESTINIAN AND PRO-ISRAEL DEMONSTRATIONS In its court filings, South Africa cites Israel's failure to provide food, water, medicine and other essential assistance to Gaza, where Hamas seized power in 2007, two years after Israel withdrew settlers and soldiers from the enclave. In Gaza, Amer Salah, 23, who is sheltering in a U.N. school in the south after fleeing his home, said he hoped the trial would help pile pressure on Israel. \"We call upon the world to say enough to Israeli killings, enough to massacres, enough to the destruction of Gaza, enough to the bloodshed,\" he said. Hamas official Sami Abu Zuhri told Reuters the group was following the court proceedings with great interest. \"Justice is going to be tested today,\" he said. \"We urge the court to reject all pressure and take a decision to criminalise the Israeli occupation and stop the aggression on Gaza.\" Supporters of both sides held marches and rallies in The Hague. Thousands of pro-Israel protesters marched in the city centre, carrying Israeli and Dutch flags and posters with images of people taken hostage by Hamas. Gabi Patlis, a native of Tel Aviv who now lives in the Netherlands, said it was painful to hear Israel accused of genocide. \"Especially after 7 October - we were the ones that were attacked,\" he told Reuters at the rally. \nPolice ensured the pro-Israel march was kept away from a pro-Palestinian march, in which some carried placards reading \"Free Palestine. Stop genocide\", surrounded by red-and-green coloured smoke symbolising the Palestinian flag. \"What I hope is that they (the court) can achieve what has not been able to achieve until now, which is a permanent ceasefire, a safety corridor for humanitarian help so that the death toll doesn't go up even further,\" said Sara Galli, a pro-Palestinian demonstrator."
}