{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK070DV_L.jpg",
  "title": "Brazil marks anniversary of Jan. 8 attack on democracy",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 08, 2024 06:36AM ET",
    "Updated Jan 08, 2024 04:32PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/brazil-to-mark-anniversary-of-january-8-attack-on-democracy-3269163",
  "paragraph": "© Reuters. Brazil's flag is projected on the building of the National Congress as part of events to mark the consolidation of democracy in Brazil, a year after supporters of far-right former president Jair Bolsonaro stormed the presidential palace, Congress and Supr\nBy Ricardo Brito BRASILIA (Reuters) -Brazilian authorities celebrated their country's democratic system on Monday, a year after a right-wing crowd invaded and vandalized its Supreme Court, Congress and presidential palace in protest against an election result. Under a screen that said \"Democracy Unshaken\" Congressional leaders, Supreme Court justices and government officials led by President Luiz Inacio Lula da Silva recalled the day the capital Brasilia was stormed by protesters calling for a military coup. \"All those who financed, planned and executed the coup attempt must be exemplarily punished. There is no forgiveness for anyone who attacks democracy,\" Lula said at the event held in Congress. \"Forgiveness would sound like impunity. And impunity would be a free pass for more acts of terrorism.\" \"Democracy prevailed,\" said top court justice Alexandre de Moraes, who has led investigations to hold those responsible for the riots accountable.  A year ago, supporters of hard-right former president Jair Bolsonaro stormed the buildings that symbolize Brazil's democracy, a week after Lula had taken office. They rejected his election victory and urged the military to overthrow him. Bolsonaro, who never conceded defeat, had left the country for the United States before the presidential handover to Lula. The assault on Brasilia's main government buildings was the Brazilian equivalent of the attack on the U.S. Capitol by supporters of outgoing President Donald Trump on Jan. 6, 2021 after his election loss to Joe Biden. About 2,000 people were arrested over the Brasilia attack, though most were later released. Others have been convicted by the Supreme Court on charges of an attempted coup, among other crimes, following ongoing police investigations into those who took part in the riots and who fostered or funded the attack. Bolsonaro is under investigation by the Supreme Court for allegedly masterminding the riots, something he denies.  Brazil's electoral authority banned Bolsonaro from running for elected office for eight years over his abuse of power and misuse of the media ahead of the 2022 election, when he summoned ambassadors to vent unfounded claims about Brazil's electronic voting system. \nSupreme Court judge Gilmar Mendes has accused Bolsonaro of political responsibility for the assault on Brasilia and that the armed forces had been encouraged by the former president not to stop his supporters protesting. Bolsonaro has denied any involvement. A poll by Genial/Quaest released on Sunday showed that a large majority of Brazilians disapprove of the riots, with 89% against the protests by Bolsonaro backers and 6% for them."
}