{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "Camera footage shows Israeli vehicles driving over Palestinian killed in army raid",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 10, 2024 06:40AM ET",
    "Updated Jan 10, 2024 08:40AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/camera-footage-shows-israeli-vehicles-driving-over-palestinian-killed-in-army-raid-3271238",
  "paragraph": "JERUSALEM (Reuters) -Security camera footage recorded outside a house in the West Bank city of Tulkarm showed Israeli security forces vehicles repeatedly running over the body of a Palestinian man shot during a raid by Israeli forces. The Israeli border police said a vehicle had run over the body unintentionally after it came to extricate Israeli forces which it said had come under heavy fire, adding that the incident was under review. The footage emerged after the border police said on Monday its commandos had raided Tulkarm to arrest a wanted militant and had killed three Palestinian gunmen in a clash. It showed Israeli security forces approaching a house at night and opening fire on a group of young men, at least one of them armed, after they rushed out of the house into the street. Two of the men were hit in the street and lay still, while footage taken from another angle shows a third man shot. The footage showed an Israeli security forces vehicle coming up to two bodies on the ground and driving over one of them, at one point coming to a stop on the man's legs. Images apparently recorded later show one body having apparently been moved to the side of the road while another vehicle backs over the other body and then manoeuvres over it twice more. Footage from a different camera at the same scene, apparently taken moments earlier, showed several Palestinians running from the house, with one handing a rifle to another, who was immediately shot. The footage shows the two men in the street from a different angle as well as the third man, lying in the driveway of the house. The Palestinian ministry of foreign affairs issued a statement condemning the incident, which it said reflected a \"culture of hatred and extremism\". The Tulkarm Brigades, an armed militant group linked to Fatah, which leads the internationally-recognised Palestinian Authority, claimed one of the Palestinians killed on Monday as its member.  Tulkarm, location of one of the main crossing points between the West Bank and Israel, has seen repeated raids by Israeli security forces since the Oct. 7 attack on Israel by Hamas, a Fatah rival which runs Gaza. U.S. Secretary of State Antony Blinken met Palestinian Authority President Mahmoud Abbas in the Israeli-occupied West Bank on Wednesday, after pressing Israel's leaders to offer a pathway to a Palestinian state."
}