{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0B0N1_L.jpg",
  "title": "US scientists say one-in-three chance 2024 another year of record heat",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 12, 2024 11:03AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-scientistssay-oneinthree-chance-2024-another-year-of-record-heat-3273715",
  "paragraph": "3/3\n© Reuters. FILE PHOTO: A general view shows the city of Lyon after sunrise from the Fourviere esplanade as France issued a \"red alert\" for four southern regions amid a spell of excessively hot weather, especially in the Rhone valley, France, August 22, 2023. REUTERS\n2/3\nBy Gloria Dickie TORONTO (Reuters) - This year has a one-in-three chance of being even hotter than 2023, which was already the world's hottest on record, scientists from the U.S. National Oceanic and Atmospheric Administration (NOAA) said on Friday.  In its annual global climate analysis, the agency confirmed the findings of EU scientists that 2023 was the warmest since records began in 1850, putting it at 1.35 degrees Celsius (2.43 degrees Fahrenheit) above the preindustrial average. The amount of heat stored in the upper layers of the ocean also reached a record high last year, NOAA said. The World Meteorological Organization (WMO) also confirmed 2023 was a record year on Friday and said the world has warmed 1.2C (2.16F) above the preindustrial average, based on the ten-year global average temperature from 2014 to 2023.  The record was made possible by climate change, driven by the burning of fossil fuels, alongside an El Nino climate pattern that emerged halfway through the year. El Nino is a natural event that leads to warmer surface waters in the eastern Pacific Ocean and higher global temperatures.  It is expected to persist until at least April, increasing the likelihood 2024 will be another record year. \"The interesting and depressing question is what will happen in 2024? Will it be warmer than 2023? We don't know yet,\" said Christopher Hewitt, WMO head of international climate services. NOAA said there was a one-in-three chance that 2024 would be warmer than 2023, and a 99% chance it would rank among the five warmest on record.  \"It's highly likely (El Nino) will persist until April, possibly May, and then beyond that we're not sure — it becomes less certain,\" said Hewitt. The impacts of El Nino normally peak during the Northern Hemisphere's winter and then diminish, switching to either neutral conditions or a La Nina phase which generally yields cooler global temperatures. But there is also the risk El Nino will return.  \"If we were to make a transition into a La Nina phase ... maybe 2024 might not be the warmest on record,\" said Carlo Buontempo, director of Europe's Copernicus Climate Change Service. As the Southern Hemisphere is now in summer when El Nino peaks, authorities are on alert for heatwaves, drought and fire. This week, Australia's Bureau of Meteorology issued extreme heat alerts for Western Australia. \nAnd in southern Africa, \"we're really concerned about the potential for dry spells in January and February with a high likelihood of below-average rainfall,\" said Lark Walters, a decision support adviser for the Famine Early Warning System Network. \"We're estimating over 20 million will be in need of emergency food assistance.\""
}