{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0909I_L.jpg",
  "title": "In shelter where Hamas killed trapped Israelis: smell of blood and a mother's grief",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 10, 2024 03:58AM ET",
    "Updated Jan 10, 2024 06:55AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/in-shelter-where-hamas-killed-trapped-israelis-smell-of-blood-and-a-mothers-grief-3271015",
  "paragraph": "4/4\n© Reuters. Tali Kizhner grieves in the bomb shelter in which her son, Segev Israel Kizhner, sought refuge before he was killed in the October 7 killing and kidnapping spree by Palestinian Hamas gunmen from Gaza, in Reim, southern Israel, December 18, 2023. REUTERS/A\n2/4\nBy Amir Cohen and Maayan Lubell ROAD 232, southern Israel (Reuters) - Three months on, the scent of blood still hung in the air in the cramped concrete bomb shelter where rampaging Hamas fighters tossed grenades and opened fire to kill dozens of Israelis trapped inside. Tali Kizhner knelt down, caressing the foot of a bullet-and-shrapnel-scarred wall, now painted white to cover the bloodstains and scorch marks. One of the victims here was her 22-year-old son Segev, who had sought safety after fleeing a music festival on the morning of Oct. 7. \"I wanted to know where his last moments were, whether there was anywhere to hide. What happened there. To feel it,\" she said. The blank white walls of bomb shelters on Road 232 through southern Israel have become a canvas of bereavement for family and friends of those killed inside. Inscriptions, drawings, prayers and poems commemorate the dead.  \"This is where the dream of peace died,\" reads one. Segev was among dozens of young Israelis who fled from the Nova open-air music festival to a handful of nearby shelters, built to provide protection from incoming Gaza rockets. The tiny rooms, barely 6 square metres (60 square feet), provided scant protection from gunmen, who, under the cover of rocket barrages, had burst into Israel, stormed nearby towns and villages and set up ambushes on roads. They killed 1,200 people and took 240 hostages, according to Israeli tallies, precipitating a war in which Israel has so far killed more than 23,000 Palestinians, according to Gaza's health ministry.  Segev, several of his friends and around 20 more people were packed inside one of two shelters near Kibbutz Re'im, where some of the carnage was caught on camera. A dashcam video showed gunmen tossing grenades inside, seven of which were tossed back out, and then shooting into the shelter. A separate video showed at least two bloodied men and a woman being taken out of the shelter as captives. \nFor four days after, Kizhner did not know her son's fate, until the family was finally informed. Seven people survived,‮ ‬including one of Segev's wounded friends, who brought back the bloodied Star of David pendant given to Segev by his grandparents on his bar mitzvah."
}