{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBR04E_L.jpg",
  "title": "China decries Taiwan for 'hyping up' military threat, sends warplanes",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 28, 2023 04:04AM ET",
    "Updated Dec 28, 2023 05:25AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/china-says-taiwan-is-hyping-up-military-threat-for-electoral-gain-3264241",
  "paragraph": "© Reuters. FILE PHOTO: Chinese Defence Ministry spokesperson Wu Qian attends a press briefing in Beijing, China August 31, 2023. REUTERS/Shubing Wang\nBy Laurie Chen and Ben Blanchard BEIJING/TAIPEI (Reuters) - China's defence ministry accused Taiwan's government on Thursday of deliberately \"hyping up\" a military threat from China for electoral gain ahead of elections on the island in just over two weeks' time, but again sent warplanes into the Taiwan Strait. Taiwan's Jan. 13 presidential and parliamentary election will shape the Chinese-claimed island's relations with Beijing, which over the past four years has ramped up military pressure to assert its sovereignty claims. As the election approaches Taiwan has reported Chinese fighter jets and warships around the island, as well as balloons crossing the sensitive Taiwan Strait, though the military says they are most likely for weather monitoring purposes. Speaking at a monthly news conference in Beijing, Chinese defence ministry spokesperson Wu Qian said Taiwan's government was to blame for the tensions.  \"The Democratic Progressive Party (DPP) authorities are deliberately hyping up the so-called 'military threat from the mainland' and exaggerating tensions,\" said Wu, referring to Taiwan's ruling party, which Beijing regards as separatists. \"This is entirely to seek electoral gain,\" he said, accusing Taiwan of using a \"familiar electoral play-book to stoke confrontation and manipulate the election\". Shortly after Wu spoke, Taiwan's defence ministry reported further Chinese military activities in the strait, saying it had detected 12 military aircraft crossing the waterway's median line, or flying close by it, on Thursday afternoon. It said the aircraft, including J-11 and Su-30 fighters, entered airspace to the north, centre and southwest of Taiwan, and \"cooperated with communist ships to carry out joint combat readiness patrols\". The ministry says Chinese warplanes have been regularly crossing the median line, which previously served as an unofficial barrier between the two sides.  Wu reiterated that China did not recognise the median line. \"Taiwan is a part of China. The 'median line' absolutely does not exist,\" he said.  China has never renounced the use of force to bring Taiwan under its control and in 2005 passed a law giving the country the legal basis for military action against Taiwan if it formally secedes or seems about to. China detests the DPP's presidential candidate, current Vice President Lai Ching-te, believing he is a separatist, and has rebuffed his calls for talks. Taiwan's defence ministry said this week they were not seeing any signs of large-scale Chinese military activity before the elections but were keeping a close watch on China.  Wu said China's People's Liberation Army was well aware of Taiwan's military movements. \"We will, as always, take all necessary measures to resolutely defend national sovereignty and territorial integrity,\" he added. From the start of this month, Taiwan has reported a spate of Chinese balloons drifting over the sensitive Taiwan Strait, saying they were probably monitoring weather conditions. Wu declined to comment on the balloons. \nChina has been angered by U.S. arms sales to Taiwan. \"We firmly oppose any country having official and military contact with Taiwan in any form,\" Wu added. \"The United States is manipulating the Taiwan question in various forms, which is a very dangerous gamble.\""
}