{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0300D_L.jpg",
  "title": "Rescuers race against time to find survivors of Japan earthquake",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 03, 2024 08:53PM ET",
    "Updated Jan 04, 2024 12:10PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/japan-quake-death-toll-rises-to-73-as-search-for-survivors-enters-fourth-day-3266768",
  "paragraph": "5/5\n© Reuters. A man who lost his house in the earthquake reacts as he visits the graveyards of his parents, which were rattled by the earthquake, in Wajima, Japan, January 4, 2024. REUTERS/Kim Kyung-Hoon\n2/5\nWAJIMA, Japan (Reuters) - Thousands of rescuers pressed on in a search for survivors of a New Year's Day earthquake that killed at least 84 people in Japan, hoping to save as many as possible despite a three day survival window that ended on Thursday afternoon. \"We must continue putting all of our efforts into rescuing people, even beyond 72 hours after the disaster,\" Japanese Prime Minister Fumio Kishida said at a news conference. Survival rates drop off 72 hours after a quake, according to emergency responders. So far 156 people have been rescued, but at least 179 others remain unaccounted for, according to authorities. The extent of the damage from the earthquake and the tsunami it triggered remains unclear, with rescuers struggling to reach the northernmost areas of the peninsula - where much of the fatalities are - due to severed roads. Three days after disaster struck, 30 villages remain inaccessible, according to Ishikawa prefecture authorities. Material aid has trickled in but many evacuees remain largely cut off from food, water, electricity, and communications amid freezing temperatures and bad weather, authorities have also said. The 3,000 meals and 5,000 bottles of water that were delivered as of Wednesday is not nearly enough for the 11,000 evacuees in Wajima city, its mayor, Shigeru Sakaguchi, said at a regional disaster response meeting. \"First and foremost, it's the road - severed roads are hampering not just aid supplies, but also the recovery of electricity, water, mobile signals and other lifeline infrastructures,\" he said. There were almost 100 chokepoints and blockages on prefectural roads as of Thursday, according to Ishikawa officials. \"Compared to other disasters the road situation into Wajima is very bad. I feel it's taking longer than usual for assistance to arrive,\" Shunsaku Kohriki, a medical worker who has assisted other disasters, told Reuters in the city. \"I think realistically speaking the evacuees will have to live in really tough conditions for a while yet,\" he said. NO RUNNING WATER Basics such as internet access, medical supplies and clean toilets were also lacking. \"We have no running water. We cannot wash our hands after going to the bathroom,\" Kyoko Kinoshita, 62, said as she queued in line with a couple of hundred other survivors for food in Wajima. \"One of the babies at the evacuation centre is 3 weeks old and it looks like there is not enough water or milk for the baby either,\" she added. The government has pledged it will proactively provide supplies instead of waiting for official requests from local authorities. It also quintupled the number of Self-Defence Force members tasked with rescue operations since Monday, putting the total number of rescuers at about 7,000. Some aid has been delivered via sea instead of land, with coast guard boats reaching ports in Wajima and Suzu on Wednesday. However, larger ships have been unable to dock in some bays of the Noto peninsula because the seabed had buckled from the earthquake, Ishikawa Governor Hiroshi Hase said on Thursday. BUSINESS IMPACT Survivors may have escaped death, but face a lo ng road to recovery in an area that had hoped for more tourists after years of pandemic gloom. As Japanese businesses returned from the New Year holidays on Thursday, manufacturers also gauged the impact of the quake on their production lines. Display makers Japan Display and EIZO, as well as semiconductor firm Kokusai Electric, said they were repairing damaged factory facilities. \nTokyo Stock Exchange observed a minute of silence instead of ringing a bell to mark the opening of trade, out of respect for those who died in the earthquake and a separate accident at Tokyo Haneda airport where five Coast Guard members were killed en route to deliver aid. Kishida pledged on Thursday to tap roughly 4 billion yen ($28 million) of the national budget for disaster relief."
}