{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "Charles Osgood, folksy host of CBS 'Sunday Morning,' dies at 91",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 23, 2024 04:02PM ET",
    "Updated Jan 23, 2024 04:12PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/charles-osgood-folksy-host-of-cbs-sunday-morning-dies-at-91-3281001",
  "paragraph": "By Rich McKay (Reuters) - Charles Osgood, a broadcaster known for his folksy demeanor and gentle wit who served as the longtime host of the CBS News \"Sunday Morning\" show and the radio program \"The Osgood File,\" has died at age 91, the network said on Tuesday. Osgood died at his New Jersey home due to dementia, according to CBS News.  He worked with CBS for about 45 years, retiring in 2016 at age 84. Osgood, who at times worked poetry and his own piano playing into his shows, earned a raft of broadcasting awards, including four Emmy awards, the Walter Cronkite Excellence in Journalism Award and other honors, the network said. \"To say there's no one like Charles Osgood is an understatement,\" \"Sunday Morning\" Executive Producer Rand Morrison said in a CBS News article announcing the death. \"He embodied the heart and soul of 'Sunday Morning.' His signature bow tie, his poetry, just his presence was special for the audience and for those of us who worked with him. ... Truly, he was one of a kind - in every sense,\" Morrison added. Osgood anchored the Sunday morning magazine program for 22 years, taking over in 1994 from its original host, broadcaster Charles Kuralt, who called his fellow newsman \"one of the last great broadcast writers.\" During his run on the show, it drew its highest ratings in three decades, the network said, and earned three Daytime Emmy awards as Outstanding Morning Program. For decades, he also hosted a news commentary series for CBS News Radio called \"The Osgood File,\" five days a week and always signed off saying, \"I'll see you on the radio.\" \nOsgood was inducted into the National Association of Broadcasters Hall of Fame in 1990 and the Broadcasting and Cable Hall of Fame in 2000. He is survived by his wife Jean and five children."
}