{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0G03P_L.jpg",
  "title": "China says threats of force over Taiwan not aimed at most Taiwanese",
  "category": "Economy",
  "publisher": "Reuters",
  "date": [
    "Published Jan 16, 2024 11:40PM ET",
    "Updated Jan 16, 2024 11:55PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/economy/china-says-threats-of-force-over-taiwan-not-aimed-at-most-taiwanese-3275673",
  "paragraph": "© Reuters. A globe is seen in front of Chinese and Taiwanese flags in this illustration, August 6, 2022. REUTERS/Dado Ruvic/Illustration/file photo\nBEIJING (Reuters) -China's position that it will not renounce using force to bring Taiwan under its control is aimed at foreign interference and a tiny number of separatists, but Taiwanese need to be disabused of \"biases\" against China, the government said on Wednesday. Taiwan's ruling Democratic Progressive Party (DPP), which won the presidential election on Saturday, rejects Beijing's sovereignty claims but has repeatedly offered talks that have been rebuffed. China views president-elect Lai Ching-te as a dangerous separatist.  Chen Binhua, spokesperson for China's Taiwan Affairs Office, told a regular news briefing in Beijing that the result of Taiwan's election does not change the fact that the island is Chinese and will eventually be \"reunified\". \"Our not promising to renounce the use of force is absolutely not targeted at Taiwan compatriots. We are targeting interference from external forces and the tiny number of Taiwan independence separatists and their separatist activities,\" Chen said. Over the past year-and-a-half China has twice staged large-scale war games around Taiwan and regularly sends fighter jets and warships into the Taiwan Strait. Mainstream public opinion in Taiwan wants peace not war, exchanges not distance, and to \"take down\" the DPP, he said, reiterating the office's comment on Saturday following Lai's victory with less than 50 pct of the vote and the loss of the DPP's parliamentary majority. \"If the DPP does not repent and goes further and further on the wicked path of seeking 'independence' provocations, it will only push Taiwan into a dangerous situation and bring serious harm to Taiwan,\" he said. Chen said Taiwanese are \"our flesh and blood\", but some have been \"poisoned\" by ideas of independence and have a \"biased understanding\" of relations across the strait and national identity. \"We are willing to maintain sufficient patience and tolerance, continue to deepen the understanding of the mainland of the motherland by the majority of Taiwanese compatriots, and gradually reduce their misunderstandings and doubts,\" he added. \"We hope and believe that our compatriots in Taiwan can firmly stand on the right side of history and be upright Chinese people.\" As if to underscore those differences in understanding, Chen told off a Taiwanese reporter for using \"Beijing\" to refer to China, saying the correct wording was \"the mainland\". Opinion polls in Taiwan show an overwhelming number of people these days consider themselves Taiwanese not Chinese, and close to no support for China's \"one country, two systems\" model of autonomy to get the island to accept Beijing's rule.  \nHowever, Chen did not mention Lai, who takes office on May 20, by name, unlike before the election when the Taiwan Affairs Office repeatedly and directly called him a separatist and danger to peace. China says talks can only happen under the proviso Taiwan recognises both sides of the Taiwan Strait are part of \"one China\", which the DPP-led government has refused to do."
}