{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK02049_L.jpg",
  "title": "'Hawkish' China military squeeze on Taiwan likely after election",
  "category": "Stock market news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 03, 2024 01:15AM ET",
    "Updated Jan 03, 2024 02:33AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/stock-market-news/hawkish-china-military-squeeze-on-taiwan-likely-after-election-3265880",
  "paragraph": "© Reuters. FILE PHOTO: Lai Ching-te, Taiwan's vice president and the ruling Democratic Progressive Party's (DPP) presidential candidate arrives an election campaign event in Kaohsiung, Taiwan December 22, 2023. REUTERS/Ann Wang/File Photo\nBy Yew Lun Tian and James Pomfret BEIJING/HONG KONG (Reuters) - The arms race across the Taiwan Strait and Chinese military pressure against the island Beijing claims as its \"sacred\" territory is unlikely to end no matter who wins Taiwan's closely watched elections. China has cast the Jan. 13 presidential and parliamentary elections as a choice between war and peace, warning an attempt to push for Taiwan's formal independence means conflict. China has focused its anger in the run-up to the vote on Lai Ching-te, the ruling Democratic Progressive Party's (DPP) presidential candidate, rebuffing his calls for talks as it views him as a separatist. Both the DPP and Taiwan's largest opposition party, the Kuomintang (KMT), say only they can preserve the peace, and both have also committed to bolstering Taiwan's defences and say only the island's people can decide their future. The KMT traditionally favours close ties with China although it denies being pro-Beijing.  Wang Zaixi, a deputy head of China's Taiwan Affairs Office between 2000 and 2006 and a retired Chinese army major general, was quoted last month in China's Global Times newspaper as saying the DPP's Lai was an \"extremist\" independence supporter. \"If he is elected, you cannot rule out the possibility of a military clash across the Taiwan Strait. We need to be fully aware of this,\" Wang said. Such an outcome could have grave geopolitical and economic outcomes, pitting China against the United States - the world's two leading military powers - while blocking key shipping lanes and disrupting semiconductor and commodity supply chains. \"I believe they will take more hawkish actions to try to warn the new president over his future policies towards China,\" Admiral Lee Hsi-ming, a former Taiwan military chief, told Reuters, referring to Beijing. Western security officials are trying to gauge how serious China could be about a military response to the election outcome. One official, speaking on condition of anonymity as they were not authorised to speak to the media, said Beijing may wait and see, with any strong reaction coming after May 20 when the next president takes office and gives an inauguration speech. If the DPP wins the presidency but loses its majority in parliament, that could also temper China's response given it would weaken the DPP's ability to pass legislation, the Western official added. China's defence ministry, which has decried Taiwan's government for deliberately \"hyping up\" a military threat from China for electoral gain, did not respond to a request for comment. Taiwan defence ministry spokesperson Sun Li-fang told reporters its assessment of China's moves would not be based on whether there is an election or not. \"We'll look at the signs and what the enemy is up to as a basis for our judgement,\" he said. NEW STATUS QUO After Chinese and U.S. leaders met in San Francisco in November, President Xi Jinping reportedly stressed to President Joe Biden that while Taiwan is the most \"dangerous\" bilateral issue, he indicated China is not preparing for an invasion of Taiwan. However, since the last Taiwan presidential poll in 2020, China has engaged in an unprecedented level of military activity in the Taiwan Strait, including holding two rounds of major war games near the island in the past year-and-a-half. Chinese jets now regularly cross an unofficial median line in the strait, seeking to wear down Taiwan's far smaller air force by making them repeatedly scramble. Some analysts see Taiwan's contiguous zone that is 24 nautical miles (44 km) off its coast, being increasingly challenged by the People's Liberation Army (PLA) in the coming years. Taiwan is strengthening its armour. A second Western security official said China was well aware that every year they wait to \"resolve the Taiwan problem\", it gives Taipei a further opportunity to beef up its defences. \"That is not good for the PLA,\" the official said. Defence has featured prominently on the campaign trail. The DPP has repeatedly brought up Taiwan's indigenous submarine, while other arms programmes including drones are being developed. The KMT champions the \"3Ds\" - deterrence, dialogue and de-escalation. Jaw Shaw-kong, the KMT's vice president candidate, said last month Taiwan should ramp up missile production to show it can strike into China in the event of war, although he also said China should allow in Taiwanese military observers as a sign of goodwill and to lessen tensions. Whoever wins, Taiwan has a big weapons order backlog from the United States. In the next few years, Taiwan is due to get advanced U.S. weapons including F-16V fighter jets, M-1A tanks, Harpoon anti-ship missiles and the High Mobility Artillery Rocket System, or HIMARS.  OTHER OPTIONS While clearly a superior military power, recent purges in the PLA that have felled generals in the Rocket Force, navy and air force and a former defence minister could lower the risk of conflict. \"The more problems they have, the more corruption they have, the better it is for us,\" said Lee, the former Taiwan military head. \"I don't think there will be a full-scale invasion in the next few years because they have their own difficulties.\" Over the past week or so, Xi has given two speeches where he reiterated the need for \"reunification\" with Taiwan. On both occasions he made no mention of using force, though Beijing has never renounced that possibility. \nChina could also wield economic pressure post-election, targeting a trade deal signed in 2010 which Beijing says Taipei has breached with unfair trade barriers. Beijing could also ramp up operations to influence people in Taiwan through its \"United Front\" department.  \"China needs to be able to lead and control the situation in Taiwan, and we do that via a variety of means, not just by one means,\" said Wu Xinbo, a professor at Shanghai's Fudan University."
}