{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK030O6_L.jpg",
  "title": "University of Penn professors in Israel speak out on US campus antisemitism",
  "category": "General",
  "publisher": "Reuters",
  "date": [
    "Published Jan 04, 2024 01:36PM ET",
    "Updated Jan 05, 2024 12:12PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/general/university-of-penn-professors-in-israel-speak-out-on-us-campus-antisemitism-3267600",
  "paragraph": "5/5\n© Reuters. Idit Ohel, mother of 22-year-old hostage Alon Ohel, speaks to the delegation of faculty and representatives from the University of Pennsylvania, as they visit a plaza, in support of the families of hostages kidnapped on the October 7 attack by Palestinian\n2/5\nBy Steven Scheer JERUSALEM (Reuters) -Until three months ago, University of Pennsylvania psychology professor Michael Kahana said he had never felt the need to wear a yarmulke, or Jewish skullcap, to his classes. \"It started Oct. 7. I now feel that if I don't wear a yarmulke then my students might not feel that they can,\" said Kahana, one of the organisers of some 30 Penn faculty on a solidarity mission to Israel this week. The aim was mainly to build bridges with the Israeli academic community. Faculty met with Penn alumni, political and hospital leaders and hostage families and toured sites in Israel where Palestinian Hamas fighters attacked on Oct. 7. Penn and other U.S. colleges have simmered with tension over the Hamas attack and Israel's subsequent offensive in Gaza. For months, pro-Palestinian and pro-Israel students have clashed at protests and university administrators have faced criticism for their responses to allegations of antisemitism and Islamophobia.  Penn's leadership came under fire from the school's large Jewish community starting in September when the school hosted a Palestinian literary festival featuring some outspoken pro-Palestinian speakers described as antisemitic by critics.  Outrage mounted on Dec. 5 when then-president Liz Magill declined to give a U.S. congressional committee a definitive \"yes\" or \"no\" answer to the question of whether calling for genocide of Jews violated the school code of conduct.  Magill and the university's former board chair resigned later that month.  Kahana said he did not believe Magill was antisemitic. He said the problem runs far deeper than one person. During their visit to Israel, Kahana and many of his Penn colleagues voiced dismay at fellow Penn professors for not condemning Hamas. In its cross-border rampage from Gaza on Oct. 7, Hamas killed 1,200 Israelis and abducted 240 by Israel's count. Palestinian health officials say more than 22,000 people have since been killed in Israel's counterattack in Hamas-run Gaza. \"It was deeply painful that after Oct. 7 so many of my colleagues saw it perfectly fit to condemn Israel ... they didn't see it fit to say anything about the atrocities of Hamas,\" Kahana said at a dinner with Hebrew University faculty and students. \"Why couldn't they express sympathy after Oct. 7?\" Claire Finkelstein, director of Penn's Center for Ethics and Law, said anti-Israel sentiment on college campuses predates the Oct. 7 attack on Israel. She cited the pro-Palestinian BDS movement - or boycott, divestment, sanctions - founded in 2005.  Critics of the movement say it is discriminatory and aims to economically hobble and undermine the Jewish state. \"There's a very, very strong sentiment on campus that is pro-Palestinian and anti-Israel,\" Finkelstein said of Penn. \"For many of us who are supportive of Israel, that has been very painful, and many of us feel that it is based on a fundamental lack of understanding of the situation on the ground here,\" she said. \"Supporting Palestinians does not require being anti-Israel. There are innocent people dying on all sides of this conflict,\" she said. She blamed some antisemitism on U.S. secondary education, where European history and the Holocaust are taught less and conflicts are portrayed as between oppressors and oppressed. \"It's never too late for an educational institution to educate and that's what this is all about,\" she said. The Penn faculty said Jewish students have been horrified by demonstrations with chants of \"From the River to the Sea\" - which critics interpret as a call for the elimination of Israel - and claims that Israel's actions against Gaza are genocidal. \nA U.S. House of Representatives committee has opened an investigation into Penn, as well as Harvard and MIT, whose presidents testified alongside Magill at the Dec. 5 hearing on antisemitism.  This week Harvard president Claudine Gay said she would resign from her position, ending a six-month tenure marred by allegations of plagiarism and backlash over her congressional testimony about antisemitism on campus."
}