{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK010FW_L.jpg",
  "title": "Factbox-Evacuation from burning JAL jet helped by passengers leaving bags",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 02, 2024 12:32PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/factboxevacuation-from-burning-jal-jet-helped-by-passengers-leaving-bags-3265707",
  "paragraph": "By Tim Hepher and Allison Lampert PARIS/MONTREAL (Reuters) - All 379 people aboard a Japan Airlines airliner escaped after a collision with a Coast Guard aircraft at Tokyo's Haneda airport that killed five of six crew on the smaller aircraft on Tuesday. Video showed passengers being evacuated from the burning Airbus A350 by escape slides in relative calm and apparently without hand luggage, in an operation hailed as a \"miracle\". Aviation safety agencies have warned for years that pausing to collect carry-on baggage risks lives during an evacuation. Following are major milestones in passenger aircraft evacuations in recent decades:  THE 1980s Evacuation has been a key safety priority since at least the mid-1980s, when a British Airtours Boeing (NYSE:BA) 737 was engulfed in flames at Manchester airport in Britain, killing 55 people. Investigators of the 1985 disaster said the biggest cause of death was smoke inhalation following delays in opening doors and restricted access to emergency exits.  SAFETY STUDY A 2000 U.S. safety study said that on average, an airliner evacuation for whatever cause happens every 11 days. Such events typically only make headlines when fire is involved, but have led to improvements in door mechanisms and emergency lighting. However, new challenges are arising from the amount of luggage passengers are allowed to take on board. Air crash investigators have recommended stronger in-flight briefings to urge passengers to leave behind those belongings when ordered to evacuate - but often with little effect. 'REMARKABLE' In 2016, amateur video showed passengers blocking aisles and grabbing bags from overhead bins as the cabin of an Emirates jet filled with smoke in Dubai. Cabin crew were praised after managing to evacuate all 300 people, despite the panic. In 2018, Britain's Royal Aeronautical Society recommended the automatic locking of overhead bins following a crash landing, noting that passengers often ignore safety briefings. \n“It's clearly a benefit if you're not carrying your baggage,\" Steve Creamer, an aviation safety consultant and former senior director at the International Civil Aviation Organization (ICAO), said following Tuesday's Tokyo crash. \"It’s pretty remarkable that they got everybody off the airplane. That says a lot about the flight crew and the discipline of the people on board.\""
}