{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK05033_L.jpg",
  "title": "Blinken: M. East nations need to use influence to prevent 'endless cycle of violence'",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 06, 2024 04:27AM ET",
    "Updated Jan 06, 2024 07:01PM ET"
  ],
  "comments": [
    1,
    [
      [
        "john wick",
        "2024-01-07 07:34:12",
        "See! The americans and blinken going around the world stirring shet again. Americans simply just cannot stand the world is at peace. ",
        "https://www.investing.com/members/256103011"
      ],
      [
        "Brad Albright",
        "2024-01-07 13:51:30",
        "Yeah! If only the world's free nations would stop interfering with totalitarian nations' moves against other countries. ",
        "https://www.investing.com/members/236251128"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/blinken-to-meet-turkish-greek-leaders-as-gaza-diplomacy-tour-begins-3268547",
  "paragraph": "© Reuters. U.S. Secretary of State Antony Blinken meets with Turkish Foreign Minister Hakan Fidan at Vahdettin, a private residence of the Presidency, in Istanbul, Turkey, January 6, 2024. REUTERS/Evelyn Hockstein/Pool\nBy Simon Lewis and Tuvan Gumrukcu CHANIA, Greece (Reuters) -Middle Eastern nations need to use their influence over regional actors to ensure the Gaza conflict is contained and prevent \"an endless cycle of violence,\" U.S. Secretary of State Antony Blinken said on Saturday. Blinken spoke late in the day after meeting the leaders of Turkey and Greece at the start of a week-long trip aimed at calming tensions that have spiked since Israel's war with Hamas began in October. It is in the interests of virtually all nations in the Middle East to contain the fighting, Blinken told reporters. \"We want to make sure that countries who feel that way are also using their ties, using their influence, using their relationships with some of the actors that might be involved to keep a lid on things, to make sure that we're not seeing the spread of conflict,\" he said before flying to Jordan. Lebanon's Iranian-backed Hezbollah group said on Saturday it had fired rockets at Israel, and its arch-foe said it had struck a \"terrorist cell\" in retaliation. Blinken said it was very important that Israel had security in the north of the country. \"From the perspective of Israel, it's clearly not interested, does not want escalation ... but they also have to be fully prepared to defend themselves,\" he said.  Blinken, who will also visit Arab states, Israel and the occupied West Bank, said if efforts to settle the crisis failed the outcome would be \"an endless cycle of violence ... and lives of insecurity and conflict for people in the region.\" He also said he would be looking at what could be done to maximize the protection of civilians in Gaza and increase deliveries of humanitarian assistance. \"Far too many Palestinians have been killed, especially children,\" he said. The war began when Hamas fighters attacked Israel on Oct. 7, killing 1,200 people and taking 240 hostages. Israel's retaliatory offensive has killed 22,700 Palestinians, according to Palestinian officials, and the conflict has spilled into the West Bank, Lebanon and Red Sea shipping lanes. Blinken earlier met Turkish President Tayyip Erdogan, a strong critic of Israel's military actions in Gaza. Blinken and Foreign Minister Hakan Fidan had earlier discussed Gaza, as well as Turkey's process to ratify Sweden's membership of the NATO military alliance, Turkey's foreign ministry said. U.S. officials have been frustrated by the length of the process, but are confident Ankara will soon approve Sweden's accession after it won the Turkish parliament's backing last month, said a senior State Department official traveling with Blinken, speaking on condition of anonymity. U.S. lawmakers have held up the sale of F-16 fighter jets to Turkey until it signs off on Swedish membership. BLINKEN VISITS GREECE Blinken later traveled to Crete where he met Prime Minister Kyriakos Mitsotakis. Fellow NATO member Greece is awaiting U.S. Congress approval of a sale of F-35 fighter jets.  Blinken stressed the importance of Greece's strong alliance with Washington, while Mitsotakis said the two countries could work together to help safeguard security in a turbulent region.  Greece has condemned the Oct. 7 Hamas attack and backs Cyprus' initiative for a maritime corridor to help deliver more aid to the enclave. It believes it can play an active role on that front due to its historic ties with the Arab world.  The U.S. official said Turkey has relationships with many parties in the conflict, a reference to its ties to U.S. adversary Iran and Hamas. Unlike the U.S., Turkey does not view Hamas as a terrorist group and hosts some of its members. \nBlinken also hopes to make progress in talks on how Gaza could be governed if and when Israel achieves its aim of eradicating Hamas. Washington wants countries in the region, including Turkey, to play a role in reconstruction, governance and potentially security in the Gaza Strip, which has been run by Hamas since 2007, the official said."
}