{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0M08F_L.jpg",
  "title": "Russian missile strikes on Ukrainian cities kill 18, Zelenskiy says",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 23, 2024 03:10AM ET",
    "Updated Jan 23, 2024 08:46PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/several-killed-in-latest-russian-air-strike-on-ukraine-3280280",
  "paragraph": "5/5\n© Reuters. An explosion of a missile is seen in the sky over the city during a Russian missile strike, amid Russia's attack on Ukraine, in Kyiv, Ukraine January 23, 2024. REUTERS/Gleb Garanich\n2/5\nBy Yurii Kovalenko and Sergiy Karazy KYIV (Reuters) - Russian missiles hit Ukraine's two largest cities, killing 18 people, injuring more than 130 and damaging homes and infrastructure, President Volodymyr Zelenskiy said as Moscow's war approaches its third year. The eastern city of Kharkiv suffered three waves of attacks. There were strikes on Kyiv and in central Ukraine and the southern region of Kherson, subject to constant shelling. Zelenskiy, in his nightly video address, said Russia had launched nearly 40 missiles of different types in \"another combined strike to try to circumvent our air defence system\". More than 200 sites were hit, including 139 dwellings, with many deaths in \"an ordinary high-rise apartment building. Ordinary people lived there,\" he said. Kharkiv's mayor and the governor of Kharkiv region said eight people had been killed in the city, which has been subjected to repeated attacks in 23 months of war. Ukraine's Emergency Services posted online a video of teams sifting through a shattered apartment building. Police said search operations were suspended before midnight as there was a danger of debris falling on rescue squads. Kharkiv regional Governor Oleh Synehubov said more than 100 high-rise blocks had been damaged in the first two attacks. He said there were three hits in the evening on an apartment block and other infrastructure, injuring seven. Ukraine's General Staff said the country's armed forces had destroyed 22 of 44 missiles of various types. Nearly 20 had been shot down over Kyiv, the city's military administration said. The strikes coincided with Defence Minister Rustem Umerov telling the latest international ministerial meeting on Kyiv's defence needs that Russia was stepping up missile attacks. Over the past two months, he said, Russian forces had used more than 600 missiles and more than 1,000 drones. German Defence Minister Boris Pistorius said after the meeting that Berlin would send six \"Sea King\" helicopters to Ukraine later this year, the first delivery of its kind.  WOUNDED IN KYIV In Kyiv, emergency services said 22 people, including four children, had been wounded across at least three districts. At one site, rescuers tended to dazed and groaning victims as workers swept away debris and broken glass. \"There was a very loud bang, and my mother was already running outside, shouting that we need to leave. We all went to the corridor,\" said Daniel Boliukh, 21. \"Then, we went on the balcony to have a look, and saw all these buildings were on fire.\" Emergency services said apartment buildings, medical and educational institutions were damaged in Kyiv. Some of the damage occurred next to the United Nations office, resident coordinator Denise Brown said in a statement. The Kremlin, asked to comment on the strikes on Kyiv and Kharkiv, said the Russian military does not target civilians. Kherson regional Governor Oleksandr Prokudin said Russian aircraft had pounded his region throughout the day. Officials said two people had died. One person was killed in the southeastern city of Pavlohrad, the regional governor said. The attacks damaged a gas pipeline in Kharkiv and thousands were left without power after infrastructure was hit. Russia has carried out regular air strikes on cities and civilian infrastructure far behind the front lines since its invasion of Ukraine in February 2022. Its troops, meanwhile, are attacking along the sprawling eastern front and seeking to seize the initiative, Ukraine's military says.  Russian forces have increasingly employed a mix of air- and land-based missiles that are more difficult to shoot down. Moscow accused Kyiv on Sunday of shelling the Russian-occupied eastern Ukrainian city of Donetsk, killing 27 people. Ukrainian forces said Russia bore responsibility for the attack. \nThe Russian defence ministry said on Tuesday it had struck enterprises producing missiles, explosives and ammunition.  (This story has been refiled to correct the spelling of 'our' in Zelenskiy's quote in paragraph 3)"
}