{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0O00G_L.jpg",
  "title": "North Korea's Kim warns failure to provide food a 'serious political issue'",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 24, 2024 07:16PM ET",
    "Updated Jan 24, 2024 07:28PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/north-koreas-kim-warns-failure-to-provide-food-a-serious-political-issue-3282374",
  "paragraph": "© Reuters. North Korean leader Kim Jong Un attends the 19th expanded political bureau meeting of the 8th Central Committee of the Workers' Party of Korea, which was held from January 23 to 24, in Pyongyang, North Korea, in this image released by the Korean Central N\nBy Hyunsu Yim SEOUL (Reuters) - North Korean leader Kim Jong Un has called for ways to be found to improve economic development after saying that a failure to provide people with basic living necessities including food is a \"serious political issue\", state media reported on Thursday. Kim made the remarks while discussing regional development in a speech at the 19th Enlarged Meeting of the Political Bureau of the 8th Central Committee of the Workers' Party of Korea, the country's ruling party, held between Tuesday and Wednesday, according to KCNA. North Korea has over recent decades suffered serious food shortages, including famine in the 1990s, often exacerbated by natural disasters such as floods damaging harvests.  The food situation in North Korea was \"still bad\" despite an uptick in trade with China, South Korea's unification minister, who is charged with handling relations with its neighbour, said last year. The North Korean leader also urged his party to bring about a swift change to raise the living standards of people throughout the country and close the gaps between urban and rural areas through its new regional development policy.  Kim announced the policy at a Supreme People's Assembly meeting held earlier this month. \"The overall regional economy is in a terrible situation without elementary conditions and there are severe imbalances and huge gaps between regions in terms of their geographical circumstances, economic potential and living circumstances,\" Kim was quoted as saying. \n\"We should not sit by and wait till the situation and conditions turn favourable but find more jobs to be faithful to our duty for the sake of the people,\" he added. North Korea, which is under strict international sanctions over its banned weapons programmes, came under further economic pressure during the pandemic when its limited border trade was virtually choked off by self-imposed lockdowns aimed at preventing COVID-19."
}