{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0T01W_L.jpg",
  "title": "Vietnam, Philippines seal deals on South China Sea security",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 29, 2024 11:35PM ET",
    "Updated Jan 30, 2024 02:56AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/vietnam-philippines-seal-deals-on-south-china-sea-security-3286520",
  "paragraph": "By Khanh Vu HANOI (Reuters) -Vietnam and the Philippines agreed on Tuesday to boost cooperation between their coastguards and to prevent untoward incidents in the South China Sea, in an announcement during a state visit to Hanoi by President Ferdinand Marcos Jr. The two Southeast Asian countries have competing claims over some parts of the South China Sea, a conduit for $3 trillion of annual ship-borne trade that China claims almost in its entirety. The two memoranda of understanding on security covered \"incident prevention in the South China Sea\" and \"maritime cooperation\" among coastguards, according to a Vietnamese official who announced the deals during a formal ceremony in the country's presidential palace. The agreements in Hanoi could risk angering Beijing, especially if they paved the way for future compromises on disputed claims. China tends to view progress in the resolution of border disputes among other claimants with scepticism. Both Hanoi and Manila have had run-ins with China's coastguard in the past, but altercations have been frequent in the last year between vessels of China and U.S.-ally the Philippines, adding strain to deteriorating relations. The maritime cooperation deal aims to establish a comprehensive partnership between the two Coast Guards on capacity building, training, and personnel and ship exchanges to improve their ability to run operations together, according to Marcos' remarks at a meeting with Vietnamese Prime Minister Pham Minh Chinh. \"The South China Sea remains to be a point of contention,\" Marcos said at the meeting.  \"We are firm in defending our sovereignty, sovereign rights, and jurisdiction against any provocations. But at the same time, we are also seeking to address these issues with China through peaceful dialogue and consultations as two equal sovereign states.\" Before meeting Vietnam's President Vo Van Thuong, Marcos said Vietnam was \"the sole strategic partner of the Philippines\" in Southeast Asia and stressed that maritime cooperation was the foundation of that relationship. \"The world and regional situation is evolving in a rapid and complicated manner and therefore we need to unite and cooperate more closely,\" Vietnamese Prime Minister Pham Minh Chinh said, noting Marcos' visit helped boost bilateral relations. Vietnam, one of the world's biggest rice exporters, also sealed agreements with the Philippines, a top importer of the grain, covering rice trade and agriculture cooperation.  In his two-day visit to Hanoi, Marcos is meeting Vietnamese leaders, but not Communist Party chief Nguyen Phu Trong, according to official schedules, in what would be Trong's third consecutive absence from meetings with visiting leaders this month. Trong, 79, however attended a parliament's session in mid-January, partly dispelling concerns about his health after he was not included in official schedules of visiting leaders from Laos and Indonesia.  Before meeting Vietnamese political leaders on Tuesday, Marcos met Pham Nhat Vuong, the head of Vingroup, Vietnam's largest conglomerate, on Monday. The company said on Tuesday its electric car unit VinFast (NASDAQ:VFS) will open a business network in the Philippines.  \nMarcos said the Philippines could help produce batteries for electric vehicles, thanks to its reserves of cobalt, copper and nickel, Vingroup said in a statement. He said the two countries aim to increase bilateral trade to $10 billion from $7 billion."
}