{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBR07Y_L.jpg",
  "title": "China's military lashes out at US after breakthrough talks",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 28, 2023 05:49AM ET",
    "Updated Dec 28, 2023 05:55AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/chinas-military-lashes-out-at-us-after-breakthrough-talks-3264262",
  "paragraph": "© Reuters. FILE PHOTO: U.S. and Chinese flags are set up before a meeting between U.S. Treasury Secretary Janet Yellen and Chinese Vice Premier He Lifeng at the Diaoyutai State Guesthouse in Beijing, China, Saturday, July 8, 2023. Mark Schiefelbein/Pool via REUTERS/\nBy Laurie Chen BEIJING (Reuters) - China's defence ministry lashed out at the United States on Thursday, a week after their top military officials resumed high-level talks, criticising its continued meddling in the Asia Pacific region and saying it maintained a \"Cold War\" mindset.  Both sides had pledged at the talks to work towards restoration of contacts to avert miscalculation and misunderstanding, with the U.S. calling for \"more work\" to ensure military communications stayed open and reliable. But a Chinese defence ministry spokesperson took a more hawkish tone at the year's last regular press conference. \"The United States continues to strengthen its Asia-Pacific deployments, this is full of a Cold War mindset,\" the spokesperson, Wu Qian, said on Thursday.  \"Its goal is for its own selfish gains and to maintain its hegemony. Its nature is to stoke confrontation.\" U.S. officials had hoped last week's talks, when top U.S. General Charles Brown and his Chinese counterpart, General Liu Zhenli, held a videoconference in the first such event in more than a year, could bring a broader restoration in military ties. Those talks followed a pact in San Francisco last month between the leaders of both countries to resume such ties, which Beijing had snapped after a visit to self-ruled Taiwan in 2022 by Nancy Pelosi, then speaker of the House of Representatives. The video call yielded \"positive and constructive outcomes\", Wu said. But Beijing expected Washington to \"take concrete actions on the basis of equality and respect to promote the sound and steady development of China-US military-to-military relationship\", he added, with specifics to be announced later. MANIPULATING TAIWAN On Taiwan, set to hold a key presidential election on Jan 13, Wu accused its government of deliberately \"hyping up\" a military threat from China for electoral gain. He warned the U.S. against interfering in Taiwan affairs, including selling arms to the island democracy.  \"We firmly oppose any country having official and military contact with Taiwan in any form. The U.S. is manipulating the Taiwan question in various forms, which is a very dangerous gamble,\" Wu said. \"We urge the U.S. to stop arming Taiwan under any excuses or by any means,\" he added. Taiwan's defence ministry said this week it was not seeing any signs of large-scale Chinese military activity before the elections but was keeping close watch on China. Wu also blamed the United States for rising tension in the South China Sea, following recent skirmishes between China and the Philippines around the Spratly islands. The U.S. has backed Manila in its maritime disputes with China amid a broader strengthening of ties under Philippine President Ferdinand Marcos Jr. \"The U.S., out of its selfish calculations, has been conniving at, and emboldening the Philippines, attempting to coerce and threaten China,\" Wu said. This week a Philippine military spokesperson rebutted China's accusation that his country was provoking conflict in the region. On the domestic front, Wu declined to comment on the removal this week of three executives at leading aerospace defence firms from China's top political advisory body. \"I refer you to the competent national authorities,\" he said, when asked about the reason behind the removals.  The executives are from China Aerospace Science and Technology Corporation (CASC), China's main space program contractor and builder of missile systems; Norinco, a major Chinese defence contractor, and China's largest missile maker, the China Aerospace Science and Industry Corporation (CASIC). \nAn anti-corruption purge in the top ranks of the People's Liberation Army has implicated former defence minister Li Shangfu, who faces investigation for corrupt military procurement, Reuters has previously reported. The People's Liberation Army Rocket Force has also been in focus recently after its two most senior leaders were suddenly replaced at the end of July with commanders from outside the force."
}