{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "Russian drones hit sites linked to Ukrainian nationalists",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 01, 2024 07:42PM ET",
    "Updated Jan 01, 2024 08:16PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/russian-drones-hit-sites-linked-to-ukrainian-nationalists-3265158",
  "paragraph": "By Andriy Perun LVIV, Ukraine (Reuters) - Russian drones attacked a university and a museum linked to two of the most prominent 20th century defenders of Ukrainian national identity on Monday, leaving locals vowing to repair the damage.  The first smashed windows and much of the roof at the National Agrarian University, outside the western Ukrainian city of Lviv, where Stepan Bandera - a hero in Ukraine but a villain according to the Kremlin - studied.  It hit on what would have been Bandera's 115th birthday. The second ravaged a nearby museum devoted to Roman Shukhevych.  Both men were key figures in nationalist resistance to Soviet rule and were associated with the Ukrainian Insurgent Army (UPA) which fought Soviet forces in World War Two. \"This is the building in which Stepan Bandera attended classes. There's a memorial plaque dedicated to Bandera, and the statue too,\" 82-year-old Sofia Zdorovyk said as people cleared up the rubble around her. \"Everything that's been going on in our country, for so many years, do they (Russia) feel better because of it? Don't they have enough land? Natural resources? What is it that they need?\" Lviv Mayor Andriy Sadovyi described the strike on the museum as a symbolic act. \"We will restore it after our victory,\" he said. Bandera was the most prominent figure in a group associated with the UPA, whose ranks swelled to 100,000 by 1944, according to historical accounts, and continued fighting Moscow's rule until the mid-1950s. Shukhevych was the UPA's supreme commander. Moscow still invokes Bandera's name to underpin its assertions that it invaded Ukraine in February 2022 to \"denazify\" the country, pointing to the fact that some nationalists initially cooperated with German forces in their battle against the Russians - though they later also fought the Nazis. \"Just hearing the name Bandera scares them (the Russians). It causes rage and hatred,\" Vasyl Lapushniak, President of the Lviv National Agrarian University, said. \"They did not scare us with this. It only united us once more and showed our strength.\" The honour of \"Hero of Ukraine\" was bestowed on both men in the post-Soviet period. Soldiers from the UPA's ranks were declared \"veterans\" alongside Soviet Red Army soldiers. \nThe nationalist army's activity has long been clouded by allegations that it carried out massacres of tens of thousands of ethnic Poles in western Ukraine's Volyn region - part of an area that was under Polish rule between the two world wars. Poland and Ukraine have taken measures to honour those deaths and seal a reconciliation between the two neighbours."
}