{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "California professors end strike after one day",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 22, 2024 04:06PM ET",
    "Updated Jan 23, 2024 01:56AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/california-professors-launch-5day-strike-on-first-day-of-semester-3280012",
  "paragraph": "By Daniel Trotta (Reuters) -A union representing 29,000 professors and staff at the California State University (CSU) reached a tentative deal on Monday night to call off a five day strike after one day, ending uncertainty for more than 450,000 students on 23 campuses. The California Faculty Association and the CSU have been bargaining for a new contract since May. The union started their proposed five-day strike earlier on Monday in the first week of the semester. The union said the now agreed deal includes a 5% general salary hike for all faculty backdating to July 2023 and a 5% salary increase for all faculty in July this year. The agreement also raises the salary floor for the university's lowest-paid faculty and increases paid parental leave from six to 10 weeks.  Staff were expected to return to work on Tuesday and will vote on ratifying the contract in the coming weeks, the union added.  \"The agreement enables the CSU to fairly compensate its valued, world-class faculty while protecting the university system's long-term financial sustainability,\" Chancellor Mildred García said in a separate statement. The union had earlier posted images of its members walking picket lines on Monday. The CSU is distinct from the University of California system, which had its own five-week strike by academic workers at the end of 2022. \nThe strikes have formed part of a resurgence for organized labor activism in California. Los Angeles Unified School District workers staged a three-day strike last year before settling on a contract, while Hollywood writers and actors also held lengthy walkouts. Another potential strike was averted on Friday, when the Teamsters Local 2010 representing 1,100 skilled trade workers on 22 campuses reached a deal with the CSU."
}