{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0O0TQ_L.jpg",
  "title": "Diplomats back non-violence as Venezuela, Guyana talk over border dispute",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 25, 2024 04:01PM ET",
    "Updated Jan 25, 2024 04:09PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/diplomats-back-nonviolence-as-venezuela-guyana-talk-over-border-dispute-3283449",
  "paragraph": "© Reuters. Brazil's Foreign Minister Mauro Vieira, Venezuela's Foreign Minister Yvan Gil and Guyana's Foreign Minister Hugh Todd attend a meeting between representatives of the governments of Venezuela and Guyana to discuss the crisis surrounding the territory of Es\nBRASILIA (Reuters) -Talks over a territorial dispute pitting Venezuela against Guyana yielded commitments on Thursday to avoid violence or threats, after Venezuelan President Nicolas Maduro revived claims over an oil-rich region on their shared border. The dispute centers on Esequibo, a 160,000 square kilometer (61,800 sq mile) region that is mostly thick jungle but also where in recent years massive amounts of oil and gas have been found. The top diplomats from both South American nations held talks hosted by Brazil, pledging to use diplomacy to settle differences. \"We agree on the need to continue... through diplomatic channels,\" Venezuelan Foreign Minister Yvan Gil told reporters in the Brazilian capital after the meeting. Esequibo is generally recognized as part of Guyana, but in recent years Venezuela has reasserted its claim to the territory and its adjacent offshore areas, where several dozen major oil discoveries have been notched since 2015.  Guyanese Foreign Minister Hugh Todd expressed confidence that the next meeting will bring \"real advances.\" \nHe added his nation was committed to allowing the International Court of Justice to offer a solution on the dispute. The court ruled in December that Venezuela refrain from taking any action that alters the situation on the ground in Esequibo. The follow-up meeting will also be held in Brazil, according to Brazilian Foreign Minister Mauro Vieira."
}