{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBU02A_L.jpg",
  "title": "Final bodies found after China's most serious earthquake in a decade",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Dec 31, 2023 02:01AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/final-bodies-found-after-chinas-most-serious-earthquake-in-a-decade-3264926",
  "paragraph": "© Reuters. FILE PHOTO: An aerial view shows buildings covered in silt amid rescue operations after the earthquake in Gansu's Jishishan county triggered a mudslide in Jintian village, Qinghai province, China December 19, 2023. cnsphoto via REUTERS\nBEIJING (Reuters) - The bodies of the two remaining people missing in the aftermath of China's most serious earthquake in nearly a decade were found on Sunday, a tragedy that has renewed concern over exposed populations in seismically active zones.  That raises official fatalities from the magnitude 6.2 quake that rocked the northwestern provinces of Qinghai and Gansu almost two weeks ago to 151. The final bodies were found in Qinghai at 1:16 a.m. (1716 GMT Saturday), state media reported.  The earthquake, whose epicentre straddled Qinghai and Gansu, was the most serious in China since a magnitude 6.5 temblor struck the southwestern province of Yunnan in 2014 and killed 617 people.  The tragedy in disaster-hit Qinghai and Gansu, home to many Hui people, a tight-knit ethnic minority characterised by its distinctive Muslim identity, has renewed concern over outdated and poorly built homes. Many of the homes destroyed were made of earth-wood or brick-wood structures. Their load-bearing walls were constructed from earth, providing little defence against any earthquake, say local authorities.  Gansu, Qinghai, Tibet, Xinjiang and the rugged highlands in Sichuan and Yunnan are located on the fringe of the geologically complex Qinghai-Tibet plateau. Many populations living near the edge of the plateau, often atop active fault lines, are rural farmers and herders subsisting on very low incomes.  Han Ting, 33, whose village in Gansu was nearly wrecked by the quake, chose to stay put in an emergency tent set up by relief workers because of fears her partially damaged family home could still collapse on her.  \"The prefab house assigned to us is also a bit far, so we still choose to stay here in the tent,\" said Han, one of the thousands of Hui people who live in the area.  \"It's not too cold at the moment, and we aren't lacking in daily necessities, and the children have also resumed school.\" Even as life started to resume for Han, she could not help but think of her grandfather, who survived the initial impact of the earthquake but died several days later. \"On the night of the quake, he ran out of the house wrapped in just blankets and hid in a small car,\" she recounted to Reuters.  In under two weeks, local authorities have built thousands of single-storey prefab homes to help affected families transition from tents as the winter progressed. The quake displaced 145,000 people and destroyed over 200,000 homes. \n\"Our village was one of the more severely hit,\" said Han. \"The government said homes that have collapsed will be rebuilt and homes that have been damaged will be repaired. But we don't when exactly.\""
}