{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "How US House Republican-proposed spending cuts would hit Black Americans",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 04, 2024 06:08AM ET",
    "Updated Jan 04, 2024 06:26PM ET"
  ],
  "comments": [
    2,
    [
      [
        "Mark Jannetty",
        "2024-01-04 13:28:31",
        "Democrats are pathetic. They would rather bankrupt the country, instead of solving America's spending crisis ",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Barry Nickerson",
        "2024-01-04 11:37:24",
        "ATTENTION!! Reuters goes to work campaigning for Old Joe.  There's NO bias in this article, really!   What happened to making people pay for their political ads?",
        "https://www.investing.com/members/249373719"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/factboxhow-us-house-republicanproposed-spending-cuts-would-hit-black-americans-3267023",
  "paragraph": "WASHINGTON (Reuters) - U.S. House of Representatives Republicans are working to rein in government spending in ways that would affect many federal social programs and could have a disproportionate impact on Black Americans. Here is a rundown on some of House Republicans' spending proposals that will be discussed as Congress attempts to avert a partial government shutdown later this month and next: RACIAL EQUITY House appropriations bills would prohibit the use of federal dollars to carry out an executive order by Democratic President Joe Biden that aims to close racial gaps in wages, lending opportunities, access to higher education and other areas, according to the White House. It was a tool used during the COVID-19 pandemic to help ensure vaccines were distributed equitably. More recently it is being used to help guard against artificial intelligence algorithms tilting against members of minority groups in housing programs, for example. GUNS House Republicans have moved to prohibit federally funded firearm and gun violence research.  Republican Representative Robert Aderholt, who chairs the House appropriations panel that oversees the Centers for Disease Control and Prevention (CDC), defended the move, saying in an April statement the agency should focus \"on infectious diseases, transmittable diseases, and certainly chronic diseases rather than on controversial, politically-charged activities.\" Everytown, a group dedicated to ending gun violence, says Black Americans \"experience 12 times the gun homicides, 18 times the gun assault injuries, and nearly three times the fatal police shootings of white Americans.\" EDUCATION Funding for low-income college students under the Pell Grant program, which most Black undergraduates obtain for tuition, would remain at last year's level under the bill approved by a House Republican-controlled subcommittee. That legislation has been stalled in the full committee.  During the 2019-2020 academic year (the most recent data available), nearly 60% of Black students relied on Pell Grants, according to the U.S. Department of Education. That compares with about 32% of white students, about 50% for Latino or Hispanic students and nearly 34% for Asian students. DIVERSITY OFFICES The U.S. Army's Office for Diversity, Equity and Inclusion would be eliminated under House Republicans' defense spending bill, as would other federal agencies'. Republicans said the Army programs \"serve to divide the military along racial, ethnic, or gender lines rather than unite servicemembers to provide for the common defense.\" White enrollment over the past 12 years has fallen from nearly 62% of the Army's active soldiers in 2011 to 53.5% in 2023. Meanwhile, Black soldier numbers have remained steady at around 20% while Hispanic ones have risen to 17.6% from 11.4%. As of Oct. 31, 2022, 69% of the Army's officers were white, with 11% Black, according to Army statistics. LEAD PAINT CONTAMINATION A federal program helping local governments remove lead-based paint from homes, which causes neurological problems in young children, would see funding cut by $65 million, to $345 million, just for this year. Another $560 million would be clawed back that was appropriated for a three-year period under an arrangement designed to give officials time to vet state and local cleanup projects.  Children under 6 are particularly vulnerable to ingesting lead-based paint chips and dust because of their hand-to-mouth habits and because their bodies are developing in those early years. The severity of blood lead levels in early childhood \"are markedly worse for Black children compared to their white or Hispanic peers,\" according to a 2020 National Institutes of Health study. House Republicans proposed a $10 million pilot program to explore new financing methods for the cleanup. INFANT MORTALITY Funding would be eliminated this year for the Department of Health and Human Services' \"Healthy Start,\" which aims to attack high rates of mortality for pregnant women and their unborn children. Around 60% of women participating in this program are Black, according to a 2020 analysis done for the department by Abt Associates. The Centers for Disease Control and Prevention said in a 2021 survey that the maternal mortality rate for Black women was 2.6 times the rate for white women. Republicans argue the $145 million Healthy Start could be folded into a separate program focusing on improving early childhood development and school readiness. HHS says prenatal care is not authorized in the Maternal, Infant, and Early Childhood Home Visiting program. HOUSING  The Home Investment Partnership Program offers U.S. Housing and Urban Development Department grants to states and local governments to expand the supply of affordable housing by rehabilitating existing homes or building new ones.  House Republicans want last year's $1.5 billion appropriation shrunk to $500 million. They argue that a COVID-era law provided $5 billion and nearly all of that has not yet been spent. Robert Henson, a senior specialist at the National Council of State Housing Agencies, said the $5 billion is targeted at another program with a different mission. The Republican spending cuts, Henson said, would result in about 17,000 fewer affordable homes built or rehabilitated this year, resulting in about 5,000 fewer households being helped. As of Dec. 1, almost 40% of Home Investment Partnership Program rental units were to Black people and nearly 48% to white renters.  CIGARETTES Last year the Food and Drug Administration proposed banning menthol cigarettes, which are heavily marketed in Black communities. House appropriators want to kill that effort. The CDC said about 81% of Black adults who smoked cigarettes used menthol varieties compared with 34% of white adults. \nThe FDA has delayed issuing the regulation. The Washington Post in December reported the delay came amid administration concerns the move could anger Black smokers who are important to Biden's reelection in November. (This story has been corrected to say that there have been no funding cuts to Pell Grants, instead of a $1,000 cut, in paragraph 9)"
}