{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBR0JT_L.jpg",
  "title": "More than 180 Palestinians killed as Israel forges on with Gaza assault",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 28, 2023 05:51PM ET",
    "Updated Dec 29, 2023 05:53PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/israeli-tanks-missiles-strike-gaza-in-offensive-against-hamas-3264521",
  "paragraph": "© Reuters. Israeli soldiers work to repair tanks amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, near the Israel-Gaza border, in southern Israel, December 28, 2023. REUTERS/Amir Cohen\nBy Nidal al-Mughrabi and Arafat Barbakh CAIRO/GAZA (Reuters) - Tens of thousands of fleeing Palestinians sought shelter on Friday as Israeli tanks pushed through the central Gaza Strip, with more than 180 people reported killed in 24 hours of airstrikes and artillery barrages on the shattered enclave. Israeli warplanes attacking the south of Gaza flattened homes and buried families as they slept, residents said. The assaults in central and southern Gaza propelled a new exodus of people already driven from other areas in what Israeli Defence Minister Yoav Gallant called an essential stage of Israel's mission to destroy its foe Hamas. Twelve weeks after Hamas militants stormed Israeli towns, killing 1,200 people and seizing 240 hostages, Israeli forces have laid much of the Gaza Strip to waste. Nearly all of its 2.3 million people have fled their homes at least once and many are now on the move again, often reduced to taking shelter in makeshift tents or huddled under tarpaulins and plastic sheets on open ground. Gaza health authorities said 187 more Palestinians were confirmed killed in Israeli strikes in the last 24 hours, raising the toll to 21,507 - about 1% of Gaza's population. Thousands more bodies are feared to be buried in the ruins of obliterated neighbourhoods. In Rafah in the south, Reuters journalists at the scene of one airstrike that destroyed a building saw the head of a buried toddler sticking out of the rubble. The child screamed as a rescue worker shielded his head with a hand, while another swung a sledgehammer at a chisel, trying to break up a slab of concrete to free him. Neighbour Sanad Abu Tabet said the two-storey house had been crowded with displaced people. After morning broke, relatives went to collect the dead wrapped up in white shrouds. A man peeled away the cloth to stroke the face of a dead child. Tens of thousands of Gazans are fleeing the crowded central districts of Bureij, Maghazi and Nusseirat, ordered out by Israeli forces whose tanks advanced from the north and east. Most have made their way south or west to the already overwhelmed city of Deir al-Balah. \"We suffered a lot. We had the whole night without shelter, under rain and it was cold, we were with our kids and elderly women,\" said Um Hamdi, a woman cooking porridge over an open woodfire surrounded by children. Nearby, Abdel Nasser Awadallah stood inside a wooden frame set up to be wrapped in plastic to make a tent, and spoke of the family he had lost. \"I buried my children - a child 16 years old, another one aged 18. Something I really can't believe, I buried my children at 6 a.m. while their bodies were still warm. Also my nephew, he was 2 years old, I buried him. I buried my wife,\" he said. \"I never thought in my life that I will bury my children, I thought they would bury me.\" NO SIGN OF SCALING DOWN ISRAELI ASSAULT Israel says it is doing what it can to avoid civilian casualties, but the high death toll has caused concern even amongst its staunchest allies. The U.S. has called for it to scale down the war in coming weeks and move to targeted operations against Hamas leaders. So far Israel shows no sign of doing so. Footage filmed by a Palestinian Red Crescent volunteer in Maghazi showed dead and wounded being carried from ruined buildings. In the south, Israeli forces have been pounding Khan Younis in preparation for an anticipated further advance into the main southern city, swathes of which they captured in early December. Defence Minister Gallant said troops were reaching Hamas command centres and arms depots. \"Our operations are essential to achieving the goals of the war,\" he said. The Israeli military also said it had destroyed a tunnel complex in the basement of one of the houses of the Hamas leader for Gaza, Yahya Sinwar, in Gaza City. The shaft led to a network designed for lengthy stays and combat command and was fitted with electricity, an elevator, prayer rooms, bathrooms and air conditioning, it said. It made no mention of Sinwar's possible whereabouts.  AID TRICKLE  Gaza is almost entirely reliant on food, fuel and medical supplies from the outside, and Israel has shut off all access apart from at the southern edge. International bodies say supplies being let in through Israeli inspections are a small fraction of the enclave's vast needs.  Last week Israel bowed to international pressure to open a second crossing it said would double the number of supply trucks daily to 200, but just 76 were able to enter on Thursday, according to the United Nations, compared to 500 in peacetime.  An Israeli government spokesman said on Friday it does not limit humanitarian aid and the problem was with its distribution inside Gaza.  The United Nations Relief and Works Agency (UNRWA), which distributes aid, rejected allegations it was responsible for hold-ups in deliveries and said the operation was riddled with logistical hurdles. \nBombardments and ground fighting had hampered distribution as well as hold-ups at Israeli checkpoints, it said. A breakdown of law and order also made it hard to secure the convoys, while people were helping themselves to supplies at warehouses.  Separately, UNRWA said Israeli soldiers fired at an aid convoy as it returned from northern Gaza along a route designated by the Israeli army. No one was injured, it said."
}