{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBQ0BS_L.jpg",
  "title": "Taylor Swift fan died of heat exhaustion at Rio concert, police say",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 27, 2023 09:45AM ET",
    "Updated Dec 27, 2023 09:51AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/taylor-swift-fan-died-of-heat-exhaustion-at-rio-concert-police-say-3264061",
  "paragraph": "© Reuters. Fans wait in line outside Nilton Santos stadium for the Taylor Swift concert, following the death of a fan due to the heat during the first day concert, in Rio de Janeiro, Brazil, November 20, 2023. REUTERS/Ricardo Moraes/File Photo\nBy Rodrigo Viga Gaier RIO DE JANEIRO (Reuters) - The death of a young Brazilian fan who fell ill at a concert by U.S. singer Taylor Swift in sweltering Rio de Janeiro last month was due to heat exhaustion, police said on Wednesday. Ana Clara Benevides, 23, collapsed at the Nilton Santos Stadium on Nov. 17 while attending the first of six shows that Swift performed in Brazil as part of The Eras Tour. Benevides was taken to an on-site medical station and later transferred to the Salgado Filho Hospital, where she died. The concert came amid Brazil's record-breaking heat-wave in November, with Rio recording on that day its highest-ever levels at the time of the so-called heat index, which combines temperature and humidity, at 59.3 degrees Celsius. A police report published on Wednesday said Benevides suffered heat exhaustion that led to cardiovascular and respiratory issues, citing \"alveolar hemorrhage and polyvisceral congestion caused by diffuse exposure to heat\" as the official cause of death. Toxicological tests did not indicate alcohol or drugs in her blood, the report said. Benevides had traveled from Mato Grosso do Sul state in midwest Brazil to Rio to attend the concert. Show organizers T4F acknowledged they could have taken more measures to help fans cope with the extreme heat in Rio, including changing the start time for shows and publicizing that fans could enter with cups of water. Rio police opened a probe into the firm last month. \"Company representatives will be called to provide clarifications following this report,\" police said in a statement on Wednesday, adding that the investigation was ongoing. \nFollowing the news of Benevides' death, Swift wrote on Instagram that she had a \"shattered heart\" and was \"devastated.\" She postponed her second Rio concert the next day due to scorching heat, but went ahead with the remaining shows on the Brazilian leg of The Eras Tour."
}