{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK080HO_L.jpg",
  "title": "Gunmen in Ecuador storm TV studio in wave of violence",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 09, 2024 08:53AM ET",
    "Updated Jan 10, 2024 10:51AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/explosions-kidnapping-of-police-mark-ecuador-state-of-emergency-3270341",
  "paragraph": "© Reuters. FILE PHOTO: Police officers stand in formation outside El Inca prison after a security operation due to riots, following the disappearance of Jose Adolfo Macias, alias 'Fito', leader of the Los Choneros criminal group, in Quito, Ecuador, January 8, 2024. \nBy Yury Garcia and Alexandra Valencia GUAYAQUIL/QUITO (Reuters) -Gunmen with explosives stormed a TV station on-air in Ecuador on Tuesday during a wave of violence around the nation that prompted President Daniel Noboa to name 22 gangs as terrorist organizations to be hunted by the military. Police eventually rescued the TV staff and arrested the 13 men who burst into TC's studio during a live broadcast with long-range guns, grenades and dynamites, according to witnesses in the coastal city of Guayaquil. Elsewhere in Ecuador, at least seven police officers were kidnapped and there were several explosions. \"Thank God, we are alive, because it was an extremely violent attack,\" said Jorge Rendon, deputy director of the news program that was interrupted.  Noboa, who took office in November promising to stem drug-related violence, declared a 60-day state of emergency on Monday in response to prison violence - including hostage-takings of guards by inmates - and the apparent escape of Los Choneros gang leader Adolfo Macias over the weekend. In a revised decree on Tuesday, Noboa declared nearly two dozen gangs terrorist groups, including Los Choneros. The government has said the violence is a reaction to Noboa's plan to build a new high security prison for gang leaders. \"They have created a wave of violence to frighten the populace,\" said Admiral Jaime Vela, head of the joint command of the armed forces, adding that the decree made the gangs military targets. Prison transfers of gang leaders have historically led to violence, with hundreds of inmates killed in recent years.  Gang wars over lucrative cocaine smuggling routes have also fueled the instability. Peru declared an emergency along its border with Ecuador, while other alarmed South American nations Brazil, Colombia and Chile all expressed support for Noboa's government.  China, a major investor in Ecuador, closed its embassy and consulates until further notice. LIVE INVASION The takeover of TC's studio in Guayaquil was broadcast for about 20 minutes, to the astonishment of viewers. Men wearing balaclavas and mostly dressed in black wielded guns and accosted staffers huddling on the floor. Gunshots and yelling were heard, before later police commandoes arrived to rescue the terrified media employees.  \"They (the attackers) shot one of our cameramen in the leg, broke the arm of another one,\" added the broadcaster's Rendon. \"The police came in minutes, surrounded the TV station and the tactical units intervened.\" TC, which broadcasts nationally, shares a site with another public broadcaster, Gamavision, and several radio stations. The attackers entered through Gamavision's reception, assaulting staff there and leaving dynamite behind, TC news coordinator and reporter Leonardo Flores Moreno told Reuters, saying he and others in a meeting were able to hide. Police said they confiscated explosives and guns, and showed images of young men kneeling with their hands zip-tied. The channel was back on-air for its evening news broadcast, with anchors saying the attorney general's office was on site collecting evidence.  In the southern city of Machala, Quito and Los Rios province seven police officers were kidnapped in three incidents, police said earlier. The three officers taken in Machala were freed late on Tuesday, the police said, and ten arrests were made. The police confirmed explosions in Esmeraldas and Los Rios, while mayor's offices in Cuenca and Quito confirmed others, and the attorney general's office said it was investigating one in Guayaquil. Media also reported explosions in Loja and Machala. PRISON GUARDS CAPTURED Prisons agency SNAI said earlier on Tuesday a group of prisoners escaped from a penitentiary in Riobamba, including accused gang member Fabricio Colon Pico, who was suspected of a plot against the attorney general. Seventeen of the 39 escapees have been recaptured, the prosecutor's office said. Eleven prison guards taken hostage over the past two days have been released, SNAI added, but 139 guards and other staff are still being held.  Authorities in Guayaquil said there were \"takeover\" incidents at five hospitals, but that police and soldiers had restored order. It was unclear what the incidents entailed. Video footage on social media showed armed men on the streets, traffic at a standstill, and businesses and offices closed in major Ecuadorean cities. Some Ecuadoreans are questioning Noboa's efforts to control violence, which stymied his predecessor. He plans a plebiscite this year focused on security. Violent deaths rose to 8,008 in 2023, nearly double the 2022 figure. \"The previous government declared (a state of emergency) almost 22 times without any result. They (government) have to take more drastic measures and use the police and the armed forces to put some order in the country,\" said Quito resident Marcelo Gordillo. Ecuadorean sovereign bonds fell on the instability.  \nThe 2035 paper fell 1.125 cents to 36.25 cents on the dollar, while the 2030 dropped 1 cent to 48.25 and the 2040 lost half a cent to trade at 32.5 cents according to LSEG data. Spreads widened 83 basis points to 2,039 bps in JPMorgan's EMBIG index, reversing all the gains of the year."
}