{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK020NY_L.jpg",
  "title": "US, Europe embark on new diplomatic push to quell Gaza war",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 03, 2024 05:09PM ET",
    "Updated Jan 06, 2024 01:42AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/hezbollah-israel-appear-to-signal-no-desire-for-spread-of-gaza-war-3266703",
  "paragraph": "By Nidal al-Mughrabi and Arafat Barbakh CAIRO/GAZA/JERUSALEM (Reuters) -U.S. Secretary of State Antony Blinken and Europe's senior diplomat Josep Borrell began a new diplomatic push on Friday to stop spillover from the Gaza war into Israeli-occupied West Bank, Lebanon and Red Sea shipping lanes. Their Middle East visits came three months since Hamas militants from Gaza attacked Israel, triggering an offensive that has devastated the enclave, uprooted 90% of its population, and killed 22,600 people, according to Palestinian officials.  Israel, which says it has killed 8,000 militants since the deaths of 1,200 people in the Oct. 7 Hamas attack, has announced a more targeted approach under global pressure to limit civilian casualties. But Gazans said Israeli planes and tanks had intensified attacks overnight on densely populated Al-Maghazi, Al-Bureij and Al-Nusseirat in the centre of the coastal strip. Some 162 people were killed in the past 24 hours, Palestinian officials said earlier. In addition to these, Palestinian officials later said that in the south, where hundreds of thousands of Gazans have moved in response to Israeli warnings, at least 22 people were killed by Israeli strikes on Khan Younis. One Palestinian health official said these included at least 10 people killed and several wounded by an Israeli air strike on a house belonging to Al-Bayouk family. Four others were killed in an air strike on a street in Al-Nusseirat, Palestinian officials said, while another three died and seven were injured in Israeli shelling on a house in central Gaza's Deir Al-Balah, the Palestinian Red Crescent said. Separately, medics reported that two more people were killed and others injured in the same central Gaza town after what residents described as fresh Israeli air strikes after dark. \"The Israeli government claims democracy and humanity, but is inhumane,\" Abdel Razek Abu Sinjar said as he cried over the shrouded bodies of his wife and children killed in a strike on his house in Rafah on the border with Egypt. In Jabalia in northern Gaza, people picked their way through ruined streets filled with sewage and garbage, video showed. Hunger and deadly diseases are spreading. WEST BANK DEATHS MOUNT TOO The military said it had struck more than 100 targets in Gaza in the past 24 hours, killing gunmen who tried to attack a tank in Al-Bureij and others in Khan Younis, where Hamas' military wing said it had killed some troops. The war in Hamas-run Gaza has stoked violence in the West Bank, which is governed by its rival Fatah and is another territory where Palestinian hopes for statehood have been dashed since the last U.S.-mediated talks on a solution to the decades-long conflict in 2014. The Palestinian health ministry said a 17-year-old was killed and four other Palestinians wounded by Israeli army gunfire in the West Bank town of Beit Rima. Israel's military said troops shot at Palestinians who threw petrol bombs. Some 300 Palestinians have died there since the war erupted, the United Nations says. Blinken is due to visit the West Bank during a week-long tour starting on Friday in Turkey, which has offered to mediate. He will also visit Israel, Jordan, Qatar, the United Arab Emirates, Saudi Arabia and Egypt. \"It is in no one's interest, not Israel's, not the region's, not the world's, for this conflict to spread beyond Gaza,\" State Department spokesperson Matthew Miller said.  Borrell, the EU foreign policy chief, was due in Lebanon. IRANIAN BACKING Hamas, which is sworn to Israel's destruction, is backed by Iran. Other Iranian-backed militants have hit U.S. forces in Iraq and Syria and struck Israel from Lebanon in what they call revenge for Israel's avowed attempt to eliminate the Palestinian Islamist movement. The U.S. offered up to $10 million for information on Hamas sponsors or anything leading to the disruption of the group's financial mechanisms.  Hamas chief Ismail Haniyeh said the U.S. should focus on ending aggression towards Palestinians and occupation of their land. \"We hope that Mr. Blinken learned lessons from the past three months and realized the extent of the mistakes the U.S. has made by blindly supporting the Zionist occupation and believing its lies, which resulted in unprecedented massacres and war crimes against our people in Gaza,\" he said in a speech. The leader of Lebanon's powerful Iran-backed Hezbollah movement, Hassan Nasrallah, said on Friday the militia had conducted around 670 military operations on the border with Israel since Oct. 8, destroying many Israeli military vehicles. The Iran-aligned Houthis who control much of Yemen have fired on commercial vessels in the Red Sea since Nov. 19, forcing them to take longer routes in a blow to global trade. Israel has listed 175 soldiers as killed in action since its offensive began. Defence Minister Yoav Gallant has said the next phase would include raids in the north to demolish tunnels and a focus in the south on rescuing some 132 Israeli hostages remaining. A 25th hostage had been declared dead, a government spokesperson said on Friday. \nThe World Health Organization said hospitals and other medical infrastructure in Gaza have been attacked nearly 600 times since the conflict erupted. Some 613 people have died within facilities and more than 770 wounded, it said. France and Jordan air-dropped seven tonnes of aid for a field hospital in Khan Younis."
}