{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK03032_L.jpg",
  "title": "South Korean opposition leader leaves ICU after knife attack - surgeon",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 03, 2024 10:48PM ET",
    "Updated Jan 04, 2024 03:26AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/south-korea-opposition-leader-leaves-icu-after-knife-attack--surgeon-3266788",
  "paragraph": "3/3\n© Reuters. South Korea's opposition Democratic Party leader Lee Jae-myung arrives on a stretcher at Seoul National University hospital after being stabbed in the neck by an unidentified man during his visit to Busan, in Seoul, South Korea, January 2, 2024. Yonhap/v\n2/3\nBy Jack Kim SEOUL (Reuters) -South Korea's opposition Democratic Party leader Lee Jae-myung was out of intensive care and recovering from surgery to repair a major vein that was sliced in a knife attack two days ago, a surgeon who operated on him said on Thursday. Lee requires continued observation as the injury to the jugular vein was tricky to repair and post-surgery complications could not be ruled out, Professor Min Seung-kee told a news briefing. \"(Lee) is fortunately recovering well,\" said Min from Seoul National University Hospital's vascular surgery unit. Lee was attacked in Busan by a man in his 60s who was disguised as a supporter and approached him at an outdoor public event, stabbing him in the neck with a camping knife. The assailant was quickly subdued and taken into police custody. The attack shocked the country and was condemned by Lee's party and its rivals alike. It renewed questions about the safety of high-profile politicians considering the country's history of political violence despite strict gun controls. The tough talking former progressive lawyer leads the liberal opposition party that seeks to retain its parliamentary majority against President Yoon Suk Yeol's conservatives at an election in April.  \nThe suspect, who reportedly has a history of extreme political views, is being investigated on a charge of attempted murder. The Busan District Court issued a warrant for his formal arrest, citing the gravity of the charge against him and the possibility of flight, a court judge said by telephone."
}