{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0B0D1_L.jpg",
  "title": "Moscow calls U.S. plan to confiscate Russian assets '21st century piracy'",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 12, 2024 05:52AM ET",
  "comments": [
    2,
    [
      [
        "Ken Roth",
        "2024-01-12 20:25:46",
        "Russia will never one cent of that money will go straight to ukraine for weapons, humantarian aid and for rebuilding the country when russia is kicked out",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Brad Albright",
        "2024-01-12 18:08:40",
        "\"would violate international law\"? Tell us more about violating international law, barbarians.",
        "https://www.investing.com/members/236251128"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/moscow-calls-us-plan-to-confiscate-russian-assets-21st-century-piracy-3273313",
  "paragraph": "© Reuters. FILE PHOTO: Russian Foreign Ministry spokeswoman Maria Zakharova speaks during a news conference in Moscow, Russia, April 4, 2023. REUTERS/Maxim Shemetov/File Photo\nMOSCOW (Reuters) - The Russian Foreign Ministry on Friday called a U.S. plan to confiscate up to $300 billion in frozen Russian assets to help rebuild Ukraine \"21st century piracy\" and said Moscow would retaliate harshly if it happened.  Foreign Ministry spokeswoman Maria Zakharova accused the United States of trying to create \"legal cover\" in order to steal Russia's sovereign assets, a move Moscow has repeatedly warned would violate international law and undermine the global financial system.  \"Theft of state, private and public property has become a trademark of the Anglo-Saxons,\" Zakharova told a news briefing. \"Washington (and) London have been doing it for decades. Before that it was called piracy, but then it was legalised. Now it is the piracy of the 21st century in my opinion.\" A Bloomberg report published on Wednesday said that U.S. President Joe Biden's administration was backing legislation that would allow it to seize some frozen Russian assets in order to help rebuild Ukraine, parts of which lie in ruins after Moscow sent its army into its neighbour in February 2022. Zakharova, who accused Washington of trying to strong-arm the European union into signing up to the same asset confiscation plan, said Moscow would respond harshly if its assets were stolen. \"Retaliatory measures will be taken and they will be such that they will be seen and felt. They will be painful,\" she said.  After President Vladimir Putin launched what he calls a \"special military operation\" in Ukraine, the United States and its allies prohibited transactions with Russia's central bank and finance ministry, blocking around $300 billion of sovereign Russian assets in the West, much of it in Europe. Zakharova said the West was now scrabbling to find new ways to fund Ukraine because of growing difficulties in securing financial support for Kyiv.  The White House said on Thursday that U.S. assistance for Ukraine had \"ground to a halt\" as negotiations continued in Washington over an aid package that could be tied to an overhaul of border security measures. \nThe Kremlin has previously said that Moscow has a list of U.S., European and other assets that Russia will seize if Western countries confiscate Russian assets. Leaders of the Group of Seven major industrialised nations are expected to discuss next month a new legal theory that would enable the seizure of Russian assets, two sources familiar with the plans and a British official said late last year."
}