{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0F0VI_L.jpg",
  "title": "Qatar, France broker deal to get aid, medication to civilians, hostages in Gaza",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 16, 2024 03:45PM ET",
    "Updated Jan 16, 2024 04:45PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/qatar-france-broker-deal-to-get-aid-medication-to-civilians-hostages-in-gaza-3275603",
  "paragraph": "© Reuters. A view of tent camps, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, in Rafah in the southern Gaza Strip, January 16, 2024. REUTERS/Mohammed Salem\nPARIS (Reuters) -Qatar and France have brokered a deal with Israel and Palestinian Islamist group Hamas to deliver urgent medication to some 45 Israeli hostages held by the group in Gaza in return for humanitarian and medical aid for the most vulnerable civilians. The two countries said the aid would leave Qatar for Egypt on Wednesday before being taken across the Rafah border crossing. Qatari foreign ministry spokesperson Majed al-Ansari said in a statement the deal would mean \"medicine along with other humanitarian aid is to be delivered to civilians in the Gaza Strip, in the most affected and vulnerable areas, in exchange for delivering medication needed for Israeli captives in Gaza.\" He did not give details on how much aid or what aid would be delivered to civilians. The office of Israeli Prime Minister Benjamin Netanyahu said two Qatari Air Force planes were to land on Wednesday in Egypt with medicines purchased in France based on an Israeli list. Earlier, Philippe Lalliot, head of France's foreign ministry crisis centre which organises aid efforts, said negotiations had been going on for weeks and the initial idea had come from the families of some of the Israeli hostages. \nSpecific medical packages for several months, which were put together in France, would be delivered to each of the 45 hostages. The International Committee of the Red Cross will coordinate on the ground. France still has three nationals held in Gaza, but none of them are in urgent need of medication, Lalliot said."
}