{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0P0M0_L.jpg",
  "title": "Palestinians see World Court ruling as both win and setback",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 26, 2024 11:42AM ET",
    "Updated Jan 26, 2024 04:13PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/palestinians-see-world-court-ruling-as-both-win-and-setback-3284440",
  "paragraph": "5/5\n© Reuters. People comfort each other during a pro-Palestinian demonstration outside the International Court of Justice (ICJ) as judges rule on emergency measures against Israel following accusations by South Africa that the Israeli military operation in Gaza is a st\n2/5\nBy Ali Sawafta, Nidal al-Mughrabi and Emily Rose RAMALLAH/DOHA/JERUSALEM (Reuters) - Palestinians said the World Court let them down by failing to order a halt to the Israeli military offensive in Gaza, but they also described the proceedings as a victory which had inspired hope of accountability. The International Court of Justice (ICJ) ordered Israel to prevent any acts of genocide against the Palestinians and do more to help suffering civilians. However, it stopped short of ordering a ceasefire as requested by South Africa, which brought the case. Friday's proceedings were broadcast live across the Arab world and in Israel, which rejects South Africa's claims that it has committed genocide. At a shelter for people displaced by Israeli bombardment in southern Gaza, people gathered around a radio to follow the news. \"We, the displaced, the bereaved families and those who lost their homes, had an ambition the court would call for an immediate ceasefire,\" said Mustafa Ibrahim, a human rights activist. \"Despite that, what happened was a victory,\" added Ibrahim, a resident of Gaza City who now lives in a shelter with his family of seven in Rafah in the south of the enclave. South Africa asked the ICJ to grant emergency measures to halt the fighting. More than 26,000 Palestinians have been killed in the Israeli offensive, according to authorities in Hamas-run Gaza. Israel mounted the offensive in response to cross-border attacks by Hamas on Oct. 7 in which 1,200 people were killed and around 250 abducted, according to Israeli figures. The assault has laid waste to much of the Gaza Strip and uprooted most of its 2.3 million residents. BADMOUTHS Israeli Prime Minister Benjamin Netanyahu welcomed the ICJ's decision not to order a ceasefire but rejected the claim of genocide as \"outrageous\" and said Israel would continue to defend itself. Israel says it makes the utmost efforts to avoid civilian casualties. Reflecting criticism of Israel voiced in the court's ruling, a headline in Israel's Jerusalem Post read: \"ICJ badmouths Israel for 35 minutes, then Israel wins\". Jonathan Dekel-Chen, whose son is being held hostage in Gaza, said he was encouraged by the ICJ's call for the release of the captives. \"This point reflects the fact, greatly ignored by the ICJ’s ruling, that the current war occurred because of Hamas’ mass murder and hostage-taking of Israeli civilians on October 7,\" he said.  While the ruling dashed Palestinian hopes of a binding order to halt the war, it also represented a legal setback for Israel, which had hoped to throw out a case brought under the genocide convention established after the Holocaust. Prime Minister Mohammad Shtayyeh of the West Bank-based Palestinian Authority said Palestinians had hoped the ruling would include an immediate ceasefire. But the decision \"confirms the end of Israel's time with impunity and puts it in the dock as a war criminal\", he said. The court did not rule at this stage on the core of the case brought by South Africa - whether genocide has occurred in Gaza.  'THANK YOU SOUTH AFRICA' In the Israeli-occupied West Bank, Palestinians watched on a big screen at government offices in Ramallah. One held a banner saying \"Thank You South Africa\". Senior Hamas official Sami Abu Zuhri said the ruling was an important development that contributed to isolating Israel and exposing what it described as its crimes in Gaza.  The court found that Palestinians were protected under the convention and there was a case to be heard about whether their rights were being denied in a war that it said was causing grievous humanitarian harm. Palestinian politician Mustafa Barghouti said the ICJ's acceptance of the case \"means putting Israel on trial for its crimes for the first time\".  Israeli Defence Minister Yoav Gallant said Israel did not need to be lectured on morality.  \nIsraeli Josh Mover said his country was being subjected to \"double standards\". \"Countries that are notorious for human rights violations seem to get by without the same scrutiny,\" he said."
}