{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "US plans more strikes in Middle East against Iran-backed groups",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Feb 04, 2024 10:04AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-plans-more-strikes-in-middle-east-against-iranbacked-groups-3292048",
  "paragraph": "WASHINGTON (Reuters) - The United States plans to undertake further strikes after the killing of three U.S. troops by Iranian-backed militias last weekend, White House National Security Adviser Jake Sullivan said on Sunday. \"We intend to take additional strikes, and additional action, to continue to send a clear message that the United States will respond when our forces are attacked, when our people are killed,\" he told NBC’s \"Meet the Press\" program. The United States and Britain launched strikes against 36 Houthi targets in Yemen on Saturday, in the second day of major U.S. operations against Iran-linked groups following a deadly attack that killed three American troops in Jordan last weekend. Saturday's strikes targeted 13 sites in Yemen the Houthis have used to attack Red Sea shipping, the Pentagon said, one day after the U.S. carried out a first wave of retaliatory strikes on more than 85 targets in Iraq and Syria linked to Iran's Islamic Revolutionary Guard Corps and militias it backs. They are the latest blows in a conflict that has spread into the Middle East since Oct. 7, when the Palestinian militant group Hamas stormed Israel from the Gaza Strip, igniting a war that has drawn Tehran-backed groups into attacks on U.S. and Israeli targets on several fronts. \"What happened on Friday was the beginning, not the end, of our response, and there will be more steps - some seen, some perhaps unseen,\" Sullivan told CBS' \"Face the Nation\" program. \"I would not describe it as some open-ended military campaign.\""
}