{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0A08K_L.jpg",
  "title": "Ukraine builds barricades, digs trenches as focus shifts to defence",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 11, 2024 02:04AM ET",
    "Updated Jan 11, 2024 11:27AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/ukraine-builds-barricades-digs-trenches-as-focus-shifts-to-defence-3272002",
  "paragraph": "3/3\n© Reuters. Ukrainian military engineer with the call sign \"Lynx\" inspects a freshly dug trench that his unit built as part of a system of new fortifications near the front lines outside Kupiansk, amid Russia’s attack on Ukraine, December 28, 2023. REUTERS/Thomas \n2/3\nBy Vitalii Hnidyi and Thomas Peter NEAR KUPIANSK, Ukraine (Reuters) -Rows of white concrete barricades and coils of razor wire stretch across an open field for more than a kilometre. Trenches with rudimentary living quarters are being dug under cover of darkness. Artillery rumbles not far away. New defensive lines visited by Reuters near the northeastern city of Kupiansk on Dec. 28 show how Ukraine has stepped up construction of fortifications in recent months as it shifts its military operations against Russia to a more defensive footing. The defences, which bear some similarities to those rolled out in the Russian-occupied south and east, aim to help Ukraine weather assaults while regenerating its forces as Moscow takes the battlefield initiative, military analysts said. \"As soon as the troops are moving, traversing fields, you can do without fortifications. But when the troops stop, you need to immediately dig into the ground,\" a Ukrainian army engineer with the call sign Lynx told Reuters near Kupiansk. President Volodymyr Zelenskiy announced that Ukraine was \"significantly enhancing\" fortifications on Nov. 28 after a counteroffensive that it launched in June was unable to rapidly punch through Russian lines. Kyiv says it is unswayed in its ambition to retake all remaining occupied territory, but for now is focused on politically sensitive conscription reforms to replenish manpower and on addressing artillery shortages at the front. Russia has been ramping up offensive pressure around eastern towns such as Kupiansk, Lyman and Avdiivka, and no longer needs to hold back its reserve troops for fear of a possible Ukrainian breakthrough, the military analysts said. Zelenskiy said Ukraine's defensive constructions needed to be boosted and work on them accelerated around the three towns, in eastern parts of the Donetsk region, and in the regions of Kharkiv, Sumy, Chernihiv, Kyiv, Rivne and Volyn.  Those regions stretch all the way up from Ukraine's east, along the border with Russia and Belarus, to its western ally Poland. Zelenskiy said the southern Kherson region, a swathe of which is still occupied, would also be reinforced. DEFENSIVE POSTURE There is no publicly available data for the intensity or scale of the fortification construction. Ukraine has had defensive lines in some areas of the eastern Donbas region since 2014, when Russia backed militants who seized territory. It has been heavily dug in at places such as Avdiivka throughout the full-scale invasion. Stronger fortifications would slow down Russian troops and suck fewer Ukrainian forces into defence, freeing them up from the front so they could, for instance, receive more training, said Jack Watling, senior research fellow for land warfare at the Royal United Services Institute. \"The Ukrainians are now shifting onto a defensive posture because their offensive has culminated,\" he said in a telephone interview, adding that Russia had retaken the initiative on the battlefield and was able to choose where to attack. With Ukrainian artillery ammunition stocks declining, the rate of Russian casualties was falling, making it easier for Moscow to generate new units, which in time could allow them to open up new lines of attack, he added. \"On the Ukrainian side, they are trying to minimise their own casualties, but also regenerate offensive combat power,\" said Watling.  He said fortifications could also be used to defend Ukraine's flanks when it goes back on the offensive. DRAGON'S TEETH On Wednesday, Reuters reporters visited trenches being dug with an excavator and shovels at an undisclosed location in the Chernihiv region near the Russian border. \"When the civilians have done their job (building the positions), we will densely mine it,\" Serhiy Nayev, Ukraine's joint forces commander who oversees the northern military sector, told reporters at the site. The military has expanded its defensive fortifications in the north by 63% in the last few months, Ukraine's joint forces quoted Nayev as saying on Thursday.  Last month, Reuters reporters visited newly built Ukrainian trenches in Chornobyl near the border with Belarus, a Russian ally used by Moscow as a staging ground for the February 2022 invasion. A large military engineering vehicle churned through the snowy ground as it carved out a wide anti-tank ditch. \"(The works are ongoing) along the whole Northern Operational Zone. These works are currently underway in Sumy region, Chernihiv region, here in the Kyiv direction,\" Nayev said at the site. \"Concrete structures, barbed wire, ... 'dragon's teeth' (concrete barricades)...; they will be mined and barbed wire will be put on them. This will be a continuous concrete obstacle for armoured vehicles,\" he said.  Near Kupiansk, Ukraine's military showed Reuters reporters newly built defensive lines, but said the exact location could not be disclosed publicly for security reasons. A military engineer using the call sign \"Lizard\" said they typically put down the \"dragon's teeth\" first, followed by coils of razor wire and then mines, if they use them. \"I believe most of these barriers should have been built much earlier, probably in the spring. It takes too much time,\" he said. Several hundred metres behind the \"dragon's teeth\", work was underway to expand a network of personnel trenches reinforced with wooden beams where there were also living quarters and wooden bunk beds. \nLynx, the other serviceman, said Ukraine was trying to minimise the use of mines for its fortifications to avoid leaving dangerous munitions on its territory. \"This is our land. We wouldn't want to litter it so much,\" he said."
}