{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0P01D_L.jpg",
  "title": "US, South Africa discuss Gaza war ahead of ruling on measures in genocide case",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 25, 2024 08:42PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-south-africa-discuss-gaza-war-ahead-of-ruling-on-measures-in-genocide-case-3283631",
  "paragraph": "© Reuters. Israeli soldiers fire a mortar, as the conflict continues between Israel and the Palestinian Islamist group Hamas, on the border with the central Gaza, Israel January 22, 2024. REUTERS/Amir Cohen \nBy Kanishka Singh WASHINGTON (Reuters) - U.S. Secretary of State Antony Blinken spoke on Thursday with South African Foreign Minister Naledi Pandor about the war in Gaza, a day ahead of a ruling at the World Court on urgent measures in a case in which Israel is accused of genocide. WHY IT IS IMPORTANT U.N. judges on Friday will rule on South Africa's request for emergency measures against Israel, which is accused at the International Court of Justice of state-led genocide for its military operation in Gaza. Friday's ruling will not deal with the core accusation of the case - whether genocide occurred - but will focus on the urgent intervention sought by South Africa. KEY QUOTES In a call on Thursday, Blinken reaffirmed U.S. support \"for Israel's right to ensure the terrorist attacks of October 7 can never be repeated,\" the U.S. State Department said in a statement. Blinken and Pandor also discussed the need to protect civilian lives in Gaza, and ensure regional peace that \"advances the establishment of an independent Palestinian state,\" according to the State Department. It added the two also reaffirmed U.S.-South Africa bilateral ties. CONTEXT South Africa has requested an immediate halt to Israel's military operation, which has laid waste to much of the enclave and killed more than 25,000 people or over 1% of Gaza's 2.3 million population, according to the local health authorities. \nIsrael rejects the accusations from South Africa and says it has a right to defend itself following the Oct. 7 attack on Israel by Palestinian Islamist group Hamas, which governs Gaza. Israeli officials say that in that attack 1,200 people were killed and 240 taken hostage. South Africa has asked for nine emergency measures, which act like a restraining order while the court hears the case in full, which could take years. The court is not bound to follow South Africa's requests and could order its own measures if it finds it has jurisdiction at this stage of the case."
}