{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0H03K_L.jpg",
  "title": "Organized crime prosecutor in Ecuador's Guayas killed-AG's office",
  "category": "Economy",
  "publisher": "Reuters",
  "date": [
    "Published Jan 17, 2024 10:48PM ET",
    "Updated Jan 18, 2024 02:16AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/economy/organized-crime-prosecutor-in-ecuadors-guayas-killedags-office-3276832",
  "paragraph": "3/3\n© Reuters. A police barricade tape is seen at a cordoned-off area where Ecuadorean prosecutor Cesar Suarez, who focused on cases involving organized trans-national crime in Guayas province, was killed, in Guayaquil, Ecuador, January 17, 2024. REUTERS/Vicente Gaibor \n2/3\nQUITO (Reuters) - Ecuadorean prosecutor Cesar Suarez, who focused on pursuing organized trans-national crime in Guayas province, one of the country's most violent areas and the site of an on-air attack on a television station last week, has been killed, the attorney general said on Wednesday. Suarez, who had been placed in charge of investigating the television station attack, was traveling to a court hearing when he was killed, the council of the judiciary said in a statement condemning the attack. The killing had the hallmarks of an assassination, police said in a statement, adding that the victim sustained a number of gunshot wounds. Ecuador has suffered a recent burst of violence, including the gunmen interrupting the broadcast at TC Television in Guayaquil, the hostage-taking of more than 200 prison staff, explosions in several cities and the kidnapping of police officers.  In response President Daniel Noboa declared a 60-day state of emergency, including a nighttime curfew, and designated 22 criminal groups as terrorist organizations. \"The criminals, the terrorists, will not hold back our commitment to Ecuadorean society,\" attorney general Diana Salazar said in a video posted to social media. \"We call on the forces of order to guarantee the security of those who are carrying out their duties.\" Suarez was investigating the attack against TC Television. Police have arrested 13 people, including two minors, who are detained for suspected terrorism crimes. \n\"We reject all forms of violence as a response to the conflict we are experiencing and we ratify the strong commitment of the national government to supporting justice,\" Defense Minister Gian Carlo Loffredo said in a message to journalists. Salazar's office has launched an investigation into Suarez's killing."
}