{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0J042_L.jpg",
  "title": "Four astronauts, including Turkey's first, arrive at space station",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 20, 2024 08:27AM ET",
    "Updated Jan 20, 2024 04:43PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/four-astronauts-including-turkeys-first-arrive-at-space-station-3278827",
  "paragraph": "3/3\n© Reuters. FILE PHOTO: The Axiom Mission 3 launches to the International Space Station with crew members Commander Michael Lopez-Alegria of the U.S./Spain, Pilot Walter Villadei of Italy, Mission Specialist Alper Gezeravcı of Turkey, and ESA (European Space Agency)\n2/3\nBy Steve Gorman (Reuters) - A four-man crew including Turkey's first astronaut arrived at the International Space Station (ISS) early on Saturday for a two-week stay in the latest such mission arranged entirely at commercial expense by Texas-based startup company Axiom Space. The rendezvous came about 37 hours after the Axiom quartet's Thursday evening liftoff in a rocketship from NASA's Kennedy Space Center in Cape Canaveral, Florida. Both the Crew Dragon vessel and the Falcon 9 rocket that carried it to orbit were supplied, launched and operated by Elon Musk's SpaceX under contract with Axiom, as they were in the first two Axiom missions to the ISS since 2022. Once the astronauts reach the space station, they fall under the responsibility of NASA's mission control operation in Houston. The Crew Dragon autonomously docked with the ISS at 5:42 a.m. EDT (1042 GMT) as the two space vehicles were flying roughly 250 miles (400 km) over the South Pacific, a live NASA webcast showed. Both were soaring in tandem around the globe at the hypersonic speed of about 17,500 miles per hour (28,200 km/h) as they joined together in orbit. With coupling achieved, it was expected to take about two hours for the sealed passageway between the space station and crew capsule to be pressurized and checked for leaks before hatches can be opened, allowing the newly arrived astronauts to move aboard the orbiting laboratory. Plans call for the Axiom-3 crew to spend roughly 14 days in microgravity conducting more than 30 scientific experiments, many of them focused on the effects of spaceflight on human health and disease.  The multinational team was led by Michael López-Alegría, 65, a Spanish-born retired NASA astronaut and Axiom executive making his sixth flight to the space station. He also commanded Axiom's debut mission - the first all-private voyage to the ISS - in April 2022. His second-in-command for Ax-3 is Italian Air Force Colonel Walter Villadei, 49. Rounding out the team are Swedish aviator Marcus Wandt, 43, representing the European Space Agency, and Alper Gezeravcı, 44, a Turkish Air Force veteran and fighter pilot, making his nation's first human spaceflight. They will be welcomed aboard ISS by the seven members of the station's current regular crew - two Americans from NASA, one astronaut each from Japan and Denmark and three Russian cosmonauts. Since its founding eight years ago, Houston-based Axiom has carved out a business catering to foreign governments and wealthy private patrons aiming to put their own astronauts into orbit. The company charges at least $55 million per seat for its services organizing, training and equipping customers for spaceflight. \nAxiom also is one of a handful of companies building a commercial space station of its own intended to eventually replace the ISS, which NASA expects to retire around 2030.  Launched to orbit in 1998, the ISS has been continuously occupied since 2000 under a U.S.-Russian-led partnership that includes Canada, Japan and 11 countries belonging to the European Space Agency."
}