{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "Colombia, Ecuador bust drug ring exporting five tons of cocaine a month",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 07, 2024 04:06PM ET",
  "comments": [
    1,
    [
      [
        "Barry Nickerson",
        "2024-01-07 22:10:41",
        "That is one heck of a lot of cocoa plants!  And nobody see these bushes  / trees growing?",
        "https://www.investing.com/members/249373719"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/colombia-ecuador-bust-drug-ring-exporting-five-tons-of-cocaine-a-month-3268714",
  "paragraph": "By Luis Jaime Acosta BOGOTA (Reuters) - Colombia and Ecuador broke up a criminal organization responsible for sending up to five tons of cocaine per month to the U.S. and Europe and captured the Colombian brothers in charge, the two countries said on Sunday. Colombian police said the Los Curva criminal organization generated more than $2 billion a year in profits from the trade.  A year-long police operation culminated on Saturday with the capture of Colombian brothers Hader and Dairon Cuero, leaders of Los Curva, the countries said. Hader Cuero is wanted by the United States on drug trafficking charges.  Colombia is considered the world's leading producer of cocaine, an illegal business that finances leftist guerrilla groups and criminal gangs. \"This operation stops the shipment of five tons of cocaine per month,\" said the deputy director of the Colombian National Police, General Nicolas Zapata, at a joint press conference streamed online on Sunday. The national director of anti-drug investigations of the Ecuadorean police, General William Villarroel, added that the organization used speed boats and Mexico-flagged vessels to transport the drugs to Mexico on maritime routes. Los Curva worked with Mexico's Sinaloa cartel and cartels in Europe's Balkan region, the police said. Last year, six Colombians and 22 Ecuadoreans were captured as part of the police operation."
}