{
  "image": "https://i-invdn-com.investing.com/news/LYNXMPEDAF0IH_L.jpg",
  "title": "Earnings call: TotalEnergies reports strong 2023 results and optimistic outlook",
  "category": "Stock market news",
  "publisher": "Investing.com",
  "date": [
    "Published Feb 08, 2024 08:38AM ET",
    "Updated Feb 08, 2024 08:38AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/stock-market-news/earnings-call-totalenergies-reports-strong-2023-results-and-optimistic-outlook-93CH-3297482",
  "paragraph": "In an earnings call, TotalEnergies (EPA:TTEF) (ticker: TTE) showcased robust financial and operational performance for 2023, with significant milestones in safety, profitability, and sustainability. The company reported a tragic incident at the Silane refinery but highlighted overall safety improvements, including a reduction in primary losses of containment by 50% over the past five years. Financially, TotalEnergies achieved an adjusted net income of over $23 billion and generated a cash flow of $36 billion. The energy giant emphasized its balanced energy transition strategy, focusing on oil, gas, and renewables, and outlined ambitious plans for growth in LNG and integrated power sectors. CEO Patrick Pouyanné also addressed various strategic initiatives, including the company's LNG trading success and the cautious approach to electric vehicle uptake in the U.S.Key TakeawaysTotalEnergies reported an adjusted net income of over $23 billion and an IFRS net income of over $21 billion.The company achieved a 19% return on capital employed and a 20% return on equity.Cash flow reached $36 billion, fueling capital investment, shareholder return, and deleveraging.Safety performance improved, with a total recordable injury rate well below 1.Upstream production increased by 2%, with LNG production growing by 9%.Significant growth in renewable capacity, with an increase of almost 6 gigawatts.Methane emissions were reduced by 47% compared to the previous year.TotalEnergies maintained its position as the most profitable supermajor, with an operating income of 19%.Dividend set to increase by 7% and a $2 billion buyback plan for the next quarter.Company OutlookTotalEnergies plans to grow oil and gas production by 2-3% per year, mainly from LNG.The company aims to be net cash flow positive by 2028 with a 12% return on capital employed.A project cash flow of $34 billion is projected with Brent at $80, and net investments of $17-18 billion are planned.TotalEnergies intends to increase renewable energy capacity, expand LNG sales, and reduce carbon intensity in sales.Bearish HighlightsThe downstream market is expected to soften in 2024, impacting refining and petrochemicals.The company noted the volatility in the industry due to the increasing addition of renewable energy sources.Bullish HighlightsThe integrated LNG and integrated power segments generated almost $10 billion in cash flow.TotalEnergies is actively working on major projects in Brazil, the U.S., and Uganda and exploring in Namibia.The company is developing renewable and flexible generation assets in Texas to meet growing demand.MissesThe tragic incident at the Silane refinery resulted in a contractor's death and suspension of similar operations worldwide.Q&A HighlightsCEO Patrick Pouyanné expressed satisfaction with the company's LNG trading performance, despite some peers achieving better results in the last quarter.Pouyanné discussed the company's cautious EV strategy in the U.S. and emphasized the importance of government incentives.TotalEnergies is comfortable with a gearing level of 5% but could go down to zero if necessary.The company is managing cost inflation and prioritizes value over volume in their investments.TotalEnergies' earnings call revealed a company navigating the complexities of the energy market with a keen eye on safety, profitability, and the transition to cleaner energy sources. The company's financial strength and strategic initiatives paint a picture of resilience and growth amidst market uncertainties. CEO Patrick Pouyanné's leadership and the company's focus on value creation and sustainability are set to steer TotalEnergies towards a promising future in the evolving energy landscape."
}