{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0F0FX_L.jpg",
  "title": "First U.S. nitrogen-gas execution may constitute torture - UN rights office",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 16, 2024 06:43AM ET",
    "Updated Jan 16, 2024 09:46PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/first-us-nitrogengas-execution-may-constitute-torture--un-rights-office-3274851",
  "paragraph": "© Reuters. The flags alley is seen outside the United Nations building during the Human Rights Council in Geneva, Switzerland, February 27, 2023. REUTERS/Denis Balibouse/ File Photo\nGENEVA (Reuters) - The U.N. human rights office on Tuesday called on the U.S. state of Alabama to halt its first planned execution of a prisoner by nitrogen gas asphyxiation this month, saying it could amount to torture and violate U.S. commitments under international law. Kenneth Smith, convicted for a murder-for-hire committed in 1988, is scheduled to be executed in Alabama on Jan. 25 using the method, in which execution officials will bind a mask to his face connected to a cylinder of nitrogen intended to deprive him of oxygen. \"We have serious concerns that Smith's execution in these circumstances could breach the prohibition on torture or other cruel, inhuman or degrading treatment or punishment, as well as his right to effective remedies,\" Ravina Shamdasani, spokesperson for the U.N. Human Rights Office, told a press briefing in Geneva. \"These are rights that are set out in two international human rights treaties that the U.S. is bound by,\" she added. Shamdasani said Smith's appeal against his execution had not been concluded. She also voiced concern that Alabama's protocol made no provision for a sedative prior to execution - a measure which she said is a formal recommendation of the American Veterinary Medical Association for euthanising large animals. U.S. states have found it increasingly difficult to obtain barbiturates used in lethal-injection execution protocols, in part because of a European ban preventing pharmaceutical companies from selling drugs to be used in executions. As a result, some states have sought to revive older methods such as firing squads, while Alabama, Mississippi and Oklahoma have introduced new gas-based protocols. \"It is worrying that this is gaining ground as a method of execution,\" Shamdasani said. \nThe U.N. rights office has raised the issue repeatedly with U.S. federal authorities, Shamdasani said. Other U.N. experts have also sounded the alarm over the planned execution. According to Amnesty International, the United States executed 18 people in 2022."
}