{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0905H_L.jpg",
  "title": "To old friend in Iowa, Xi says world requires stability in China-US ties",
  "category": "Commodities news",
  "publisher": "Reuters",
  "date": "Published Jan 10, 2024 12:57AM ET",
  "comments": [
    1,
    [
      [
        "tolomey widdle",
        "2024-01-10 15:27:27",
        "game theory 101",
        "https://www.investing.com/members/212413843"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/commodities-news/to-old-friend-in-iowa-xi-says-world-requires-stability-in-chinaus-ties-3270873",
  "paragraph": "© Reuters. FILE PHOTO: China's Vice President Xi Jinping speaks at the home of Roger and Sarah Lande (2nd L) in Muscatine, Iowa February 15, 2012. Xi joked about receiving a gift of popcorn during his first visit to Muscatine in 1985. REUTERS/Kevin E. Schmidt/Pool \nBy Ryan Woo BEIJING (Reuters) - Chinese President Xi Jinping, in a recent reply to a letter from an Iowa native whom he first met nearly four decades ago, said the world's future demanded stability in Sino-U.S. ties, according to Chinese state media on Wednesday. Bilateral ties have sagged in recent years, slammed by a trade war and a plethora of other issues, including the origins of COVID-19. Communications between the countries have improved since Xi's talks with U.S. President Joe Biden in San Francisco in November, but both sides remain tense over democratically governed Taiwan, which China claims as its territory. The island is electing a new president on Saturday. \"China and the United States are the largest developing and developed countries in the world, and the future and destiny of this planet require Sino-U.S. relations to be more stable, to be better,\" Xi told Sarah Lande, whom he first met in May 1985.  The two became acquainted when Xi, then 31, led a delegation from China's northern Hebei province to its \"sister state\" Iowa to learn about U.S. food production. In 2012, they reunited in her hometown of Muscatine, and once more in San Francisco in November 2023, when Lande attended a dinner hosted for Xi.  In a previous letter to Lande in 2022, he told her and his \"old friends\" in Iowa to \"continue sowing the seeds of friendship and make new contributions to the friendship between the Chinese and American peoples\". Just as bilateral ties had worsened in recent years, the image of China in the United States had deteriorated.  In early 2020, a Chinese foreign ministry spokesman said on Twitter that the coronavirus might have emerged from the United States, and that it might have reached Wuhan, where the virus was first detected, via the World Military Games held there.  \nLast year, in a poll by the Pew Research Center, 83% of respondents in the United States held an unfavourable opinion of China. Asked to name the country that posed the greatest threat to the United States, Americans perceived China as both an economic and national security threat, the U.S. think tank said. Repairing its image is paramount to China, especially in the United States. Washington has levied additional tariffs on Chinese goods and imposed curbs on exports of certain technologies, such as advanced chips, to China."
}