{
  "image": "https://i-invdn-com.investing.com/news/World_News_8_800x533_L_1420026210.jpg",
  "title": "US judge allows first nitrogen-gas execution to proceed",
  "category": "General",
  "publisher": "Reuters",
  "date": [
    "Published Jan 10, 2024 04:23PM ET",
    "Updated Jan 10, 2024 09:21PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/general/us-judge-allows-first-nitrogengas-execution-to-proceed-3271833",
  "paragraph": "By Jonathan Allen (Reuters) - A federal judge ruled on Wednesday that Alabama can proceed later this month with the first execution by nitrogen gas asphyxiation, saying that the condemned prisoner was unlikely to show the new method amounts to cruel or unusual punishment. Kenneth Smith, convicted for a murder-for-hire committed in 1988, is scheduled to be executed in Alabama on Jan. 25 using the method, in which execution officials will bind a mask to his face connected to a cylinder of nitrogen intended to deprive him of oxygen. U.S. states have found it increasingly difficult to obtain barbiturates used in lethal-injection execution protocols, in part because of a European ban preventing pharmaceutical companies from selling drugs to be used in executions. As a result, some states have sought to revive older methods such as firing squads, while Alabama, Mississippi and Oklahoma have introduced new gas-based protocols. He has sued the Alabama Department of Corrections, arguing that the proposed method comes with dangerous risks, including that the mask's seal with his face might be broken allowing in oxygen, botching the execution. Such a scenario could induce a stroke or leave Smith in a permanent vegetative state, he argued. United Nations experts warned last week that what would be the first instance anywhere in the world of an execution using inert-gas asphyxiation would likely violate an international treaty against torture and other cruel, inhuman or degrading punishment.  Judge R. Austin Huffaker of the U.S. District Court in Montgomery, Alabama, ruled against Smith, who sought an injunction halting the execution to allow his litigation to proceed. \"Smith is not guaranteed a painless death,\" Huffaker wrote in his opinion, citing a U.S. Supreme Court precedent. He wrote that Smith \"has not shown the current Protocol is sure or very likely to cause substantial risk of serious harm or superadded pain.\" Smith, 58, is one of two people alive in the U.S. to have survived a judicial execution attempt: Alabama botched his previously scheduled execution by lethal injection in November 2022 when multiple attempts to insert an intravenous line failed. Robert Grass, a lawyer representing Smith, said he planned to appeal the ruling."
}