{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK090CY_L.jpg",
  "title": "Despair in Gaza as fighting intensifies despite Israel promise to scale back war",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 10, 2024 06:28AM ET",
    "Updated Jan 10, 2024 02:19PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/despair-in-gaza-as-fighting-intensifies-despite-promise-to-scale-down-war-3271239",
  "paragraph": "5/5\n© Reuters. A Palestinian man walks at the site of an Israeli strike, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, in Rafah in the southern Gaza Strip January 10, 2024. REUTERS/Ibraheem Abu Mustafa\n2/5\nBy Mohammed Salem, Simon Lewis and Nidal al-Mughrabi GAZA/MANAMA/DOHA (Reuters) -Israeli strikes in southern and central Gaza intensified on Wednesday despite a pledge by Israel that it would pull out some troops and shift to a more targeted campaign, and pleading from its ally Washington to reduce civilian casualties. In the latest sign of the three-month-old war spreading, U.S. and British warships in the Red Sea fended off the biggest attack yet from Yemen's Houthi movement, which says it is acting to support Gaza. Washington and London said they shot down 21 drones and missiles aimed at shipping lanes. No one was hurt. Israel had said this week it was planning to begin drawing down troops, at least from the northern part of Gaza, after weeks of U.S. pressure to scale down its operations and shift to what Washington says should be a more targeted campaign. But the fighting appears to be as intense as ever, especially in the southern and central areas where Israeli forces launched ground advances last month. The World Health Organization cancelled a planned medical aid mission to Gaza due to security concerns, the sixth such cancellation in two weeks. The Palestinian Red Crescent said four of its staffers were killed when their ambulance was hit by an Israeli strike on the main road near Deir al-Balah, in the central Gaza Strip. Two passengers in the ambulance were wounded and later died. Israel has killed more than 23,000 Palestinians in Gaza since launching its campaign to eradicate the Hamas militant group that runs the enclave, after Hamas fighters killed 1,200 Israelis and captured 240 hostages in a rampage on Oct. 7. Gaza's health authorities have estimated that about 40% of those killed were aged under 18. Seven-year-old Laila al-Sultan and her brother Khaled, 4, now live in a tent shanty town in southern Gaza after their family home was destroyed in an air strike that killed their father. \"The house collapsed on us and Daddy went to heaven and he is very happy,\" said Khaled, bouncing up and down on Laila's lap. HOUTHI WARNING U.S. Secretary of State Antony Blinken, on his fourth trip to the region since the war began, went to Ramallah on Wednesday and met Palestinian leaders, including Palestinian Authority (PA) President Mahmoud Abbas, in the Israeli-occupied West Bank. The PA, which exercises limited self-rule in the West Bank and accepts Israel's right to exist, lost control of Gaza in 2007 to Hamas, which is sworn to Israel's destruction. The State Department said Blinken expressed support for a Palestinian state, discussed efforts to protect and aid civilians in Gaza, and encouraged \"administrative reforms\" of the PA. The PA said Abbas told Blinken no Palestinians should be displaced from Gaza or the West Bank. Blinken has also met Israeli leaders and visited nearby Arab states in search of a future settlement for the Gaza Strip and its 2.3 million residents. Jordan and Egypt warned against any Israeli reoccupation of the Gaza Strip and appealed for uprooted residents to be allowed to return to their homes as Jordan's King Abdullah and Egyptian President Abdel Fatah al-Sisi met in Aqaba on Wednesday. Washington fears that the Gaza war could spread violence across the region, with armed groups backed by Israel's arch-enemy Iran launching solidarity attacks in Lebanon, Syria, Iraq and Yemen. The Houthis, who control most of Yemen, have been attacking one of the world's busiest shipping lanes at the mouth of the Red Sea, forcing Washington to send warships for protection. A Houthi military spokesman said the group fired a large number of missiles and drones at a U.S. ship that was providing support to Israel, calling it a \"preliminary response\" to a New Year's Eve incident, when U.S. helicopters sank three boats carrying Houthi fighters who tried to board a commercial vessel. Speaking in Bahrain on the next leg of his trip, Blinken said there would be consequences of continued attacks on commercial shipping. \"We've also repeatedly tried to make clear to Iran, as other countries have, as well, that the support that they're providing to the Houthis, including for these actions, needs to stop,\" he told reporters. NO LET-UP Despite a public assertion by Israel since the New Year that it is scaling back the war, Gaza residents say they have seen no let-up. Nearly the entire population has been driven from their homes at least once, many displaced several times as Israeli forces advance. In Rafah, on the southern edge of the enclave, relatives wept by the bodies of 15 members of the Nofal family laid out at a hospital morgue after their home was obliterated by an Israeli air strike overnight. Most of the white shrouds were tiny, with children inside. \nUm Ahmed, a mother-of-five from Gaza City now sheltering in a tent in Rafah, said Gazans had hoped Blinken's visit meant they would be allowed to return to their homes.  \"It is like words written in butter, it soon disappeared with the rise of the sun. That was the words of Blinken, fake,\" she said."
}