{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBP055_L.jpg",
  "title": "Russia's Navalny describes harsh reality at 'Polar Wolf' Arctic prison",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 26, 2023 04:44AM ET",
    "Updated Dec 26, 2023 08:50AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/russias-navalny-describes-harsh-reality-at-polar-wolf-arctic-prison-3263424",
  "paragraph": "© Reuters. FILE PHOTO: Russian opposition leader Alexei Navalny is seen on a screen via video link from the IK-2 corrective penal colony in Pokrov before a court hearing to consider an appeal against his prison sentence, in Moscow, Russia May 17, 2022. REUTERS/Evgen\nBy Andrew Osborn and Olzhas Auyezov MOSCOW (Reuters) -Jailed Russian opposition politician Alexei Navalny on Tuesday confirmed his arrival at what he described as a snow-swept prison above the Arctic Circle and said he was in excellent spirits despite a tiring 20-day journey to get there.  Navalny posted an update on X via his lawyers after his allies lost touch with him for more than two weeks while he was in transit with no information about where he was being taken, prompting expressions of concern from Western politicians. His spokeswoman said on Monday that Navalny, 47, had been tracked down to the IK-3 penal colony north of the Arctic Circle located in Kharp in the Yamal-Nenets region about 1,900 km (1200 miles) northeast of Moscow. \"I am your new Father Frost,\" Navalny wrote jokingly in his first post from his new prison, a reference to the harsh weather conditions there. \"Well, I now have a sheepskin coat, an ushanka hat (a fur hat with ear-covering flaps), and soon I will get valenki (traditional Russian winter footwear). \"The 20 days of the transfer were quite tiring, but I'm still in an excellent mood, as Father Frost should be.\" Navalny's new home, known as \"the Polar Wolf\" colony, is considered to be one of the toughest prisons in Russia. Most prisoners there have been convicted of grave crimes. Winters are harsh - and temperatures are due to drop to around minus 28 Celsius (minus 18.4 Fahrenheit) there over the next week. About 60 km (40 miles) north of the Arctic Circle, the prison was founded in the 1960s as part of what was once the GULAG system of forced Soviet labour camps, according to the Moskovsky Komsomolets newspaper. Kira Yarmysh, his spokeswoman, has said she believes the decision to move him to such a remote and inhospitable location was designed to isolate him, make his life harder, and render it more difficult for his lawyers and allies to access him.  Navalny, who thanked his supporters for their concern about his welfare during his long transfer, said he had seen guards with machineguns and guard dogs and had gone for a walk in the exercise yard which he said was located in a neighbouring cell, the floor of which he said was covered with snow. Otherwise, he said he had just seen the perimeter fence out of a cell window. He said he had also seen one of his lawyers.  Navalny, who denies all the charges he has been convicted of, says he has been imprisoned because he is viewed as a threat by the Russian political elite.  The Kremlin says he is a convicted criminal and has portrayed him and his supporters as extremists with links to the CIA intelligence agency who they say is seeking to destabilise Russia.  Navalny earned admiration from Russia's disparate opposition for voluntarily returning to Russia in 2021 from Germany, where he had been treated for what Western laboratory tests showed was an attempt to poison him with a nerve agent. \nIn his social media post, he told supporters he was unfazed by what he was facing.  \"Anyway, don't worry about me. I'm fine. I'm awfully glad I finally made it here,\" said Navalny."
}