{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0O0D4_L.jpg",
  "title": "Trump denies Carroll's sexual abuse claims as defamation trial nears end",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 25, 2024 06:03AM ET",
    "Updated Jan 25, 2024 06:17PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Charles Manson",
        "2024-01-25 19:20:59",
        "If he takes the stand, he will get cross-examined by the prosecution. That the point where her character gets attacked by the Defense. Hope it's televised. An appeal will be automatic. By the time the Case reaches the SCOTUS due to the Statute of Limitations expiration clause, it will be thrown out and all will be Well in America again. Love to All, Charles.",
        "https://www.investing.com/members/249519852"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/trump-on-deck-to-testify-at-e-jean-carroll-trial-3282599",
  "paragraph": "© Reuters. Republican presidential candidate and former U.S. President Donald Trump gestures as he takes the stage during his New Hampshire presidential primary election night watch party, in Nashua, New Hampshire, U.S., January 23, 2024. REUTERS/Mike Segar/File Pho\nBy Jonathan Stempel and Luc Cohen NEW YORK (Reuters) -Donald Trump's testimony in the writer E. Jean Carroll's defamation case ended almost immediately after it began, with the former U.S. president standing by his earlier testimony that Carroll's claim that he raped her was a hoax. \"100% yes,\" Trump told his lawyer Alina Habba in federal court in Manhattan, when asked if his comments in an October 2022 deposition in Carroll's case were accurate. Earlier on Thursday, Carroll's lawyers played videotaped excerpts from the deposition, in which Trump called the former Elle magazine advice columnist \"mentally sick\" and a \"whack job,\" and threatened to sue her. \"It's a false accusation, never happened, never would happen,\" Trump said in the deposition. Carroll, 80, is seeking at least $10 million over Trump's June 2019 denials, when he was president, that he had raped her in the mid-1990s in a Bergdorf Goodman department store dressing room in Manhattan. Trump, 77, accused Carroll of making up the rape to boost sales of her memoir. Last May, another jury ordered Trump to pay Carroll $5 million over a similar denial in October 2022. He is appealing. Trump spent only four minutes on the witness stand after U.S. District Judge Lewis Kaplan, who has overseen both trials, said he would not allow \"do-overs by disappointed litigants\" and let Trump revisit the first jury's findings. That jury concluded that Trump defamed Carroll, and sexually abused her by inserting his fingers in her vagina, and Kaplan said those findings were binding in the current trial. Carroll's case has become part of Trump's campaign to retake the White House in the November election. The Republican frontrunner has been shuttling between the courtroom and campaign stops while criticizing Carroll, the judge and the judicial process online and at press conferences. 'YOU ARE INTERRUPTING THESE PROCEEDINGS' Kaplan struck most of what Trump said on the witness stand from the record, meaning the seven-man, two-woman jury cannot consider it during deliberations. Trump testified \"yes I did\" when Habba asked if he had publicly denied Carroll's rape claim to defend himself, and \"no\" when asked if he had intended to harm Carroll. He then said he had \"wanted to defend myself, my family, and frankly the presidency,\" but the judge instructed jurors to disregard this comment. The trial has lasted four days, and closing arguments are expected on Friday. Before Trump took the stand, Kaplan and lawyers for both sides discussed outside the jury's presence what the former president could say, when the judge overheard Trump talking about Carroll and the first trial, which he did not attend. \"I wasn't at the trial,\" Trump said. \"I don't know who this woman is. I never met this woman.\" Kaplan, who is known for maintaining tight control over his courtroom, cut him off. \"I'm sorry, Mr. Trump, you are interrupting these proceedings by talking loudly,\" the judge said. Jurors will consider only how much money Trump should pay Carroll for damaging her reputation, and perhaps additional sums as punishment and to stop him from defaming her again. To win, Carroll must prove her case by a preponderance of the evidence, meaning more likely than not. CARROLL'S FRIEND TESTIFIES A damages expert testified on Carroll's behalf last week that the reputational damage from Trump's 2019 comments could be as high as $12.1 million. Trump's legal team has said Carroll's damages should be nominal or zero, and that Carroll sought out and has enjoyed the adulation from coming forward. They have also said it was the publication of excerpts from Carroll's book in New York magazine, and not Trump's comments, that led people to brand Carroll a liar. Carol Martin, a former New York TV news anchor and a close friend of Carroll, was the only other defense witness, with Habba trying to establish how Carroll enjoyed her newfound fame. Martin acknowledged having sent texts, after Carroll first accused Trump of rape, that described Carroll as being like \"Santa at a Christmas parade\" and \"like a drug addict and the drug is herself,\" but said she regretted using hyperbole. \"She is adapting to the change in her life,\" Martin said. \"'Enjoying' is a multifaceted word.\" Martin had testified on Carroll's behalf at last year's trial. Under questioning from one of Carroll's lawyers, Martin said she had no qualms about the writer's motives. \n\"What she always wanted was to have her day in court,\" Martin said. Earlier on Thursday, Carroll's lawyers finished presenting their case, with former Elle Editor-in-Chief Robbie Myers testifying that she had viewed Carroll as a \"truth-teller\" whose empathy and sense of humor made her \"so important\" to the Elle brand."
}