{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBS0GU_L.jpg",
  "title": "Arrests of Catholic priests in Nicaragua tick up as dragnet intensifies",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 29, 2023 06:18PM ET",
    "Updated Dec 29, 2023 10:45PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/arrests-of-catholic-priests-in-nicaragua-tick-up-as-dragnet-intensifies-3264857",
  "paragraph": "© Reuters. FILE PHOTO: Rolando Alvarez, bishop of the Diocese of Matagalpa and a critic of the Nicaraguan President Daniel Ortega, shown praying at Managua's Catholic church where he was taking refuge, alleging he had been targeted by the police, in Managua, Nicarag\nBy Ismael Lopez SAN JOSE (Reuters) -Nicaraguan police on Friday arrested three more Catholic priests, bringing the number of clergymen detained this week to at least nine, according to sources close to the local church leadership, including one who is a high-ranking church member. The three sources, who requested anonymity for fear of arrest, said two of the priests were taken into custody for publicly praying for jailed Bishop Rolando Alvarez, the most prominent critic of President Daniel Ortega. The pair \"were arrested for refusing to stop mentioning Bishop Alvarez in their sermons,\" one of the sources said, naming Marco Diaz and Bayardo Aguilar as among the latest clerical detainees. The source said Aguilar was later released. The government has not issued any statements explaining any alleged crimes committed by the priests or reasons for their arrests. But dating back to protests five years ago, Ortega has accused church leaders of seeking to overthrow his government. Local media outlet Confidencial has previously reported that at least two other priests arrested this week were also released shortly after being detained. Later on Friday, another prominent priest, Silvio Fonseca, was arrested after leading religious services at his parish in the capital Managua, according to two of the sources. \"We don't want to further complicate things, we're in reflection,\" said one of the sources, a high-ranking church member, who confirmed all of the recent arrests. \"We're trying to find a way to help them, as much as possible, trying to reach the authorities to see what are the charges,\" said the source. The government's press office, run by Vice President Rosario Murillo, Ortega's wife, did not respond to a request for comment. Alvarez, the bishop of Matagalpa, forcefully criticized the government's deadly response to mass protests that broke out in 2018, and was convicted of treason and sentenced to a 26-year prison term earlier this year. Over the past few years, Ortega's government has targeted leaders of the Catholic church, a crackdown which officials in the past have said was needed to punish treasonous behavior or other alleged crimes. On Thursday, two additional high-ranking priests were arrested, both with close ties to Cardinal Leopoldo Brenes, the archbishop of Managua and the highest-ranking figure in the country's Catholic hierarchy. Brenes has made no public pronouncements on the arrests, and he declined to comment when Reuters reached him by phone on Friday. Last week, the police arrested Bishop Isidro Mora of the Siuna diocese, making him the second bishop to be detained after Alvarez's detention in 2022. \nThe enforcement actions against Nicaragua's Catholic church, including broad surveillance of priests, intensified earlier this year, Reuters reported, after Pope Francis condemned the government led by Ortega as a \"gross dictatorship\" and the president responded by severing ties with the Vatican. At least 11 priests, bishops and seminarians are currently behind bars in the country, according to exiled Nicaraguan researcher Martha Patricia Molina, who publishes records of what she describes as the persecution of the Catholic Church under Ortega."
}