{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0U014_L.jpg",
  "title": "US needs to work with greater intensity in the Pacific - NZ foreign minister",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 30, 2024 08:03PM ET",
    "Updated Jan 31, 2024 01:30AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-needs-to-work-with-greater-intensity-in-the-pacific--nz-for-min-3287586",
  "paragraph": "© Reuters. FILE PHOTO: New Zealand's Foreign Minister Winston Peters speaks during a news conference after he attended an emergency meeting of the Organisation of Islamic Cooperation (OIC) in Istanbul, Turkey, March 22, 2019. REUTERS/Murad Sezer\n(This Jan. 30 story has been refiled to remove an extraneous word in paragraph 1) By Lucy Craymer WELLINGTON (Reuters) - New Zealand will start talks on Wednesday with Australia about cooperating with the AUKUS trilateral defence partnership, Foreign Minister Winston Peters said, adding Washington needed to do more in the Pacific to counter other political influences there. Peters heads to Australia on Wednesday for an inaugural joint meeting of New Zealand and Australian foreign and defence ministers, and said the talks would also canvas what joining an expanded AUKUS grouping of Australia, Britain and the U.S. would mean for Wellington. “Pillar two (of AUKUS) is the examination we're going to look at beginning tonight and tomorrow and going forward,\" he told Reuters in an interview. \"Pillar two\" of the AUKUS pact is separate from the first pillar designed to deliver nuclear-powered attack submarines to Australia, but what any new agreement would entail is not yet public. New Zealand has had a nuclear free policy since the 1980s, damaging defence ties with the U.S., and there has been no indication this will change. Peters also said the U.S. had neglected the Pacific since the Second World War, and that had created a vacuum that others had filled. \"They have certainly upped their game, but they need to work with greater intensity on the immediate problems at the ground level of many of the island nations,” he said. Peters did not mention China by name, but jostling between Washington and Beijing for influence in the Pacific has increased in recent years over issues including security, defence, aid and infrastructure.  Peters, who held the role of foreign minister from 2005 to 2008 and again from 2017 to 2020, returned to the role in late 2023 when a new conservative coalition government was elected.   In 2017, Peters launched a “Pacific Reset” pouring aid and boosting engagement with the region in an effort to woo small neighbouring Pacific island nations at a time when China was dramatically increasing its presence in the region. Peters criticised the prior government for not taking a stand on political issues. “Taking some glorified isolationist stance in this new environment is not in our national interest,” he said. “It’s so fundamental that if you don’t have capacity to ensure you’ve got peace in any environment then there’s a high likelihood that you’re not going to have it.”  The current New Zealand government has asked ministries to cut spending since they came into office as they try to return the country’s accounts to surplus. Peters, however, said that he would like to be able to expand the reach of the country’s foreign office. “We are not an indulgent Foreign Service, we are undercooked compared to those countries we compare ourselves to,” Peters said. “We need more people out there particularly on the trade side.” \nNew Zealand was not in a “benign security environment” and the country needed to build secure relationships and partnerships in the region, he said. “We are going to make, alongside our friends, a stand for the safety and the security of the part of the world we live in.\""
}