{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK040DD_L.jpg",
  "title": "Plan for internal Israeli military probe of Oct. 7 attack angers some ministers",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 05, 2024 07:32AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/plan-for-internal-israeli-military-probe-of-oct-7-attack-angers-some-ministers-3268129",
  "paragraph": "© Reuters. FILE PHOTO: Israeli military Chief of General Staff Herzi Halevi looks on while visiting a location given as northern Israel, in this screengrab taken from a handout video released on January 3, 2024. Israel Defense Forces/Handout via REUTERS/File Photo\nJERUSALEM (Reuters) - A plan by Israel's military to mount an internal investigation into the Oct. 7 Hamas attack that triggered the Gaza war is drawing criticism from rightist government ministers, who want a more sweeping review of policy towards the Palestinian enclave. The armed forces chief, Lieutenant-General Herzi Halevi, informed the security cabinet of the planned inquiry during a briefing on Thursday evening. The briefing was meant to be closed but some of it was aired by Israeli media, including criticism by several ministers who were present.  The Oct. 7 rampage by Hamas militants, in which Israel said some 1,200 people were killed and about 240 taken hostage, blindsided the country's advanced security apparatus and exposed Prime Minister Benjamin Netanyahu to criticism. Unlike some other top officials, he has made no personal admission of failure. He has spoken more generally of the eventual need of a public reckoning with all Israeli decision-makers involved in Gaza policy, including those predating his record-long term. Two far-right cabinet ministers said they were upset at the inclusion in the military's inquiry of Shaul Mofaz, a retired general who was defence minister when Israel unilaterally quit the Gaza Strip in 2005 and razed Jewish settlements there. The two ministers, Itamar Ben-Gvir and Bezalel Smotrich, accused another ex-general helping with the probe of having weakened the military by supporting reservists who protested again a campaign for a judicial overhaul by Netanyahu last year.  \"These are people whose own actions should be under investigation - and who should not be the ones doing the investigating,\" Ben-Gvir said in a social media post. \nIn his own online post, Smotrich said he was not in principle opposed to a military review intended to improve war performance. But any investigation of what led to the events on Oct. 7, and of wider security doctrines, demanded cabinet input, he said.  The office of an Israeli military spokesperson said the inquiry had not yet begun, adding: \"The general staff are planning the process of the investigation and the appointment of the heads of the investigation teams.\""
}