{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK04053_L.jpg",
  "title": "Explainer-Where did Russia get its North Korean missiles?",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 05, 2024 01:25AM ET",
    "Updated Jan 05, 2024 01:31AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/explainerwhere-did-russia-get-its-north-korean-missiles-3267769",
  "paragraph": "By Josh Smith SEOUL (Reuters) - Russia has launched multiple North Korea-made ballistic missiles at Ukraine recently, the White House said on Thursday, the first time the North's latest weapons have been used in battle. Here is what we know about the missiles, and where they came from. WHAT MISSILES DID RUSSIA USE? While the White House would not say specifically what type of missiles Pyongyang had sent to Russia, Kirby (NYSE:KEX) said they had a range of about 900 km (550 miles) and released a graphic that appeared to show KN-23 and KN-25 short-range ballistic missiles (SRBMs). Joost Oliemans, a Dutch researcher and expert on North Korea's military, said images from Ukrainian social media accounts clearly show fragments of the ring housing the control vanes that are characteristic to North Korea's Hwasong-11 family of missiles, which includes the KN-23 and KN-24. The solid-fuel KN-23 was first tested in May 2019, and is designed to evade missile defences by flying on a lower, \"depressed\" trajectory, experts said. North Korea has test-fired it from wheeled launch vehicles, train cars, a buried silo, and a submerged submarine. \"Despite external characteristics and what some may state on the matter, this missile family does not appear to be substantially related to the Russian 9K720 Iskander, and is instead an indigenous North Korean development,\" Oliemans said. The KN-24, also powered by solid fuel, was first tested in 2019 and appears to have entered mass production and deployment with military units. The KN-24 resembles the U.S. MGM-140 Army Tactical Missile System (ATACMS) and, like the KN-23, is designed to evade missile defences by flying on a flatter trajectory than traditional ballistic missiles.  Because the North Koreans may have configured their launchers based on their extensive experience with legacy Soviet equipment, the learning curve for Russian crews to operate the imported systems may not be particularly great, said Ankit Panda, of the U.S.-based Carnegie Endowment for International Peace.  \"North Korean technical advisers may be present in Russia to advise on the use of these systems,\" he said. WHERE DID RUSSIA GET THE MISSILES? North Korea has been under a United Nations arms embargo since it first tested a nuclear bomb in 2006. U.N. Security Council resolutions - approved with Russian support - ban countries from trading weapons or other military equipment with North Koread. In November, South Korean authorities said North Korea may have supplied SRBMs to Russia as part of a larger arms deal that also included anti-tank and anti-air missiles, artillery and mortar shells, and rifles. Both Moscow and Pyongyang have previously denied conducting any arms deals, but vowed last year to deepen military relations. Since August, Rason port on North Korea's northeast coast has seen visits from Russian ships linked to that country’s military logistics system, according to U.S. and South Korean officials and reports by Western researchers citing satellite imagery. As of November, North Korea had sent an estimated 2,000 shipping containers from Rason suspected of carrying those weapons, including possibly the SRBMs, South Korea has said. The KN-24 appears to be assembled at an armaments factory in Sinhung, which was visited by North Korean leader Kim Jong Un in August, Oliemans said. \"The examples photographed back then might well have been shipped to Russia just months later,\" he said. Kim has called for the defence industry to increase its output to respond to U.S. threats, but has not mentioned providing weapons to Russia. \"War preparations provides a nationalistic cover to reinvigorate the military industry to both replenish what is presumably depleted stocks and potentially continue to provide Russia with additional stocks going forward,\" said Jenny Town, director of the Stimson Center's 38 North Program, which studies North Korea. WHAT DOES NORTH KOREA GET FROM THE DEAL? Kirby said U.S. intelligence suggests that in exchange for the missiles and other armaments, North Korea is seeking military assistance from Russia including fighter aircraft, surface-to-air missiles, armoured vehicles, ballistic missile production equipment or materials, and other advanced technologies. Some experts have questioned whether Moscow would be willing to give Pyongyang sensitive military technology, but note there are a wide range of areas for the two politically and economically isolated neighbours to cooperate on. \"There are any number of things that Russia and North Korea have discussed as part of their deepening relations, from increasing trade, to setting up joint agricultural zones, to updating North Korea's antiquated air force, to cooperation on satellites,\" Town said. \nNorth Korea would benefit from any data on the battlefield performance of its missiles, but it is unclear if Russia will share that, Panda said. \"The most valuable data would concern the performance of these missiles against Ukrainian air defence systems, including those supplied by NATO,\" he said."
}