{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "US lawmakers want pressure on Hungary to back Sweden's NATO membership",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 01, 2024 05:14PM ET",
    "Updated Feb 01, 2024 07:30PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Ken Roth",
        "2024-02-02 09:15:59",
        "Like the EU countries did to ensure aid for Ukraine. Tell Orban that NATO will do fine without Hungary and he should seek Russian citizenship instead. As Putins puppet he does not belong in NATO.",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/us-lawmakers-want-pressure-on-hungary-to-back-swedens-nato-membership-3290572",
  "paragraph": "By Patricia Zengerle WASHINGTON (Reuters) - Senior U.S. lawmakers said they wanted Hungary to immediately approve Sweden's accession to NATO, suggesting on Thursday, a week after Turkey's approval, that Budapest risks permanent damage to its relationship with Washington if it does not act. Senate Foreign Relations Committee Ben Cardin said he had \"deep concerns\" over the direction of Hungary's current government. The Democratic lawmaker noted Hungarian Prime Minister Viktor Orban's delay, until today, of European Union assistance for Ukraine, as well as its continuing obstruction of Sweden's NATO membership. \"Partners don't do these things. And I am questioning whether they are a trusted ally for our (visa) waiver program,\" he told a news conference. The Visa (NYSE:V) Waiver Program permits citizens from 41 countries to travel to the United States for stays of up to 90 days without a visa. And Senators Jeanne Shaheen, a Democrat, and Thom Tillis, a Republican, who co-chair the Senate's NATO Observer Group which leads efforts in the chamber in support of the alliance, issued a statement calling on Hungary to change course. \"Hungary’s inaction risks irrevocably damaging its relationship with the United States and with NATO,\" Senators Jeanne Shaheen, a Democrat, and Thom Tillis, a Republican said in a statement. \nSweden, along with Finland, applied to join NATO in 2022 after Russia's invasion of Ukraine. But its membership was held up by Turkey and Hungary, leaving the country in limbo and frustrating NATO allies who see Sweden as an important player in ensuring security in the Baltic region. Hungary is now the only NATO member that has not approved Sweden's application to join the alliance."
}