{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0N0P2_L.jpg",
  "title": "World Court to rule on Gaza emergency measures in Israel genocide case on Jan 26",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 24, 2024 12:39PM ET",
    "Updated Jan 24, 2024 01:03PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/world-court-to-rule-on-gaza-emergency-measures-in-israel-genocide-case-on-jan-26-3282047",
  "paragraph": "© Reuters. FILE PHOTO: Strollers with pictures of kidnapped children are placed by protesters in front of the seat of the United Nations World Court in The Hague to protest the abduction of Israeli children by Hamas on October 7, in The Hague, Netherlands November 3\nAMSTERDAM (Reuters) - Judges at the International Court of Justice (ICJ) will rule on Friday whether or not they will grant emergency measures against Israel following accusations by South Africa that the Israeli military operation in Gaza is a state-led genocide. The United Nations' top court issued a statement on Wednesday saying the 17-judge panel will hand down its ruling in court on Jan. 26 at 1200 GMT. Earlier this month, in two days of hearings, South Africa asked the ICJ, also known as the World Court, to order an emergency suspension of Israel's devastating military campaign in the Palestinian enclave. Israel dismissed the genocide allegations as \"grossly distorted\" and said it had a right to defend itself and was targeting Hamas militants, not Palestinian civilians. In the ruling on Friday, the ICJ will not deal with the main question if Israel is committing genocide.  The court will just look at possible emergency measures, meant as a kind of restraining order to prevent a dispute from getting worse while the court looks at the full case, which usually takes years. \nIf the ICJ does decide on issuing emergency measures it is not bound to order exactly what South Africa asked for.  Rulings by the court are legally binding and without appeal, but the court has no way to enforce them."
}