{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0C02W_L.jpg",
  "title": "The Trump voters in swing states who are returning to the fold",
  "category": "Economic indicators",
  "publisher": "Reuters",
  "date": [
    "Published Jan 13, 2024 06:33AM ET",
    "Updated Jan 13, 2024 12:34PM ET"
  ],
  "comments": [
    8,
    [
      [
        "Ken Roth",
        "2024-01-14 20:51:07",
        "Lock him UP and fast before he destroys our country and democracy completely",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Mark Jannetty",
        "2024-01-14 22:07:36",
        "Your right, Biden needs to be locked up. Using the DOJ and private companies to interfere with elections is the end of democracy ",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Ken Roth",
        "2024-01-15 00:00:26",
        "Mark Jannetty",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Barry Nickerson",
        "2024-01-15 11:52:11",
        "Too late, Old Joe has been taking away our freedoms for the last three years.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Ken Roth",
        "2024-01-16 20:27:31",
        "Barry Nickerson",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Kevin Eddlemon",
        "2024-01-13 21:12:40",
        "Just more leftwing propaganda from Reuters.  Trump wins in a landslide meanwhile Biden has his diaper changed.",
        "https://www.investing.com/members/234090009"
      ],
      [
        "Mark Gesswein",
        "2024-01-13 21:13:44",
        "That is, if Biden even MAKES it to November. He is NOT well.",
        "https://www.investing.com/members/245851936"
      ],
      [
        "Brad Albright",
        "2024-01-14 17:42:59",
        "Let me guess: another red wave.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Ken Roth",
        "2024-01-14 20:56:12",
        "The only one wearing diaper is Trump he stinks when it leaks and everybody knows this, maybe except you Kevin",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Mark Gesswein",
        "2024-01-13 21:05:07",
        "Trump is more popular now than he was 4 years ago, while Biden has proven to be nothing more than a dumpster fire for this country. Trump won in 2020, and he’s going to win again in a LANDSLIDE this November.",
        "https://www.investing.com/members/245851936"
      ],
      [
        "Benjamin USA",
        "2024-01-13 18:22:39",
        "Weak on criminals, GOP is weak party",
        "https://www.investing.com/members/200821892"
      ],
      [
        "Alan Greenleaf",
        "2024-01-13 18:10:23",
        "Your Liberal bent is showing.  How do you know that \"Trump's false claims that he, and not Biden, won the 2020 election.\" are false?  There are videos everywhere of ballot box stuffing, and windows covered during the vote count.  There have been prosecutions for voter fraud.  An actual Journalist, even if Liberal, would have said \"none agree with Trump's allegations that he, not Biden won the election.\"  Do better.",
        "https://www.investing.com/members/201140868"
      ],
      [
        "Mark Gesswein",
        "2024-01-13 21:11:25",
        "And even THAT would be false. Nearly half the country KNOWS that Biden stole the 2020 election.",
        "https://www.investing.com/members/245851936"
      ],
      [
        "Brad Albright",
        "2024-01-14 17:47:55",
        "We know those claims are false because when they have been asserted in venues where the allegations are examined for valid proof, they dis not stand up to scrutiny. Believe the unsupported misunderstandings of internet conspiracy theories if it comforts you, but in 60 cases in courts of law, where facts win, every one found no fraud.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Merica Moment",
        "2024-01-13 17:45:52",
        "Biden Approval rating at 32%. No chance he wins. Trump is coming back and thr libs will cry ",
        "https://www.investing.com/members/255178822"
      ],
      [
        "Mark Gesswein",
        "2024-01-13 21:08:51",
        "Biden’s approval rating is 32% among DEMOCRATS. His real poll numbers are actually in the teens.",
        "https://www.investing.com/members/245851936"
      ],
      [
        "John Avenetti",
        "2024-01-13 15:04:38",
        "is not confounded anyone. the system is corrupt as a cotton to the core. even mostlow iiq dopes know that",
        "https://www.investing.com/members/225003989"
      ],
      [
        "Brad Albright",
        "2024-01-13 15:37:16",
        "Corrupt as a cotton to the core? LOL. More English classes please, comrade. What a moran.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Tom Scheuermann",
        "2024-01-13 12:41:18",
        "will be funny to see Trump dominate his broken party so much and then get crushed in the general election again",
        "https://www.investing.com/members/236178756"
      ],
      [
        "John Avenetti",
        "2024-01-13 15:05:36",
        "how can you say that a d not mention the party is Satanists??? ",
        "https://www.investing.com/members/225003989"
      ],
      [
        "Tom Scheuermann",
        "2024-01-13 16:59:00",
        " huh ",
        "https://www.investing.com/members/236178756"
      ],
      [
        "Mark Gesswein",
        "2024-01-13 21:07:08",
        "Biden can only win through fraud. If it is even CLOSE to being a fair election, Trump wins in a landslide.",
        "https://www.investing.com/members/245851936"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/economic-indicators/the-trump-voters-in-swing-states-who-are-returning-to-the-fold-3273924",
  "paragraph": "6/6\n© Reuters. Memorabilia are displayed at the home of Trump supporter Camilla Moore, in Atlanta, Georgia, U.S., December 15, 2023. REUTERS/Megan Varner\n2/6\nBy Tim Reid, Nathan Layne and James Oliphant (Reuters) - Donald Trump begins 2024 as the clear frontrunner for the Republican presidential nomination despite facing scores of criminal charges, a dynamic that would doom most other candidates and has confounded his political opponents. Those criminal charges include indictments for his efforts to overturn the 2020 election culminating in the Jan. 6, 2021 attack on the U.S. Capitol by his supporters. To try to understand his enduring appeal, Reuters spoke to five Trump supporters in five general election battleground states: Nevada, Georgia, Arizona, Pennsylvania, and Michigan. Trump currently leads Democratic President Joe Biden in several swing state general election polls, suggesting he will be highly competitive in a likely re-match next November.  Although all five Republicans voted for Trump in 2016 and 2020, three began 2023 open to other Republican candidates, including two who said they initially planned to vote for Florida Governor Ron DeSantis. As voting in the Republican nomination contest kicks off in the Iowa caucuses on Jan. 15, four now see Trump as their party's best hope to defeat Biden in November. They cite Trump's isolationist foreign policy, criminal charges, and hard line on immigration as key reasons for their return.  None are full-blown \"election deniers\" backing Trump's false claims that he, and not Biden, won the 2020 election. But they say the U.S. election system needs greater oversight. All said they saw Trump as a strong leader and none considered him racist, despite past comments decrying Haiti and some African nations as \"shithole\" countries which stirred widespread criticism and recent accusations that migrants were \"poisoning the blood\" of America, language used by Nazi dictator Adolf Hitler about Jewish people. The Trump campaign has dismissed criticism of the former president's language as \"nonsensical, arguing that similar language was prevalent in books, news articles and on TV.  MARK LIPP, BUSINESS CONSULTANT, NEVADA A year ago Mark Lipp, 68, knew who he wanted to vote for in the Republican presidential primaries: Florida Governor Ron DeSantis, \"because there was so much commotion around the name Trump.\" Yet Lipp - who sold his fiber-optic cable business in 2014 and lives in an 8-bedroom, 12-bathroom mansion in Las Vegas - is today all in for Trump. Lipp says his return to Trump began with Russia's invasion of Ukraine. In March 2023, DeSantis downplayed the invasion, calling it a \"territorial dispute\". \"That really made me wonder about DeSantis's knowledge of international politics and how it affects the United States. It really concerned me,\" Lipp said. Lipp, an observant Jew who grew up in the Bronx and who has an Israeli wife, said that as 2023 progressed he came to see Trump as the only presidential candidate capable of dealing with Russia's invasion of Ukraine, and growing friction with China. When the Palestinian militia group Hamas attacked Israel on October 7, 2023, killing over 1,200 Israelis and triggering a war in Gaza, Lipp said that sealed the deal for him. \"Trump has a business background and he's a great negotiator. He has a strong personality. These conflicts can be resolved through negotiation, and Trump is the right man at the right time.\" CAMILLA MOORE, RETIRED CITY MANAGER, GEORGIA When Trump's mugshot lit up news broadcasts last August after he was booked on felony charges related to his efforts to overturn his 2020 election loss in Georgia, Camilla Moore said she was bombarded with calls and messages from other Black people who said they could relate to the former president. \"The Black community can really sympathize with what Trump is going through because this is (our)history,\" said Moore, 64, who lives outside Atlanta. \"Black people know about trumped-up charges, someone who's been unfairly targeted by the law.\" Trump's legal woes differ greatly from the historic inequities Black Americans have experienced in the criminal justice system. As chair of the Georgia Black Republican Council, Moore says she is required to stay neutral in the primary but would happily vote for Trump if he is the nominee. She liked Trump's record on the economy and said the Ukraine and Gaza conflicts made her appreciate his \"unpredictable\" approach to foreign leaders, believing it would have averted those wars. Moore said Fulton County District Attorney Fani Willis, who brought the charges against Trump in Georgia, is overstepping her jurisdiction in prosecuting a federal election matter.  Moore views the federal prosecution of Trump for election subversion differently, saying she would accept a verdict if the evidence was overwhelming and the trial conducted fairly.  With talk of compromise and civility, Moore sounds like a Republican from another era. The hallway of her home is adorned with pictures of presidents from both parties, including a framed invitation to former Democratic President Barack Obama's 2009 inauguration, which she attended as a member of the Georgia Republican Party's executive committee. \"I always respect the office of the president, regardless of who sits in it,\" she said. \"Because we are Americans, right?\"  CARLOS RUIZ, SMALL BUSINESS OWNER, ARIZONA Carlos Ruiz sells custom-cut raw material to manufacturers including aircraft and medical device makers. The MBA and metallurgy graduate founded his Tucson-based company 21 years ago and runs it with his wife and three other employees. Ruiz, 60, began 2023 supporting DeSantis, impressed by his record in Florida and his landslide re-election as governor in 2022, at a time when many Trump-backed Republicans lost. \"Early on, I thought Trump's had his four years, and there's other candidates like DeSantis emerging,\" Ruiz said from his office in a business park on the outskirts of Tucson. Then two issues rallied Ruiz behind Trump again. The first was the increase in migrants crossing the Mexican border, 60 miles south of Ruiz's home. Since Biden took office, arrests of migrants at the border have reached record highs. \"We don't know who these people are,\" Ruiz said, adding many are young men, some of whom could be terrorists. Despite Trump's hard line rhetoric on immigration, there is no evidence that potential terrorists have crossed the border. Ruiz praised policies introduced by Trump when he was president including building some new sections of border wall, and keeping asylum seekers in Mexico. \"Trump introduced common-sense policies that changed the attraction for all of these people coming into the country. He's already proved he can do it and the policies were working.\" The second issue that swung Ruiz back behind Trump was the multiple criminal charges against him. Ruiz likened the indictments to Biden and the Democrats using \"banana republic\" tactics against Trump. \"That gives the green light to every tyrant at all levels of government to do the same thing to anybody,\" Ruiz said, echoing the words of Trump in campaign speeches. The Biden administration has denied any involvement in pursuing cases against Trump. MEGAN CHUDEREWICZ-ADAMS, SALES MANAGER, PENNSYLVANIA Megan Chuderewicz-Adams, 43, had been a staunch Trump supporter when COVID-19 hit and school shutdowns caused her to question whether he was deferring too much to Dr. Anthony Fauci, the top U.S. infectious disease official who became the face of America's pandemic response under Trump. But ultimately Chuderewicz-Adams, the married mother of a five-year-old son in a Pittsburgh suburb, decided the blame for what she viewed as overly restrictive COVID policies shouldn't lie with Trump, but with her state's governor. \"I think we suffered more in Pennsylvania than we would have living in another state,\" said Chuderewicz-Adams, a sales and marketing manager for a property developer. While she says DeSantis did a \"great job\" running Florida, where he came out against many COVID restrictions, she doesn't think he is worthy of unseating Trump.  Chuderewicz-Adams ran successfully for the Plum Borough School District board in November 2021. She campaigned on \"parental choice\" and against \"indoctrination,\" part of a wave of conservative women who sought school board seats to contest mask and vaccine mandates and to curtail the instruction of sexuality and racial identity in public schools. Chuderewicz-Adams likes that Trump speaks without a filter, dismissing the uproar over his \"poisoning the blood\" comments as alarmist. And she thinks it wrong to single Trump out for the Jan. 6 attack. \"It wasn't a good day,\" she said. \"But I don't hold one man responsible.\"  RANDY JOHNSON, TOWNSHIP SUPERVISOR, MICHIGAN As the supervisor of Adams Township, a section of rural Michigan of about 2,300 mainly working-class residents, Randy Johnson is the person you call if you have a zoning complaint or a problem with a neighbor. Johnson, 65, looks around the township and doesn't like what he sees: Families that don't have enough to eat, who can't afford reliable cars or to heat their homes. He worries about military veterans. \"We're in a downward spiral,\" he said. To Johnson, migrants crossing across the U.S. southern border deserve some of the blame. He said they are soaking up government resources that could be better used somewhere else.  \"Why is it our government would help somebody who isn't an American, isn't sitting here and hasn't grown up here their whole life?\" he said. Johnson likes Trump's tough stance on migration, and believes Trump will slow the crossings and deport as many migrants as feasibly possible. Like many of Trump's supporters, Johnson said he wishes Trump would tone down his rhetoric, but he's not ready to abandon him for DeSantis, whom he also admires. Johnson stops short of calling the 2020 election rigged but harbors suspicions about Biden's victory. Press Johnson harder and he will tell you those who stormed the U.S. Capitol were simply \"voicing their opinion.\"  \nJohnson can't foresee any way Trump could legitimately lose again to Biden. He fears violence should the Republican fail to return to the White House. It's why the Second Amendment - the right to bear arms - is in the Constitution, he said: \"Not to protect yourself from your neighbor but to protect yourself from your government.\""
}