{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0D065_L.jpg",
  "title": "Mental strain, deepening risks as Israel's war with Hamas reaches 100 days",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 14, 2024 06:42AM ET",
    "Updated Jan 14, 2024 06:55AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/mental-strain-deepening-risks-as-israels-war-with-hamas-reaches-100-days-3274091",
  "paragraph": "© Reuters. Israeli soldiers operate in the Gaza Strip amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, in this handout picture released on January 14, 2024. Israel Defense Forces/Handout via REUTERS\nBy James Mackenzie JERUSALEM (Reuters) - One hundred days after Hamas gunmen broke out of Gaza to launch the deadliest attack in Israel's history, tens of thousands of Palestinians have been killed, Gaza lies in ruins and the Middle East is sliding towards a wider, more unpredictable conflict. For both Israelis and Palestinians, the war has been a trauma that looks likely to last for years, deepening the hostility and mistrust that have stood in the way of peace for more than 75 years. \"No one will win,\" said Rebecca Brindza, a spokesperson for families of the 240 Israelis and foreigners seized as hostages during attack on communities around the Gaza Strip that opened the war on Oct. 7. The assault in the early morning hours caught Israel's vaunted military and security services completely off guard, opening days of fear and uncertainty for the country as the details of the slaughter by the rampaging gunmen emerged. The attack killed more than 1,200 people, the biggest single day loss of life since the founding of the state of Israel in 1948, and the shock was compounded by the multiple accounts of rape and sexual violence that emerged in the following weeks. The Israeli response was immediate and unrelenting, beginning with a systematic aerial bombardment and followed by a ground invasion that have together laid waste to Gaza and forced almost 2 million people to flee their homes. Almost 24,000 Palestinians have been killed and 60,000 wounded in the invasion, according to Gaza health authorities, the largest loss of Palestinian life suffered in the decades of wars and conflict with Israel since 1948. Three months on, Israeli troops are still battling Hamas Islamist militants in the ruins of Gaza and hunting architects of the October attack, such as Yahya Sinwar, the Hamas leader in Gaza and Mohammed Deif, the movement's military leader. Most of the enclave's hospitals have been destroyed, hunger is a growing threat and a dire humanitarian crisis threatens to end up killing even more Gazans than the Israeli military. In a statement marking the 100 days, the Palestinian ministry of foreign affairs accused Israel of creating \"a circle of death\" in Gaza. Israeli officials say they do all they can to avoid civilian casualties and they accuse Hamas of hiding its network of tunnels and military infrastructure among Gaza's civilian population, deliberately putting them at risk. Yet that offers little comfort to the tens of thousands who have lost relatives to the bombardment. \"I come here everyday, longing for them,\" said Khaled Abu Aweidah, who lost 22 members of his family to an air strike and who still searches the mountains of rubble that was his family home in vain for any sign of three children buried there. SHOCKED World opinion has been shocked and the bitterness of the conflict has spilled out into angry demonstrations on the streets of European cities and American college campuses, casting its shadow over the U.S. presidential election.  Across the Arab world, there has been outrage at the killing and destruction and at widely seen images of Palestinian prisoners stripped to their underwear. Even Washington, Israel's closest ally, has urged restraint and South Africa has brought a case before the International Court of Justice, accusing Israel of genocide, a charge it rejects as a gross and hypocritical distortion of the truth. Efforts to agree a ceasefire have so far failed and the future of Gaza, which has been under blockade for more than 15 years, remains up in the air, while violence in the volatile cities of the occupied West Bank has spiralled to levels that in other times would cause deep alarm. The United States and other powers have called for a revival of a process to create an independent Palestinian state after the war but Prime Minister Benjamin Netanyahu's right-wing government has so far failed to respond.  Israel's main enemy Iran, which backs Hamas, has taunted Israel but has so far refrained from direct action and Hezbollah, its proxy in Lebanon, has taken care to avoid an all-out confrontation. However, the Houthis in Yemen, another Iran-backed movement, have caused increasing turmoil by attacking shipping in the Red Sea, bringing nearer the threat of a wider conflict that could draw in outside powers and further destabilize the global order. For their part, Israelis see Hamas as an existential threat to their country and surveys show they support the campaign to destroy the group, even though most blame Netanyahu for the security failures that allowed the Oct. 7 attack to take place. Posters showing the hostages are plastered on walls and bus stops across Israel and Sunday saw large demonstrations, demanding the return of more than 130 still held in Gaza after a truce in November, during which around half were swapped for Palestinian prisoners held in Israeli jails. \"Israel's society is gripped by trauma and we cannot heal without them all coming back,\" said Moran Stella Yanai, a former hostage returned in the swap who was kidnapped during the Nova music festival, where hundreds of party-goers were killed on the morning of Oct. 7. As the war goes on, it imposes an increasing strain on the economy and the army has begun releasing some of the tens of thousands of reservists called up to fight Hamas and guard the northern border to enable them to return to their jobs. \nBut Netanyahu, whose political future will depend on the outcome of the war, has shown no sign that he was listening to the growing calls for an end to the fighting.  \"We are continuing the war until the end - until total victory,\" he said on Saturday at a news conference to mark the 100 days of the war."
}