{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0E06E_L.jpg",
  "title": "Canadians worry US democracy cannot survive Trump's return to White House, poll finds",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 15, 2024 03:07AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/canadians-worry-us-democracy-cannot-survive-trumps-return-to-white-house-poll-finds-3274239",
  "paragraph": "2/2\n© Reuters. FILE PHOTO: Former U.S. President and Republican presidential candidate Donald Trump campaigns in Indianola, Iowa, U.S., January 14, 2024. REUTERS/Brendan McDermid/FILE PHOTO\n2/2\nBy Steve Scherer OTTAWA (Reuters) - About two-thirds of Canadians surveyed this month said American democracy cannot survive another four years of Donald Trump in the White House, and about half said the United States is on the way to becoming an authoritarian state, a poll released on Monday said. The November U.S. election is likely to pit President Joe Biden against Trump, who is the clear frontrunner to win the Republican nomination as voting in the presidential primary race kicks off in Iowa on Monday. Sixty-four percent of respondents in the Angus Reid Institute poll of 1,510 Canadians said they agreed with the statement: \"U.S. democracy cannot survive another four years of Donald Trump.\" Twenty-eight percent disagreed. The Jan. 6, 2021 attack on Capitol Hill by Trump supporters seeking to block certification of Biden's 2020 election win shocked many Canadians, and Prime Minister Justin Trudeau publicly blamed Trump for inciting the mob. Trump has vowed if elected again to punish his political enemies, and he has drawn criticism for using increasingly authoritarian language. Three times as many Canadians say a Biden victory would be better for Canada's economy (53%) than a Trump win (18%), according to the poll which was seen exclusively by Reuters. The poll, taken between Jan. 9-11, had a margin of error of plus or minus 2 percentage points  Forty-nine percent of people said the United States is on the way to becoming an authoritarian state and 71% of Canadians say the concept that the rule of law applies equally to everyone is weakening in the United States. The Trump campaign did not respond to a request for comment about the poll. \"What we're seeing is people quite alarmed about the prospect of a return of Donald Trump,\" said Shachi Kurl, president of Angus Reid Institute. The polling is also \"an indictment\" of \"how poorly Canadians now view the democratic institutions and the checks and balances that in the past people on both sides of the border took for granted,\" she added. American allies around the world and financial markets are watching the election with unease given the isolationism and the protectionist trade policies of Trump's presidency. Because of their proximity and economic ties, Canadians have more at stake than most countries. Two-thirds of Canada's 40 million people live within 100 km (62 miles) of the U.S. border, and the trade relationship with the United States is of existential importance to Canada.  Three-quarters of all exports go to the southern neighbor, and half of its imports come from the United States, including 60% of all imported fresh vegetables. \"One can make the argument that there's no country that would be more negatively affected by a Trump win than Canada,\" said Kim Nossal, a professor of political studies at Queen's University in Kingston and author of \"Canada Alone: Navigating the Post-American World\". In his first term, Trump forced the renegotiation of the North American trade pact and clashed with Trudeau, who he once called \"very dishonest and weak\".  \nTrump's \"mercantilist view involves thinking of Canada and every other so-called friend of the United States as no friend at all, but just a bunch of free-riders sucking off the wealth of the United States,\" Nossal said. \"He is the ultimate protectionist.\" There is a provision in the new North American trade pact that requires it to be reviewed for renewal after six years, or during the next American president's term in 2026."
}