{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0D031_L.jpg",
  "title": "North Korea fires missile, minister to visit Russia as tensions rise",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 14, 2024 01:06AM ET",
    "Updated Jan 14, 2024 10:50AM ET"
  ],
  "comments": [
    2,
    [
      [
        "Bett Albern",
        "2024-01-14 13:51:47",
        "If I remember right the Democrats with big mouths were threatening that Trump would have wars raging all over the Planet if he were elected, he had none.  Now Uncle Joe is in charge and we have war raging all over the Planet.  HMM?",
        "https://www.investing.com/members/215501997"
      ],
      [
        "Jason Patcher",
        "2024-01-14 16:54:52",
        "True. They didn't have too - trump was doing a good enough job at destroying democracy without the wars. He pulled out of Afghanistan not Joe. He recognized Jerusalem. ",
        "https://www.investing.com/members/204675713"
      ],
      [
        "Ac Tektrader",
        "2024-01-14 18:00:35",
        "all Joe did uin Afghanistan is implemented the garentees Trump made to the Taliban.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Mark Jannetty",
        "2024-01-14 18:52:24",
        " without a plan and cost taxpayers billions in lost equipment and many good Americans. ",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Surya Prakash",
        "2024-01-14 06:30:09",
        "war bad for economic ",
        "https://www.investing.com/members/241027207"
      ],
      [
        "Empire Destroyer",
        "2024-01-14 09:36:58",
        "You sure? Check US... two wars and it's doing good for economy",
        "https://www.investing.com/members/230614171"
      ],
      [
        "you tb",
        "2024-01-14 09:43:51",
        "War would increase the chance of spill over to other regions, which would be disastrous. Anything and everything, all conflicts should have an end. Life lost by war cannot be brought back as countries becoming graveyards",
        "https://www.investing.com/members/234725017"
      ],
      [
        "Derick Lim",
        "2024-01-14 13:38:12",
        "Weapon manufacturers are praying for WW3.....",
        "https://www.investing.com/members/214364779"
      ],
      [
        "Bett Albern",
        "2024-01-14 13:53:54",
        "Derick Lim",
        "https://www.investing.com/members/215501997"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/north-korea-fires-missile-south-korea-says-3274073",
  "paragraph": "© Reuters. FILE PHOTO: North Korea's leader Kim Jong Un attends a meeting with Russia's President Vladimir Putin at the Vostochny Сosmodrome in the far eastern Amur region, Russia, September 13, 2023. Sputnik/Vladimir Smirnov/Pool via REUTERS/File Photo\nBy Ju-min Park and Makiko Yamazaki SEOUL (Reuters) -North Korea fired an apparent intermediate-range missile into the sea on Sunday, South Korea and Japan said, as tensions run high after Pyongyang's recent launches of an intercontinental ballistic missile and its first military spy satellite. North Korea has stepped up pressure on Seoul in recent weeks, declaring it the \"principal enemy\", saying the North will never reunite with the South and vowing to enhance its ability to deliver a nuclear strike on the U.S. and America's allies in the Pacific. Sunday's missile, launched from the area of Pyongyang around 2:55 p.m. (0555 GMT), flew about 1,000 km (600 miles) off the country's east coast, South Korea's military said in a statement, adding that Seoul was running an analysis on the missile in coordination with the United States and Japan.  The maximum altitude was at least 50 km (30 miles), and the missile appeared to fall outside Japan's exclusive economic zone, Japan's defence ministry said, criticising the launch as a violation of United Nations resolutions. The U.S. military said the launch wasn't an immediate threat but that it highlighted the \"destabilising impact\" of North Korea's weapons program, according to a statement from the U.S. Indo-Pacific Command. In November, North Korea said it successfully tested solid-fuel engines designed for intermediate-range ballistic missiles. In December it said it had tested its newest intercontinental ballistic missile to gauge the war readiness of its nuclear force against what it called mounting U.S. hostility, as Washington and its allies began operating a real-time missile data-sharing system. North Korean soldiers brought heavy weapons back to the Demilitarized Zone around the North-South border and restored guard posts that the two countries had demolished, after Seoul suspended part of a 2018 military accord between the two Koreas in a protest over Pyongyang's launch of the spy satellite. North and South Korea remain technically at war because the 1950-1953 Korean War ended in an armistice rather than a peace treaty. Pyongyang's isolated government is forging closer ties with Moscow. Foreign Minister Choe Son Hui will visit Russia from Monday to Wednesday at the invitation of her counterpart Sergei Lavrov, the North's KCNA news agency said on Sunday. The United States and its allies have condemned what they describe as Russia's firing of North Korean missiles at Ukraine, with Washington calling it abhorrent and Seoul calling Ukraine a test site for Pyongyang's nuclear-capable missiles. Moscow and Pyongyang have denied conducting any arms deals but vowed last year to deepen military relations.  \n\"Pyongyang’s show of force should be of concern beyond Seoul, as its military cooperation with Moscow adds to the violence in Ukraine, and because it may be more willing to challenge the U.S. and its allies while global attention is fixed on the Middle East,\" said Leif-Eric Easley, an international studies professor at Ewha Womans University. The U.S. State Department on Thursday imposed sanctions on three Russian entities and one individual involved in the transfer and testing of North Korea's ballistic missiles for Russia's use against Ukraine."
}