{
  "image": "https://i-invdn-com.investing.com/news/LYNXNPEB730HT_L.jpg",
  "title": "Gold prices stem losses as dollar rally pauses; $2,000 support eyed",
  "category": "Commodities news",
  "publisher": "Reuters",
  "date": "Published Feb 06, 2024 12:52AM ET",
  "comments": [
    5,
    [
      [
        " ",
        "2024-02-06 15:58:43",
        "To be honest I have never been this happy before because the trusted man that has always been guiding me on my investment trade has made day I just got a massive withdrawal from his trade guidelines the proofs are everywhere. the man in WSap +31612574318). 010101010010101010001010101010101010101010101010101010101010101010101010101010101010101010101010101001101010101010101010101010101010101010101=101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101810101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010",
        "https://www.investing.com/brokers/"
      ],
      [
        " ",
        "2024-02-06 15:55:52",
        "To be honest I have never been this happy before because the trusted man that has always been guiding me on my investment trade has made day I just got a massive withdrawal from his trade guidelines the proofs are everywhere. the man in WSap +31612574318). 01010101001010101000101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010101010",
        "https://www.investing.com/brokers/"
      ],
      [
        "Myat Noe",
        "2024-02-06 10:36:14",
        "hi",
        "https://www.investing.com/members/256868562"
      ],
      [
        "Maneswar Naik",
        "2024-02-06 07:08:08",
        "hello ",
        "https://www.investing.com/members/256864357"
      ],
      [
        "Zara Chowdhury Zara Chowdhury",
        "2024-02-06 06:25:43",
        "Hello ",
        "https://www.investing.com/members/252409569"
      ],
      [
        "Qader Bazyar",
        "2024-02-06 06:33:04",
        "hi",
        "https://www.investing.com/members/256743394"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/commodities-news/gold-prices-stem-losses-as-dollar-rally-pauses--2000-support-eyed-3293403",
  "paragraph": "Investing.com-- Gold prices steadied on Tuesday after tumbling sharply over the past week as a rally in the dollar paused for breath, with markets now watching for the yellow metal to potentially test a key support level.\nThe near-term outlook for gold remained marred by persistent concerns over higher-for-longer U.S. interest rates, especially as markets began pricing the possibility that the Federal Reserve will keep rates static until June. \nStrong U.S. economic data and hawkish comments from Fed Chair Jerome Powell were the key drivers of this notion, with both factors triggering sharp declines in gold prices over the past two sessions.\nThe dollar rallied to a near three-month high, while U.S. Treasury yields also appreciated sharply in the face of higher-for-longer rates, which further pressured gold.\nSpot gold steadied at $2,026.33 an ounce, while gold futures expiring in April were flat at $2,042.40 an ounce by 00:23 ET (05:23 GMT). \n$2,000 support in focus as rate fears increase \nSeveral analysts said that spot gold prices were likely to test the $2,000 an ounce level in the coming days, especially if there was little change in the outlook for U.S. interest rates. \nThe CME Fedwatch tool showed traders pricing in an 83% chance the Fed will keep rates steady in March, and were steadily dialing up bets for a similar move in May. \nGold had briefly tested the $2,000 an ounce level earlier in January, but had just stopped shy of breaking below the support. Any moves below $2,000 could herald deeper losses in bullion prices, especially in the face of higher-for-longer U.S. rates.\nU.S. inflation data next week is expected to act as a key pivot point for prices, while several Fed officials are also set to speak this week.\nHigher-for-longer U.S. rates diminish gold’s appeal by increasing the opportunity cost of investing in the yellow metal. \nCopper rises as traders weigh China woes \nAmong industrial metals, copper prices rose on Tuesday after logging four straight sessions of losses, as markets digested more weak economic signals from China.\nCopper futures expiring in March rose 0.5% to $3.7920 a pound, after losing more than $1 in the past four sessions.\nPrices were hit chiefly by a string of weak purchasing managers index readings from China, which is the world’s largest copper importer. The readings showed little recovery in business activity in January, particularly in the key manufacturing sector.\nFocus this week is now on Chinese inflation data for January, due on Thursday. The reading also comes a day before the week-long Lunar New Year holiday."
}