{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "Mexico restarts repatriating Venezuelans as tensions over migration run high",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 30, 2023 07:34PM ET",
    "Updated Dec 30, 2023 08:40PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/mexico-restarts-repatriating-venezuelans-as-tensions-over-migration-run-high-3264917",
  "paragraph": "MEXICO CITY (Reuters) -Mexico's government has restarted repatriation flights of Venezuelans, it said on Saturday, two days after officials agreed to work more closely with their U.S. counterparts to tackle record migration at their shared border.  Earlier this week, U.S. Secretary of State Antony Blinken visited Mexico to hold high-level talks on migration and other issues.  The talks came after the U.S. government temporarily shuttered some border crossings to redeploy agents toward enforcement. In a statement, the Mexican foreign ministry said on Saturday \"it was agreed to restart the coordinated mechanism of repatriation flights for Venezuelans.\" It said two flights had departed Mexico on Friday and Saturday. \"Both countries are working on the implementation of social programs in Venezuela that will benefit, among others, repatriated people by linking them with productive projects and paid internships in workplaces,\" the statement said. Meanwhile, U.S. Homeland Security Secretary Alejandro Mayorkas said on social media that the U.S. Immigration and Customs Enforcement had also repatriated Venezuelans this week. \"The U.S. continues to remove those who have no legal basis to remain back to their countries of origin, including Venezuela,\" he wrote on X.  \"We also continue to work with our partners, including Mexico, to expand lawful pathways and coordinate enforcement measures against those who do not use them.\" The Venezuelan transport ministry confirmed on social media that 207 nationals had landed on Saturday morning in Maiquetia, near the capital Caracas, from Mexico \"as part of the migration agreements established by both nations.\" Venezuelan migrants often leave from Colombia and cross the border with Panama, including the dangerous Darien Gap, on their route north, hoping to pass through Central America and Mexico to reach the U.S. border."
}