{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0A013_L.jpg",
  "title": "Netanyahu condemns ICJ genocide case; Gazans return to wasteland in north",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 10, 2024 07:29PM ET",
    "Updated Jan 11, 2024 02:52PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Ken Roth",
        "2024-01-11 07:07:05",
        "Amazing hypocracy from South Africa. They want to accuse Isreal of genocide but at the same time they support Russia in their daily bombings of civilians and invasion of ukraine....Nobody takes South Africa serious anymore with their double standards.",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/israel-to-face-gaza-genocide-charges-at-world-court-3271909",
  "paragraph": "5/5\n© Reuters. Mourners react next to the bodies of Palestinians killed in an Israeli strike, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, in Rafah, in the southern Gaza Strip, January 10, 2024. REUTERS/Mohammed Salem \n2/5\nBy Mohammed Salem, Nidal al-Mughrabi and Anthony Deutsch GAZA/THE HAGUE (Reuters) -Benjamin Netanyahu on Thursday condemned South Africa's genocide case against Israel in Gaza as \"hypocrisy and lies\", as some Gazans returned to scenes of total devastation in the north of the enclave where Israeli forces have begun withdrawing. Three months of Israeli bombardment have laid much of the coastal enclave to waste, killing more than 23,000 people and driving nearly the entire population of 2.3 million Palestinians from their homes. An Israeli blockade has sharply restricted supplies of food, fuel and medicine, creating what the United Nations describes as a humanitarian catastrophe. Israel says its only means to defend itself is by eradicating Hamas, the Islamist group that rules Gaza, whose fighters stormed through Israeli communities on Oct. 7, killing 1,200 people and capturing 240 hostages. Israel blames Hamas for all subsequent harm to Palestinian civilians for operating among them, which the fighters deny. The case, brought by South Africa at the International Court of Justice (ICJ) in the Hague, accuses Israel of violating the 1948 genocide convention, enacted in the wake of the mass murder of Jews in the Holocaust, which mandates all countries to ensure such crimes are never repeated. \"Israel has a genocidal intent against the Palestinians in Gaza,\" Tembeka Ngcukaitobi, advocate of the High Court of South Africa, told the court in the Hague. \"The intent to destroy Gaza has been nurtured at the highest level of state.\" South Africa asked the court for a preliminary order to demand Israel stop fighting now, while the court hears the full merits of the case in coming months. In a strongly worded response, Israeli Prime Minister Benjamin Netanyahu said \"the hypocrisy of South Africa screams to the heavens.\"  \"We are fighting terrorists, we are fighting lies... Today we saw an upside-down world. Israel is accused of genocide while it is fighting against genocide,\" he said. Israel's foreign ministry accused South Africa of \"functioning as the legal arm of the Hamas terrorist organisation\" in a case built on \"false and baseless claims\". The White House also said the genocide allegations were unfounded. Palestinians said they hoped the court would stop the war.  In Rafah, in southern Gaza where the bodies of members of the al-Arjany family killed overnight were laid out outside a morgue, neighbour Khamis Kelab picked up the smallest of three children bundled in shrouds and cradled the dead infant. \"To the ICJ: what is the fault of this baby? What did this girl do? What crime did she commit? Was she a terrorist? Did this baby fire rockets?\" he said. \"She was inside a tent, in the freezing cold, she was hit by a strike, this baby is just a few days old, you people.\" The Palestinian Red Crescent reported late on Thursday that nine people had been killed in an Israeli bombardment targeting a house in Rafah.  SCORCHED RUINS Since the New Year, Israel has announced a new phase in the war, to begin drawing down forces in the northern half of the Gaza Strip where its offensive began. Even so, fighting has only intensified in southern areas. The relative quiet in the north has let residents begin trickling back into obliterated cities, finding a moonscape often with scant trace of where homes once stood. Yousef Fares, a freelance journalist, filmed himself walking through a wasteland surrounded by scorched ruins that was once a part of Gaza City, home to nearly a million people. A few civilians passed by, some wobbling on bicycles over a track across the mud. \"All the houses you see are destroyed, completely or partially,\" he said. \"We are now at the Tuffah old cemetery, which is over 100 years old. All those graves were exhumed, they were run over by the Israeli bulldozers and tanks. People are coming from various areas of Gaza City to search for the bodies of their sons.\" While Washington has backed Israel's military campaign as justified by its right to self-defence, it has also called on its ally to scale the war back, do more to protect civilians, and maintain the hope of a future independent Palestinian state. This week, Secretary of State Antony Blinken visited the region, meeting Israeli and Palestinian officials and leaders of neighbouring Arab States, defending Israel's campaign to eradicate Hamas but pushing for it to work with the Palestinian Authority (PA), which recognises Israel. Offering a pathway to a Palestinian state is the best way to stabilize the wider region and isolate Iran and its proxies, he said while on a visit to Egypt.  He was also briefed on progress as Egypt along with Qatar tries to mediate between Hamas and Israel to broker a ceasefire and secure the release of more than 130 Israeli hostages still being held in Gaza, according to Israeli tallies. Relatives of the hostages stood by the Gaza fence on Thursday, taking turns to shout messages of love and support into a microphone in the hope that the captives would hear them. \n\"Omer, can you hear us? \" shouted Orna Neutra, mother of 22-year-old hostage Omer Neutra. \"We're here. We're really close to you. We're fighting for you every single day,\" she shouted, her voice breaking with emotion. She was holding a placard with a picture of her son."
}