{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "With a mask and nitrogen tank, Alabama pioneers execution method",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 24, 2024 05:30PM ET",
    "Updated Jan 24, 2024 06:35PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/with-a-mask-and-nitrogen-tank-alabama-pioneers-execution-method-3282323",
  "paragraph": "By Jonathan Allen (Reuters) - If federal courts give the green light, Alabama plans on Thursday to pioneer the first new method of judicial execution since lethal injections were introduced in 1982. The new method is asphyxiation using an inert gas: Alabama Department of Corrections executioners will strap to the prisoner's face a commercially made industrial-safety respirator mask attached to a canister of pressurized pure nitrogen intended to rob him of oxygen. The moment is being closely watched, with implications both for other states that use capital punishment and for abolitionists who seek to end the practice, as well as companies that manufacture masks, nitrogen canisters and other equipment required by the new method. \"If this execution is successful then we're going to see nitrogen hypoxia take off across the country,\" said Rev. Jeff Hood, the spiritual adviser to Kenneth Smith, who was convicted for the 1988 murder of Elizabeth Sennett. Smith is scheduled to be the first prisoner subjected to the method, which Alabama refers to as 'nitrogen hypoxia,' on Thursday evening at Alabama's Holman Correctional Facility. \"If it's not successful, Kenny will be put in horrific pain and I will be at risk, but it will stop the march of nitrogen hypoxia to other jurisdictions, which puts us in a very weird Catch-22 conundrum,\" Hood said. Oklahoma and Mississippi have also approved similar nitrogen-asphyxiation protocols in recent years but are yet to deploy them. Alabama first tried to execute Smith in 2022 by lethal injection, but aborted the attempt after several hours of failed efforts to insert an intravenous line's needle into his body. Alabama Solicitor General Edmund LaCour told federal judges last week that the state has since developed \"the most painless and humane method of execution known to man.\" Smith's lawyers disagree, and seek a court-ordered halt to the second execution attempt, scheduled for 6 p.m. on Thursday. They say the new method, particularly the repurposing of a respirator mask, could easily go wrong if the mask's seal is imperfect and oxygen seeps in. On Wednesday, they sought a new emergency injunction at the 11th Circuit U.S. Court of Appeals after Alabama told the court the previous evening that it was revising its protocol to move Smith's last meal to before 10 a.m. over his concerns that he may vomit into the mask and choke. ACKNOWLEDGING THE RISKS Hood has been a minister at the side of four other men for their executions over the last 15 months, all lethal injections using a barbiturate drug. This is the first time he has had to sign a form acknowledging the risk that an execution method poses to others in the execution chamber. As the waiver form notes, nitrogen is an invisible, odorless, tasteless gas that makes up about 78% of normal breathing air. If the concentration of nitrogen is increased, displacing oxygen, there is a risk of unconsciousness and even death. The American Veterinary Medical Association in its 2020 guidelines said nitrogen could be used to euthanize pigs but not other mammals as it could lead to distress or seizures. Nitrogen has been advocated for by the right-to-die movement, and used successfully in assisted suicides but is more commonly deployed using a nitrogen-filled hood over the head. Hood, the minister, signed the acknowledgement form, but has sought assurances from Alabama that there will be oxygen tanks, paramedics and ambulances nearby. He said he has received no response. The Department of Corrections did not respond to questions. It previously has said it will have oxygen meters in the chamber and describes the possibility of oxygen levels dangerously plummeting in the room as a \"highly unlikely event.\"  Smith's lawyers have also complained about Alabama's decision to not perform the test outlined in the mask manufacturer's manual to ensure an airtight seal. \nThe New York-based advocacy group Worth Rises has organized a letter-writing campaign to Allegro Industries, the South Carolina-based safety equipment manufacturer that made the mask acquired by Alabama, asking the company to bar its products for use in executions.  \"We're not prepared to make any sort of statement,\" Stéphanie Boucher, a spokesperson for Allegro's Canada-based parent company Walter Surface Technologies, said when asked about the mask."
}