{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0B0RQ_L.jpg",
  "title": "Biden approved Yemen strikes after drone attack, US doesn't want war - White House",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 12, 2024 02:47PM ET",
  "comments": [
    1,
    [
      [
        "Mark Jannetty",
        "2024-01-12 20:08:26",
        "This president only wants war. We had 4 years of global peace under Trump ",
        "https://www.investing.com/members/241633026"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/biden-approved-yemen-strikes-after-drone-attack-us-doesnt-want-war--white-house-3273796",
  "paragraph": "ON BOARD AIR FORCE ONE (Reuters) - The United States does not want war with Yemen but will not hesitate to take further action, the White House said on Friday, adding President Joe Biden approved the U.S. strikes on Tuesday in response to a Houthi drone strike in the Red Sea.  \"We're not interested in ... a war with Yemen. We're not interested in a conflict of any kind here,\" White House spokesperson John Kirby (NYSE:KEX) told reporters on Air Force One. \"Everything the president has been doing has been trying to prevent any escalation of conflict, including the strikes last night,\" he said. U.S. and British forces launched air strikes across Yemen overnight in retaliation against the Iran-backed Houthi group for its attacks on Red Sea shipping. Kirby said Biden approved the strikes after a Houthi attack on Tuesday. U.S. and British naval forces repelled that attack, shooting down drones and missiles fired by the Yemen-based Houthis towards the southern Red Sea. Biden \"was kept up to speed as that attack was unfolding. It took some time. When he was briefed that it had been accurately and effectively defended, he called his national security team together - this is Tuesday afternoon - was presented with the response options and approved those options at that time,\" Kirby said. \nKirby said the Houthi attack on Tuesday came right after the U.S. issued \"what can only be understood as a final warning to the Houthis. They violated that obviously in this attack on Tuesday and so it led to these strikes.\" A \"battle damage assessment\" about how much the Houthi capabilities had been degraded by the strikes was ongoing, he said, and the United States was comfortable with and confident about the legal authorities that Biden exercised to order the attacks."
}