{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK101EJ_L.jpg",
  "title": "Russia says it has evidence US Patriot missiles downed its military transport plane",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 01, 2024 07:02AM ET",
    "Updated Feb 01, 2024 09:52AM ET"
  ],
  "comments": [
    2,
    [
      [
        "michel Le havre",
        "2024-02-02 15:41:40",
        "I would have thought the russian would deny any loss.  Putin look like he is buying time and appearing to be reasonable.  maybe he is banking on a Trump win and his rescue",
        "https://www.investing.com/members/230946628"
      ],
      [
        "Ken Roth",
        "2024-02-01 12:22:54",
        "So what…all russian military planes are free targets for ukraine.",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Mark Jannetty",
        "2024-02-01 12:36:02",
        "even when they are loaded with Ukrainian POW's? stop making a fool of yourself 🤡",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Ken Roth",
        "2024-02-01 14:02:12",
        "Who is the fool ? If you believe in russia who lies on a daily basis on everything no wonder you vote for Trump the biggest liar of them all. Russia has produced 0 evidence that the plane had POW more was more lilely filled with missiles.",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/russia-says-it-has-evidence-us-patriot-missiles-downed-its-military-transport-plane-3289782",
  "paragraph": "By Guy Faulconbridge MOSCOW (Reuters) -Russian investigators said on Thursday they had evidence showing that Ukraine's military shot down a Russian Il-76 military transport plane last week with U.S.-made Patriot surface-to-air missiles. The Russian Air Force Il-76 fell from the skies on Jan. 24. Russia said all 74 people on board, including 65 captured Ukrainian soldiers en route to be swapped for Russian prisoners of war, were killed, and blamed Kyiv for downing the plane. The investigators released footage of body parts which they said proved those aboard were Ukrainian military personnel. Kyiv, which is fighting Russian forces in Ukraine, has neither confirmed nor denied that it downed the plane, but has challenged details of Moscow's account and called for an international investigation. Russia's State Investigative Committee said in a statement that Ukrainian soldiers in the area of Lyptsi in the Kharkiv region had fired two missiles at the plane.  Among the fragments were serial numbers with English acronyms, including \"CONFIDENTIAL classified by PATRIOT SECURITY CLASSIFICATION GUIDE DATED: 9/22/83 ADDENDUM DATED 11/28/83 8/8/84 CONTRACT NO/DAAH01-86C-A018',\" the committee said in a statement. \"The fragments seized from the scene, according to their design features, geometric characteristics and available markings, are structural elements of the MIM-104A anti-aircraft guided missile of the Patriot complex of the United States, developed by Raytheon (NYSE:RTN) and Hughes corporations and manufactured by Raytheon,\" the committee said. It published a short video showing investigators inspecting some of the 116 missile fragments on the ground in an unspecified location. One of the fragments included the what appears to be \"ATRIOT\" in English.  A separate video from the Investigations Committee, which appeared to be taken at the crash site, showed officials putting what they said were body fragments into bags for evidence. It showed tattooed skin and said that, checked against DNA and identity records Russian authorities hold of Ukrainian prisoners of war, the investigation proved that those killed were Ukrainian soldiers. \nRussia said on Friday it had recovered Ukrainian identity documents and tattooed body parts from the crash site near the Ukrainian border. Ukraine did not immediately comment on the statement by the investigative committee."
}