{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0G0EA_L.jpg",
  "title": "Look beyond profit to heal 'lacerated world', pope tells Davos leaders",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 17, 2024 06:28AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/look-beyond-profit-to-heal-lacerated-world-pope-tells-davos-leaders-3276036",
  "paragraph": "© Reuters. FILE PHOTO: Pope Francis leads the Angelus prayer at the Vatican, January 7, 2024. Vatican Media/­Handout via REUTERS\nBy Philip Pullella VATICAN CITY (Reuters) - Pope Francis on Wednesday urged political, economic and business leaders at the World Economic Forum (WEF) in Davos to look beyond profit and try to heal an \"increasingly lacerated\" world with moral and ethical decisions. In his message to the world's movers and shakers meeting at the Swiss resort, Francis urged them to tackle the \"injustices that are at the root causes of conflict\", primarily hunger and the exploitation of natural resources for the benefit of the few. \"Sadly, as we look around, we find an increasingly lacerated world, in which millions of persons – men, women, fathers, mothers, children – whose faces are for the most part unknown to us, continue to suffer, not least from the effects of prolonged conflicts and actual wars,\" Francis, 87, wrote. Francis, who has made defence of the poor and immigrants one of the hallmarks of his 11-year-old papacy, said globalization must have a \"fundamentally moral dimension\" in economic, cultural and political discussions taking place at the WEF. States and businesses had to join together in promoting \"far-sighted and ethically sound\" models of globalization that place the common good over the \"pursuit of power and individual gain,\" he said. \"How is it possible that in today's world people are still dying of hunger, being exploited, condemned to illiteracy, lacking basic medical care, and left without shelter?\" he asked. The Argentine-born pope, the first from the Global South, said the world situation required that \"businesses themselves be increasingly guided not simply by the pursuit of fair profit, but also by high ethical standards\". \nThe \"widespread exploitation\" of male, female and child labourers with low wages and no real prospects for personal and professional development must stop, he said. \"It is my hope, then, that the participants in this year’s Forum will be mindful of the moral responsibility that each of us has in the fight against poverty, the attainment of an integral development for all our brothers and sisters, and the quest for a peaceful coexistence among peoples,\" he said."
}