{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0Q04Y_L.jpg",
  "title": "South Gaza battles rage as heavy rain hits displaced further north",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 27, 2024 06:00AM ET",
    "Updated Jan 27, 2024 06:36PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/south-gaza-battles-rage-as-heavy-rain-hits-displaced-people-further-north-3284816",
  "paragraph": "2/2\n© Reuters. Israeli soldiers ride in military vehicles near the Israel-Gaza border, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, in Israel, January 26, 2024. REUTERS/Alexandre Meneghini\n2/2\nBy Nidal al-Mughrabi and Fadi Shana DOHA/GAZA (Reuters) -Israel pressed ahead on Saturday with its campaign against Hamas in Gaza's Khan Younis area, while bad weather hit displaced Palestinians seeking refuge further north in the battered enclave.  Residents reported heavy aerial and tank fire across Khan Younis, a part of southern Gaza that has become the focus of Israel's ground offensive against Hamas, and around two main hospitals there.  Hamas said its fighters fired an anti-tank missile at an Israeli tank in southwest Khan Younis. The Israeli military said it killed at least 11 gunmen who were trying to plant explosives near troops and others firing rifles and rocket-propelled grenades at soldiers in Khan Younis. Over the past week, it added, commandos killed more than 100 militants and raided weapons warehouses. The Palestinian Islamic Jihad group, allied with Hamas, said its fighters were engaging Israeli forces in the area and had fired rockets into Israel.  The Gaza Health Ministry said Israeli strikes hit near the largest functioning medical facility in the south, Nasser Hospital, and Al-Amal Hospital, where one person was killed in the courtyard, according to the Palestinian Red Crescent Society.  The Israeli bombardment was compromising healthcare and endangering the lives of doctors, patients and displaced people, said ministry spokesman Ashraf Al-Qidra. The Israeli military says it is in contact with hospital directors and medical staff by phone and on the ground to make sure that they are running and accessible. Israel says Hamas operates in and around medical facilities, an allegation the group denies. In a ruling on Friday, the World Court stopped short of ordering a ceasefire but ordered Israel to prevent acts of genocide against Palestinians and do more to help civilians. Prime Minister Benjamin Netanyahu said afterwards that the war aimed at eliminating Hamas would continue. In the southern city of Rafah, Zainab Khalil, 57, displaced with her family several times until reaching shelter not far from the border with Egypt, said the International Court of Justice's ruling was important but not enough. \"We want a ceasefire now,\" she said. UNRWA PROBE Israel launched its air, sea and land offensive after militants from the Hamas group that rules Gaza stormed into Israel on Oct. 7, killing 1,200 people and abducting 253. Some 26,257 Palestinians have been killed and nearly 65,000 wounded so far, including 174 killed in the last 24 hours, Gaza health authorities said on Saturday. The majority of the enclave's 2.3 million population has been displaced. Israel says 220 soldiers have died since it launched its ground offensive. It says it has killed at least 9,000 Gaza militants so far, a figure that Hamas has dismissed.  Residents and Hamas militants reported fighting on Saturday in the central and northern parts of the enclave, where heavy rain flooded tents of those displaced, forcing some to seek alternative shelter in the middle of the night.  On Friday, the United Nations agency for Palestinian refugees (UNRWA) said it had opened an investigation into several employees suspected of involvement in the Oct. 7 Hamas attacks and that it had severed ties with those staff members. The Palestinian foreign ministry criticised what it described as an Israeli campaign against UNRWA, and Hamas condemned the termination of employee contracts \"based on information derived from the Zionist enemy\". In Rafah, where over half of Gaza's people are now taking cover in shelters and tents, the Gaza Health Ministry said an Israeli air strike killed three people in a house there. \nIt was not immediately clear who the casualties were and there was no immediate comment from the Israeli military.  In the occupied West Bank, one man was killed in an exchange of fire with Israeli forces near Jenin, residents said."
}