{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0D05T_L.jpg",
  "title": "Volcano erupts in Iceland, flowing lava reaches fishing town",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 14, 2024 07:50AM ET",
    "Updated Jan 14, 2024 06:01PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/volcano-erupts-in-iceland-posing-risk-to-fishing-town-3274100",
  "paragraph": "3/3\n© Reuters. A volcano spews lava and smoke as it erupts in Reykjanes Peninsula, Iceland, January 14, 2024. Iceland Civil Protection/Handout via REUTERS\n2/3\n(Reuters) -A volcano erupted in southwest Iceland on Sunday, with molten lava flows reaching the outskirts of a small fishing town by midafternoon, setting some houses alight, although the town was evacuated earlier and no people were in danger, authorities said. Fountains of molten rock and smoke spewed from fissures in the ground across a wide area stretching to the town of Grindavik, where at least one house had caught fire, live video published by daily Morgunbladid showed. \"No lives are in danger, although infrastructure may be under threat,\" Iceland's President Gudni Johannesson said on social media site X, adding there had been no interruptions to flights. The eruption began early on Sunday north of the town, which just hours before had been evacuated for the second time since November over fears that an outbreak was imminent amid a swarm of seismic activity, authorities said. Authorities built barriers of earth and rock in recent weeks to try to prevent lava from reaching Grindavik, some 40 km (25 miles) southwest of the capital Reykjavik, but the latest eruption have penetrated the town's defences. The nearby geothermal spa Blue Lagoon had closed on Sunday, it said on its website. VOLCANIC HOTSPOT It was the second volcanic eruption on the Reykjanes peninsula in southwest Iceland in less than one month and the fifth outbreak since 2021. Last month, an eruption started in the Svartsengi volcanic system on Dec. 18 following the complete evacuation a month earlier of Grindavik's 4,000 residents and the closing of the Blue Lagoon, a popular tourist spot. More than 100 Grindavik residents had returned in recent weeks, before Saturday's renewed evacuation order, according to local authorities. Iceland, which is roughly the size of the U.S. state of Kentucky, boasts more than 30 active volcanoes, making the north European island a prime destination for volcano tourism - a niche segment that attracts thousands of thrill seekers.  \nIn 2010, ash clouds from eruptions at the Eyafjallajokull volcano in the south of Iceland spread over large parts of Europe, grounding some 100,000 flights and forcing hundreds of Icelanders to evacuate their homes. Unlike Eyafjallajokull, the Reykjanes volcano systems are not trapped under glaciers and are thus not expected to cause similar ash clouds."
}