{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0A0V9_L.jpg",
  "title": "UK, US expected to launch strikes against Houthis 'within hours' -Times",
  "category": "World news",
  "publisher": "Investing.com",
  "date": [
    "Published Jan 11, 2024 04:18PM ET",
    "Updated Jan 11, 2024 06:45PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/uk-us-expected-to-launch-strikes-against-houthis--times-report-3272844",
  "paragraph": "2/2\n© Reuters. FILE PHOTO: British Prime Minister Rishi Sunak gestures as he talks to an audience at a PM Connect event at Accrington Stanley Football Club on January 8, 2024, in Accrington, Britain. Christopher Furlong/Pool via REUTERS\n2/2\nBy Sachin Ravikumar LONDON (Reuters) -Britain is expected to join the United States in conducting air strikes on military positions belonging to the Iran-backed Houthis in Yemen \"within hours\", the political editor for the Times newspaper reported on Thursday. British Prime Minister Rishi Sunak's Downing Street office did not respond to a request from Reuters for comment, while the Pentagon and the White House each declined to comment on the report. The U.S. typically does not comment on potential future military operations. \"The Houthis need to stop these attacks ... they will bear the consequences for any failure to do so,\" White House national security spokesperson John Kirby (NYSE:KEX) said on Thursday. Sunak briefed his cabinet of ministers on the imminent military intervention earlier on Thursday, the Times said. British media also reported that other political figures, including the leader of Britain's opposition Labour Party, Keir Starmer, as well as the speaker of the House of Commons, had been briefed by the government. Three residents of Yemen's Hodeidah told Reuters the city has been on alert since Thursday evening, with the heavy deployment of Houthi forces and movement of military trucks. Houthi military sites and camps in Hodeidah were also being evacuated, they said. Yemen's Iranian-backed Houthi militants have stepped up attacks on commercial vessels in the Red Sea in protest against Israel's war in Gaza. Various shipping lines have suspended operations, instead taking the longer journey around Africa. The U.S. military said the Houthis earlier on Thursday had staged their 27th attack on shipping since Nov. 19, firing an anti-ship ballistic missile into international shipping lanes in the Gulf of Aden. \nEarlier this week, U.S. and British naval forces shot down drones and missiles fired by the Houthis toward the southern Red Sea. The Houthis, who seized much of Yemen in a civil war, have vowed to attack ships linked to Israel or bound for Israeli ports. However, many of the targeted ships have had no links to Israel."
}