{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "Iraqi, Jordanian foreign ministers hold call after attack on U.S. outpost in Jordan",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 30, 2024 12:28PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/iraqi-jordanian-foreign-ministers-hold-call-after-attack-on-us-outpost-in-jordan-3287330",
  "paragraph": "(Reuters) - Iraqi Foreign Minister Fuad Hussein, in a phone call with his Jordanian counterpart on Tuesday, condemned an attack on a U.S. military outpost on Jordanian territory near the border with Syria, state media reported. Hussein and Ayman Safadi stressed the need to distance the two countries and the region from military threats by any side, Iraqi state media added. Iran-aligned groups have been waging attacks against Israeli and U.S. targets from Lebanon, Yemen, Iraq and Syria since the war between their Palestinian ally Hamas and Israel began on Oct. 7. The Islamic Resistance in Iraq, an umbrella organisation of hardline Iran-backed militant groups, on Sunday claimed attacks on three bases, including one on the border between far northeastern Jordan and eastern Syria. That attack killed three U.S. soldiers and wounded more than 40 troops. It was the first deadly strike against U.S. troops since the Israel-Hamas war erupted in October and marks a major escalation in tensions that have engulfed the Middle East. Iraq's government is backed by parties and militias close to Iran, though not directly by the hardline groups that have been firing on U.S. forces, Western and Iraqi officials say. Baghdad has condemned the attacks while also saying regional escalation would continue as long as the Gaza war went on. U.S. Defense Secretary Lloyd Austin vowed on Monday the U.S. would take \"all necessary actions\" to defend its troops after the deadly drone attack, even as President Joe Biden's administration stressed it was not seeking a war with Iran."
}