{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0O0K7_L.jpg",
  "title": "In Wisconsin, Biden talks $5 billion bridge, highway spending",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 25, 2024 09:15AM ET",
    "Updated Jan 25, 2024 02:36PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Mark Grube",
        "2024-01-31 01:56:03",
        "more debt",
        "https://www.investing.com/members/204635067"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/biden-heads-to-wisconsin-to-tout-5-billion-transportation-investment-3283081",
  "paragraph": "© Reuters. U.S. President Joe Biden speaks to United Auto Workers members at the UAW's Community Action Program (CAP) legislative conference in Washington, U.S., January 24, 2024. REUTERS/Leah Millis\nBy Jeff Mason and Trevor Hunnicutt SUPERIOR, Wisconsin (Reuters) -U.S. President Joe Biden is pushing $5 billion into transportation projects around the country during a visit Thursday to Wisconsin, hoping his cheery economic pitch takes root in a high-value state in the 2024 election. The visit highlights a $1 billion investment to replace the Blatnik Bridge in Superior, which connects Wisconsin and Minnesota and is vital to the region's its small business owners, the White House said. \"Economic growth is stronger than we had in the Trump administration,\" Biden said, adding that the economy has defied the expectations of both forecasters and his likely Republican opponent Donald Trump, who he said wanted the economy to tank. Biden has struggled to shake voters' concerns about elevated consumer prices, and polls show him lagging likely Republican challenger Donald Trump in the Nov. 5 presidential election. Democrats hope stronger-than-expected economic growth and improving consumer sentiment, coupled with trips to battleground states to highlight investment, will shift U.S. voters.  U.S. consumer sentiment hit the highest level in 2-1/2 years in January amid growing optimism over the outlook for inflation and household incomes, and suggesting Americans were finally warming up to the economy's resilience.  The U.S. economy has shrugged off dire recession predictions and grew at a faster-than-expected 3.3% annualized rate in the fourth quarter, new data showed on Thursday. Biden's campaign regards Wisconsin as one of the most important of seven states they've identified determining the 2024 election.  The campaign hired Garren Randolph, a longtime strategist in the state, as a campaign manager there last month. It has named five new senior aides since then, as it switches into general-election mode against Trump. In Wisconsin, Biden is meeting with a local small business owner whose operation will benefit from rebuilding the deteriorating bridge, which was due to close by 2030, the White House said. \nThe $5 billion investment will support 37 projects overall, including the Interstate 5 bridge over the Columbia River between Vancouver, Washington, and Portland, Oregon; the I-376 corridor of Pittsburgh; the Cross Bronx Expressway in New York City; and part of a highway through the Gila River Indian Community in Arizona, the White House said. The signature infrastructure law is part of Biden's \"investing in America\" agenda that the White House credits with a surge in clean-energy and manufacturing jobs."
}