{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK110J9_L.jpg",
  "title": "Satellite images show 30% of Gaza destroyed, UN centre says",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 02, 2024 10:35AM ET",
    "Updated Feb 02, 2024 10:42AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/satellite-images-show-30-of-gaza-destroyed-un-centre-says-3291542",
  "paragraph": "© Reuters. Palestinians gather at the site of an Israeli strike on a house, as the conflict between Israel and the Palestinian Islamist group Hamas continues, in Rafah in the southern Gaza Strip, December 19, 2023. REUTERS/Shadi Tabatibi/File Photo\nGENEVA (Reuters) - Satellite imagery analysed by the United Nations Satellite Centre shows that 30% of Gaza Strip's buildings have been destroyed or damaged in the Israel offensive in the densely populated Palestinian enclave. Israel's assault, launched in response to attacks by Hamas militants in southern Israel on Oct. 7, has killed more than 27,000 Palestinians, according to health authorities in the Hamas-run territory. Air strikes, shelling and demolitions have razed entire city districts, including much civilian infrastructure. \"In total, a staggering 69,147 structures, equivalent to approximately 30% of the Gaza Strip's total structures, are affected,\" the United Nations Satellite Centre, UNOSAT, said.  It said 22,131 structures in the enclave have been identified as destroyed, with an additional 14,066 deemed severely damaged and 32,950 having sustained moderate damage.  UNOSAT used satellite imagery from Jan. 6-7, which it compared with six other sets of images, including some dating from before the Israeli offensive.  UNOSAT said that the regions of Gaza City and Khan Younis had experienced the most significant increase in damage since the previous analysis.  The two areas have seen 10,280 and 11,894 newly damaged structures respectively, compared with UNOSAT's previous analysis based on images from Nov. 26. \nUNOSAT's analysis also showed that an estimated 93,800 housing units have been damaged in the Gaza Strip. About 1,200 people were killed in the Hamas raid on Israel that triggered the offensive."
}