{
  "image": "https://i-invdn-com.investing.com/news/LYNXMPED3P0U2_L.jpg",
  "title": "Boeing 737MAX in India cleared after inspections, one washer found missing",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 09, 2024 04:36AM ET",
    "Updated Jan 09, 2024 05:06AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/boeing-737max-in-india-cleared-after-inspections-one-washer-found-missing-93CH-3269992",
  "paragraph": "NEW DELHI - In a recent oversight by India's aviation regulator, the Directorate General of Civil Aviation (DGCA), a fleet of Boeing (NYSE:BA) 737MAX airplanes operated by Akasa Air, Spicejet, and Air India Express has been cleared for service after a thorough inspection. The checks were prompted by an advisory issued by Boeing, recommending a one-time inspection before January 10.\nDuring the inspections, a missing washer was discovered in the Aft Rudder Quadrant of one aircraft. The DGCA, which supervised the inspection process, confirmed that the rest of the fleet showed no issues. Following the discovery, the affected aircraft was promptly repaired to comply with the service resumption deadline.\nThe inspections were part of a proactive measure following an incident involving an Alaska Airlines jet that underwent rapid decompression from a mid-cabin door plug detachment leading to an emergency landing. All B737-8 Max planes have also passed flight safety checks on their emergency exits after this event.\nThe DGCA's swift action to enforce Boeing's advisory and the subsequent confirmation of the fleet's airworthiness reflects a commitment to maintaining stringent safety standards in India's aviation sector. The quick identification and rectification of the single issue found ensures that the Boeing 737MAX planes continue to operate safely within the country.\nIn response to DGCA's safety inspection that discovered a missing washer in one out of India's fleet of Boeing 737 Max airplanes shared among Akasa Air (22), SpiceJet (9), and Air India Express (9), Boeing has taken further action today. They mandated urgent global checks on its entire fleet of over 1,300 jets. This action comes after historical safety issues that led to a significant 20-month grounding period for the model.\nThis article was generated with the support of AI and reviewed by an editor. For more information see our T&C."
}