{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0K05Z_L.jpg",
  "title": "UN's Guterres condemns Israel for 'heartbreaking' killings in Gaza",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 21, 2024 05:43AM ET",
  "comments": [
    2,
    [
      [
        "Ken Roth",
        "2024-01-22 11:51:01",
        "What about the heartbreaking kill.ing in ukraine of Russia.",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Tom Saltzman",
        "2024-01-21 10:58:22",
        "They love K each other, It's what they live for. Violence in the name of their God. I could not care less. K away.",
        "https://www.investing.com/members/200520915"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/uns-guterres-condemns-israel-for-heartbreaking-killings-in-gaza-3278934",
  "paragraph": "© Reuters. UN Secretary-General Antonio Guterres attends the 54th annual meeting of the World Economic Forum in Davos, Switzerland, January 17, 2024. REUTERS/Denis Balibouse/File photo\nBy Elias Biryabarema KAMPALA (Reuters) - United Nations Secretary-General António Guterres on Sunday denounced Israel for the \"heartbreaking\" deaths of Palestinian civilians in Gaza and called it unacceptable to resist statehood for the Palestinian people. \"Israel's military operations have spread mass destruction and killed civilians on a scale unprecedented during my time as secretary-general,\" Guterres said at the opening of a summit of the G77+China in the Ugandan capital Kampala. \"This is heartbreaking and utterly unacceptable. The Middle East is a tinder-box, we must do all we can to prevent conflict from igniting across the region.\" Israel launched its offensive in Gaza after the Islamist militant group Hamas' Oct. 7 attack in which Israeli officials say more than 1,200 Israelis and foreigners were killed and 240 taken hostage.  Israel's campaign has killed more than 25,000 Palestinians, according to Gaza health authorities on Sunday, and displaced most of the enclave's 2.3 million people from their homes. Over the course of the war, the Israeli military has expressed regret for civilian deaths but it accuses Hamas of operating in densely populated areas and using civilians as human shields, a charge the group denies. Guterres added that the refusal to accept the two-state solution for Israelis and Palestinians is totally unacceptable, saying denying Palestinians the right to statehood \"would indefinitely prolong a conflict that has become a major threat to global peace and security\". Israeli Prime Minister Benjamin Netanyahu appeared on Saturday to push back against U.S. President Joe Biden's remarks about Palestinian statehood after the war against Hamas ends. His office said that in talks on Friday with Biden, Netanyahu \"reiterated his policy that after Hamas is destroyed Israel must retain security control over Gaza to ensure that Gaza will no longer pose a threat to Israel, a requirement that contradicts the demand for Palestinian sovereignty\". Guterres was in Kampala to attend the summits of G77+China and the Non-Aligned Movement (NAM). Leaders and senior officials from dozens of countries including South Africa, Iran, China, Turkey, Cuba, India, Vietnam and others attended the meetings.  \nThe G77+China is a group of 134 developing countries that champions the common interests of countries from the global south. A document released late Saturday at the end of the NAM summit included a condemnation of \"the illegal Israeli military aggression on the Gaza Strip, the indiscriminate attacks against Palestinian civilians, civilian objects, the forced displacement of the Palestinian population\" and called for an immediate and durable humanitarian ceasefire."
}