{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0M0QT_L.jpg",
  "title": "Venezuela opposition presidential candidate announces alliance, seeks election date",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 23, 2024 02:58PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/venezuela-opposition-presidential-candidate-announces-alliance-seeks-election-date-3280965",
  "paragraph": "© Reuters. FILE PHOTO: Venezuelan opposition leader Maria Corina Machado arrives after a news conference held by the national coordinator of Venezuela's opposition party Vente, in Caracas, Venezuela January 17, 2024. REUTERS/Leonardo Fernandez Viloria\nBy Mayela Armas CARACAS (Reuters) - Venezuelan opposition candidate Maria Corina Machado on Tuesday announced an alliance with political parties and civil society organizations that will help organize her campaign to challenge President Nicolas Maduro, and she called for an exact date for the elections. Machado is currently barred from holding public office by Venezuela's comptroller general. Calling the ban unfair, Machado has appealed the decision but the Supreme Court has yet to decide. The campaign has not formally begun, and Maduro has yet to officially announce a bid for re-election. But Venezuela's political opposition is beginning to mobilize. \"We're going to reach every last village (...) we're already building governability,\" Machado told hundreds of people at an event in Caracas. The event was moved from its original location to avoid clashing with a march organized by Venezuela's ruling party to commemorate the overthrow of the country's 1958 dictatorship. Machado has asked civil society groups to rally their campaigners ahead of the elections, so they can join a network to monitor the electoral process, she said. Machado called on authorities to reveal the exact date of the presidential elections. An agreement between the opposition and Maduro's government, signed in Barbados in 2023, said elections would take place in the second half of the year. \"No one will remove us from this electoral route. We, the people, are going to force him (Maduro) to measure himself. Set the date for the electoral process once and for all, leave the fear behind,\" she said. \nFollowing the agreement, the U.S. temporarily eased oil sanctions, adding the move was dependent on Caracas lifting bans on opponents holding public office and releasing political prisoners and \"unjustly detained\" Americans. In late 2023, U.SA. President Joe Biden granted a pardon to Colombian businessman Alex Saab, an ally of Maduro, in a deal in exchange for the release of 10 Americans and at least 20 Venezuelans linked to the opposition.  (Report by Mayela Armas. Edited by Deisy Buitrago and David Gregorio)"
}