{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK1701U_L.jpg",
  "title": "Oil rises on Gaza ceasefire rejection and U.S. stock data",
  "category": "Commodities news",
  "publisher": "Investing.com",
  "date": [
    "Published Feb 07, 2024 08:39PM ET",
    "Updated Feb 08, 2024 07:52AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Gary Offill",
        "2024-02-08 03:57:14",
        "talking has nothing to do with oil ",
        "https://www.investing.com/members/204136589"
      ],
      [
        "stephen kariuki",
        "2024-02-08 06:10:33",
        "yes also gold is selling off with weaker dollar",
        "https://www.investing.com/members/230616301"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/commodities-news/oil-edges-up-with-slim-progress-in-gaza-peace-talks-3296537",
  "paragraph": "By Robert Harvey LONDON (Reuters) -Oil prices gained ground on Thursday as investors considered the impact of Israel's rejection of a ceasefire offer from Hamas and unexpected drops in U.S. fuel stocks.  Brent crude futures rose 81 cents, or 1.02%, to $80.02 a barrel by 1239 GMT. U.S. West Texas Intermediate crude futures were up 72 cents, or 0.97%, at $74.58. The Brent benchmark breached $80 a barrel for the first time since Feb. 1 as it extended three straight sessions of gains. \"The recent strength is the result of the Israeli reply to the counter offer from Hamas to the original peace plan, which ensures that hostilities in the Red Sea will continue unabated,\" said PVM analyst Tamas Varga. Israeli Prime Minister Benjamin Netanyahu rejected the latest Hamas ceasefire offer and return of hostages held in the Gaza Strip, but U.S. Secretary of State Antony Blinken said there was still room for negotiation. Diplomatic efforts continue, with a Hamas delegation arriving in Cairo on Thursday for ceasefire talks with mediators Egypt and Qatar. Jordan's King Abdullah, meanwhile, will meet U.S. President Joe Biden to lobby for an end to the war. Wider Middle East tensions have kept the market on edge since October, with limited progress in talks to end the Gaza conflict.  The Israeli military intensified strikes against the southern border city of Rafah on Thursday, where more than half of Gaza's population is sheltering.  A stronger than expected drawdown in U.S. gasoline and middle-distillate stocks also buoyed the oil market. Distillate stockpiles fell by 3.2 million barrels to 127.6 million barrels, Energy Information Administration data showed, versus expectations for a 1 million barrel drop. Gasoline stocks fell by 3.15 million barrels, compared with analyst forecasts of a build of 140,000 barrels. The draw in fuel stocks, combined with a rise in crude stocks, was a sign of U.S. refinery maintenance, Varga said. \"Ongoing U.S. refinery maintenance, together with Europe being short on diesel, can help maintain the positive sentiment for now,\" he added. \nElsewhere, Norway's Johan Sverdrup oilfield - the largest in the North Sea - will maintain steady production at 755,000 barrels per day (bpd) for the rest of this year, Aker BP (NYSE:BP) said. The field has been overproducing compared with originally planned capacity of 660,000 bpd since last year."
}