{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0B0L6_L.jpg",
  "title": "Exclusive-Ukraine needs more attack aircraft for war effort - ground forces commander",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 12, 2024 10:23AM ET",
    "Updated Jan 12, 2024 10:46AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/exclusiveukraine-needs-more-attack-aircraft-for-war-effort--ground-forces-commander-3273625",
  "paragraph": "4/4\n© Reuters. Colonel general Oleksandr Syrskyi, Commander of the Ukrainian Ground Forces, arrives for an interview with Reuters, amid Russia's attack on Ukraine, in Kharkiv region, Ukraine January 12, 2024. REUTERS/Valentyn Ogirenko\n2/4\nBy Dan Peleschuk KHARKIV REGION, Ukraine (Reuters) - Ukraine's ground forces commander said on Friday that Kyiv needed more military aircraft for its war effort, such as U.S. A-10 attack jets to support infantry and planes that could fire long-range cruise missiles. Colonel-General Oleksandr Syrskyi spoke to Reuters in an exclusive interview at an undisclosed location in the northeastern region of Kharkiv that borders western Russia. \"I would talk about A-10s as an option if they'll be given to us ... this is not a new machine, but a reliable one that has proven itself in many wars, and which has a wide array of weapons for destroying land targets to help the infantry,\" said the 58-year-old, wearing combat fatigues. The A-10 Thunderbolt is a subsonic attack aircraft produced in the United States that has been in service since the 1970s.  Syrskyi's call for more aircraft comes as a major new U.S. package of military aid for Kyiv has been held up by infighting among lawmakers. Syrskyi said the A-10 would provide crucial support for ground forces as they attempt to seize the initiative against a well-resourced enemy. \"It is for destroying land-based targets: tanks, artillery ... everything that counters the infantry,\" he said. Sirskyi added that attack helicopters such as the AH-64 Apache and AH-1 Super Cobra, as well as the UH-60 Black Hawk, could also play an important role. Since Russia's full-scale invasion of Ukraine began in February, 2022, Kyiv has pressed Western allies to supply increasingly sophisticated arms and ammunition, including armoured vehicles, tanks, long-range missiles and F-16 fighters. The first F-16 jets are expected to arrive in Ukraine later in 2024, although their impact on the war could be limited by the strength of Russia's air force. STILL 'CHANCES' FOR BREAKTHROUGH Ukraine conducted a major counteroffensive last summer that failed to achieve a major breakthrough, partly because Russian forces in the east and south of the country had dug in with trenches and other defensive lines. Moscow's forces are now back on the offensive in some parts of the east, where Syrskyi said fighting remained fierce. He added that Russian forces were continually attacking in several parts of the front, with Ukrainian forces conducting small counterattacks. \"This is active defence when we are not just sitting on the defensive but constantly counterattacking, and in some directions switching to the offensive,\" he said. \"And the enemy knows this.\" As well as calls for more aircraft, Ukraine has asked allies to speed up the supply of artillery ammunition, which some units have complained is running short. While drones are increasingly influential on the battlefield, artillery is a mainstay for both armies, and Ukraine is having to balance its use of various calibre shells based on the available supply. \"We have developed an expertise with this and adjust to our daily realities,\" said Syrskyi. Despite near-stalemate along a frontline some 1,000 km (620 miles) long, Syrskyi, who oversaw the defence of Kyiv in early 2022 and Ukraine's lightning counteroffensive in the Kharkiv region later that year, said future breakthroughs were still possible. \nAsked if there could be a turning point in the war in Ukraine's favour, he said: \"I think there are always chances. You just need to find them and use them.\" He added that it was \"impossible\" for Russia to have built robust defences everywhere, and that there were always weak spots because of the landscape and other factors."
}