{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0D0EQ_L.jpg",
  "title": "Explainer-What are solid-fuel missiles, and why is North Korea developing them?",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 14, 2024 05:57PM ET",
    "Updated Jan 14, 2024 06:45PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/what-are-solidfuel-missiles-and-why-is-north-korea-developing-them-3274167",
  "paragraph": "© Reuters. Ballistic missile, said to be solid-fuel and hypersonic, launches during a test at an unspecified location in North Korea in this picture released by the Korean Central News Agency on January 14, 2024. KCNA via REUTERS\nBy Hyonhee Shin SEOUL (Reuters) -North Korea test-fired what it says was a new intermediate-range ballistic missile (IRBM) on Sunday, in what would be its first such missile powered by solid fuel designed boost capabilities for launching with little preparation. The new missile was also equipped with a hypersonic manoeuvrable controlled warhead, state media said. The launch comes after the nuclear-armed North said it had tested solid-fuel engines for an upcoming new-type IRBM in November, and conducted at least three tests last year of its new solid-fuel Hwasong-18 intercontinental ballistic missile (ICBM). Here are some characteristics of solid-fuel technology, and how it can help the North improve its missile systems. WHAT ARE SOME ADVANTAGES OF SOLID FUEL? Solid-fuel missiles do not need to be fuelled immediately ahead of launch, are often easier and safer to operate, and require less logistical support, making them harder to detect and more survivable than liquid-fuel weapons. \"These capabilities are much more responsive in a time of crisis,\" said Ankit Panda, a senior fellow at the U.S.-based Carnegie Endowment for International Peace. WHAT IS SOLID-FUEL TECHNOLOGY? Solid propellants are a mixture of fuel and oxidiser. Metallic powders such as aluminium often serve as the fuel, and ammonium perchlorate, which is the salt of perchloric acid and ammonia, is the most common oxidiser. The fuel and oxidiser are bound together by a hard rubbery material and packed into a metal casing. When solid propellant burns, oxygen from the ammonium perchlorate combines with aluminium to generate enormous amounts of energy and temperatures of more than 5,000 degrees Fahrenheit (2,760 degrees Celsius), creating thrust and lifting the missile from the launch pad. WHO HAS THAT TECHNOLOGY? Solid fuel dates back to fireworks developed by the Chinese centuries ago, but made dramatic progress in the mid-20th century, when the U.S. developed more powerful propellants. North Korea uses solid fuel in a range of small, shorter-range ballistic missiles. The Soviet Union fielded its first solid-fuel ICBM, the RT-2, in the early 1970s, followed by France's development of its S3, also known as SSBS, a medium-range ballistic missile. China started testing solid-fuel ICBMs in the late 1990s. South Korea has also said it has secured \"efficient and advanced\" solid-propellant ballistic missile technology, though in much smaller rockets so far. SOLID VS LIQUID Liquid propellants provide greater propulsive thrust and power, but require more complex technology and extra weight. Solid fuel is dense and burns quite quickly, generating thrust over a short time. Solid fuel can remain in storage for an extended period without degrading or breaking down - a common issue with liquid fuel. \nNorth Korea said the development of its new solid-fuel ICBM, the Hwasong-18, would \"radically promote\" its nuclear counterattack capability. After the first launch South Korea's defence ministry sought to downplay the testing, saying the North would need \"extra time and effort\" to master the technology."
}