{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK1203K_L.jpg",
  "title": "India to replace troops in Maldives with civilians by May",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 03, 2024 08:05AM ET",
    "Updated Feb 03, 2024 08:11AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/india-to-replace-troops-in-maldives-with-civilians-by-may-3291892",
  "paragraph": "© Reuters. FILE PHOTO: President of the Maldives Mohamed Muizzu delivers a national statement at the World Climate Action Summit during the United Nations Climate Change Conference (COP28) in Dubai, United Arab Emirates, December 1, 2023. REUTERS/Amr Alfiky/File Pho\nBy Krishn Kaushik and Mohamed Junayd NEW DELHI/MALE (Reuters) - India will remove its troops in the Maldives by May, the Maldivian Foreign Ministry said on Saturday, as the two countries seek agreement on a pullout that has strained ties. The roughly 80 soldiers stationed in the Indian Ocean archipelago will be replaced by civilians, officials from both countries said. As global powers jostle for influence in the Indo-Pacific region, India and China have wooed the Maldives, which has traditionally been close to neighbour India. New Delhi's ties with Male have under strain since Mohamed Muizzu was elected president of the Maldives last year, pledging to end the country's \"India First\" policy. He has called for the withdrawal by March 15 of the troops stationed to provide support for military equipment given to the Maldives by New Delhi and assist in humanitarian activities in the region. The first set of Indian troops will leave by March 10 and the rest by May 10, the Maldives said, citing an agreement reached at a high-level meeting in the Indian capital on a range of issues concerning bilateral cooperation. India's foreign ministry said the two countries \"agreed on a set of mutually workable solutions to enable continued operation of Indian aviation platforms\" that provide humanitarian services to Maldives. The ministry did not immediately respond to a request for comment on the troop pullout, and its statement did not mention a timeframe. India says the soldiers, who include a dozen medical personnel, provide help with humanitarian aid and medical evacuations for the residents of the country's remote islands. \nNew Delhi has given Male two helicopters and a Dornier aircraft, which are mostly used for marine surveillance, search and rescue operations and medical evacuations. The Indian troops manage those operations. The next bilateral meeting will be in Male in the last week of February, the Maldives foreign ministry said."
}