{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0I0FK_L.jpg",
  "title": "France could face nationwide farmer protests as anger mounts",
  "category": "Commodities news",
  "publisher": "Reuters",
  "date": "Published Jan 19, 2024 08:04AM ET",
  "comments": [
    1,
    [
      [
        "tolomey widdle",
        "2024-01-19 13:31:09",
        "the global reaction against Marxism takes hold. ",
        "https://www.investing.com/members/212413843"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/commodities-news/france-could-face-nationwide-farmer-protests-as-anger-mounts-3278258",
  "paragraph": "PARIS (Reuters) - France's largest farm union FNSEA is considering nationwide protests in the coming weeks, a spokesperson said on Friday, potentially expanding action by farmers in the southwest who have blocked a highway and dumped manure on public buildings. Like their German counterparts who held a massive demonstration over the weekend with tractors rumbling towards Berlin from every corner of the country, French farmers are mainly protesting against taxes and regulation.  The FSNEA will decide whether to organise nationwide action next Thursday after meeting local branch representatives and different farm sectors, the spokesperson said. Hundreds of tractors and farmers from across southwest France have been protesting in the southwestern city of Toulouse this week, causing traffic jams. On Friday they blocked the highway linking Toulouse to the Atlantic cost with a wall of hay. Farmers cite a government tax on tractor fuel, cheap imports, water storage issues, excessive restrictions and red tape among their grievances. FNSEA farmers have been turning around road signs at the entrance of towns and villages across the country - in 12,000 districts out of a total of 36,000 - to express their discontent in a campaign called \"We are walking on our heads\". The protests in the European Union's biggest agricultural producer come at a time when President Emmanuel Macron is wary of farmers' growing support for the far-right ahead of the European Parliament elections in June. \nMacron told his cabinet this week to pay careful attention to potential flashpoints for rural workers, to try to avoid further demonstrations and another flare-up of the so-called Yellow (OTC:YELLQ) Vest protest movement, a minister told Politico.  In a sign of growing farmer anger in the EU, hundreds of Romanian farmers have also held protests this week."
}