{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK01013_L.jpg",
  "title": "South Korea opposition chief stabbed in neck, recovering after surgery",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 02, 2024 02:05AM ET",
    "Updated Jan 02, 2024 03:29PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Charles Manson",
        "2024-01-02 14:47:38",
        "Yea ... Having lived in South Korea, those folks can get real rowdy after a few bottles of Soju.",
        "https://www.investing.com/members/249519852"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/south-korea-opposition-chief-stabbed-by-assailant-motive-unknown-3265230",
  "paragraph": "3/3\n© Reuters. South Korea's opposition party leader Lee Jae-myung falls after being attacked by an unidentified man during his visit to Busan, South Korea, January 2, 2024. Yonhap via REUTERS\n2/3\nBy Ju-min Park and Hyonhee Shin SEOUL (Reuters) -South Korean opposition Democratic Party leader Lee Jae-myung was stabbed in the neck on Tuesday by a man who lunged at him with a knife after asking for his autograph, officials said. Lee, 59, was rushed to hospital, where he underwent surgery to repair a major blood vessel, and was later recovering and conscious in an intensive care unit, party spokesperson Kwon Chil-seung told reporters. Kwon condemned the attack, weeks before a parliamentary election that is due in April, as \"political terror\".  Lee, who narrowly lost the 2022 presidential election and is on trial on bribery charges he denies, was attacked in the southern city of Busan while touring the site of a proposed new airport and speaking to journalists and supporters. The suspect, wearing a paper crown with Lee's name on it, approached Lee, asked for an autograph and then lunged forward and stabbed him in the neck, video footage showed. Lee grimaced, staggered back into the crowd behind him and collapsed. Photographs showed him on the ground with his eyes closed and bleeding, and a handkerchief being held against his neck. Lee was airlifted to the capital Seoul after receiving emergency treatment in Busan, and had two hours of surgery at the Seoul National University Hospital. The assailant was quickly subdued by party officials and police officers, the video footage showed.  A Busan police official, Son Je-han, said the assailant was born in 1957 and used an 18-cm (seven-inch)knife that had been bought online. He did not identify the suspect and said the motive was being investigated. \"This type of violence must never be tolerated under any circumstances,\" President Yoon Suk Yeol was quoted as saying by his office. HISTORY OF POLITICAL VIOLENCE  Lee, a former governor of Gyeonggi province, lost to conservative Yoon, a former chief prosecutor, in the 2022 election. He has led the main opposition party since August 2022. Lee faces bribery allegations stemming from a development project when he was mayor of Seongnam near Seoul but denies wrongdoing. South Korea has a history of political violence despite tough restrictions on gun possession. Political leaders are not usually under close security protection.  \nLee's predecessor, Song Young-gil, was hurt in 2022 by an assailant who swung a blunt object against his head.  Then conservative opposition party leader Park Geun-hye, who later served as president, was slashed in the face in 2006. Her father, Park Chung-hee, who was president for 16 years, was shot and killed by his spy chief in 1979 at a drunken private dinner."
}