{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK03095_L.jpg",
  "title": "Islamic State claims responsibility for deadly Iran attack, Tehran vows revenge",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 04, 2024 05:23AM ET",
    "Updated Jan 04, 2024 05:16PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Nehl Kevin Pandi",
        "2024-01-04 22:06:25",
        "If I understand it correctly, the attacks came from their Muslim brothers but they want to get revenge towards US and Israel?\nAs if they hurt themselves yet they blame US and Israel about it?",
        "https://www.investing.com/members/246464965"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/iran-vows-revenge-after-biggest-attack-since-1979-revolution-3266966",
  "paragraph": "3/3\n© Reuters. People gather at the scene of explosions during a ceremony held to mark the death of late Iranian General Qassem Soleimani, in Kerman, Iran, January 3, 2024. WANA (West Asia News Agency) via REUTERS\n2/3\nBy Parisa Hafezi, Elwely Elwelly and Clauda Tanios DUBAI (Reuters) -Islamic State claimed responsibility on Thursday for two explosions in Iran that killed nearly 100 people and wounded scores at a memorial for top commander Qassem Soleimani.  In a statement posted on its affiliate Telegram channels, the militant Sunni Muslim group said two IS members had detonated explosive belts in the crowd that had gathered at the cemetery in the southeastern Iranian city of Kerman on Wednesday. The memorial was marking the fourth anniversary of the death of Soleimani, who was assassinated in Iraq in 2020 by a U.S. drone. In Washington, White House spokesman John Kirby (NYSE:KEX) told reporters the United States was in no position to doubt Islamic State's claim that it was responsible for Wednesday's attack. Tehran has vowed revenge for the bloodiest such attack since the 1979 Islamic Revolution. The twin blasts also wounded 284 people, including children. \"A very strong retaliation will be meted out to them by the hands of the soldiers of Soleimani,\" Iran's First Vice President Mohammad Mokhber told reporters in Kerman. Iranian authorities have called for mass protests on Friday, when the funerals of the victims of the twin blasts will be held, state media reported. Iran's powerful Revolutionary Guard Corps described the attacks as a cowardly act \"aimed at creating insecurity and seeking revenge against the nation's deep love and devotion to the Islamic Republic\". Iranian President Ebrahim Raisi has condemned what he called Wednesday's \"heinous and inhumane crime\". Iran's top authority, Supreme Leader Ayatollah Khamenei, vowed revenge for the bombings. The United Nations Security Council in a statement condemned what it called Wednesday's \"cowardly terrorist attack\" and sent its condolences to the victims' families and the Iranian government.  ISLAMIC STATE More details about the authors of the attack and their motives could not be immediately established. But Aaron Zelin, an expert with the Washington Institute for Near East Policy thinktank, said he would not be surprised if the attack was mounted by the Islamic State branch based in neighbouring Afghanistan, known as ISIS-Khorasan, or ISIS-K. Tehran, he said, has alleged that ISIS-K has been behind many foiled plots in the last five years. Most of those arrested were Iranians, Central Asians, or Afghans from the Afghanistan-based affiliate's network rather than from the group's Iraq and Syria network. ISIS, he said, harbours a virulent hatred for Shiites - Iran's dominant sect and often the target of attacks by the group in Afghanistan – who it views as apostates, and for years has made threats against Tehran. A Taliban crackdown has weakened ISIS-K inside Afghanistan, forcing some members to move to neighbouring states, but the group has continued plotting operations outside the country, according to U.S. officials. \"ISIS-Khorasan's increased external focus is probably the most concerning development,\" said a U.S. National Counterterrorism Center report published in August in CTC Sentinel, a publication of the Combating Terrorism Center at West Point.  In 2022 Islamic State claimed responsibility for a deadly attack on a Shi'ite shrine in Iran that killed 15 people, while earlier attacks claimed by Islamic State include twin bombings in 2017 that targeted Iran's parliament and the tomb of the Islamic Republic's founder, Ayatollah Ruhollah Khomeini. The attack coincides with a three-month outbreak of fresh hostilities between Israel and Gaza, and Iranian state TV earlier showed crowds gathered at cities across Iran, including Kerman, chanting: \"Death to Israel\" and \"Death to America\". The United States denied on Wednesday any involvement in the explosions and said it also had no reason to believe Israel was involved. It said the blasts appeared to represent \"a terrorist attack\" of the type carried out in the past by Islamic State. Tehran often accuses its arch enemies, Israel and the United States, of backing anti-Iran militant groups that have carried out attacks in the past. Baluchi militants and ethnic Arab separatists have also staged attacks in Iran.  \nThe U.S. assassination of Soleimani in a Jan. 3, 2020, drone attack at Baghdad airport, and Tehran's retaliation - by attacking two Iraqi military bases that house U.S. troops - brought the United States and Iran close to full-blown conflict. As chief commander of the elite Quds force, the overseas arm of Iran's Revolutionary Guard Corps, Soleimani ran clandestine operations abroad and was a key figure in Iran's longstanding campaign to drive U.S. forces from the Middle East."
}