{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBS01Q_L.jpg",
  "title": "India's far-right cow vigilantes bolster clout before high-stake elections",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 28, 2023 09:04PM ET",
    "Updated Dec 29, 2023 03:41AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/indias-farright-cow-vigilantes-bolster-clout-before-highstake-elections-3264533",
  "paragraph": "4/4\n© Reuters. Vishnu Dabad, 30, a Gau Rakshak or a cow protector and politician with the regional political party Jannayak Janta Party(JJP), speaks on his mobile phone at a cow shelter, run by him for injured and sick cows, in Chamdhera village, Haryana, India, Novembe\n2/4\nBy Rupam Jain CHAMDHERA, India (Reuters) - Vishnu Dabad attributes his rise from poverty to powerful local politician to an animal: the cow. The 30-year-old is one of many Gau Rakshaks, or cow protectors: activists who have taken Indian laws banning cattle slaughter and beef consumption into their own hands since Prime Minister Narendra Modi came to power in 2014 at the head of the Hindu nationalist Bharatiya Janata Party (BJP). Scores of cow protectors in recent years have been accused of using violence to carry out extra-judicial activities, often finding themselves at odds with law enforcement, even as many won acclaim for defending the Hindu faith. Now some of these operatives are transferring their clout into grassroots political power, where they are pursuing a hardline majoritarian agenda, according to interviews with more than 90 activist-vigilantes, as well as senior leaders of the BJP and other parties, government officials and political analysts. They described how cow vigilantism has become a finishing school for the young men who mobilise large groups against alleged cattle smugglers and used the resulting popularity to catapult into politics. Many are now campaigning and preparing for elections in 2024 that the BJP and allied right-wing parties are favoured to do well in. Forty-one of the cow protectors who spoke to Reuters have been elected to positions such as village chief, town council member or local legislator in the past six years, roles that can involve governing tens of thousands of people. Another 12 said they were lobbying their family members to seek local office. \"All of what you see: my success, my existence is only because cows have blessed me,\" said Dabad, who started a cow protection force in 2014 and was elected as village chief in 2016. He is now a full-time political campaigner in the northern state of Haryana for a party allied with the BJP, and is keen to seek higher office. Ancient Hindu religious texts praise cows, who are regarded as deities, for their nurturing ability. But India's minority Muslims and Christians, as well as some Hindus, consume beef as part of their diet, generating some sectarian tensions. There is no publicly available official estimate on the number of cow activists nationwide, but activist leaders said they believe more than 300,000 Hindu men in the nation of 1.4 billion are directly involved with their groups.  India's interior ministry, which oversees national law enforcement, did not return a request for comment on that figure or the role of cow activists.  Reuters previously reported that some of them have stopped cow traders - many of them Muslim men - with deadly force, according to prosecutors, witnesses and the families of victims. Some states have enacted laws enabling cow vigilantes to patrol alongside police. While government data does not distinguish general violence from cow-related lynching, Human Rights Watch found that at least 44 people - 36 of them Muslims - were killed in cow-related violence between May 2015 and December 2018. The independent, New Delhi-based Documentation of the Oppressed database found 206 acts of cow-related violence involving 850 victims, mainly Muslims, between July 2014 and August 2022. The proximity of cow activists to power has raised concerns among many Muslims, who allege that some BJP members and their affiliates have engaged in anti-Islam hate speech and violence.  Modi and the BJP have denied that religious discrimination exists in India. Cow protectors \"are very powerful men…and there is a climate of fear,\" said Jaan Mohammed, a Muslim man whose brother was one of the first victims of a cow-related lynching after Modi took power. \"I don't think this can ever change now.\" Legal proceedings are pending. Seventeen men accused of involvement in his brother's 2015 killing were released on bail, and another suspect later died. Police at the time of the slaying said the alleged perpetrators behaved as if they had a \"licence to kill.\" Modi has repeatedly criticized activists who engage in \"criminal\" violence, even as his party courts their support. Giriraj Singh, a BJP minister responsible for rural development, said his party welcomed anyone who wanted to \"genuinely serve the cows\". \"Anyone who saves mother cow must be respected and recognised,\" he told Reuters. IMAGE OF MODERN-DAY HINDU WARRIORS Half of India's 36 states and union territories have partial or complete bans on cow slaughter - most of them governed by the BJP. But enforcement has often fallen into the hands of activists. By posting videos of their raids on alleged cow smugglers on social media, they have mobilised money, as well as thousands of Hindu men. Religious cow protection movements have a long history in India, but many activists, including Dabad, said they were emboldened by Modi's sweeping 2014 victory. Dabad recounted bloody fights between his activists – who he said are often armed with batons, stones, machetes, and sickles – and alleged Muslim smugglers. He described spreading beds of nails on the road to stop vehicles suspected of smuggling cows, as well as high-speed chases and brutal attacks. \"The journey to protect cows has not been easy,\" said Dabad, who previously spent more than a month in jail for his vigilante activities. Police responsible for the area around his hometown of Chamdhera said Dabad has been the subject of nine criminal complaints related to religious clashes and that he was arrested once for allegedly beating up a Muslim trader. Investigations continue on one complaint, while the other probes have been dismissed, they said. The image of lawlessness has not stopped politicians from seeking the support of such activists. Six officials from the party of Haryana deputy chief minister Dushyant Chautala, who identified himself as Dabad's political patron, said the activist was an effective campaigner and a rising star. Influential right-wing organisations such as the ruling party-affiliated World Hindu Council have helped legitimise the activists by depicting them as modern-day warriors waging a war against cow slaughter. Council spokesman Vinod Bansal likened cow protectors, some of whom he said had been killed in clashes, to brave religious warriors. He added that achieving political fame was only a side-effect of the efforts of some activists. Christophe Jaffrelot, a professor of Indian politics at King's College London, said the Indian state cannot harass minorities openly but by allowing vigilantes to do so, it keeps majoritarian feelings satisfied. \"And now these private armies ... are being given a share in governance and power at the local level,\" he said, adding that they would continue their penetration of politics. During an interview in his guesthouse, as his aides smoked on a brass water pipe, Dabad looked at them and said: \"We can all kill or get killed to protect the cow.\" FORCE OF THEIR OWN Of the 41 vigilante-politicians, eight said they joined the BJP at its encouragement. Another eight, including Dabad, joined other regional parties because they said they had doubts about the BJP's commitment to cows and Hindu values. \"If police would effectively identify and apprehend the alleged violators of cow protection laws, then not a single Gau Rakshak will be needed,\" said Ram Charan Pande, a cow vigilante leader who serves as a village head in the northwestern state of Rajasthan. Narendra Raghuvanshi, a member of a regional nationalist party and a Gau Rakshak based in the central state of Madhya Pradesh said that politicians often approached cow protectors for their support: \"They know we can tilt the Hindu vote in their favour\". Some of the activists-turned-politicians have created power bases of their own. Dabad, the son of an illiterate farmer, now zips around Haryana in a convoy of four SUVs, while running a centre for injured and ill cows. He said his political clout help him secure licences and offices for business ventures such as an alcohol store, an eatery and a real estate company. \"I have been able to set all of these businesses because now people know me as a man committed to protect cows,\" he said.     That has caused unease within India's opposition parties and the country's security establishment, according to interviews with three officials and one lawmaker.  \nA top Indian interior ministry official who was interviewed on condition of anonymity because he was not authorised to speak with media, said the cow vigilantes have managed to blend popularity with nous on local issues. \"Even politicians feel threatened by the enormous network of cow vigilantes,\" he said. \"They have become a force of their own.\""
}