{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0I08J_L.jpg",
  "title": "Trump to stay on Washington state ballot; third-party group asks DOJ to probe Democrats",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 20, 2024 07:43AM ET",
    "Updated Jan 20, 2024 07:52AM ET"
  ],
  "comments": [
    4,
    [
      [
        "Ken Roth",
        "2024-01-20 15:51:20",
        "The legal system has failed to sentence the US traitor Trump which should have been done long time ago, so the states judges could rule on a sentence rather than public knowledge.",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Mark Jannetty",
        "2024-01-20 16:16:41",
        "🤡",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Mark Gesswein",
        "2024-01-21 14:11:16",
        "The legal system has failed to sentence Trump because he hasn’t done anything to be sentenced for. ",
        "https://www.investing.com/members/245851936"
      ],
      [
        "Jimmy Doodoo",
        "2024-01-20 15:04:13",
        "Democrats are a threat to democracy, they are afraid to let the people to decide who they want to vote for.",
        "https://www.investing.com/members/240314649"
      ],
      [
        "Ken Roth",
        "2024-01-20 15:33:56",
        "You are mixing things up kid in your head. Democrats dont control the judges in the country and the prosequetors they work for the american people which may include you if you are american. Its called the justice system.",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Brad Albright",
        "2024-01-20 19:24:14",
        "The case was brought by a group of Republicans and Democrats and decide by a judge appointed by a Democratic governor. Another uninformed magabilly comment..",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Mark Gesswein",
        "2024-01-21 14:12:50",
        "Actually, Leftists DO control a lot of the local and state DAs that have been put into power over the last few decades. ",
        "https://www.investing.com/members/245851936"
      ],
      [
        "Angus Malarkey",
        "2024-01-20 13:07:33",
        "More TDS. The biased media has turned more people into Trump supporters than Trump has.",
        "https://www.investing.com/members/217302809"
      ],
      [
        "Mark Gesswein",
        "2024-01-21 14:14:42",
        "You are correct! Trump has gotten more free political advertising from the MSM than can be calculated. The MSM is doing a GREAT job of driving voters to Trump.",
        "https://www.investing.com/members/245851936"
      ],
      [
        "Ace Geo",
        "2024-01-20 13:02:24",
        "Despicable that news outlets still omit the part where Trump ordered his followers to protest peacefully.",
        "https://www.investing.com/members/252376420"
      ],
      [
        "Brad Albright",
        "2024-01-20 19:26:04",
        "If you think that is the full extent of Trump's actions, you are woefully uninformed.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Mark Gesswein",
        "2024-01-21 14:16:42",
        "Actually, Ace is fully correct, NotBright. The MSM always leaves out the part where Trump told protestors to be peaceful and go home without violence.",
        "https://www.investing.com/members/245851936"
      ],
      [
        "Adrian White",
        "2024-01-22 21:04:35",
        "That's because he didn't say anything like that until hours after all the mayhem had ensued. It was too little, too late, and a derelict of duty on Trump's part.",
        "https://www.investing.com/members/202315569"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/trump-to-stay-on-washington-state-ballot-thirdparty-group-asks-doj-to-probe-democrats-3278816",
  "paragraph": "3/3\n© Reuters. FILE PHOTO: Former U.S. President and Republican presidential candidate Donald Trump looks on during a rally ahead of the New Hampshire primary election, in Portsmouth, New Hampshire, U.S., January 17, 2024. REUTERS/Elizabeth Frantz/File Photo\n2/3\n(This Jan. 18 story has been corrected to rectify the name of Washington's capital city from Columbia to Olympia in paragraph 7) By Joseph Ax and Jarrett Renshaw (Reuters) - Donald Trump can remain on Washington state's Republican presidential primary ballot, a judge ruled on Thursday, rejecting the latest effort to disqualify the former president from running again based on his efforts to reverse his 2020 election loss. As in other states, the voters who filed the challenge in Washington argued that Trump is ineligible to run for the presidency based on his actions on Jan. 6, 2021, when he delivered a fiery speech before a mob of his supporters attacked the U.S. Capitol. The U.S. Constitution's 14th Amendment bars anyone who \"engaged in insurrection\" from holding public office. Similar complaints have been brought in dozens of states, but only two - Colorado and Maine - have removed Trump from the ballot. The U.S. Supreme Court has agreed to hear Trump's appeal of the Colorado ruling in February, in a case that will likely determine whether other challenges can proceed. Trump's lawyers on Thursday filed a brief with the Supreme Court urging it to reverse the Colorado decision and laying out their main arguments. While Trump faces four criminal cases, including for his attempts to overturn the election, he has not been charged with insurrection. Judge Mary Sue Wilson in Thurston County, the home of Washington's capital Olympia, found on Thursday that the secretary of state had \"acted consistent with his duties\" by accepting the candidates, including Trump, submitted by the Republican and Democratic parties. In other news from the campaign trail: THIRD-PARTY GROUP ASKS JUSTICE DEPARTMENT TO PROBE DEMOCRATS The leaders of No Labels, a group preparing a potential third-party presidential bid, have asked the U.S. Justice Department to investigate Democratic-leaning groups and activists working to thwart those efforts. The group on Thursday said a public and private pressure campaign by Democrats and allies of President Joe Biden goes beyond legally protected political speech. \"There is a group of activists, operatives and party officials who are participating in an alleged illegal conspiracy to use intimidation, harassment and fear against representatives of No Labels, its donors and its potential candidates,\" Dan Webb, a No Labels leader and former U.S. attorney, said during a press conference in Washington. No Labels, which has yet to name a candidate, has already raised more than $60 million and has qualified in 14 states, including swing states Arizona, Nevada and North Carolina. Democrats fear a centrist third-party bid would splinter their party while Trump's loyal base sticks with him. No Labels identified Democratic-aligned groups including American Bridge, Third Way and MoveOn as part of the alleged conspiracy. American Bridge President Pat Denis called the No Labels complaint \"frivolous\" and accused the group of having a \"weak chin.\" MoveOn did not return a request for comment, and Third Way declined to comment. The Justice Department did not respond to requests for comment. HALEY, TRUMP SKIP DEBATE STAGE IN FAVOR OF CABLE TV Donald Trump has skipped all five Republican presidential debates thus far, a not-so-subtle way of telling voters that the events - and, by extension, his rivals - were unworthy of his attention. That strategy was largely validated after Trump's blowout victory on Monday in Iowa's first-in-the-nation nominating contest over former U.N. Ambassador Nikki Haley and Florida Governor Ron DeSantis. Now Haley is taking a page from Trump's playbook, skipping what was to be the sixth debate on Thursday night in favor of a CNN town hall. She announced she would no longer debate unless Trump participated. Trump, meanwhile, will sit down for a friendly interview with Fox News host Sean Hannity. DeSantis took part in his own CNN town hall on Tuesday, where he attacked Haley and Trump for refusing to debate him. \nHaley's decision was aimed at marginalizing DeSantis ahead of Tuesday's primary election in New Hampshire, where polls show Haley all alone behind Trump in second place. DeSantis barely registers at around 5% in New Hampshire and has turned his focus to more conservative South Carolina - Haley's home state - which will hold its primary on Feb. 24. On Monday night, despite finishing behind DeSantis in the caucuses, Haley nevertheless declared that the results meant the race had come down to her versus Trump."
}