{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBT06G_L.jpg",
  "title": "Israeli ex-hostage says she feared being raped by Gaza captor",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 30, 2023 01:22PM ET",
    "Updated Dec 30, 2023 01:35PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Mickey Mau",
        "2023-12-30 20:18:14",
        "I don't understand the reason of her account being published. The intention clearly is to criticize Hamas and their treatment of the hostages they took.\nHowever, reading her account of the real facts the only conclusion we can reach is that Hamas wasn't as bad as advertised.\nShe feared being raped but gives no explanation of why as her guardian never tried to do so. The reason she gives of the wife being present is a product of her imagination without evidence.\nShe also feared being killed again without a clear reason other than her own feelings.\nWell, the truth is that she turned out to be wrong on both of her main fears. And that's actually the only thing we know for sure....",
        "https://www.investing.com/members/204881094"
      ],
      [
        "jew in exile israel",
        "2023-12-31 00:15:42",
        "That is precisely why this is the only accounting that they posted.",
        "https://www.investing.com/members/255929742"
      ],
      [
        "leehiung chong",
        "2024-01-01 23:39:35",
        "she also thinks the wife is a bad woman for hostility to her... really entitled Israeli brainwashed to think she is all lovable by everyone ",
        "https://www.investing.com/members/200827264"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/israeli-exhostage-says-she-feared-being-raped-by-gaza-captor-3264909",
  "paragraph": "© Reuters. Mia Schem, 21, reunites with her family following her release after being held hostage by Hamas, Sheba Medical Center, Ramat Gan, Israel, obtained by Reuters on December 1, 2023. Prime Minister's Office/Handout via Reuters\nJERUSALEM (Reuters) - An Israeli-French woman who was among scores of people taken hostage by Hamas militants has described how she feared being raped by the gunman who watched over her around the clock in the home where he lived with his wife and children in Gaza. Mia Schem, 21, was released in late November under a now-lapsed ceasefire between Israel and Hamas, and made headlines while in captivity after the Palestinians released video footage of her undergoing treatment for a bullet wound to the arm. Interviewed on Israeli TV, Schem recalled dancing at a rave near the Gaza border on Oct. 7 when Hamas infiltrators stormed in, killing hundreds of revellers. She tried to flee but her car was fired on and set alight. Nursing her wound, she surrendered.  \"It was a split-second decision, whether to stay put and burn to death or go with him,\" she told Channel 13, referring to a gunman who seized her as she emerged from the flames of the car. Brought into the Gaza Strip by pickup truck, Schem said she was kept in a room for three days while her arm was put in a rudimentary splint. Then she was taken to a Hamas gunman's home where, she said, he sat watch by her bedside. \"(I was) closed in a dark room, not allowed to talk, not allowed to be seen, to be heard, hidden. There is a terrorist looking at you 24/7, looking, raping you with his eyes,\" she said. \"There is a fear of being raped, there is a fear of dying ... I was frightened,\" she said, adding that the presence of his wife in the house had given her some reassurance - even though the woman treated her with hostility. \"His wife was outside the room with the children. That was the only reason he didn't rape me,\" Schem said. Hamas has denied allegations of sexual abuse of Israeli captives by its gunmen.  As she was being released on Nov. 30, while still in Gaza, Schem said she had been well-treated, but she told Channel 13 in the interview that she had felt compelled to give that account. During her 54 days as a hostage, Schem said, the captor's wife had \"toyed\" with her, serving him meals while denying her food. \"His wife hated the fact that he and I were in the same room,\" Schem said. \"You feel like you want a hug, you know, woman to woman, to break down a bit. That's all you had there. But she was so mean, she had such mean eyes - a bad woman.\" Schem added that, at one point, the captor had confided to her that he did not love his wife. The cacophony of Israel's shelling of the Palestinian enclave did not bother her, she said, though the windows of the building where she was held were shattered and she was temporarily deafened. \"I thought, 'If I didn't die on the seventh (of October), I'm not going to die now'. I trusted in the military.\" \nHelp came too late for Schem's best friend, Elia Toledano, however. Abducted with her but taken to a different location, he was killed in what Hamas said was an Israeli air strike.  The Israeli military, which recovered his body along with those of four other hostages this month, said the circumstances of their deaths were under investigation."
}