{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0L0RS_L.jpg",
  "title": "Chinese music student faces US trial for alleged threats to activist",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 22, 2024 05:30PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/chinese-music-student-faces-us-trial-for-alleged-threats-to-activist-3280100",
  "paragraph": "© Reuters. FILE PHOTO: Xiaolei Wu, a citizen of China who at the time was a student at the Berklee College of Music in Boston, sits for an interview with the Federal Bureau of Investigation at its office in Chelsea, Massachusetts, December 14, 2022 in a still image \nBy Nate Raymond BOSTON (Reuters) - A Chinese music student went on trial on Monday on U.S. charges that he harassed an activist who posted fliers at the Berklee College of Music in Boston supporting democracy in China and threatened to report her activities to Chinese law enforcement. Assistant U.S. Attorney Alathea Porter told a federal jury in Boston that Xiaolei Wu, 25, scared the activist, referred to only as Zooey in court, by making threats online to chop off her hands and report her to the Chinese government because of her \"reactionary posters.\"  \"She was afraid for herself, and she was afraid for her family, who was back in China,\" Porter said in her opening statement to a 12-person jury. The trial comes as U.S. and Western authorities continue to warn that China's government has increasingly exerted pressure to silence its critics abroad. Human rights groups have also complained of threats to academic freedom and monitoring of Chinese students on international university campuses. Wu was first arrested in December 2022 and has pleaded not guilty to charges of cyberstalking and interstate transmissions of threatening communication.  Porter told jurors that his threats began after Zooey, who also attended the private music college, posted a photo on Instagram of a flier she put in a window that said \"We Want Freedom,\" \"We Want Democracy,\" and \"Stand with Chinese People.\" Wu in response in October 2022 posted on a 300-person chat of Chinese Berklee students and alumni on the social media app WeChat a demand that she tear down the fliers and said he had called in a tip to a Chinese public security agency about her. Porter called that a serious threat, as the Chinese government does not allow the type of expression her posters contained and worked to suppress dissent against the Chinese government. A lawyer for Wu, Michael Tumposky, countered that Wu's comments were never meant to threaten Zooey but were made as part of an \"immature, online dispute between two young people,\" who were acquainted with each other. \nHe said his client \"was not some agent of the Chinese government\" but an \"awkward, nerdy guy\" who came to Boston to learn jazz and had spoken out about Zooey's posters \"in his own misguided way to remind her of consequences of her activism.\" \"He came here to learn guitar, not to shill for the Chinese Communist Party,\" he said."
}