{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0705Y_L.jpg",
  "title": "What is the genocide case against Israel at top UN court?",
  "category": "World news",
  "publisher": "Investing.com",
  "date": [
    "Published Jan 11, 2024 03:20PM ET",
    "Updated Jan 11, 2024 03:29PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/what-is-the-genocide-case-against-israel-at-top-un-court-3272813",
  "paragraph": "© Reuters. FILE PHOTO: General view of the International Court of Justice (ICJ) in The Hague, Netherlands December 11, 2019. REUTERS/Yves Herman/File Photo\nBy Stephanie van den Berg THE HAGUE (Reuters) -The International Court of Justice will hold hearings this week on a case brought by South Africa accusing Israel of genocide in the Gaza war and seeking an emergency suspension of its military campaign. WHAT IS THE ICJ? The ICJ, also called the World Court, is the highest United Nations legal body, established in 1945 to deal with disputes between states. It should not be confused with the treaty-based International Criminal Court, also in The Hague, which handles war crimes cases against individuals. The ICJ's 15-judge panel - which will be expanded by an additional judge from each side in the Israel case - deals with border disputes and increasingly cases brought by states accusing others of breaking U.N. treaty obligations. Both South Africa and Israel are signatories to the 1948 Genocide Convention which gives the ICJ the jurisdiction to rule on disputes over the treaty. While the case revolves around the occupied Palestinian territories, Palestinians have no official role in the proceedings because they are not a United Nations member state. All states that signed the Genocide Convention are obliged to not commit genocide and also to prevent and punish it. The treaty defines genocide as \"acts committed with intent to destroy, in whole or in part, a national, ethnical, racial or religious group\". WHAT IS SOUTH AFRICA'S CASE? In its 84-page filing South Africa says that by killing Palestinians in Gaza, causing them serious mental and bodily harm and by creating conditions on life \"calculated to bring about their physical destruction\", Israel is committing genocide against them. It lists Israel's failure to provide essential food, water, medicine, fuel, shelter and other humanitarian assistance to the Gaza strip during the more than three-month-old war with Hamas. It also points to the sustained bombing campaign which has laid much of the enclave to waste, forced the evacuation of some 1.9 million Palestinians and killed over 23,000 people according to Gaza health authorities. \"The acts are all attributable to Israel, which has failed to prevent genocide and is committing genocide in manifest violation of the Genocide Convention,\" the filing says, adding that Israel also failed to curb incitement to genocide by its own officials in violation of the convention. It asks the court to impose emergency measures to cease alleged violations by Israel. WHAT IS ISRAEL'S RESPONSE? Israeli President Isaac Herzog called the ICJ case \"atrocious and preposterous\". Israel has said it makes utmost efforts to avoid civilian casualties in Gaza. The Israeli offensive was triggered by the Oct. 7, 2023 cross-border Hamas attacks in which Islamist fighters killed 1,200 people and abducted 240, according to Israeli figures. \"We will be there at the International Court of Justice and will present proudly our case of using self-defence under our most inherent right under international humanitarian law,\" Herzog said. WHAT WILL HAPPEN AT THE HEARINGS? The hearings will take place on Jan 11 and 12. South Africa and Israel will both have two hours on separate days to make their case for or against emergency measures. There will be no witness testimony and no cross-examinations. The presentation will be mostly legal arguments brought by state officials and their teams of international lawyers. The request for emergency measures is a first step in a case that will take several years to complete. Formally called provisional measures, they are meant as a kind of restraining order to prevent a dispute from getting worse while the court looks at the full case. The court will not make a final determination on South Africa's genocide allegations until a hearing of the case on the merits, which is likely years away. This week's hearings are only about possibly granting emergency measures. Judges at the ICJ often grant such measures, which generally consist of asking a state to refrain from any action that could aggravate the legal dispute. For provisional measures the court only has to decide if at first glance, or prima facie, it would have jurisdiction and the acts complained of could fall within the scope of the genocide treaty. Any measures it decides would not necessarily be those requested by the complainant. South Africa has asked the court to order Israel to suspend its military actions in Gaza, to stop any genocidal acts or take reasonable measures to prevent genocide and issue regular reports to the ICJ about such measures. A decision on the measures is expected in the weeks following the hearings. The ICJ's rulings are final and without appeal, but it has no way of enforcing them. A ruling against Israel could hurt the country's international reputation and set legal precedent. HOW LONG WILL IT BE UNTIL A FINAL RULING ? If the court finds it has prima facie jurisdiction, the case will move forward at the ornate Peace Palace in The Hague - even if the judges decide against emergency measures. \nIsrael would then get another chance to argue the court has no legal grounds to look at South Africa's claim and to file a so-called preliminary objection - which can only touch on issues of jurisdiction. If the court rejects that objection, the judges could finally look at the case in further public hearings. It is not unusual for several years to pass between the initial claim and the actual hearing of the case on its merits."
}