{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK1301S_L.jpg",
  "title": "Philippines ready to use 'forces' to quell any secession attempt- official",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Feb 04, 2024 04:31AM ET",
  "comments": [
    1,
    [
      [
        "Barry Nickerson",
        "2024-02-04 11:54:10",
        "Muslim population growing, what could go wrong?",
        "https://www.investing.com/members/249373719"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/philippines-ready-to-use-forces-to-quell-any-secession-attempt-official-3291980",
  "paragraph": "© Reuters. FILE PHOTO: Philippine President Rodrigo Duterte gestures as he delivers his 6th State of the Nation Address (SONA), at the House of Representative in Quezon City, Metro Manila, Philippines, July 26, 2021. REUTERS/Lisa Marie David/File Photo\nMANILA (Reuters) - The Philippine government is ready to use \"authority and forces\" against attempts to divide the nation, a security official said Sunday, after former President Rodrigo Duterte threatened to separate some southern islands from the rest of the archipelago. Duterte has called for the independence of his hometown Mindanao from the Philippines as his alliance with President Ferdinand Marcos Jr disintegrated this week over disagreements around efforts to amend the constitution.  Marcos said amending the 1987 constitution was meant to ease foreign investments, but Duterte accused him of using constitutional change to stay in power.  National security adviser Eduardo Ano said in a statement any attempt to secede \"will be met by the government with resolute force\", citing \"recent calls to separate Mindanao\" but without specifically naming Duterte.  \"The national government will not hesitate to use its authority and forces to quell and stop any and all attempts to dismember the Republic,\" Ano said. Ano said calls for secession could reverse the gains of government's peace deal with former separatist groups.  Violence and conflict had plagued Mindanao for decades as the government battled insurgents and extremists, which has discouraged investments and left many villages in poverty. The region's largest rebel group, the Moro Islamic Liberation Front (MILF), had signed a peace agreement with the Philippine government in 2014, withdrawing their fight for independence in exchange for enhanced autonomy in a Muslim region called the Bangsamoro. \nBangsamoro chief minister Ahod Ebrahim said in a statement on Friday he remains committed to the peace agreement while government peace process adviser Carlito Galvez Jr. called on Filipinos to \"turn away from any call...to destabilize\" the country.  Philippine armed forces chief Romeo Brawner told soldiers on Saturday \"to remain united and loyal to the constitution and the chain of command\"."
}