{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0J06P_L.jpg",
  "title": "US judge condemns FBI while ordering release of man in 'Newburgh Four' case",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 20, 2024 02:10PM ET",
    "Updated Jan 20, 2024 03:50PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-judge-condemns-fbi-while-ordering-release-of-man-in-newburgh-four-case-3278890",
  "paragraph": "© Reuters. FILE PHOTO: An exterior view of the Masjid Al Ikhlas mosque in Newburgh, New York, May 21, 2009, where suspects in a plot to bomb New York synagogues and to down military planes had reportedly attended. REUTERS/Mike Segar/File Photo\nBy Kanishka Singh WASHINGTON (Reuters) -A man convicted in 2010 of plotting to blow up New York City synagogues and a Jewish community center, and shoot down military planes, was ordered to be released from prison by a judge who said the defendant was part of a group manipulated by the FBI. Four men, who became known as the \"Newburgh Four,\" were caught up in a scheme in 2009 to attack the synagogues and community center, and launch stinger missiles at military aircraft, driven by what the judge describes as overzealous FBI agents and an \"unsavory\" confidential informant. U.S. District Judge Colleen McMahon had already ordered the three other men in the group - Onta Williams, David Williams and Laguerra Payen - to be released last July.  The fourth man, James Cromitie, described as the ringleader by the government, was ordered released by the judge on Friday. The judge called the case \"notorious\" and described the men as \"hapless\" petty criminals who were \"easily manipulated\" by the government in a sting operation. Cromitie's lawyer was quoted in the New York Times as saying the judge's order was \"at least some kind of vindication for what we believe was a tragic miscarriage of justice.\" The four men were convicted of terrorism charges in 2010 and sentenced to 25 years in prison. Friday's order by the judge asked for Cromitie's sentence to be cut to time served plus 90 days. It did not reverse the conviction. Judge McMahon said that Cromitie was a small-time \"grifter\" who was broke and unemployed when he was enlisted in the FBI-driven plot and provided fake bombs to plant in exchange for $250,000 in the \"jihadist mission.\" Cromitie enlisted the other three men to serve as lookouts, according to the judge. \"The three men were recruited so that Cromitie could conspire with someone,\" the judge said. \"The real lead conspirator was the United States. .... The FBI invented the conspiracy; identified the targets; manufactured the ordnance.\" \nCromitie was recruited by longtime FBI informant Shahed Hussain, whom the judge called a \"villain.\" The judge wrote that Hussain's role was to infiltrate mosques and spot people who could be potential extremists.  Hussain offered \"heavenly and earthly rewards, including as much as $250,000\" to Cromitie \"if he would plan and participate in, and find others to participate in, a jihadist 'mission,'\" according to the judge."
}