{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "Judge tosses suit against Florida over ban on pro-Palestinian group",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 31, 2024 07:56PM ET",
    "Updated Jan 31, 2024 08:20PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Barry Nickerson",
        "2024-02-01 11:30:00",
        "Funny thing....law suits no longer required once philanthropists started to withdraw endowment funds.",
        "https://www.investing.com/members/249373719"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/judge-tosses-suit-against-florida-over-ban-on-propalestinian-group-3289108",
  "paragraph": "By Kanishka Singh WASHINGTON (Reuters) - A judge on Wednesday dismissed a lawsuit that claimed Florida's proposed ban on a pro-Palestinian university group violated students' free speech rights, ruling that the case was not valid because the ban had not been enforced. Florida's university system, joined by Governor Ron DeSantis, late last year asked colleges to shut down chapters of Students for Justice in Palestine (SJP), a group at the center of U.S. campus activism since war broke out in Gaza.  But none of the schools acted on the proposal.  The governor's labeling of group members as \"terrorists\" who support \"jihad\" understandably made them anxious, Chief Judge Mark Walker of U.S. District Court for northern Florida wrote on Wednesday. But the group's closure \"remains merely speculative,\" he said. After the judge denied its request for preliminary injunction on Wednesday, the American Civil Liberties Union, which represents SJP, said the group would sue again if Florida officials tried to act on closure of its chapters.  \"Florida officials are now on notice that if they attempt to enforce the deactivation order, we will be back in court to uphold our client's First Amendment rights,\" said ACLU attorney Brian Hauss.  Rights advocates have noted a rise in Islamophobia, anti-Palestinian bias and antisemitism in the U.S. since war erupted in Gaza in October. U.S. colleges have simmered with tension amid the conflict. Israel says Palestinian Islamist group Hamas killed 1,200 people in the Oct. 7 attack on Israel and took about 240 hostages to Gaza. Gaza health authorities say nearly 27,000 people have been killed in Israel's subsequent assault on Gaza."
}