{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0B0DM_L.jpg",
  "title": "In moon race with China, U.S. setbacks test role of private firms",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 12, 2024 06:11AM ET",
    "Updated Jan 12, 2024 11:53AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/in-moon-race-with-china-us-setbacks-test-role-of-private-firms-3273347",
  "paragraph": "© Reuters. FILE PHOTO: NASA's next-generation moon rocket, the Space Launch System (SLS) rocket with the Orion crew capsule, lifts off from launch complex 39-B on the unmanned Artemis I mission to the moon at Cape Canaveral, Florida, U.S. November 16, 2022. REUTERS/\nBy Joey Roulette, Nivedita Bhattacharjee and Ryan Woo WASHINGTON (Reuters) - Two U.S. setbacks this week in the race to the moon with China illustrate the risks of NASA's plans to bet on a new strategy of relying heavily on private companies. Fresh delays in the U.S. space agency's Artemis moon program and a propulsion issue that doomed American company Astrobotic's recent robot moon lander illustrate the difficulties faced by the only country to have set foot on the moon, as it tightens budgets while carrying on its cosmic legacy. The United States is planning to put astronauts back on the moon in late 2026 - delayed this week from 2025 - while China is targeting 2030 for its crewed landings. Before humans arrive, each space power plans to first send several smaller robotic missions to examine the moon's surface. China's government-backed program has scored a string of firsts. Astrobotic's lander carried seven NASA instruments that were meant to inspect the lunar surface. Although the lander won't make it to the surface intact, three other private moon missions sponsored by NASA, including a second Astrobotic attempt, are planned for this year. NASA is leaning heavily on other companies such as Elon Musk's SpaceX - which it will pay for the use of its Starship HLS lunar landing spacecraft - to slash the cost of its moon missions. The last crewed moon trips were the U.S. Apollo missions more than half a century ago, when NASA owned all the spacecraft involved. \"I think that China has a very aggressive plan,\" NASA chief Bill Nelson said on Tuesday after announcing the Artemis delay. \"I think they would like to land before us, because that might give them some PR coup. But the fact is, I don't think they will.\"  U.S. startups must develop space expertise and culture that took well-funded governments decades to develop. India is also taking that approach - leaning heavily on private companies in its space exploration efforts. \"Ten thousand things have to go right\" in a debut moonshot such as Astrobotic's, said Carnegie Mellon professor Red Whittaker, who led development of a tiny four-wheeled moon rover that was aboard Peregrine. \"It's very, very common in the course of a mission that glitches are encountered.\" Astrobotic said its executives were unavailable for interviews this week, but its Peregrine mission director, Sharad Bhaskaran, told Reuters last year the company's challenges were steep. \"We have to be a commercial company. We're trying to be competitive in this new era of commercial spaceflight. When you look at the budgets, we have to be more creative and more efficient and do things differently,\" Bhaskaran said. OTHER PLAYERS China's next step in its lunar exploration program involves an automated mission this year to retrieve samples on the moon's far side - which would be the next in a series of firsts. In December 2013, China's uncrewed Chang'e-3 made the world's first lunar soft landing since 1976. In January 2019, the also uncrewed Chang'e-4 landed on the far side of the moon, also a first. India and firms from Israel and Japan have failed in their moon attempts in recent years. India, which succeeded last year on its second try with its Chandrayaan-3 lander and became the first nation to touch down on the moon's south pole, sees Astrobotic's failure as a lesson. \"This is a much-needed learning curve for private entities similar to what the government agencies of the U.S., Russia and India had through their first landing attempts,\" said Pawan Kumar Chandana, co-founder of Skyroot Aerospace, which launched India's first private rocket in 2022. \"It inspires our startups to take up missions of this scale in the future,\" he said. \nU.S. moon lander startup Intuitive Machines is next up in the private sector's bid to reach the moon, and has spent about $100 million on the mission, the company's CEO Steve Altemus told Reuters last year. \"We had to build an entire lunar program, not just a lander. So it was a little more expensive,\" he said."
}