{
  "image": "https://i-invdn-com.investing.com/news/LYNXNPEC3B0CQ_L.jpg",
  "title": "Russia says four survive charter jet crash in Afghanistan, condition of two others unclear",
  "category": "Stock market news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 21, 2024 03:29AM ET",
    "Updated Jan 21, 2024 12:25PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/stock-market-news/russian-charter-flight-with-6-people-disappears-over-afghanistan-crash-reported-3278927",
  "paragraph": "© Reuters. \nKABUL/MOSCOW (Reuters) -Russia's aviation watchdog said on Sunday four people survived the crash of a charter plane bound for Moscow in northern Afghanistan, citing the Russian embassy there, and it said the condition of two other passengers on board was not yet clear. Two Taliban provincial officials said four survivors were now with Taliban administration officials who had reached the remote, mountainous site of the crash. They said that two other passengers had died.  The Taliban administration's top spokesman Zabiullah Mujahid said the pilot of the plane was among four who had survived.  \"The investigative team of the Islamic Emirate continues their efforts to search for and provide assistance to the remaining individuals,\" he said in a statement.  The Russian-registered charter plane with six people on board disappeared from radar screens over Afghanistan a day earlier, Russian aviation authority Rosaviatsia said on Sunday, after Afghan police said they had received reports of a crash. The plane was a charter ambulance flight travelling from Thailand's Utapao Airport in Pattaya to Moscow via India and Uzbekistan on a French-made Dassault Aviation Falcon 10 jet manufactured in 1978, Rosaviatsia said in a statement.  About 25 minutes before the plane vanished from radar screens, the pilot warned that fuel was running low and that the plane would try to land at an airport in Tajikistan, Russian news outlet SHOT reported, citing an unnamed source.  The pilot then reported that one engine had stopped, and then that the second one had also stopped, SHOT reported.  Reuters could not immediately confirm the details shared by SHOT.  India's civil aviation authority said the plane was not a scheduled commercial flight or an Indian chartered aircraft.  The flight was carrying out a private medical evacuation from Thailand's Pattaya, a popular tourist destination for Russians, to Moscow, Russian state-run TASS news agency reported, citing the Russian embassy in Bangkok. \"On board was a bedridden patient in serious condition, a Russian citizen, who was transported from one of the hospitals in Pattaya to Russia,\" the RIA news agency reported, citing a source at Thailand's Utapao International Airport. \"She was accompanied by her husband, a private entrepreneur, also a Russian citizen, who paid for the flight.\"  Several Russian media outlets said the passengers were a couple from Volgodonsk in southern Russia.  A manifest list for the plane, published by the SHOT news outlet, appeared to show the crew were also Russian nationals. Russia's Investigative Committee said it had opened a criminal case to determine if safety rules had been violated. The plane's reported owner, a small Russian firm called Athletic Group LLC, did not immediately respond to a request for comment.  The Taliban-run Afghan aviation ministry said in a statement on X that the plane’s planned route did not include passing through Afghanistan’s air space and that \"probably due to technical issues\" the plane had diverted from its planned route. The statement said a ministry technical team was investigating the matter. Afghanistan police had received reports of a plane crash in a remote, mountainous region of Badakhshan in Afghanistan's far north, a provincial police spokesperson said on Sunday.  Zabihullah Amiri, a spokesperson for Badakhshan's provincial government, told Reuters a team had been sent to the location of the crash, a remote area more than 200 km (124 miles) from the provincial capital Fayzabad."
}