{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0O0OC_L.jpg",
  "title": "Haley raises $1 million since Trump donor warning, but loses a prominent funder",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 25, 2024 11:46AM ET",
    "Updated Jan 25, 2024 08:55PM ET"
  ],
  "comments": [
    2,
    [
      [
        "Joe Blewit",
        "2024-01-26 02:59:59",
        "Wow!  A million $ gets a headline",
        "https://www.investing.com/members/256551012"
      ],
      [
        "Mark Jannetty",
        "2024-01-25 18:04:57",
        "congratulations to the 47th President Donald Trump 🇺🇲🎉",
        "https://www.investing.com/members/241633026"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/two-prominent-haley-donors-to-pull-funding-after-trump-new-hampshire-win-3283322",
  "paragraph": "© Reuters. Republican presidential candidate and former U.S. Ambassador to the United Nations Nikki Haley speaks during a campaign event before the South Carolina Republican presidential primary election in North Charleston, South Carolina, U.S., January 24, 2024. R\nBy Alexandra Ulmer and Tim Reid (Reuters) - Republican presidential candidate Nikki Haley's campaign said it had raised $1 million since Donald Trump issued a warning to her donors, even as at least one prominent benefactor of hers turned off the taps, saying Trump was now the de facto party nominee. Trump issued a threat to donors on Wednesday night to stop funding Haley as he seeks to knock her out of the race before the next major primary race, in South Carolina on Feb. 24.  Metals magnate and Haley donor Andy Sabin said in an interview the Republican race was now essentially over, given Haley had not been able to pull off an upset in the New Hampshire primary on Tuesday. \"Haley needs to drop out,\" Sabin said late on Wednesday. \"Regardless of what anyone tells you, her money is going to dry up. Why would you fund someone who you know has no chance?\" Trump's back-to-back wins in the Iowa and New Hampshire contests have made his march to the Republican nomination almost certain as he looks ahead to a likely general election rematch with Democratic President Joe Biden in November despite facing four criminal prosecutions.  Another major Haley donor, Reid Hoffman, the billionaire co-founder of online business and employment platform LinkedIn, also does not plan to keep funding her campaign, CNBC first reported.  But Dmitri Mehlhorn, a Hoffman adviser, told Reuters on Thursday evening that they were \"reconsidering\" that decision given Haley's increased criticism of Trump. Haley has especially been questioning the cognitive abilities of Trump, 77.  \"If she makes traction prior to South Carolina with that electorate there is a case for money for Super Tuesday,\" Mehlhorn said.  TRUMP DONOR THREAT Haley, Trump's last surviving Republican rival, has vowed to carry on, triggering the warning to her donors from Trump on his social media account. On the Truth Social app, Trump, who is furious at Haley for refusing to drop out, said anybody making a contribution to Haley would be \"permanently barred\" from his political orbit. Haley responded on social media platform X with a link to donate to her campaign: \"Well in that case ... donate here. Let's Go,\" she wrote.  A Haley campaign spokesperson said the campaign had raised around $1 million since the post, confirming an earlier report by The Hill.  Haley raised $24.5 million between October and December, her campaign said earlier this month.  Dave Thul, a logistics manager in Minnesota who left the Republican Party in 2016 when Trump became its nominee, said in an interview that he donated $100 to Haley after seeing Trump's threat.  \"I didn't donate previously to Haley because she was kind of wishy-washy on her stance on Trump. She's taken a different tone in last couple of days,\" Thul said. \"Her being in the race, and being directly antagonistic towards Trump, increases the possibility that he has more verbal gaffes or lashes out at her in manners that prompt a backlash.\" Threatening Haley's donors is just one tactic Trump and his campaign are using to pressure the former South Carolina governor to quit. Trump's team has also been courting donors, urging them to support him and in at least one case promising one-on-one meetings with Trump at his Mar-A-Lago Florida estate.  Some Haley donors brushed off Trump's threat. \"Whatever,\" said Eric Levine, a New York litigator. \"He sounds desperate,\" said venture capitalist Tim Draper. Retail businessman Art Pope said he was still backing Haley's bid. \nSabin said Trump's threat shows the former president is a \"nasty\" person. \"It just does more harm,\" he added.  Still, negative headlines about donors dropping Haley could dent her momentum and ability to keep raising funds to sustain her campaign."
}