{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0601N_L.jpg",
  "title": "Bangladesh turnout low in election set to keep PM Hasina in power",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 07, 2024 09:34AM ET",
    "Updated Jan 07, 2024 09:56AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/bangladesh-turnout-low-in-election-set-to-keep-pm-hasina-in-power-3268699",
  "paragraph": "5/5\n© Reuters. A voter comes out of a designated area after casting his vote during the 12th general election in Dhaka, Bangladesh, January 7, 2024. REUTERS/Mohammad Ponir Hossain\n2/5\nBy Sudipto Ganguly and Ruma Paul DHAKA (Reuters) -Bangladeshis largely stayed away from the polls in a general election on Sunday set to give Prime Minister Sheikh Hasina a fourth straight term, after a vote boycotted by the main opposition party and marred by violence. Rights groups have warned of virtual one-party rule by Hasina's Awami League in the South Asian country of 170 million people after the boycott by the Bangladesh Nationalist Party (BNP) and some smaller allies. The United States and Western nations, key customers of Bangladesh's garment industry, have called for a free and fair election, the 12th since independence from Pakistan in 1971. Turnout was about 40% when polls closed, said chief election commissioner Kazi Habibul Awal, compared with over 80% in the last election in 2018. Initial results are expected early on Monday. Voting was cancelled at seven centres due to irregularities while the candidature of an Awami League contestant was cancelled for threatening security officials, said Jahangir Alam, secretary of the commission. The BNP, boycotting the second of the past three elections, says Hasina's party is trying to legitimise a sham vote. She refused BNP demands to resign and allow a neutral authority to run the election, accusing the opposition of instigating anti-government protests that have rocked Dhaka since late October and killed at least 14 people. The BNP called a two-day strike nationwide through Sunday, asking people to shun the election. \"The people of the country boycotted the government by not going to the polling booths,\" said BNP leader Abdul Moyeen Khan, adding the opposition's boycott call was a success. In her latest 15 years in power, Hasina, 76, has been credited with turning around Bangladesh's economy and the key garment industry. But critics accuse her of authoritarianism, human rights violations, crackdowns on free speech and suppression of dissent. At least four people were killed on Friday in a passenger train fire that the government called arson. Several polling booths, schools and a Buddhist monastery were set ablaze days before the poll. A person in Munshiganj, south of the capital Dhaka, was hacked to death on Sunday morning, district police chief Mohammad Aslam Khan said, adding it was unclear if the killing was related to political violence. Police in Chandpur district about 110 km (70 miles) from Dhaka fired tear gas to disperse BNP supporters who had blocked roads to disrupt voting and threw stones at security forces, said district police chief Saiful Islam. Supporters of the Awami League and independent candidates clashed in some districts, amid allegations that ruling party cadres were stuffing sealed ballot papers in voting boxes, local media reported. Bangladesh deployed nearly 800,000 security forces to guard polling booths and troops were mobilised nationwide to assist in maintaining peace. 'PEOPLE ARE MY POWER,' HASINA SAYS Hasina, accompanied by her daughter and other family members, voted at Dhaka's City College minutes after polling began at 8 a.m. \"Bangladesh is a sovereign country and people are my power,\" Hasina said after voting, adding she hoped her party would win the people's mandate, which would give it a fifth term since 1996. \"I am trying my best to ensure that democracy should continue in this country.\" About 120 million voters were choosing from nearly 2,000 candidates for 300 directly elected parliamentary seats. There are 436 independent candidates, the most since 2001. The BNP, its top leaders either in jail or exile, says the Awami League has propped up \"dummy\" candidates as independents to try to make the election look credible, a claim the ruling party denies. \"PM Hasina has done a lot for the country. I'll vote for her party,\" said Anowar Hossain, 55, as he walked home after buying vegetables at a market in Dhaka. College teacher Zayeda Begum, 55, said she was happy with how Bangladesh was progressing, adding that she had cast her vote in favour of the ruling party. Hasina said she did not need to prove the credibility of the election to anyone. \"What is important is if the people of Bangladesh will accept this election.\"  The economy has slowed sharply since the Russia-Ukraine war pushed up prices of fuel and food imports, forcing Bangladesh to turn last year to the International Monetary Fund for a bailout of $4.7 billion. \nFahim Faysal, 20, a BNP supporter and a first-time voter decided against voting. \"The government is doing many things but there are no employment opportunities,\" he said. \"I feel it would have been better if BNP contested. Anyway, it's their decision.\""
}