{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0M0T4_L.jpg",
  "title": "US determined to remain strong security partner for Nigeria -Blinken",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 23, 2024 04:17PM ET",
    "Updated Jan 24, 2024 07:12AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Aminu Lawan",
        "2024-01-25 14:18:32",
        "wow with Nigeria",
        "https://www.investing.com/members/256573164"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/us-determined-to-remain-strong-security-partner-for-nigeria-blinken-3281048",
  "paragraph": "3/3\n© Reuters. U.S. Secretary of State Antony Blinken attends a press conference with Minister of Foreign Affairs of Nigeria Yusuf Tuggar at the Presidential Villa in Abuja, Nigeria, January 23, 2024. Andrew Caballero-Reynolds/Pool via REUTERS\n2/3\nABUJA/WASHINGTON (Reuters) - Secretary of State Antony Blinken on Tuesday said the United States is determined to remain a strong security partner for Nigeria, whose military is backed by the U.S., Britain and other allies in a long war against Islamist insurgents. Blinken also discussed challenges to democracy and security in the region during his meeting on Tuesday with Nigerian President Bola Tinubu in a visit that comes after last year's coup in neighboring Niger, one of a series of coups or attempted power grabs over the past few years in West and Central Africa.  \"The United States is determined to be and remain a strong security partner for Nigeria,\" Blinken told reporters. Blinken added that he discussed how it is vitally important there be a focus on ensuring civilians are protected and humanitarian considerations. Observers have noted a pattern of deadly aerial assaults by the Nigerian military that have killed civilians, which was the subject of a Reuters special report last year. The U.S. faced a setback in its fight against militants in the Sahel when military officers toppled Niger's President Mohamed Bazoum, a key ally, in July last year. The coup in Niger was one of a series of military takeovers or attempted power grabs that occurred in West and Central Africa over the past three years. The instability has raised concern, particularly as juntas have cut ties with traditional Western allies such as the European Union and France, which withdrew thousands of troops from the Sahel last year. Blinken, speaking in Abuja as part of a four-nation tour of Africa taking him to Cape Verde, Ivory Coast, Nigeria and Angola from Jan. 21-26, also said repatriation of capital and corruption were among challenges that need to be tackled for companies to invest in Nigeria. \nAfrica's biggest economy has about $7 billion in forex forwards that have matured, a major concern for investors as foreign currency shortages continue to weigh down the naira currency, despite assurances by the Central Bank of Nigeria (CBN) to clear the backlog. So far, about $2 billion of the backlog across sectors such as manufacturing, aviation, and petroleum have been paid, CBN spokesperson Hakama Sidi Ali said in a statement."
}