{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK030LD_L.jpg",
  "title": "Mourners march, hold mass hug to remember Prague shooting victims",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 04, 2024 11:18AM ET",
    "Updated Jan 04, 2024 12:04PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/mourners-march-hold-mass-hug-to-remember-prague-shooting-victims-3267553",
  "paragraph": "© Reuters. Students create a human chain in memory of victims of the shooting at Prague University, Prague, Czech Republic, January 4, 2024. REUTERS/Eva Korinkova\nPRAGUE (Reuters) - Students and teachers remembered the 14 victims of the Czech Republic's worst mass shooting on Thursday as they formed a human chain to symbolically hug the university building where the gunman opened fire just before Christmas. Mourners passed from Charles University's medieval headquarters through Prague's Old Town Square to the Faculty of Arts building where a 24-year-old history student went on a rampage on Dec. 21 before killing himself when cornered by police. A crowd of more than a thousand people then stood quietly hand-in-hand as the city's historic churches rang bells for 14 minutes to commemorate each victim.  Thousands of candles lay on the steps of the faculty building, which will remain closed until the end of January. \"I am encouraged by the words of students who say hate will not win. We will live and study on,\" university rector Milena Kralickova told the crowd ahead of the march. \"Our academic community is hurt, but unbroken. Our steps through Prague today toward the Faculty of Arts will also symbolise out path to recovery.\" Kralickova and the Faculty of Arts dean led the march, each helping to carry a kerosene lamp lit from candles at the university headquarters to kindle a memorial flame outside the Faculty building that will burn for a month. The shooting has prompted discussion among university, student, police and political leaders about changes in security measures. But they have initially agreed to keep letting people enter university buildings without having to go through metal detectors.  There are nearly 1 million guns, including rifles, owned legally by more than 300,000 people in the country of nearly 11 million. The shooting has prompted calls for tighter rules for getting gun licences and for compulsory psychological checks. Police said last week the shooter had left a suicide note, admitting to the killing of a man and a two-month-old child earlier in December. He also killed his father earlier in the day of the university shooting. \nPolice won plaudits for arriving on the scene minutes after the first reports of gunfire and for confronting the gunman.  A police inspection has been looking into whether a wider alarm could have been raised faster after police found the shooter's father dead earlier on the day of the tragedy."
}