{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK080A9_L.jpg",
  "title": "Kremlin has 'no comment' on U.S., Ukraine claims it fired North Korean missiles",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 09, 2024 04:52AM ET",
  "comments": [
    1,
    [
      [
        "Ken Roth",
        "2024-01-09 18:00:42",
        "What should russia say…”yes we have bought thousands of missiles from north korea and intends to fire them all at ukraine, if civilians get hit we are prepared to accept this”… and what are you going to do about…”nothing” we didnt think so",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/kremlin-has-no-comment-on-us-ukraine-claims-it-fired-north-korean-missiles-3269997",
  "paragraph": "© Reuters. A firefighter extinguishes remains of an unidentified missile, which Ukrainian authorities claimed to be made in North Korea, at a site of a Russian strike, amid Russia's attack on Ukraine, in Kharkiv, Ukraine January 2, 2024. REUTERS/Sofiia Gatilova/ Fil\nMOSCOW (Reuters) - The Kremlin declined on Tuesday to comment on U.S. and Ukrainian assertions that Moscow had fired North Korean missiles at Ukrainian targets, but it also accused Kyiv of using missiles produced by Western nations to strike targets in Russia. Last week the White House said Russia had used short-range ballistic missiles (SRBMs) sourced from North Korea to conduct multiple strikes against Ukraine, citing newly declassified intelligence. A senior Ukrainian official later corroborated the assertion. Both Moscow and Pyongyang have drawn closer since the beginning of the Ukraine conflict, though they deny making any arms deals. North Korean leader Kim Jong Un met President Vladimir Putin in Russia's Far East region last September and senior Russian officials have made several visits to Pyongyang. Asked about the U.S. and Ukrainian accusations during a call with reporters, Kremlin spokesman Dmitry Peskov said: \"No comment.\" Peskov added that Ukraine had repeatedly struck civilian targets inside Russia using missiles produced by \"Germany, France, Italy, the United States, and other countries\".  Ukraine struck the Russian border city of Belgorod on Dec. 30, killing more than 20 people including two children and injuring 111, Russian media reported. \nThe Belgorod region, which adjoins northern Ukraine, has like other Russian border zones suffered shelling and drone attacks all year that authorities have blamed on Ukraine, although none had previously been on such a scale.  Moscow, which sent tens of thousands of troops into Ukraine on Feb. 24, 2022, with the stated aim of \"demilitarising\" and \"denazifying\" the country, has said Western nations including the United States bear responsibility for the consequences of supplying weapons to Kyiv."
}