{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0U00U_L.jpg",
  "title": "Explorer may have found wreckage of Amelia Earhart's plane in Pacific",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 30, 2024 07:47PM ET",
    "Updated Jan 31, 2024 02:51AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/explorer-may-have-found-wreckage-of-amelia-earharts-plane-in-pacific-3287582",
  "paragraph": "3/3\n© Reuters. A view shows the mission to find the wreckage of Amelia Earhart's plane in the Pacific Ocean by Deep Sea Vision, in this screen grab obtained from a undated video. Deep Sea Vision/via REUTERS\n2/3\nBy Ashraf Fahim (Reuters) - A former U.S. Air Force intelligence officer says he believes he has found the wreckage of Amelia Earhart's plane, which disappeared nine decades ago, on the bottom of the Pacific Ocean using sonar data from a deep-sea drone. Hoping to solve an 87-year-old mystery, explorer Tony Romeo plans to launch a mission later this year or next to find the long-lost plane, which a massive U.S. search failed to do in 1937. \"She's America's most famous missing person, right? As long as she's missing, there's always going to be somebody out there searching,\" Romeo said. \"If we can help bring closure to this story and bring Amelia home, we'd be super excited.\" Earhart, an American aviator, became the first woman and second person ever to fly solo and nonstop across the Atlantic in 1932, five years after Charles Lindbergh accomplished the feat. Along with navigator Fred Noonan, she was attempting to fly around the world when their plane went missing over the Pacific. If she succeeded, she would have become the first female pilot to do so. Romeo, chief executive of the private exploration company Deep Sea Vision, believes the wreckage of Earhart's plane lies on the ocean floor more than 5,000 meters (16,400 feet) beneath the surface, about 160 km (100 miles) from Howland Island, roughly halfway between Hawaii and Australia. Blurry sonar images from the deep-sea drone show a plane-like shape on the flat, sandy ocean bottom, he said. Deep Sea Vision's 16-member crew searched more than 13,400 square km (5,200 square miles) over 100 days at the end of last year. Romeo said the images showed what appeared to be a plane matching the size of Earhart's Lockheed Model 10-E Electra. The image, he said, appeared to show a distinguishing characteristic of the plane: its twin vertical stabilizers on the tail. \nRomeo supposes Earhart ran out of fuel and landed the plane on the ocean surface and that the craft later sank to the bottom, where it would have lay ever since, little disturbed by the light currents. \"The first step is to confirm it,\" he said. \"The next step would be, if it's possible, to raise it to the surface and restore it,\" Romeo said, adding that the process could take years."
}