{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK040GN_L.jpg",
  "title": "Some families of kidnapped migrants paid ransoms, Mexico minister says",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 05, 2024 09:53AM ET",
    "Updated Jan 05, 2024 08:30PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/mexico-president-requested-us-visas-for-at-least-10-million-hispanics-3268265",
  "paragraph": "© Reuters. FILE PHOTO: Mexico's President Andres Manuel Lopez Obrador speaks during his daily press conference, in Acapulco, Mexico December 20, 2023. REUTERS/Daniel Becerril/File Photo\nMEXICO CITY (Reuters) -Some of the families of kidnapped Venezuelan and Honduran migrants paid ransoms to their abductors before the group was rescued this week, Mexico's security minister said on Friday.  The 32 migrants were kidnapped from a bus over the weekend by armed men aiming to extort money from them and their families in the United States.  \"They took photos and in the early morning of December 31, the kidnappers called the families to ask for money. In some cases, deposits of a part of the required resource were made,\" Mexican Security Minister Rosa Icela Rodriguez said in a regular news conference.  The migrants were abandoned by their kidnappers and rescued on Wednesday in the northern city of Reynosa in the state of Tamaulipas. Six of the migrants were from Honduras and 26 were Venezuelan, with three having dual nationality with Colombia, Mexico said.  During Friday's news conference, Mexican President Andres Manuel Lopez Obrador rejected speculation that police had been involved in the kidnapping, saying the allegation that has circulated in local media was aimed at undermining the work of security forces. Migrants in Mexico frequently say they are extorted by local police and federal authorities as they head north toward the border.  One migrant who traveled the same bus route from Monterrey to Matamoros a week before the kidnapping told Reuters he and other migrants were extorted by police who threatened to hand them over to a cartel if they did not pay. Reuters was unable to verify his story. In an interview with Reuters on Thursday, Tamaulipas State Security spokesman Jorge Cuellar also rejected the idea that authorities were involved in the mass kidnapping, though he acknowledged there were occasional \"isolated cases of bad police officers.\" Lopez Obrador also said separately on Friday that he had asked U.S. authorities to grant visas to at least 10 million Hispanic migrants who have worked for more than 10 years in the country, and deploy $20 billion for a cooperation plan to help other countries in Latin America tame migration.  \nThe requests were made during the last bilateral meeting in Mexico City, the president said.  A record number of migrants traveled across Central America and Mexico in 2023 to reach the United States, fleeing poverty, violence, climate change and conflict."
}