{
  "image": "https://i-invdn-com.investing.com/news/LYNXNPEE211WU_L.jpg",
  "title": "Bitcoin (BTC) Accumulation Trend Score Hits 3-Year High: Details",
  "category": "Cryptocurrency news",
  "publisher": "U.Today",
  "date": "Published Feb 04, 2024 10:57AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/cryptocurrency-news/bitcoin-btc-accumulation-trend-score-hits-3year-high-details-3292061",
  "paragraph": "U.Today - In a pivotal turn of events for the cryptocurrency space, Bitcoin (BTC) is undergoing one of its most substantial accumulation streaks in nearly three years, reaching a noteworthy three-year high in the Accumulation Trend Score. Esteemed crypto analyst Ali Martinez recently brought attention to this trend on X (formerly Twitter), underscoring the increasing confidence of larger entities in the cryptocurrency market.\nAccording to Martinez, the Accumulation Trend Score has maintained near 1 for the past four months, indicating active accumulation by larger entities and reflecting a robust confidence level in the overall market. In a related development, as previously reported by U.Today, Bitcoin whales have been notably increasing their holdings in recent times.\nApproximately 67 new entities now boast holdings of 1,000 BTC or more, marking a substantial 4.50% uptick in holdings within just a fortnight. This surge in accumulation by institutional players underscores a growing optimism in the enduring potential of Bitcoin. Observers closely monitor these developments as institutional interest in Bitcoin grows.\nBitcoin market sentimentAs of the latest available data, Bitcoin is currently priced at $42,119, reflecting a marginal decrease of 1.72% in the last 24 hours. Nevertheless, the cryptocurrency has demonstrated a positive trend over the last seven days, with a 5.17% uptick in value. The 24-hour trading volume of BTC has also seen a notable increase of 13.65%, reaching $25.74 billion, signaling heightened market activity.Despite prevailing positive sentiment, data from Coinglass indicates significant liquidations for Bitcoin, totaling $58.52 million. Among these liquidations, $45.91 million are attributed to long positions, while $12.62 million are associated with short positions. This data implies a certain degree of volatility in the market, even as institutional investors continue their ongoing accumulation of Bitcoin.\nOverall, as institutional interest in Bitcoin continues to grow, the sustained surge in accumulation not only bolsters confidence in the present but also holds the potential to contribute substantially to the long-term stability and growth of the broader market. The intricate balance between accumulation, liquidations and market trends will undoubtedly be closely watched in the coming days.\nThis article was originally published on U.Today"
}