{
  "image": "https://i-invdn-com.investing.com/news/LYNXNPEB5S0BG_L.jpg",
  "title": "Asian stocks rise as SoftBank fuels Japan rally; China rebound stalls",
  "category": "Stock market news",
  "publisher": "Investing.com",
  "date": "Published Feb 07, 2024 10:03PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/stock-market-news/asian-stocks-rise-as-softbank-fuels-japan-rally-china-rebound-stalls-3296604",
  "paragraph": "Investing.com-- Most Asian stocks rose on Thursday, with Japan’s Nikkei 225 leading gains on strength in SoftBank and the technology sector, while a rebound in Chinese markets appeared to have stalled after weak inflation data.\nRegional stocks also took a positive lead-in from Wall Street, as U.S. benchmarks closed at record highs on a slew of strong earnings. Waning concerns over higher-for-longer interest rates also spurred gains in risk-driven stock markets. \nJapan’s Nikkei 225 surges on SoftBank rally, 34-year high in sight \nThe Nikkei 225 was the best performer in Asia on Thursday, rising 1.7% and trading just a hair below a 34-year high.\nGains in the Nikkei were fueled chiefly by technology stocks, with investment conglomerate SoftBank Group Corp. (TYO:9984) leading the charge with a nearly 10% bounce.\nSoftBank hit a six-month high as it looked poised to book a nearly $16 billion windfall from an overnight rally in its chip designing subsidiary  Arm  Holdings ADR (NASDAQ:ARM), which forecast stronger earnings on increased demand for artificial intelligence. \nSoftBank is also set to report its earnings for the December quarter later on Thursday, and is expected to clock its first profit in five quarters on improved tech valuations.\nOther Japanese tech firms also advanced, with chip firms  Advantest Corp.  (TYO:6857) and  Tokyo Electron Ltd.  (TYO:8035) up 7% and 2.7%, respectively. \nAutomobile giant  Toyota  Motor (TYO:7203) (NYSE:TM) rose nearly 4% and hit a record high for a third consecutive session, after clocking bumper quarterly earnings earlier this week. \nOther Asian stocks also advanced, tracking a positive overnight close on Wall Street. Australia’s ASX 200 rose 0.5% and came within spitting distance of a record high, while South Korea’s KOSPI rose 0.6% on gains in tech stocks- particularly heavyweight chipmakers.\nFutures for India’s Nifty 50 index pointed to a muted open before a Reserve Bank of India meeting later in the day, where the central bank is widely expected to keep rates on hold. But its forecasts on inflation and economic growth will be in close focus. \nChinese stocks lag on deflation risks,  Alibaba  losses \nChinese stocks lagged their peers on Thursday, as a rebound rally now appeared to be running out of steam. Weak inflation data and losses in tech giant Alibaba Group (HK:9988) (NYSE:BABA) also weighed.\nChina’s bluchip Shanghai Shenzhen CSI 300 index was flat, while the Shanghai Composite rose 0.9% on some strength in financial and industrial stocks. Official data showed Chinese consumer inflation grew less than expected in January, while producer inflation shrank for a sixteenth consecutive month. \nThe reading showed that disinflationary risks remained squarely in play, and presented more headwinds for the struggling Chinese economy, especially as consumer spending slowed. The weak inflation reading also stalled a rebound rally in Chinese shares, after signs of more government support for the stock market saw Chinese indexes surge from multi-year lows earlier this week. \nWeak earnings from Alibaba Group also raised more concerns over sluggish consumer spending. The e-commerce giant slid nearly 6% in Hong Kong trade after clocking weaker-than-expected earnings for the December quarter. \nLosses in Alibaba dragged Hong Kong’s Hang Seng index down 1.1%. The index was the worst performer in Asia for the day, with weakness in Chinese stocks setting a dour tone before the week-long Lunar New Year holiday."
}