{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0B0PT_L.jpg",
  "title": "US to seek death penalty against white supremacist Buffalo shooter",
  "category": "General",
  "publisher": "Reuters",
  "date": [
    "Published Jan 12, 2024 12:52PM ET",
    "Updated Jan 12, 2024 06:25PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/general/us-to-seek-death-penalty-against-buffalo-supermarket-shooter-3273762",
  "paragraph": "© Reuters. FILE PHOTO: Tops gunman Payton Gendron is escorted out of the courtroom after he was sentenced to life in prison without parole for domestic terrorism motivated by hate and each of the 10 counts of first-degree murder by Erie County Court Judge Susan Eaga\nBy Joseph Ax NEW YORK (Reuters) -U.S. prosecutors will seek the death penalty against the white supremacist who killed 10 Black people at a Buffalo, New York, grocery store in 2022, marking the first time the Biden administration has initiated capital punishment proceedings. The U.S. Justice Department in a court filing on Friday said it would seek the death penalty for Payton Gendron for killings motivated by his \"animus toward Black persons.\"  Gendron, who was 18 at the time of the mass shooting, has already pleaded guilty to separate state charges of murder and domestic terrorism and was sentenced last February to life in prison without the possibility of parole. Gendron's defense lawyers previously said he would consider pleading guilty to more than two dozen federal charges - including hate crime and firearm offenses - if the death penalty was taken off the table. His court-appointed attorneys, MaryBeth Covert and Anne Burger, in a statement on Friday said they were \"deeply disappointed\" in the decision. \"Rather than a prolonged and traumatic capital prosecution, the efforts of the federal government would be better spent on combating the forces that facilitated this terrible crime, including easy access to deadly weapons and the failure of social media companies to moderate the hateful rhetoric and images that circulate online,\" they said. The case is the first under President Joe Biden in which the Justice Department has sought capital punishment in a new case. Biden campaigned against the death penalty during the 2020 presidential race. Federal prosecutors under U.S. Attorney General Merrick Garland have sought the death penalty in two other cases, but the initial decisions were made during the Trump administration. A jury sentenced Robert Bowers, the antisemitic gunman who murdered 11 people at a Pittsburgh synagogue, to death. Another jury could not agree on the death penalty for Sayfullo Saipov, who killed eight people on a Manhattan bike path with a pickup truck after pledging allegiance to Islamic State. Garland imposed a moratorium on federal executions in 2021 to allow for a review of procedures, but the pause does not bar the Justice Department from seeking the death penalty in pending cases. A White House spokesperson said the Justice Department makes sentencing decisions, but Biden's stance had not changed. At Gendron's sentencing, where more than a dozen relatives of the victims described their anguish, at least one said he did not want to see the gunman executed. \"I don't wish the death penalty on you,\" said Wayne Jones, whose 65-year-old mother, Celestine Chaney, was gunned down. \"I wish they keep you alive so you have to suffer with the thought of what you did for the rest of your life.\" \nAuthorities said Gendron targeted a Tops Friendly Markets store on May 14, 2022, because it was in a predominantly Black neighborhood. The massacre, whose victims ranged in age from 20 to 86, left Buffalo's Black community in shock and mourning. Gendron streamed live video of the attack on the social media platform Twitch and posted material online showing he had drawn inspiration from other racially motivated mass killings, according to authorities."
}