{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "Extremist sentenced to 18 years for attack on Ohio church that planned drag events",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 30, 2024 01:24PM ET",
    "Updated Jan 30, 2024 02:01PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Barry Nickerson",
        "2024-01-31 12:15:54",
        "18 years for arson. Yet, violent A&B offenders walk with no bail.",
        "https://www.investing.com/members/249373719"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/extremist-sentenced-to-18-years-for-attack-on-ohio-church-that-planned-drag-events-3287349",
  "paragraph": "By Kanishka Singh (Reuters) - A far-right extremist from Ohio was sentenced to 18 years in federal prison for firebombing a church that planned to host two drag events, a court filing showed on Tuesday. Aimenn Penny, 20, was a member of White Lives Matter, Ohio, a group with racist, pro-Nazi and homophobic views, according to the U.S. Justice Department. He was arrested last March several days after he threw Molotov cocktails at the Community Church of Chesterland in Chesterland, Ohio. Penny pleaded guilty in October to a church arson hate crime and to using fire and explosives to commit a felony. He was sentenced to 216 months, or 18 years, in prison by U.S. District Judge Bridget Meehan Brennan, according to a filing in U.S. District Court for the Northern District of Ohio. Federal prosecutors said during the case that church burnings have \"a long and sordid history\" in the United States, and such acts serve \"as potent a symbol of hate as burning a cross on a lawn or leaving a hanging noose.\" \nDrag shows often involve feminine clothing, makeup and hair worn by a man, and have become increasingly mainstream in recent years in the United States. Ohio Republican lawmakers who oppose drag shows consider them contrary to traditional values and have labeled them as explicit and obscene.  U.S. Republicans have led efforts to limit drag in many states recently. Performers and civil rights groups have condemned the proposed drag regulations, saying they are unconstitutional, redundant under existing obscenity laws, and would lead to further harassment and violence against gay and transgender people."
}