{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "Russian forces shell Kherson rail station, one policeman dead -Ukraine interior minister",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 26, 2023 02:28PM ET",
    "Updated Dec 26, 2023 03:55PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/russian-forces-shell-kherson-rail-station-one-policeman-dead-ukraine-interior-minister-3263665",
  "paragraph": "(Reuters) -Russian forces shelled the railway station in the southern Ukrainian city of Kherson on Tuesday as a train was set to evacuate residents, killing one policeman and injuring four people, Interior Minister Ihor Klymenko said. Klymenko said about 140 civilians had been at the station in the early evening and quick action by police to direct them away saved many lives. \"Thanks to the clear actions of the police, everyone was successfully taken to safe places,\" Klymenko said on Telegram. \"Unfortunately, a police lieutenant from the Kirovohrad region lost his life due to the shelling. ... Two more police officers are in the hospital with shrapnel wounds.\" Two civilians were also being treated for shrapnel wounds. Kherson was captured by Russian forces in the first days of the February 2022 invasion but retaken by Ukrainian forces a little more than a year ago. It is under constant attack from Russian forces entrenched in new positions on the east bank of the Dnipro River, with shelling very heavy in recent days.  Video posted on social media showed debris and shattered building materials in different areas of the station.  Ukrainian railways said evacuees were taken from the station by bus northwest to the town of Mykolaiv, which has been subject to fewer Russian attacks. Delayed trains were rescheduled. The general prosecutor's office said Russian shelling had struck other infrastructure sites and dwellings in the city. Roman Mrochko, head of Kherson's military administration, had earlier reported a series of Russian attacks using different weapons. Four people were injured."
}