{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0F0P6_L.jpg",
  "title": "Exclusive-US targets Houthi anti-ship missiles in new strike on Yemen, officials say",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 16, 2024 11:24AM ET",
    "Updated Jan 16, 2024 12:41PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/exclusiveus-targets-houthi-antiship-missiles-in-new-strike-on-yemen-officials-3275464",
  "paragraph": "© Reuters. FILE PHOTO: An aircraft takes off to join the U.S.-led coalition to conduct air strikes against military targets in Yemen, aimed at the Iran-backed Houthi militia that has been targeting international shipping in the Red Sea, from an undisclosed location,\nBy Idrees Ali and Phil Stewart WASHINGTON (Reuters) -The U.S. military on Tuesday carried out a new strike in Yemen against four Houthi anti-ship ballistic missiles, two U.S. officials told Reuters, the latest move against the Iran-aligned group over its targeting of Red Sea shipping.  One of the officials said the missiles were struck because they were being prepared to target ships in the region. The U.S. strike came a day after Houthi forces hit the U.S.-owned and operated dry bulk ship Gibraltar Eagle with an anti-ship ballistic missile. Houthi attacks on Red Sea shipping have continued even after the U.S. and Britain last week launched an initial wave of strikes to degrade Houthi capabilities. But unlike the initial U.S. strikes last week, which were against pre-planned targets, Tuesday's strikes appeared to show that the U.S. military would proactively go after Houthi military capabilities as they are detected. If confirmed, that would usher in a far more assertive posture for the U.S. military toward the Houthis.  The U.S. military's Central Command on Monday disclosed the first seizure in more than four years of advanced Iranian-manufactured ballistic missile and cruise missile components, in a Jan. 11 operation that saw two U.S. Navy SEALs lost at sea near the coast of Somali. \"Initial analysis indicates these same weapons have been employed by the Houthis to threaten and attack innocent mariners on international merchant ships transiting in the Red Sea,\" Central Command said in a statement. The Houthis, who control the most populous parts of Yemen, have claimed their attacks on commercial ships are aimed at supporting the Palestinians in Israel's war in Gaza. Their attacks have disrupted global shipping and stoked fears of global inflation. They have also deepened concern that fallout from the Israel-Hamas war could destabilize the Middle East. The Houthi movement has vowed to keep up attacks despite the strikes last week against radar and missile capabilities. Some experts believe they welcome a conflict with the United States and its allies. A Malta-flagged, Greek-owned bulk carrier was targeted and hit by a missile while northbound in the Red Sea 76 nautical miles northwest of the Yemeni port of Saleef, a security firm said on Tuesday. Houthi military spokesperson Yahya Sarea in a statement said it had a \"direct hit\" on the Zografia ship that was heading to Israel with naval missiles. The bulk carrier sustained material damage but no injuries, a security firm and two Greek shipping ministry sources said. \nOn Monday, the Gibraltar Eagle's U.S.-based operator Eagle Bulk Shipping (NYSE:EGLE) said it was hit by an \"unidentified projectile\" while sailing 100 miles (160 km) off the Gulf of Aden. The attack caused a fire in a hold of the vessel, which was carrying steel products, but no injuries, and the ship was continuing on its way, it said. Container vessels have been pausing or diverting from the Red Sea that leads to the Suez Canal, the fastest freight route from Asia to Europe. Many ships have been forced to take the longer route via the Cape of Good Hope instead."
}