{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0B01K_L.jpg",
  "title": "Israel rejects genocide charges, tells World Court it must defend itself",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 11, 2024 09:04PM ET",
    "Updated Jan 12, 2024 09:42AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/israel-to-counter-genocide-accusations-at-world-court-3272960",
  "paragraph": "© Reuters. People sit inside the International Court of Justice (ICJ) on the day of the trial to hear a request for emergency measures by South Africa, who asked the court to order Israel to stop its military actions in Gaza and to desist from what South Africa says\nBy Anthony Deutsch, Toby Sterling and Stephanie van den Berg THE HAGUE (Reuters) -Israel on Friday rejected as false and \"grossly distorted\" accusations brought by South Africa at the U.N.'s top court that its military operation in Gaza is a state-led genocide campaign against Palestinians. Arguing it was acting to defend itself and was fighting Hamas, not the Palestinian population, Israel called on the International Court of Justice (ICJ) to dismiss the case as groundless and reject South Africa's request to order it to halt the offensive. \"This is no genocide,\" lawyer Malcolm Shaw said. South Africa told the court on Thursday that Israel's aerial and ground offensive - which has laid waste to much of the enclave and killed almost 24,000 people, according to Gaza health authorities - aimed to bring about \"the destruction of the population\" of Gaza. Israel rejected the accusations, saying it respected international law and had a right to defend itself. Israel launched its war in Gaza after a cross-border rampage on Oct. 7 by militants from Hamas, which is sworn to Israel's destruction. Israeli officials said 1,200 people were killed, mainly civilians, and 240 taken hostage. \"The appalling suffering of civilians, both Israeli and Palestinian, is first and foremost the result of Hamas' strategy,\" the Israeli foreign ministry's legal adviser, Tal Becker told the court. \"If there were acts of genocide, they have been perpetrated against Israel,\" Becker said. \"Hamas seeks genocide against Israel.\"  The 1948 Genocide Convention, enacted in the wake of the mass murder of Jews in the Nazi Holocaust, defines genocide as \"acts committed with intent to destroy, in whole or in part, a national, ethnical, racial or religious group\". SUFFERING Israel, its defence team argued, was doing what it could to alleviate the humanitarian suffering in Gaza, including efforts to urge Palestinians to evacuate.  The court is expected to rule later this month on possible emergency measures - including South Africa's request that it orders Israel to halt its offensive. It will not rule at that time on the genocide accusations. Those proceedings could take years. The ICJ's decisions are final and without appeal, but the court has no way to enforce them.  Palestinian backers with flags marched through The Hague and watched proceedings on a giant screen in front of the Peace Palace. As the Israeli delegation spoke in court, they chanted: \"Liar! Liar!\" Asked what she thought of Israel's arguments that the Gaza campaign was a matter of self-defence, Neen Haijjawi, a Palestinian who recently came to Netherlands said: \"How can an occupier that's been oppressing people for 75 years say it's self-defence?\" Israeli supporters were holding a separate gathering of family members of hostages taken by Hamas.  Israel has said South Africa is acting as a mouthpiece for Islamist Hamas, which is designated as a terrorist group by the United States, the European Union, Britain and several other nations. South Africa has rejected that accusation. Since Israeli forces started their offensive, nearly all of Gaza's 2.3 million people have been driven from their homes at least once, leading to a humanitarian catastrophe. \nPost-apartheid South Africa has long advocated the Palestinian cause, a relationship forged when the African National Congress' struggle against white-minority rule was supported by Yasser Arafat's Palestine Liberation Organisation. \"My grandfather always regarded the Palestinian struggle as the greatest moral issue of our time,\" Mandla Mandela, a grandson of the late South Africa president Nelson Mandela, said at a rally in support of the Palestinians in Cape Town."
}