{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "US, partners condemn arms transfers between North Korea and Russia",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 09, 2024 03:42PM ET",
    "Updated Jan 09, 2024 05:06PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-partners-condemn-arms-transfers-between-north-korea-and-russia-3270633",
  "paragraph": "By Kanishka Singh WASHINGTON (Reuters) -A joint statement by the United States and its partners on Tuesday condemned arms transfers between North Korea and Russia, including what it termed as Russia's procurement of North Korean ballistic missiles and Moscow's use of those against Ukraine on Dec. 30 and Jan. 2. WHY IT IS IMPORTANT Both Moscow and Pyongyang have drawn closer since the beginning of the Ukraine conflict, though they deny making any arms deals. North Korean leader Kim Jong Un met President Vladimir Putin in Russia's Far East region last September and senior Russian officials have made several visits to Pyongyang. Last week the White House said Russia had used short-range ballistic missiles (SRBMs) sourced from North Korea to conduct multiple strikes against Ukraine, citing newly declassified intelligence. A senior Ukrainian official later corroborated the assertion. KEY QUOTES \"We are deeply concerned about the security implications that this cooperation has in Europe, on the Korean Peninsula, across the Indo-Pacific region, and around the world,\" the joint statement added. The statement was signed by the U.S., the UK, the EU, Australia, Germany, Canada and nearly 40 other partner nations. \"We condemn in the strongest possible terms (North Korea's) export and Russia's procurement of (North Korea's) ballistic missiles, as well as Russia's use of these missiles against Ukraine on December 30, 2023, and January 2, 2024,\" the joint statement added. Asked about the accusations during a call with reporters, Kremlin spokesman Dmitry Peskov on Tuesday said: \"No comment.\" CONTEXT Russia attacked Kharkiv with several missiles last week, killing two people and injuring over 60 in one of its biggest missile and drone strikes since the start of the large-scale war in February 2022. White House national security spokesman John Kirby (NYSE:KEX) said Washington will raise these arms deals between Russia and North Korea at the United Nations Security Council on Wednesday and demand \"Russia be held accountable.\" \nNorth Korea has been under a United Nations arms embargo since it first tested a nuclear bomb in 2006. U.N. Security Council resolutions - approved with Russian support - ban countries from trading weapons or other military equipment with North Korea."
}