{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0G0FB_L.jpg",
  "title": "Judge denies motion to dismiss charges against ex-Marine in Jordan Neely NY subway killing",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 17, 2024 07:02AM ET",
    "Updated Jan 17, 2024 10:51AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/new-york-judge-weighs-dismissing-charges-against-former-marine-in-jordan-neely-killing-3276104",
  "paragraph": "2/2\n© Reuters. FILE PHOTO: People hold a placard on the day of Jordan Neely's funeral, a man whose death has been ruled a homicide by the city's medical examiner after being placed in a chokehold on a subway train by former U.S. Marine Daniel Penny, in New York City, U.\n2/2\nNEW YORK (Reuters) - A former U.S. Marine sergeant, who was charged with manslaughter for killing Jordan Neely, a homeless man, on the New York City subway, must face trial after a judge decided on Wednesday against his motion to dismiss the indictment. Judge Maxwell Wiley rejected Penny's motion to dismiss the charges at a hearing on Wednesday. Penny, who wore a dark green suit and gray tie and did not speak in the hearing, is due back in court on March 20. Daniel Penny was captured in videos recorded by bystanders putting Neely in a chokehold from behind for several minutes on May 1 while they rode on a subway train in Manhattan. The killing gained widespread public attention, with some viewing Neely, who was Black, as a victim of a vigilante, and others, including some Republican politicians, feting Penny as a hero. Penny, who is white, pleaded not guilty later that month to charges of manslaughter and criminally negligent homicide in the Manhattan criminal court. He was released from custody on a $100,000 bond. The most serious charge is a felony that carries a maximum sentence of 15 years in prison. Neely was a 30-year-old former Michael Jackson impersonator who had struggled with mental illness and had spent time in the city's strained shelter system. In the minutes before he was killed, he had been shouting about how hungry he was and that he was willing to return to jail or die, according to passengers in the car. Penny has said he acted to defend himself and other passengers, and did not intend to kill Neely, and his lawyers had argued that prosecutors did not present sufficient evidence of this to the grand jury that issued the indictment. \nPolice questioned Penny on the day Neely died, but he would not be arrested and make an initial court appearance until 11 days later. Witnesses have said Neely did not physically threaten or attack anyone before Penny grabbed him. His killing renewed debate about gaps in the city's systems for homeless and mentally ill New Yorkers."
}