{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0D033_L.jpg",
  "title": "Taiwan's new president faces 'tough' time with China pressure, no parliament majority",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 14, 2024 01:20AM ET",
    "Updated Jan 14, 2024 01:31AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Derick Lim",
        "2024-01-14 13:41:20",
        "A major headache to 💩 stirring US",
        "https://www.investing.com/members/214364779"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/taiwans-new-president-faces-tough-time-with-china-pressure-no-parliament-majority-3274074",
  "paragraph": "5/5\n© Reuters. Taiwan President-elect Lai Ching-te, of Democratic Progressive Party's (DPP) and his running mate Hsiao Bi-khim wave as they hold a press conference, following the victory in the presidential elections, in Taipei, Taiwan January 13, 2024. REUTERS/Ann Wang\n2/5\nBy Yimou Lee, Sarah Wu and James Pomfret TAIPEI (Reuters) - Taiwan's president-elect Lai Ching-te could face a tough four years in office with no parliamentary majority, an opposition which wanted to re-start a vexed service trade deal with China and the ever present threat of military action from Beijing. Lai, from the ruling Democratic Progressive Party (DPP), won on Saturday by a comfortable margin though with less than half the vote but his party lost control of parliament on which Lai will have to rely to pass legislation and spending. Lai takes office on May 20. China wasted little time in pointing out most electors voted against Lai, with its Taiwan Affairs Office saying that the DPP \"cannot represent the mainstream public opinion\" on Taiwan, though it did not name Lai directly unlike in the vote's run-up when it regularly called him a dangerous separatist. Lin Fei-fan, a former DPP deputy secretary general who is now a senior member of a party think tank, told Reuters he's \"fairly worried\" that the new government will have a \"very tough\" four years especially on China-related issues. He said opposition lawmakers, who together form a legislative majority, could step up exchanges with China and ask to re-start a controversial service trade pact which Taiwan shelved a decade ago in the face of mass protests.  \"That's what concerns us,\" he said. \"Local governments and parliament could form a line to pressure the central government.\" Both Taiwan's largest opposition party the Kuomintang (KMT) and small Taiwan People's Party (TPP) campaigned to re-start the trade services pact. Neither have confirmed if they will work together in parliament, though the TPP's chairman Ko Wen-je said on Saturday they will play the role of a \"critical minority\". The defeated KMT candidate Hou Yu-ih did not directly answer a question on the two parties teaming up on Sunday, saying only that \"opposition parties have the responsibility of being opposition parties\". China has rebuffed Lai's calls for talks. Lai and his party reject Beijing's sovereignty claims and say only Taiwan's people can decide their future. Hu Xijin, former editor of the widely-read state-backed Chinese newspaper the Global Times who remains a prominent Chinese commentator, wrote a social media post that it was irrelevant who Taiwanese voted for when it came to bringing the island under Chinese control ultimately. \"The strength of the mainland is already here, and the will of 1.4 billion people to complete the reunification of the country is also here. Who wins Taiwan's local elections is by no means the most important thing,\" he wrote. THE 'CORRECT CHOICE' China had framed the vote as a choice between war and peace and warned electors to make the \"correct choice\" did not name any candidates it wanted people to support. Lai I-chung, president of the Taipei-based think-tank the Prospect Foundation, said China was seeking to justify its approach to Taiwan by claiming they were able to end the DPP's parliament majority. \"In my view this means they will continue its hard line towards Taiwan. There's no relenting on the pressure in my view, by China, and so the situation will be tense. But I don't think that will lead to conflict but of course China will make everything difficult for William Lai,\" he said, using Lai's English name. Over the past year-and-a-half China has staged two rounds of major war games around Taiwan and its forces regularly operate in the Taiwan Strait. China has also restricted or made more expensive some trade with Taiwan. The DPP had called all that election interference. China says election interference allegations were DPP \"dirty tricks\" to win votes. Su Tzu-yun, a research fellow at Taiwan's top military think tank, the Institute for National Defence and Security Research, said that he does not expect any military action from Chinese President Xi Jinping in the coming months. \"He will observe what Lai Ching-te says leading up to his inauguration in May,\" Su said. \"The Chinese Communist Party is a super realist. What it cannot bear is political risk.\" China has never renounced the use of force to bring Taiwan, which it calls \"sacred\" Chinese territory, under its control. Victor Gao, a professor at Soochow University in China noted that 60% of voters did not support Lai and the KMT had won more seats in parliament, meaning the elections \"have not created a storm\". \"It is very clear that China has unlimited patience in promoting peaceful reunification and zero-tolerance for any push for Taiwan independence,\" he said. \"In the end, the party that pulls the trigger will not be China, but people who push for Taiwan independence.\"  China's military has yet to comment on the election. On Sunday, its Eastern Theatre Command, which is responsible for the area around Taiwan, showed pictures on its WeChat account of missile boats doing live fire drills though it did not say where. \nOne of the boat's predecessors, it said, took part in an August 1965 battle between the Chinese and Taiwanese navies in which China claimed victory. \"Today, the troops have inherited the red genes of bravery and being good at fighting,\" it added."
}