{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0D0A9_L.jpg",
  "title": "Fierce fighting in Gaza as war hits 100 days",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 14, 2024 12:53PM ET",
    "Updated Jan 14, 2024 05:47PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/fierce-fighting-in-gaza-as-war-hits-100-days-3274148",
  "paragraph": "5/5\n© Reuters. Trails of smoke are seen in the sky, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, as seen from Israel, January 14, 2024. REUTERS/Amir Cohen\n2/5\nBy Nidal al-Mughrabi and Fadi Shana DOHA/GAZA (Reuters) - Israeli tanks and aircraft hit targets in southern and central Gaza on Sunday and there were fierce gun battles in some areas as the war reached 100 days since the Oct. 7 attack led by gunmen from the Islamist Hamas movement. Communications and internet services were down for the third day running, complicating the work of emergency and ambulance crews trying to help people in areas hit by fighting. The clashes were concentrated in the southern city of Khan Younis, where Hamas said its fighters hit an Israeli tank, as well as in Al-Bureij and Al Maghazi in central Gaza, where the military said several fighters were killed. Hamas' armed wing spokesman, Abu Ubaida, said on Sunday the fate of many Israeli hostages captured on Oct. 7 has become unknown. In his first televised appearance for several weeks, marking the 100th day since the outbreak of the war, he said many of the hostages \"may have been killed\", blaming their fate on Israel. Hamas showed it retained rocketry capacity, launching a fresh salvo on Sunday at Ashdod, an Israeli town 40 km (25 miles) away. There was no word of any casualties. Abu Ubaida said the group had been told by \"several parties in the resistance fronts that they will expand their strikes on the Israeli enemy in the coming days.\"  The Israeli military said it destroyed several silos used by Hamas to fire missiles at Israel. Over the past 24 hours, the Gaza health ministry said 125 people had been killed and 265 wounded, bringing the total number confirmed to have been killed since the start of the war to almost 24,000, with more than 60,000 wounded. Israel's military said it has killed around 9,000 Palestinian fighters, and lost 189 soldiers, in the Gaza war so far.  Speaking through video link to a conference in Istanbul, Hamas leader Ismail Haniyeh praised the Oct. 7 attack by the group's fighters who rampaged through Israeli communities around the Gaza Strip, killing more than 1,200 people and seizing around 240 hostages, according to Israeli tallies. \"We are not seekers of wars. We are seekers of freedom,\" he said, saying the attack was, in part, a response to the blockade Israel and neighbouring Egypt placed on the Gaza Strip after Hamas seized control of the territory in 2007. The Iranian-backed group is sworn to Israel's destruction. NEW PHASE OF WAR The Israeli military says it has shifted to a new phase of the war, focused on the southern end of the territory, where almost 2 million people are now sheltering in tents and other temporary accommodation, after the initial phase centred on clearing the northern end including Gaza City. In the northern Gaza Strip, health officials said an Israeli air strike killed a local journalist, raising the number of journalists killed in the Israeli offensive to more than 100, according to the Gaza government media office. In a statement on Dec. 16, in response to the death of a journalist in Gaza, the Israeli army said it \"has never, and will never, deliberately target journalists\". Prime Minister Benjamin Netanyahu has brushed off calls for a ceasefire, saying Israel will keep going until it achieves complete victory over Hamas and recovers the 132 remaining hostages. The military says, though, the next phase of the war will see months of more targeted operations against the movement's leaders and positions.  On Israel's northern border with Lebanon, where there has been a constant, low-level exchange of fire between troops and fighters from the Iran-backed Hezbollah militia, the military said it killed four armed militants trying to cross the border. It said several anti-tank missiles were fired into northern Israel, one of which hit a house in Kfar Yuval village. Medical officials said a 76-year-old woman and her son were killed. The son was in the village's security squad, the military said. In Rafah in the southern Gaza Strip, Nana, a 17-year-old high school student displaced from northern Gaza, said 100 days of war \"turned our life upside down.\" \"We demand the occupation not only to end the war but also compensation for the psychological damage of displacement and the hardships endured,\" she said. The war in Gaza has also stoked violence in the Israeli-occupied West Bank. The Palestinian health officials said Israeli forces killed five Palestinians, including boys aged 14, 16 and 17, in three separate incidents in the West Bank. The Israeli military said two Palestinians in a car rammed through one of its checkpoints near Hebron and opened fire on pursuing troops. They were killed by return fire, the military said. \nAsked about a 14-year-old boy killed near Jericho, it said soldiers had shot at Palestinians who threw explosives at them. Palestinian health officials said two boys aged 16 and 17 were killed near Ramallah in the West Bank. The Israeli military said troops shot two Palestinians throwing a bomb at an army base.  (Reporting and writing by Nidal al-Mughrabi in Doha, Fadi Shana in Gaza; Additional reporting by Ari Rabinovitch in Jerusalem, Ali Sawafta in Ramallah; Editing by Hugh Lawson, Sharon Singleton and Ros Russell)"
}