{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0B0IZ_L.jpg",
  "title": "Yemen's enigmatic Houthi leader is fierce battlefield commander",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 12, 2024 09:13AM ET",
    "Updated Jan 12, 2024 04:22PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/yemens-houthi-leader-whose-mountain-fighters-are-taking-on-global-powers-3273589",
  "paragraph": "© Reuters. A person holds a placard with a picture of Yemen's Houthi movement leader Abdul-Malik al-Houthi, as supporters of the Houthi movement rally to denounce air strikes launched by the U.S. and Britain on Houthi targets, in Sanaa, Yemen January 12, 2024. REUTE\nBy Michael Georgy and Aziz El Yaakoubi DUBAI/RIYADH (Reuters) - Abdul Malik al-Houthi, enigmatic leader of Yemen's Houthi fighters whose attacks on Red Sea shipping have drawn fire from the U.S. and British militaries, created the defiant force challenging world powers from a ragtag militia in sandals. Multiple shipping lines have suspended operations or taken the longer route around Africa because of the campaign by the Houthis, who rule most of Yemen after beating tough odds in a war against forces backed by powerhouse Saudi Arabia. The Iran-backed militants have vowed to keep up the pressure on the global shipping trade, which could take a toll on the world economy, until Israel halts its bombardment of Gaza to wipe out Hamas, which is also backed by Iran. The Houthis said they would hit back after U.S. and British warplanes, ships and submarines struck across Yemen overnight in retaliation for the attacks on Red Sea shipping, a widening of regional conflict over the Gaza conflict that some analysts say could undermine the Houthis' hard-fought domestic gains. \"They have been able to survive the last eight years, have expanded their power, but now they are inviting air strikes from the world's most powerful military,\" said Tobias Borck, the Royal United Services Institute's Middle East Security Senior Research Fellow. Al-Houthi established a reputation as a fierce battlefield commander before emerging as head of the Houthi movement, mountain fighters who have been battling a Saudi-led military coalition since 2015 in a conflict that has killed tens of thousands, devastated Yemen's economy and left millions hungry. Under the direction of al-Houthi, who is in his 40s, the group has acquired tens of thousands of fighters and a huge arsenal of armed drones and ballistic missiles. It has used these to repeatedly strike strategic Saudi infrastructure despite years of bombings on its territory. In January 2022, the Houthis raised the stakes with a missile attack on Gulf tourism and commercial hub the United Arab Emirates, like Saudi Arabia a key U.S. ally.  \"He (al-Houthi) managed to transform a rural militia mostly engaged in insurgency tactics into one of the most resilient non-state armed groups of the region,\" said Ludovico Carlino, Principal Analyst, Country Risk, Middle East and North Africa at HIS Markit.  In a speech in 2022, al-Houthi said its goal was to be able to strike any target in Saudi Arabia or the United Arab Emirates, both major OPEC oil producers who view Iran and its proxies as major security threats to the Middle East and beyond. SHROUDED IN MYSTERY  Al-Houthi is known for rarely staying long in one place, for never meeting the media and for an extreme reluctance to make scheduled public appearances. Since the start of the Yemen war -- widely seen as a proxy conflict between Saudi Arabia and Iran -- foreign officials who dealt with al-Houthi have never met him in person, said a source familiar with the matter. Many seeking meetings were asked to travel to the Houthi stronghold of Sanaa, where a Houthi security convoy would take them to safe houses and conduct security checks before leading them to an upstairs room where he would only appear on a screen. The Houthi movement was formed to fight for the interests of the Zaydi Shi’ites, a minority sect that ruled a 1,000-year kingdom in Yemen until 1962 but felt progressively threatened by the 1990-2012 rule of Ali Abdullah Saleh. Iran's backing of the Houthis, who forced Yemen's Saudi-backed internationally recognised government into exile in 2021, has helped Tehran extend its regional proxy network, which includes Hezbollah in Lebanon and militias in Iraq and Syria. Yemen experts say the Houthis are motivated primarily by a domestic agenda though they share a political affinity for Iran and Hezbollah. The Houthis deny being puppets of Tehran and say they are fighting a corrupt system and regional aggression. 'AXIS OF RESISTANCE' Iran champions the Houthis as part of its regional \"axis of resistance\" - a swathe of Iran-backed groups - and the movement has adopted elements of Tehran's revolutionary ideology. Saudi Arabia and its allies accuse Iran of arming and training the Houthis, allegations denied by Tehran. Analysts say the Houthis are more independent than Lebanon's Hezbollah. The Houthis, like other sides in Yemeni politics, operate in a land of shifting alliances. In late 2017, they assassinated ex-president Saleh in a roadside RPG ambush after he switched sides in favour of the Saudi-led alliance. They have also created a military state to tighten their grip. \"The Houthis also rely on a very brutal internal intelligence apparatus, suppressing any kind of dissent,\" analyst Carlino said. In pre-recorded speeches and sermons, al-Houthi, who traces his lineage to the Prophet Mohammad, asserts that his movement is under total siege because of its religion. \n\"We must focus on preserving the authenticity of our Islamic affiliation and identity,\" he said in one speech, denouncing a 'soft war' of influence to weaken Houthi morale. \"Today we are facing the most dangerous war.\"  (This story has been refiled to remove analyst quote from paragraph 19)"
}