{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0E067_L.jpg",
  "title": "On war's 100th day, fan and foe agree: Netanyahu's reign won't last",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 15, 2024 03:05AM ET",
    "Updated Jan 15, 2024 06:32PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/on-wars-100th-day-fan-and-foe-agree-netanyahus-reign-wont-last-3274244",
  "paragraph": "5/5\n© Reuters. A girl puts her hand on a list of names of Israelis killed since the October 7 attack by Palestinian Islamist group Hamas, during a 24-hour protest, that calls for the release of Israeli hostages in Gaza and marks 100 days since the ongoing conflict betwe\n2/5\nBy Maayan Lubell RAMLA, Israel (Reuters) - Published a year before Hamas' Oct 7. attack, Prime Minister Benjamin Netanyahu's autobiography lays out a scenario that bears a chilling similarity to the events of Israel's deadliest day. \"Hamas intended to surprise Israel by initiating the simultaneous penetration of hundreds of terrorists into the country,\" he wrote of a decade-old plan of the Palestinian militant group which prompted Israeli forces to go to war in Gaza in 2014 to avert such an assault.  \"They planned to enter kindergartens and schools, murder Israelis and whisk dozens of hostages to Gaza back through the tunnels. This could spell disaster.\" But on Oct. 7 last year, Hamas militants executed their plot in a rampage in southern Israel, with one difference: hostages weren't taken into Gaza through tunnels but across a breached border fence.  Israelis are still reeling from the killing of 1,200 people, most of them civilians and kidnapping of 240 more, including children and elderly. The assault triggered an Israeli military campaign in which nearly 24,000 Palestinians have been killed. Stunned by the massive security failure, many want Netanyahu out. A poll published by the non-partisan Israel Democracy Institute on Jan. 2 showed only 15% of Israelis want Netanyahu to remain in office after the war on Hamas ends, in line with previous surveys that have shown his popularity sharply down.  But the embattled leader, who for years has brandished a Mr. Security image, shows no sign of wanting to leave.  \"He's defiant. He's apparently taken a strategic decision to survive politically even this. I think it's a quixotic aim and sooner or later I believe that his own colleagues will tell him that his time is up,\" said political analyst Amotz Asa-El.  Political change looks unlikely in the near term while fighting in Gaza still rages. Netanyahu meanwhile, has vowed to pursue war until complete victory over Hamas with security chiefs warning combat will run through 2024.  But there are signs within Netanyahu's government that some are jockeying for position.  Reports of wrangling within the security cabinet have been leaked to the Israeli press and far-right police minister Itamar Ben-Gvir, largely cut out of any war decisions, has taken swipes at Benny Gantz, Israel's former centrist defence chief who has joined Netanyahu's emergency government and war cabinet.  PROTESTS Anti-government street protests that had swept Israel for almost a year until the attack have been rekindled in recent weeks, calling for elections to be held. But those are still relatively small compared with the mass demonstrations of 2023. \"It's time for him to go home, said marketing manager Noa Weinpress, in Tel Aviv. \"It should have happened on the eighth of October and if not, definitely now, after a hundred days.\"  Even some of Netanyahu's biggest fans seem resigned to the inevitable departure of a leader they still admire. \"I think he'll win the war and step down, with dignity,\" said Yossi Zroya, a member of Netanyahu's Likud Party and Shawarma stand owner in Ramla. It was here Netanyahu was greeted with cheers of \"King Bibi\" 15 months ago at an election campaign event where he pledged to return security to the streets. The sentiment was echoed by other supporters strolling through Ramla market. \"Netanyahu is a genius. He's not to blame for what happened,\" said Rafi Kimchi, a diamond dealer visiting from nearby Herzliya. \"But I think he's done. It's finished.\" Eyeing disillusioned Likud voters, Ben-Gvir could be looking to set himself apart and leave the government ahead of a campaign, said Asa-El, who is research fellow at the Shalom Hartman Institute in Jerusalem. Gantz, meanwhile, has seen his popularity soar in the polls, seen as a responsible man of the people. Numerous Likud veterans have long been vying to succeed Netanyahu, including Foreign Minister Israel Katz and lawmaker Yuli Edelstein. Yossi Cohen, Israel's former spy chief and a frequent commentator on news shows in recent weeks, has also been floated as a successor, with some polls giving a party led by him around 12 of the Knesset's 120 seats.  \n\"Nothing is out of the question,\" Cohen told N12's Uvda television show on Jan. 4. \"I have not decided yet.\"  Asa-El predicted a \"political bang\" once fighting subsides, possibly a premature election. \"There will be vast, big and multiple demonstrations if the politicians will try to drag their feet,\" he said."
}