{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBR0BQ_L.jpg",
  "title": "Turkey to reinforce military bases in N.Iraq after 12 soldiers killed",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Dec 28, 2023 08:24AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/turkey-to-reinforce-military-bases-in-niraq-after-12-soldiers-killed-3264364",
  "paragraph": "© Reuters. FILE PHOTO: Turkish President Recep Tayyip Erdogan delivers statements, in Budapest, Hungary, December 18, 2023. REUTERS/Bernadett Szabo/File Photo\nANKARA (Reuters) - Turkey will reinforce its newly established permanent bases in northern Iraq in the coming months, after 12 Turkish soldiers were killed in the region, President Tayyip Erdogan said on Thursday. The twelve were killed last week in northern Iraq in clashes with the militants of the outlawed Kurdistan Workers' Party (PKK) based there.  \"In recent years, we have built hundreds of kilometres-long roads in northern Iraq for our permanent bases. We carry out the same activities in new places we have controlled,\" Erdogan told a televised meeting in Ankara. \"By the arrival of spring, we will have completed the infrastructure of our newly established bases (in northern Iraq), and make terrorists unable to set foot in the region.\" \nTurkish forces regularly carry out strikes in neighbouring Iraq as part of the country's offensive against PKK militants. Since 2019, Turkey has launched a series of operations in northern Iraq after Erdogan's declaration of \"a new security concept in combating terrorism\" and plan to \"neutralise terrorism and terrorists at source.\" The PKK, which demands greater Kurdish rights and has large fortifications around northern Iraq, is designated a terrorist group by Turkey, the United States and the European Union. It took up arms against the Turkish state in 1984 and over the decades it has conducted many deadly attacks in Turkey."
}