{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0E03H_L.jpg",
  "title": "Hamas appears to show dead bodies of two hostages after warning Israel",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 14, 2024 11:56PM ET",
    "Updated Jan 16, 2024 05:51AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Ken Roth",
        "2024-01-16 20:29:22",
        "Hamas are starting to k..ill witness to their crimes.",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/china-calls-for-gaza-peace-conference-hamas-to-disclose-fate-of-israeli-hostages-3274193",
  "paragraph": "4/4\n© Reuters. FILE PHOTO: People hold posters depicting Israeli hostages in Gaza during the event \"100 days 100 voices\" to mark 100 days since the October 7 Hamas attack, calling for their release, in front of the Opera Bastille in Paris, France, January 14, 2024. REUT\n2/4\nBy Nidal al-Mughrabi, Fadi Shana and Ari Rabinovitch DOHA/GAZA/JERUSALEM (Reuters) - Hamas appeared to show the dead bodies of two Israeli hostages on Monday after warning Israel they might be killed if it did not stop its bombardment of Gaza. A new video released by the Palestinian militant group purportedly showed the bodies of Yossi Sharabi, 53, and Itai Svirsky, 38, who had appeared in an initial video on Sunday. It also showed a third Israeli hostage, university student Noa Argamani, 26, seemingly reading a script in front of a blank white wall, saying the two were killed by Israeli strikes. Israel's military spokesperson said there was serious concern regarding the fate of the hostages purported to be dead in the video, while specifying that one of them, whom he identified as Svirsky, was not killed by Israeli fire. \"Itai was not shot by our forces. That is a Hamas lie. The building in which they were held was not a target and it was not attacked by our forces,\" said military spokesperson Rear Admiral Daniel Hagari, who did not give the name or any details about the second person as per the family's request. \"We don't attack a place if we know there may be hostages inside,\" he said, adding that areas nearby had been targeted.  Reuters was unable to verify what had happened to the three, who were among some 240 people taken hostage by Islamist Hamas militants during a surprise cross-border rampage into southern Israel on Oct. 7. Around half of those hostages were released during a short-lived November truce, but Israel says 132 remain in Gaza and that 25 have died in captivity. The three Israelis were shown in a Hamas video on Sunday in which the group urged the Israeli government to halt its aerial and ground offensive and bring about their release. It ended with the caption: \"Tomorrow (Monday) we will inform you of their fate.\" Israeli officials have generally declined to respond to Hamas' public messaging on the hostages.  Forensic officials have said that autopsies of slain hostages who had been recovered found causes of death inconsistent with Hamas' account they had died in air strikes. Israel has also made clear it is aware of the risks to hostages from its offensive and is taking precautions. BOMBARDMENT INTENSIFIES As night fell, residents said Israeli planes and tanks intensified their bombardment again across Gaza. In Al-Bureij in central Gaza, medics said an Israeli missile strike killed four people and wounded others, while in the Tel Al-Hawa suburb of Gaza City in the north, they said two people were killed and others wounded by an Israeli strike. Israel's military said it had withdrawn another division of troops as part of plans for more targeted operations against Hamas leaders in the south after an initial all-out offensive centred on the heavily built-up northern end of the Strip.  Israeli Defence Minister Yoav Gallant, speaking around the same time as the latest hostage video was shown, said intense military operations in southern Gaza were almost over, but that Hamas would not agree to release any more hostages without military pressure. The armed wing of Hamas said its fighters had ambushed and killed five Israeli soldiers in the southern city of Khan Younis. Palestinian health officials said earlier that seven people had been killed and others hurt in an Israeli air strike near the city's Nasser hospital.  Israel's campaign in Gaza since the Oct. 7 Hamas assault has turned much of the Palestinian territory into a wasteland and killed, health officials say, some 24,100 people and wounded nearly 61,000. Health officials said 132 were killed in the past 24 hours, suggesting to Palestinians that there has been little let-up in the intensity of Israel's offensive despite its announcement of a shift to the new, more targeted phase. Almost two million displaced people are sheltering in tents and other temporary accommodation in southern Gaza amid the fighting, and are facing increased risks of starvation and disease due to chronic shortages of food, fuel and medicines. VIOLENCE SPREADS The more than three-month-old conflict has intensified violence in the Israeli-occupied West Bank and in the wider Middle East and on Monday it reached further into Israel. Palestinians carried out coordinated car-rammings in the central Israeli town of Raanana, killing a woman and injuring 12 other people, police and medical officials said. France said two of its nationals were among the injured. The two suspects were from the same family in Hebron in the Israeli-occupied West Bank and at least one of the vehicles used in the attacks had been stolen, police said. Sami Abu Zuhri, head of Hamas' political unit in exile, told Reuters the incidents were linked to Israeli \"crimes\" and were further evidence that the conflict was expanding. Violence has also flared in the West Bank, run by the internationally recognised Palestinian Authority, where the health ministry says 351 people have been killed as Israel conducts raids that it says are aimed at flushing out militants. A man and a woman were killed on Monday by Israeli gunfire in Dora near Hebron during what Palestinian official news agency WAFA said were stone-throwing clashes that erupted after Israeli forces raided the town. Separately, WAFA said a Palestinian security officer, Mahmoud Abdullah Khalifa, was killed near the West Bank town of Tulkarm. Further afield, Houthi fighters who control much of Yemen have stepped up attacks on ships in the Red Sea it says are linked to Israel out of what they say is solidarity with the people of Gaza. \nOn Monday they damaged a U.S.-owned vessel carrying steel products with an anti-ship ballistic missile south of the Yemeni port of Aden, saying they were expanding their targets after U.S. and British air strikes on their positions in Yemen.  (This story has been refiled to correct the spelling of Hamas in paragraph 16)"
}