{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0O0SD_L.jpg",
  "title": "Turkey's Erdogan signs off on Sweden's NATO membership",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 25, 2024 02:35PM ET",
    "Updated Jan 26, 2024 10:16AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/turkeys-erdogan-signs-off-on-swedens-nato-membership-ratification-3283398",
  "paragraph": "© Reuters. FILE PHOTO: Turkish President Recep Tayyip Erdogan speaks at a press conference during a NATO summit in Madrid, Spain June 30, 2022. REUTERS/Yves Herman\n(Corrects spelling of Erdogan in headline) ANKARA (Reuters) -Turkey's president finally approved Sweden's bid to join NATO on Thursday, ending months of delay and leaving only Hungary standing in the way of Stockholm's membership of the military alliance. Tayyip Erdogan signed off on the Turkish parliament's earlier ratification of the bid, the presidency's official gazette showed, about 20 months after Stockholm first asked to join NATO following Russia's full-scale invasion of Ukraine. \"We welcome Turkey's ratification of Sweden's NATO application. We have now reached a decisive milestone on the road to full membership in NATO,” Swedish Prime Minister Ulf Kristersson said on social media network X. \"Only Hungary's ratification remains before Sweden can become a member of NATO,\" Swedish Foreign Minister Tobias Billstrom added on the same platform. Turkey's parliament ratification on Tuesday cleared the biggest remaining hurdle to expanding the Western military alliance. The presidency's communications directorate said Erdogan had \"decided to publish the law\" on Sweden's NATO accession, passed by parliament, and signed a presidential decree approving Stockholm's accession protocol. The delay had frustrated some of Ankara's allies but allowed it to extract certain concessions.  Ankara will now expect the United States to begin working on securing the U.S. Congress' endorsement for a sale of $20 billion worth of F-16 fighter jets to Turkey, which both Erdogan and members of Congress had linked to Sweden's ratification. Erdogan's approval of the Swedish bid comes a day after U.S. President Joe Biden sent a letter to leaders of key Capitol Hill committees, informing them of his intention to begin the formal notification process for the F-16 sale once Ankara completes Sweden's NATO accession process. \nEarlier, the U.S. Ambassador to Turkey told Reuters that the State Department will immediately send Congress the notification once the instrument of ratification is received in Washington. The final accession document from Ankara - the instrument of ratification - will now be sent to Washington as per NATO rules."
}