{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBO077_L.jpg",
  "title": "Ukraine draft law proposes lowering mobilisation age to 25 from 27",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 25, 2023 06:38PM ET",
    "Updated Dec 25, 2023 06:50PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/ukraine-draft-law-proposes-lowering-mobilisation-age-to-25-from-27-3263267",
  "paragraph": "© Reuters. FILE PHOTO: Ukraine's President Volodymyr Zelenskiy holds a press conference, amid Russia's attack on Ukraine, in Kyiv, Ukraine, December 19, 2023. REUTERS/Alina Smutko/File Photo\nKYIV (Reuters) - Text of a draft law posted on the website of Ukraine's parliament late on Monday proposed lowering the age of those who can be mobilized for combat duty to 25 from 27. The proposed change comes as Ukraine's 22-month-old battle against Russia drags on. On Sunday, Ukraine and Russia exchanged claims over downed military aircraft, and on Monday Ukraine denied Russia's claim that its forces had seized the regional centre Maryinka in eastern Ukraine. The draft text detailed which Ukrainian citizens would be subject to enrolment for military registration of conscripts and said it would apply to those \"who have reached the age of 25.\"  An explanatory note signed by Defence Minister Rustem Umerov summarized key provisions of the draft law, saying they included the \"change of conscription age from 27 to 25 years.\" President Volodymyr Zelenskiy told his end-of-year news conference on Dec. 19 that the military had proposed mobilising 450,000-500,000 more Ukrainians, but that it was a \"highly sensitive\" issue that the military and government would discuss before deciding whether to send the proposal to parliament. Zelenskiy, who has yet to back the proposal publicly, said on Dec. 19 that he wanted to hear more arguments for mobilising additional people. \"This is a very serious number,\" he said.  Ukraine's troop numbers are not known, but in the past it has been said the country has around 1 million people under arms. U.S. officials estimate that hundreds of thousands have been killed and wounded since Russia invaded Ukraine. Neither country publishes its casualty figures.  \nDavid Arakhamia, the head of Zelenskiy's party in parliament, said the government was working on the bill at the request of the military and that it was due to be introduced on Monday. \"The military needs a solution to its problems,\" he said in a post on the Telegram messaging app earlier on Monday. \"Society wants to hear answers to all sensitive questions.\""
}