{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBO00G_L.jpg",
  "title": "Russia, Ukraine report six civilians killed in attacks on Kherson, Horlivka",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Dec 24, 2023 08:09PM ET",
  "comments": [
    1,
    [
      [
        "Otis Grant",
        "2023-12-25 13:08:07",
        "Who cares what Russia says they lie ",
        "https://www.investing.com/members/251132356"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/russia-ukraine-report-six-civilians-killed-in-attacks-on-kherson-horlivka-3263131",
  "paragraph": "© Reuters. FILE PHOTO: A view shows an optical sight on a rifle of a Ukrainian Army sniper at a shooting ground near a front line, amid Russia's attack on Ukraine, in Donetsk region, Ukraine December 23, 2023. REUTERS/Viacheslav Ratynskyi/File Photo\nBy Maria Starkova LVIV, Ukraine (Reuters) - Russian attacks on southern Ukraine's Kherson region killed five civilians on Sunday, Ukrainian officials said, while Russian-installed officials in the eastern town of Horlivka said one person was killed in result of Kyiv's shelling.  Russian forces abandoned the city of Kherson, the administrative centre of the Kherson region on the Dnipro River in southern Ukraine, and the western bank of the River over a year ago but have since subjected many areas there to constant shelling from their positions on the eastern bank. The deaths in Kherson occurred in an incessant Russian shelling of the city and the region over the preceding 24 hours, Ukrainian officials said.  Regional police said three people died in shelling of an apartment building and a private home in Kherson city. A woman died in a drone attack in a small town south of Kherson and a second woman was killed when a town further north came under heavy fire. Oleksandr Tolokonnikov, head of the press office of Kherson's regional military administration, told the Ukrainian public broadcaster that gas and water supplies were partially cut off due to the attacks, which also hit a medical facility. \"The windows were broken, the building was damaged,\" Tolokonnikov said.  Some 600 km (400 miles) northeast of Kherson in the town of Horlivka, in areas of Ukraine's Donetsk region under Russian control, Ukraine's shelling destroyed a shopping centre and several other buildings, a Russian-installed official said. The attacks killed one woman and wounded six civilians, the Russian-installed mayor of Horlivka, Ivan Prikhodko, said on the Telegram messaging app.  \nReuters could not independently verify the Russian and Ukrainian reports.  While Moscow and Kyiv deny targeting civilians in the war that Russia launched on Ukraine in February 2022, both sides have carried out numerous strikes on each other's infrastructure that is critical to their militaries."
}