{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "Iran says Revolutionary Guards attack Israel's 'spy HQ' in Iraq, vow more revenge",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 15, 2024 07:11PM ET",
    "Updated Jan 16, 2024 05:15AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/irans-guards-attack-israels-espionage-centers-in-iraq-state-media-says-3274529",
  "paragraph": "By Parisa Hafezi and Timour Azhari DUBAI/BAGHDAD (Reuters) -Iran's Revolutionary Guards said they attacked the spy headquarters of Israel in Iraq's semi-autonomous Kurdistan region, state media reported late on Monday, while the elite force said they also struck in Syria against the Islamic State. The strikes come amid concerns about the escalation of a conflict that has spread through the Middle East since the war between Israel and Palestinian Islamist group Hamas began on Oct. 7, with Iran's allies also entering the fray from Lebanon, Syria, Iraq and Yemen.  \"In response to the recent atrocities of the Zionist regime, causing the killing of commanders of the Guards and the Axis of Resistance ... one of the main Mossad espionage headquarters in Iraq's Kurdistan region was destroyed with ballistic missiles,\" the Guards said in a statement. Israeli government officials could not immediately be reached for comment. In addition to the strikes at northeast of Kurdistan's capital Erbil in a residential area near the U.S. consulate, the Guards said they \"fired a number of ballistic missiles in Syria and destroyed the perpetrators of terrorist operations\" in Iran, including the Islamic State. Islamic State claimed responsibility for two explosions in Iran this month that killed nearly 100 people and wounded scores at a memorial for top commander Qassem Soleimani. \"We assure our nation that the Guards' offensive operations will continue until avenging the last drops of martyrs' blood,\" the Guards' statement said. Iran had already vowed revenge for the killing of three members of the Guards in Syria last month, including a senior Guards commander, who had served as military advisers there. Three security sources and Iranian state media said at the time they were killed in an Israeli air strike. An Israeli mililtary spokesman declined to comment, saying only it had a job to protect the security interests of Israel. While recalling its envoy from Tehran, Iraq summoned Iran's charge d'affaires in Baghdad to protest against the strikes, the foreign ministry said. It said Baghdad would take all legal measures against what it called a violation of Iraq's sovereignty.  MILLIONAIRE AMONG DEAD The U.S. State Department condemned the attacks near Erbil, calling them \"reckless\", but officials said no U.S. facilities were targeted and there were no U.S. casualties. \"The United States supports the sovereignty, independence, and territorial integrity of Iraq,\" Adrienne Watson, spokesperson for the White House National Security Council, said in the statement. Iran, which supports Hamas in its war with Israel, accuses the United States of backing what it calls Israeli crimes in Gaza. The U.S. has said it backs Israel in its campaign but has raised concerns about the number of Palestinian civilians killed. Iraqi Kurdish Prime Minister Masrour Barzani condemned the attack on Erbil as a \"crime against the Kurdish people\".  At least four civilians were killed and six injured in the strikes, the Kurdistan government's security council said. Multimillionaire Kurdish businessman Peshraw Dizayee and several members of his family were among the dead, killed when at least one rocket crashed into their home, Iraqi security and medical sources said.  Dizayee, who was close to the ruling Barzani clan, owned businesses that led major real estate projects in Kurdistan. Additionally, one rocket had fallen on the house of a senior Kurdish intelligence official and another on a Kurdish intelligence centre and air traffic at Erbil airport was halted, the security sources said.  \nIran has in the past carried out strikes in Iraq's Kurdistan region, saying the area is used as a staging ground for Iranian separatist groups as well as agents of its arch-foe Israel.  Baghdad has tried to address Iranian concerns over separatist groups in the region, moving to relocate some members as part of a security agreement reached with Tehran in 2023."
}