{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBQ0F8_L.jpg",
  "title": "Wolfgang Schaeuble, steely German statesman and staunch Merkel ally, dies at 81",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 27, 2023 01:25PM ET",
    "Updated Dec 27, 2023 01:52PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/wolfgang-schaeuble-steely-german-statesman-and-staunch-merkel-ally-dies-at-81-3264112",
  "paragraph": "BERLIN (Reuters) - Wheelchair-bound from 1990 when a deranged gunman's bullets crippled and almost killed him, Wolfgang Schaeuble's instinct for survival also permeated his professional life as one of Germany's longest serving politicians. Schaeuble, who has died aged 81, devoted much of his career to reunifying his country and, as Angela Merkel's loyal, frugal finance minister - a role he took on after seeing her end his ambitions of becoming chancellor - helped secure its place at the heart of Europe. Born in 1942 in the southwestern city of Freiburg, he was a member of parliament for 51 years without interruption. A trained lawyer, he had a fierce intellect and a sharp tongue that earned him respect and criticism in equal measure - and that he was not afraid to use on Merkel. \"Do you know what you are doing?\" he recalled asking her when she sounded him out about becoming finance minister in 2009. \"I'm loyal ... but uncomfortable.\" So it proved. After his first meeting in 2015 with then-Greek Finance Minister Yanis Varoufakis, who was seeking support for a euro zone debt deal, Schaeuble said they had agreed to disagree. He was promptly contradicted. \"We didn't reach an agreement. It was never on the cards that we would. We didn't even agree to disagree, from where I am standing,\" his younger left-wing radical visitor said, as Schaeuble glared stony-faced. By insisting that aid came with hairshirt austerity, Schaeuble secured for Merkel the support of sceptical lawmakers on the right of their conservative bloc for three Greek bailouts. That determination bordering on intransigence helped make him the most popular German politician inside Germany and the most hated one abroad, and helped earn him the sobriquet - bestowed by news magazine Spiegel - of \"chancellor behind the scenes\". Once Merkel's boss before their roles were reversed, Schaeuble pulled the strings of Germany's policy response to the euro zone crisis and intervened when he felt the chancellor was on the wrong track - and not only in financial matters. In November 2015, soon after Merkel opened Germany's borders to hundreds of thousands of Middle Eastern migrants, he said the country risked facing \"an avalanche\" of refugees triggered by \"careless\" actions. He subsequently defended Merkel's open-door migrant policy, however, when Alternative for Germany (AfD) waded into the debate, accusing the far-right party of fuelling xenophobia. Though they did not always see eye to eye, Schaeuble and Merkel established a strong bond. He was touched by her response when, in 2010, he spent weeks in hospital for treatment for bedsores, forcing him to miss important meetings during the euro zone crisis. He offered to resign. \"She told me I shouldn't talk nonsense,\" he recalled years later in a documentary. \"And then she did something that I found surprising. She telephoned my wife ... and told her I should take all the time in the world to get well again.\"     FUNDING SCANDAL Schaeuble recovered, and served as finance minister until 2017, showing the same focus that saw him adapt to paralysis after being shot three times at an election campaign event a few days after German reunification in 1990. That drive won him the respect of fellow conservatives and lawmakers from other parties. His was not a career without setbacks, however. As head of the Christian Democratic Union (CDU) in 1998 following then-chancellor Helmut Kohl's (NYSE:KSS) election loss, Schaeuble named Merkel as his deputy. It was a pairing that would last less than a year and a half. Caught up in a party funding scandal surrounding Kohl, he was forced to resign as party leader in 2000, with Merkel taking over. Despite his conservative views on financial matters, Schaeuble was a leading voice calling for better integration of Muslims into German society, founding the German Islam Conference while interior minister in 2006. At a 10th anniversary celebration in 2016, he said there was no question that \"Islam belongs to Germany,\" but he also underscored the importance of cracking down on criminals among the immigrant population. \nIn 2017, he stood down as finance minister and took over as president of the Bundestag lower parliamentary house, using the prestigious position to impose discipline on fractious lawmakers, including the AfD's first federal MPs.  When AfD parliamentary leader Bernd Baumann told the chamber in 2017: \"The people have decided, now a new era begins,\" Schaeuble shot back: \"Nobody on their own represents the people.\""
}