{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0B054_L.jpg",
  "title": "Taiwan expects China to apply pressure on incoming govt after election",
  "category": "World news",
  "publisher": "Investing.com",
  "date": [
    "Published Jan 12, 2024 12:26AM ET",
    "Updated Jan 12, 2024 02:15AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/taiwan-expects-china-to-apply-pressure-on-incoming-government-after-election-3273007",
  "paragraph": "2/2\n© Reuters. People ride past campaign ads for Lai Ching-te, Taiwan's vice president and the ruling Democratic Progressive Party's (DPP) presidential candidate, Justin Wu, local parliament member candidate for the ruling Democratic Progressive Party's (DPP), Hou Yu-i\n2/2\nBy Yimou Lee and Ben Blanchard TAIPEI (Reuters) -Taiwan's government believes China is likely to attempt to put pressure on its incoming president after the island goes to the polls on Saturday, including staging military manoeuvres near the island this spring, two senior government officials said. No matter which candidate wins the election, Beijing's military and economic pressure on Taiwan's next leader is likely to increase, said the Taiwanese officials who briefed reporters on condition they not be named. Taiwan goes to the polls to elect a new president and parliament under the shadow of an increasingly assertive China which has called the vote a choice between \"peace and war\".  China and Taiwan's largest opposition party, the Kuomintang (KMT), warned on Thursday of the danger Taiwan's ruling Democratic Progressive Party (DPP) presidential candidate Lai Ching-te could pose to peace if he wins election. Lai has pledged to pursue peace and engage with China if elected. Beijing is likely to apply \"great pressure\" in a bid to influence the new president's inaugural address on May 20, which is expected to set the tone for the new administration's China policy, said one official, who has knowledge of Taiwan's security planning. China's top Taiwan policy agency, the Taiwan Affairs Office, did not immediately respond to a request for comment. MILITARY PRESSURE  China claims democratically-governed Taiwan as its own territory, against the strident objections of the government in Taipei, and has never renounced the use of force to bring it under China's control. While large-scale military drills near Taiwan are unlikely immediately after the vote, Beijing is likely to stage manoeuvres near the island after March due to more favourable weather and sea conditions, the official said, citing Taiwan's security assessment. The potential for further tensions over Taiwan, especially after China staged two rounds of major war games near the island in April of last year and August of 2022, is being closely watched in the region and by Washington and its allies. Two Western security officials, speaking on condition of anonymity as they were not authorised to speak to the media, said China was likely to respond militarily at some point post election, though they did not believe it would be on the scale of the last two war games.  The Taiwan official said Beijing could also opt to limit any show of military force in the coming months because of considerations including improving U.S.-Chinese relations. U.S.-China relationship tumbled to historic lows last year, but since President Joe Biden and Chinese President Xi Jinping met in November and agreed to re-establish military-to-military ties, senior Chinese and US officials have staged meetings. In the case that the party which wins the presidency fails to gain a parliamentary majority, China is likely to label the new administration a \"minority government,\" the Taiwanese official said.  In what Taiwan views as a bid to weaken a new administration, China is also likely to invite pro-Beijing Taiwanese politicians to visit China and to continue what Taipei perceives as disinformation campaigns against the Taiwan government, the official said. \"They are likely to try to frustrate the confidence building of the new government,\" the official said. China has not publicly named a preferred candidate, but has urged Taiwan voters to make \"the right choice\" after calling a vote for the DPP dangerous and threatening cross-Strait peace. The KMT traditionally favours close ties with China although it denies being pro-Beijing. \"We are not afraid\" of China, said tech worker Charlie Lee, 61. \"We already have a very strong democratic identity and will fight to the end.\" Taiwan's defence ministry said on Friday it had detected five Chinese balloons flying over the Taiwan Strait over the past 24 hours, one of which crossed the island, the latest in a spate of such balloons the ministry says it has spotted over the past month. Taiwan has described a range of actions by China, including the balloon flights, reports by China's state-media and threats of further trade sanctions as a form of psychological warfare on the island's people ahead of the vote. \n\"China's voting interference in Taiwan is a textbook example,\" the first Taiwanese official said. \"Other countries must come and learn quickly.\" China says election interference allegations are the DPP \"dirty tricks\" to win votes."
}