{
  "image": "https://i-invdn-com.investing.com/news/SouthChinaSea_800x533_L_1610638469.jpg",
  "title": "Pacific nations meet in China to discuss naval issues",
  "category": "Economy",
  "publisher": "Reuters",
  "date": "Published Jan 16, 2024 12:56AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/economy/pacific-nations-meet-in-china-to-discuss-naval-issues-3274590",
  "paragraph": "© Reuters \nBEIJING (Reuters) - Naval officials from countries bordering the Pacific, such as Japan, Russia and the United States, are meeting from Tuesday in China's eastern city of Nanjing to discuss updating rules on unexpected encounters, among other issues, state media said.\nThe three-day talks among 70 representatives from 30 countries come amid heightened tension in the South China Sea, particularly sea encounters between China and the Philippines.\nThe two countries, which have competing claims in the strategic waterway, have traded accusations of aggressive behaviour for months.\nChina lays claim to almost the entire South China Sea, a conduit for goods worth more than $3 trillion every year, where Brunei, Malaysia, Taiwan and Vietnam also have competing claims.\nOn Monday, Manila said the Philippines would develop islands in the South China Sea that it considers part of its territory to make them more habitable for troops.\nChina also occasionally accuses U.S. naval vessels of illegally entering what it says are its waters in the South China Sea, though the U.S. navy says its routine operations in international waters are consistent with international law.\nThis week's working group meeting lays the groundwork for a biennial Western Pacific Naval Symposium set for the eastern city of Qingdao in April. The event was last held in Japan in November 2022.\nSince 2002, China and Southeast Asian nations have tried to establish a framework to negotiate a code of conduct for the South China Sea, but progress has been glacial.\nIn 2016, the Permanent Court of Arbitration said China's South China Sea claims had no legal basis, in a ruling rejected by Beijing.\nThe concerns of members of the Pacific naval symposium go beyond the South China Sea, however.\nOn the sidelines of the 2022 symposium, Japan, South Korea and the United States met to discuss three-way security challenges in the Indo-Pacific region, including those from North Korea."
}