{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "UK and US sanction senior Houthis over Red Sea shipping attacks",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 25, 2024 09:54AM ET",
    "Updated Jan 25, 2024 10:47AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/uk-and-us-sanction-senior-houthis-over-red-sea-shipping-attacks-3283193",
  "paragraph": "LONDON/WASHINGTON (Reuters) -Britain and the United States on Thursday said they had imposed co-ordinated sanctions on four key Houthi figures for their roles in supporting or directing attacks on commercial shipping in the Red Sea. Attacks by the Iranian-backed Houthis have disrupted global shipping and stoked fears of global inflation. They have also deepened concern that fallout from the Israel-Hamas war could destabilize the Middle East. Those sanctioned were Houthi Defence Minister Mohamed Nasser al-Atifi, Commander of Houthi Naval Forces Muhammad Fadl Abd Al-Nabi, coastal defence forces chief Muhammad Ali al-Qadiri and Muhammed Ahmad al-Talibi, who the two governments described as the Houthi forces' director of procurement. \"With our allies, we will continue to target those responsible for the Houthis’ unacceptable and illegal actions, which risk innocent seafarers’ lives and disrupt aid deliveries to the Yemeni people,\" British Foreign Secretary David Cameron, who is on a visit to the Middle East, said in a statement. The sanctions aim to disrupt their ability to carry out attacks on Red Sea shipping and promote the peace, stability and security of Yemen, Britain said.  The U.S. Treasury said al-Atifi had publicly warned the Houthis would turn the Red Sea into a graveyard in response to any perceived action against Yemen by the U.S.-led naval coalition aimed at helping safeguard commercial traffic. Al-Talibi is involved in efforts to smuggle Iranian-provided weapons, missiles, drones and other items into Yemen, the U.S. said. \"The Houthis' persistent terrorist attacks on merchant vessels and their civilian crews ... threaten to disrupt international supply chains and the freedom of navigation, which is critical to global security, stability, and prosperity,” U.S. Treasury Under Secretary for Terrorism and Financial Intelligence Brian Nelson said in a statement.  \"Today’s joint action with the United Kingdom demonstrates our collective action to leverage all authorities to stop these attacks.\" The U.S. action freezes any U.S.-based assets of those targeted and generally bars Americans from dealing with them. Britain said they would be subject to asset freezes, arms embargoes and travel bans. On Monday, U.S. and British forces carried out a new round of strikes in Yemen, targeting a Houthi underground storage site as well as missile and surveillance capabilities used by the Iran-aligned group against Red Sea shipping."
}