{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0H0SI_L.jpg",
  "title": "Ecuadorean prosecutor killed by gang, two arrested -police",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 18, 2024 12:48PM ET",
    "Updated Jan 18, 2024 04:07PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/ecuadorean-prosecutor-killed-by-gang-two-arrested-police-3277623",
  "paragraph": "© Reuters. A police barricade tape is seen at a cordoned-off area where Ecuadorean prosecutor Cesar Suarez, who focused on cases involving organized trans-national crime in Guayas province, was killed, in Guayaquil, Ecuador, January 17, 2024. REUTERS/Vicente Gaibor \nBy Yury Garcia and Alexandra Valencia GUAYAQUIL/QUITO (Reuters) -Two suspects have been arrested in connection with the murder of Ecuadorean prosecutor Cesar Suarez who was allegedly targeted by a gang, police said on Thursday, as security forces continued interventions in prisons. Ecuador is reeling from a wave of violence, with President Daniel Noboa declaring 22 gangs as \"terrorist\" groups and a 60-day state of emergency. Incidents this month have included an attack by armed gunmen on the TC television station, the hostage-taking of more than 200 prison staff and the kidnapping of police officers. Suarez, who focused on pursuing organized trans-national crime in Guayas province, was attacked as he drove in northern Guayaquil by gunmen in two cars, the city's police chief General Victor Herrera told journalists at a press conference. Suarez was in charge of investigating the television station attack, when journalists and others were briefly held hostage, as well as cases connected to corruption and drug trafficking, Herrera said. \"The hypothesis that the national police have is that these criminals belonged to the terrorist group ChoneKiller, the motivation (for the crime) is still under investigation,\" Herrera said. Police have collected 18 ballistic pieces of evidence and conducted raids in various homes, locating one of the vehicles. The other was found burned in another part of the city, Herrera said. Suarez had not had permanent police protection since May 2023 and had not requested protection for a hearing on Wednesday because it was virtual, authorities said. Some 62 staff at the attorney general's office have national police and other security protections, the office has said. Police detained 13 people, including two minors, in connection with the television station attack. Security forces were carrying out an operation at the Guayaquil prison that was the site of an escape by Adolfo Macias, the leader of the Los Choneros gang, earlier this month.  The raid is not connected to Suarez's killing, Herrera said. Widespread security force operations have resulted in nearly 2,000 arrests since last week. Ecuadorean bonds continued to rise on Thursday on views the crisis could become a catalyst for policy action.  \nFollowing an initial selloff last week, an index of Ecuadorean sovereign external debt has gained over 6% since Jan. 9 and sits at a more than two-month high. \"The latest developments suggest an increased likelihood of stronger fiscal accounts, as policymakers can build popular support in the fight against crime while still engaging in fiscal austerity,\" said BancTrust analysts in a Thursday client note. Spreads at over 1,900 basis points remain among the highest in Latin America and prices are at levels indicating concern over a default. The legislature has backed Noboa's efforts but several parties have said they will not support a value added tax hike meant to fund security initiatives."
}