{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0D0BJ_L.jpg",
  "title": "Iowa principal dies from injuries sustained in school shooting",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 14, 2024 02:24PM ET",
  "comments": [
    1,
    [
      [
        "dylan mulvaney",
        "2024-01-14 19:47:32",
        "Schools are gun free zones. Most mas shootings occur in gun free zones or places with strict gun laws since criminals know they can get away with it without the ability for people to defend themselves.",
        "https://www.investing.com/members/250212425"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/iowa-principal-dies-from-injuries-sustained-in-school-shooting-3274151",
  "paragraph": "© Reuters. FILE PHOTO: A medical examiner enters the school as police respond to a school shooting at the Perry Middle School and High School complex in Perry, Iowa, U.S., January 4, 2024. REUTERS/Cheney Orr/File Photo\n(Reuters) - The principal of a school in a small Iowa town who was injured during a shooting on campus at the beginning of the month died on Sunday, his family said.  Dan Marburger, had been principal at Perry High School since 1995, suffered serious injuries on Jan. 4 as he helped pupils and staff exit the school after a 17-year-old student opened fire, killing a sixth-grader and wounding five people, including Marburger.  \"After 10 days, he lost his battle and this tragedy took his life,\" read the GoFundMe page created in the shooting's aftermath to help his family with medical costs. \"All of the Marburger family and the entire Perry Community will forever be touched by the selflessness of Mr. Marburger.\" The suspect, a student at the high school, was found dead with an apparent self-inflicted gunshot wound by responding officers, authorities said.  \nThe Iowa shooting, on the district's first day of classes in 2024, is part of a national epidemic of gun violence in U.S. schools that has worsened in recent years.  Perry, a town of about 7,900, is about 40 miles (64 km) northwest of Des Moines, the state's capital city. The town's middle and high schools share a single campus."
}