{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK040FO_L.jpg",
  "title": "For civilians or Hamas? 'Dual use' issue complicates Gaza aid efforts",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 05, 2024 12:20PM ET",
    "Updated Jan 05, 2024 06:47PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/for-civilians-or-hamas-dual-use-issue-complicates-gaza-aid-efforts-3268373",
  "paragraph": "5/5\n© Reuters. Palestinian children queue as they wait to collect drinking water, amid shortages of drinking water, as the conflict between Israel and Hamas continues, in Rafah, in the southern Gaza Strip January 4, 2024. REUTERS/Saleh Salem\n2/5\nBy Saleh Salem and Estelle Shirbon GAZA/JERUSALEM (Reuters) - Water purifiers, medical supplies and tent poles are among items Israel has blocked from entering Gaza on aid trucks, according to an Egyptian Red Crescent document seen by Reuters and sources in Gaza, but Israel denied blocking any such items. Under a policy that long pre-dates the Oct. 7 Hamas attack on Israel and ensuing war in Gaza, Israel inspects trucks bound for the Palestinian enclave to stop any items it considers to have potential \"dual use\" - civilian or military. But the issue of which items do or don't get through has become more urgent and contested as the war has unfolded. The conflict has displaced most of Gaza's population and caused acute shortages of food, water, medicines and other basic necessities. The Egyptian Red Crescent document, which dates back to mid-December, says 1,200 water purifiers, 100 oxygen cylinders, one oxygen generator, 1,000 solar-powered items, 24 power generators and 418 medical supplies had been blocked since the war started. COGAT, an Israeli Defence Ministry agency that coordinates aid deliveries with the United Nations and humanitarian groups, said this was not true. \"We are not refusing anything that is underneath four headlines: food, water, medical supplies and shelters. All of those are entering every day,\" said Colonel Elad Goren of COGAT during a news briefing on Friday. COGAT said 11,220 tonnes of medical supplies, including X-ray machines, CT machines and oxygen generators for hospitals had entered Gaza, as well as filters for use in a water desalination plant and mobile desalination filters. TUNNELS But hospital doctors in Gaza said equipment such as oxygen cylinders and x-ray machines were not getting through, even though they were desperately needed. They attributed the problem to Israeli inspections, without specifying how they knew that. A humanitarian worker from an international aid group, who did not wish to be named due to the sensitivity of the subject, said they were aware that certain types of medical equipment, including x-ray machines, \"cause problems\". Hamas, the Islamist group that has run Gaza since 2007, triggered the war when its militants invaded Israel on Oct. 7, killing 1,200 people, raping and mutilating some women and taking 240 hostages, according to Israeli authorities. Vowing to destroy Hamas, Israel responded by bombarding, invading and blockading Gaza, killing more than 22,000 people, according to local health officials, and causing an acute humanitarian crisis of displacement, hunger and disease.  Kobi Michael, a former adviser to the Israeli government on Palestinian affairs, said it was likely that inspections had been toughened up since the start of the war, compared with the pre-war regime which had become less strict over the years. \"What I think most concerns Israeli inspectors now is what equipment might allow Hamas to extend their time in the tunnels,\" said Michael, who is now a senior researcher at Tel Aviv University's Institute for National Security Studies. \"Israel wants to shorten this war, and that means shortening the time that Hamas can spend underground.\" The Egyptian Red Crescent document was given to a group of European lawmakers during a visit to the Egyptian city of Al Arish, where aid trucks are loaded, and the Rafah crossing, where they enter Gaza. Spanish lawmaker Soraya Rodriguez later provided it to Reuters. Rodriguez and fellow lawmaker Barry Andrews, of Ireland, said they had learnt during their visit that in some cases, though not all, tent poles were being excluded by Israeli inspectors, for reasons that were not clear. \"How would this be capable of military use?\" said Andrews. \"It's very difficult to understand.\" TENTS WITHOUT POLES COGAT said Israel had no policy to remove tent poles and that 13,490 tonnes of shelter supplies, including tent poles, had entered Gaza during the war in 923 trucks. In Rafah, inside Gaza, Reuters reporters saw a pile of what looked like thick canvas tents, discarded on the floor in a corner of the Kuwait Hospital. This was because they had been delivered without poles, according to Dr Suhaib al-Hams, chairman of the hospital's board of directors. A Gaza social affairs ministry official said he was aware of about 150 tents arriving without poles, out of 30 trucks loaded with tents. Ashraf Abu Sakran, a builder displaced from his home in Gaza City, said he had rejected the offer of a tent without poles. Instead, he bought some plywood and tarpaulins, and built a shelter in which he is now living with his wife and five children, one of whom is disabled, in Rafah. \"Where am I supposed to find metal poles?\" he said. \"We lost our house, and we can't even find a good tent.\" Part of the confusion over whether certain items are being blocked by Israel on dual use grounds or are not arriving in Gaza for other reasons may arise from the absence of a public list of specific dual-use items. Asked to provide one, COGAT referred Reuters to a document dating from 2008, available on the internet, that listed 10 categories of items, such as telecommunications, electronics, advanced materials, propulsion and information security. \nAn Israeli official with knowledge of this subject, who did not wish to be named, mentioned fertilizer which could be used to make explosives, iron to manufacture rockets and materials to make digging equipment as examples of dual use items. \"Beyond that, we cannot expand and risk giving terrorist groups ideas about what to do with such materials,\" the official said."
}