{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0I05T_L.jpg",
  "title": "Pakistan tells Iran it wants to build trust after tit-for-tat strikes",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 19, 2024 11:26AM ET",
    "Updated Jan 19, 2024 12:28PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/pakistan-tells-iran-it-wants-to-build-trust-after-titfortat-strikes-3278548",
  "paragraph": "© Reuters. A man looks at a television screen after the Pakistani foreign ministry said the country conducted strikes inside Iran targeting separatist militants, two days after Tehran said it attacked Israel-linked militant bases inside Pakistani territory, in Karac\nBy Asif Shahzad and Gibran Naiyyar Peshimam ISLAMABAD (Reuters) -Pakistan expressed its willingness to work with Iran on \"all issues\" in a call between their foreign ministers on Friday after both countries exchanged drone and missile strikes on militant bases on each other's territory. The tit-for-tat strikes by the two countries are the highest-profile cross-border intrusions in recent years and have raised alarm about wider instability in the region since the war between Israel and Hamas erupted on Oct. 7. However, while Iran and Pakistan have a history of rocky relations, both sides have already signalled a desire to cool tensions. A statement from Pakistan's foreign office said Foreign Minister Jalil Abbas Jilani had spoken to his Iranian counterpart, Hossein Amirabdollahian, on Friday, a day after Pakistan carried out strikes in Iran. Iran said Thursday's strikes killed nine people in a border village on its territory, including four children. Pakistan said the Iranian attack on Tuesday killed two children.  \"Foreign Minister Jilani expressed Pakistan’s readiness to work with Iran on all issues based on spirit of mutual trust and cooperation,\" the statement said. \"He underscored the need for closer cooperation on security issues.\" The contact follows a call between Jilani and his Turkish counterpart in which Islamabad said \"Pakistan has no interest or desire in escalation\". Amirabdollahian, in comments quoted by Iran's state media, said: \"Pakistan's sovereignty and territorial integrity are of great interest to us and bilateral cooperation is essential to neutralise and destroy terrorist camps on Pakistani soil.\" 'MINOR IRRITANTS' The contacts came as Pakistan's Caretaker Prime Minister Anwaar ul Haq Kakar convened a meeting of the National Security Committee, with all military services chiefs in attendance. Kakar had cut short a visit to the World Economic Forum in Davos and flew home on Thursday. The meeting concluded that \"the two countries would mutually be able to overcome minor irritants through dialogue and diplomacy and pave the way to further deepen their historic relations\", according to a statement from the Prime Minister's Office. However, it also resolved that any attempts to breach the territory of Pakistan \"will be responded with full might of the state\". It urged Iran to use existing communication channels to address security concerns.  Kakar told a cabinet meeting following the security huddle that it was in the \"interest of both countries\" to return to relations as they stood before Iran's strikes, another statement said. Pakistan had recalled its ambassador from Tehran and had not allowed Iran's ambassador to return to Islamabad.  Pakistani broadcaster Geo TV, citing sources, reported that the cabinet had decided to end a standoff and also endorsed a move to re-establish full diplomatic relations with Iran. URGING RESTRAINT U.N. Secretary-General Antonio Guterres urged the two nations to exercise maximum restraint. The U.S. also urged restraint although President Joe Biden said the clashes showed that Iran is not well liked in the region. Islamabad said it hit bases of the separatist Baloch Liberation Front and Baloch Liberation Army, while Tehran said its drones and missiles struck militants from the Jaish al Adl (JAA) group.  The militant groups operate in an area that includes Pakistan's southwestern province of Balochistan and Iran's southeastern Sistan-Baluchestan province. Both are restive, mineral-rich and largely underdeveloped. Iran's top security body, in meetings on Thursday headed by President Ebrahim Raisi, was told that militants had been preparing a \"major operation\" and the Iranian strikes on Tuesday were pre-emptive, state media reported on Friday. Separately, Iranian media reports said security forces clashed with Islamic State militants in the southeast, killing two, capturing several others and seizing explosives and weapons.  INSURGENCY The groups struck by Islamabad have been waging an armed insurgency for decades against the Pakistani state, including attacks against Chinese citizens and investment projects in Balochistan. The JAA, which Iran attacked, is also an ethnic militant group, but with Sunni Islamist leanings seen as a threat by Iran, which is mainly Shi'ite. The group, which has had links to Islamic State, has carried out attacks in Iran against its powerful Revolutionary Guard Corps. Against the backdrop of the war in Gaza, Iran and its allies have been flexing their muscles in the region. This week Iran also launched strikes on Syria against what it said were Islamic State sites, and Iraq, where it said it had struck an Israeli espionage centre. Inside Pakistan, civilian leaders came together to throw their support behind the military despite a deeply divided political arena ahead of national elections next month. \nFormer foreign minister Bilawal Bhutto Zardari, a candidate for his party for prime minister, and the party of three-time premier Nawaz Sharif, considered an electoral frontrunner in the polls, said Pakistan had the right to defend itself but called for dialogue with Iran moving ahead. The Pakistan Tehreek-e-Insaaf (PTI) party of jailed former Prime Minister Imran Khan also condemned Iran, but called the strikes on Pakistan a failure of the caretaker government brought in to oversee the elections."
}