{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0C032_L.jpg",
  "title": "Israel pushes ahead with Gaza offensive approaching 100 days of war",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 13, 2024 07:47AM ET",
    "Updated Jan 13, 2024 07:21PM ET"
  ],
  "comments": [
    3,
    [
      [
        "Mark Jannetty",
        "2024-01-13 16:05:45",
        "put up a parking lot Israel. Finish the job",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Maximus Maximus",
        "2024-01-13 15:35:37",
        "stop the genocide.",
        "https://www.investing.com/members/204570756"
      ],
      [
        "Invest Right",
        "2024-01-13 14:51:07",
        "Genocidal killers",
        "https://www.investing.com/members/201206359"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/israel-presses-on-with-gaza-offensive-approaching-100-days-of-war-3273963",
  "paragraph": "© Reuters. An Israeli military vehicle operates at a location given as the Gaza Strip amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, in this screen grab obtained from a video released on January 8, 2024. Israel Defense Forces/Hand\nBy Nidal al-Mughrabi and Bassam Masoud DOHA/GAZA (Reuters) -Israel kept up bombardments in the Gaza Strip on Saturday, vowing to press ahead with its offensive to destroy the Islamist movement Hamas as the war approaches the 100-day mark with no end in sight. Prime Minister Benjamin Netanyahu said Israel would not be deterred by a case before the International Court of Justice in The Hague, where it is fighting accusations that the campaign in Gaza amounts to genocide. \"No one will stop us - not The Hague, not the Axis of Evil, no one,\" he told a news conference, referring to Hamas and the Iranian-backed Hezbollah and Houthi militias which have offered their support. More than three months after the Oct. 7 attack on Israel which triggered the war, more than 20,000 Palestinians have been killed and Gaza is a wasteland of rubble, with all but a handful of its 2.3 million population squeezed into a tiny corner at the southern end of the enclave. In the southern city of Rafah, an Israeli air strike on a house sheltering two displaced families killed 10 people, the Gaza health ministry said. Holding up a photo of a dead girl with a piece of bread in her hand, Bassem Arafeh, a relative, said the families in Rafah had been eating dinner when the house was struck on Friday night. \"This child died while she was hungry, while she was eating a piece of bread with nothing on it, where is the International Criminal Court to see how the children die?\" Arafeh said. \"Where are the Muslims ... and the world leaders?\" Israel says it targets militants and does all it can to minimize harm to non-combatants as it wages urban warfare against Hamas in the densely populated Palestinian enclave.  But the scale of the killing in Gaza and the dire humanitarian situation has shocked world opinion and fuelled growing calls for a ceasefire, with South Africa launching a case before the ICJ accusing Israel of genocide. Israel has rejected the accusation as a gross distortion, saying its actions in Gaza have been taken in self defence after Hamas gunmen attacked a string of communities in southern Israel on Oct. 7, killing more than 1,200 Israelis and foreigners and taking some 240 as hostages. It says the attack, which Hamas leaders have said they would carry out again, showed its existence as a state was under threat unless the movement is destroyed. The Israeli military, which says it has killed more than 8,000 fighters, has announced a new phase in combat, withdrawing some forces from northern Gaza, while maintaining operations in the south, where senior Hamas leaders including the movement's leader in Gaza Yahya Sinwar, are believed to be hiding. On Saturday, it said its forces had killed numerous militants in the southern area of Khan Younis and in the central Gaza Strip. It said it was looking into the reported strike in Rafah.  Hamas said its fighters fired at an Israeli helicopter in southern Gaza's Khan Younis. In the central Gaza Strip, residents reported intense gunbattles and tank shelling and Israeli air strikes in Al-Bureij, Al-Nusseirat and Al-Maghazi, areas housing refugees and descendants of the 1948 war. HEALTH SYSTEM 'COLLAPSED' The Gaza health ministry spokesman Ashraf Al-Qidra said Israeli strikes killed 135 Palestinians and wounded 312 in the past 24 hours. In total, he said 23,843 Palestinians, mostly civilians, have been killed since Oct. 7. As the fighting continued, the head of UNWRA, the U.N. aid agency for Palestinians, said the death and destruction over the past 100 days was \"staining our shared humanity\". At Nasser Hospital, a handful of doctors said they were struggling in a now \"collapsed\" healthcare system.  Reuters footage showed patients lying on stretchers on the floor inside corridors and doctors using their phone flashlights to examine patients' eyes. \"Most of the medical supplies in the ICU are missing,\" said doctor Mohammad Al-Qidra. \"We don't have empty beds, no treatments. Most of the medicines inside the emergency room are not enough for patients. We are trying to find alternatives.\"  Hospital wards are being shared by many of the displaced. \"When we ask for medicine, they tell us they don't have it, and the situation is bad. We are here in cold and windy weather,\" said Mahmoud Jaber, who has been displaced from his home in Gaza City. \nIn the occupied West Bank, where violence had already been on the rise before Oct. 7 and has increased since, three Palestinians who were armed with knives, a rifle and an axe tried to break into a Jewish settlement and were killed, the Israeli military said.  The Palestinian Health Ministry said the dead were aged 15, 17 and 19. An Israeli soldier was wounded in an exchange of fire with the assailants as they breached the outer fence of the settlement Adora, near the Palestinian city Hebron, Israel said."
}