{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "Las Vegas standup comic Shecky Greene dies at 97",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Dec 31, 2023 04:07PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/las-vegas-standup-comic-shecky-greene-dies-at-97-3264989",
  "paragraph": "By Rich McKay (Reuters) - Shecky Greene, a comic legend of the old-school Las Vegas lounge acts who rubbed elbows with yesteryear entertainment greats, died on Sunday, his widow told the media. His wife of 41 years, Marie Musso Greene, told the Las Vegas Review-Journal that her husband, born Fred Sheldon Greenfield in Chicago, died of natural causes at their home in Las Vegas, Nevada. Greene, who served in the U.S. Navy in World War II, headlined Vegas acts in the 1950s and 1960s where he was famous for foregoing his planned comedic routines and improvising jokes while walking through the audience with a microphone in hand. He was a frequent guest on early variety television programs such as the Ed Sullivan Show and made more than 40 appearances on the Tonight Show with Johnny Carson. Even on television he would perform ad-libbed jokes with the occasional pratfall while the show's host would try to keep up. In the Las Vegas nightclubs he worked alongside entertainment giants such as Bob Hope, Dean Martin and Frank Sinatra. But offstage, he battled a host of personal problems including gambling, alcohol and drug addictions and depression, which at times he joked about.  He once told his audience that he suffered from bipolar disorder and quipped, “I’m more than bipolar. I’m South Polar, North Polar. I’m every kind of polar there is. I even lived with a polar bear for about a year,” the New York Times reported. And at times he talked seriously about struggling with mental illness and issues including stage fright. “I’d get a standing ovation, then I’d burst out crying as soon as I left the stage,” he told Las Vegas Review-Journal in 2009. Greene was also an avid fan of thoroughbred racing and once owned a race horse also named Shecky Greene, an online biography says. Along with his widow, Greene is survived by his two adopted daughters, Dorian Hoffman and Alison Greene. No public services were announced."
}