{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK05057_L.jpg",
  "title": "Ukraine shows evidence Russia fired North Korea missile at Kharkiv",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 06, 2024 10:25AM ET",
    "Updated Jan 06, 2024 11:51AM ET"
  ],
  "comments": [
    2,
    [
      [
        "Ken Roth",
        "2024-01-07 20:19:39",
        "Mark you are either a russian troll or a sick MAGA nut that belongs in jail with your proud boys. From your comments every in this forum. My guess is russian troll.",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Mark Jannetty",
        "2024-01-06 15:34:20",
        "and? hot many American missiles has Ukraine fired?",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Yury Babich",
        "2024-01-06 17:09:30",
        " It is not true. Putin said so, but he is a liar. 5 days before the invasion he told Russia is not going to attack and Biden's warnings were insane, but true is different. Putin attacked and Biden was wright",
        "https://www.investing.com/members/202121732"
      ],
      [
        "Mark Jannetty",
        "2024-01-06 21:00:07",
        " yury, please do some research on your weapons. I don't think Russia is launching to space to hit Ukraine. ",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Brad Albright",
        "2024-01-06 21:31:38",
        "Magabilly ignorance on full display. There are, of course, short range ballistic missiles. Does this guy have a brain injury or something?",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Mark Jannetty",
        "2024-01-06 23:29:30",
        " I see you still have not learned to read brad or fail to comprehend. neither surprises me ",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Ken Roth",
        "2024-01-07 20:17:30",
        "Mark Jannetty",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/ukraine-shows-evidence-russia-fired-north-korea-missile-at-kharkiv-3268568",
  "paragraph": "4/4\n© Reuters. A man photographs parts of an unidentified missile, which Ukrainian authorities believe to be made in North Korea and was used in a strike in Kharkiv earlier this week, amid Russia's attack on Ukraine, in Kharkiv, Ukraine January 6, 2024. REUTERS/Vyachesl\n2/4\nKHARKIV, Ukraine (Reuters) - The Kharkiv region prosecutor's office provided further evidence on Saturday that Russia attacked Ukraine with missiles supplied by North Korea, showcasing the fragments. A senior adviser to President Volodymyr Zelenskiy said on Friday that Russia hit Ukraine this week with missiles supplied by North Korea for the first time during its invasion.  Dmytro Chubenko, spokesperson for the prosecutor's office, said the missile, one of several that hit the city of Kharkiv on Jan. 2, was visually and technically different from Russian models. \"The production method is not very modern. There are deviations from standard Iskander missiles, which we previously saw during strikes on Kharkiv. This missile is similar to one of the North Korean missiles,\" Chubenko told media as he displayed the remnants. He said the missile was slightly bigger in diameter than the Russian Iskander missile, while its nozzle, internal electrical windings, and rear parts were also different. \"That is why we are leaning towards the version that this may be a missile which was supplied by North Korea.\" Chubenko declined to give the missile's exact model name. Russia attacked Kharkiv with several missiles this week, killing two people and injuring over 60 in one of its biggest missile and drone strikes since the start of the large-scale war in February 2022.  \nNorth Korea has been under a United Nations arms embargo since it first tested a nuclear bomb in 2006. U.N. Security Council resolutions - approved with Russian support - ban countries from trading weapons or other military equipment with North Korea."
}