{
  "image": "https://i-invdn-com.investing.com/news/JoeBiden_800x533_L_1605106149.jpg",
  "title": "Michigan's Arab American leaders shun Biden campaign, ahead of president's visit",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 26, 2024 05:46PM ET",
    "Updated Jan 26, 2024 06:10PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Ken Roth",
        "2024-02-01 22:10:32",
        "Arab leaders in america perhaps prefers republicans who would rather see all muslims in USA sent to the middle east.",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/michigans-arab-american-leaders-shun-biden-campaign-ahead-of-presidents-visit-3284635",
  "paragraph": "© Reuters \nBy Andrea Shalal and Nandita Bose\nWASHINGTON (Reuters) - A group of Arab American leaders in Dearborn, Michigan skipped a meeting on Friday with President Joe Biden's campaign manager that was organized ahead of a possible visit to the battleground state by Biden on Feb. 1, two participants and two sources said.\nBiden's likely visit to the state next week involves meetings with members of the United Auto Workers Union and potential meetings with the Arab American community, the participants and sources said.\nAhmad Chebbani, co-founder and chair of the Arab American Chamber of Commerce, told Reuters that a majority of the 15 Arab community leaders invited to the meeting with Julie Chavez Rodriguez had decided to skip it, citing frustration and anger with Biden because he has not called for a ceasefire in Israel's assault on Gaza.\n\"We're not interested. Only when a ceasefire has been announced and the people of Gaza are taken care of, then will a discussion be appropriate,\" Chebbani said.\nThe Biden campaign had no immediate comment. A White House spokeswoman declined to confirm Biden's travel or events in Michigan.\nA source familiar with the campaign said Rodriguez was meeting with local elected officials and leaders from Michigan's Arab American, Palestinian American, Latino and Black communities this week as part of the campaign's ongoing outreach to important constituencies in key states.\nThe incident comes against a backdrop of wider disquiet over the war in Gaza, with a majority of Americans favoring a ceasefire, and Biden's speeches being routinely disrupted by protesters.\nBiden's support for Israel could cost him votes in battleground states like Michigan, where Arab Americans account for 5% of the vote and Biden's margin of victory over former President Donald Trump was less than 3%. An October poll showed Biden's support among Arab Americans had plunged to 17% from 59% in 2020.\nIsrael began its offensive in October after Hamas militants stormed into Israel, killing 1,200 and kidnapping more than 240. Israel's bombardment has killed more than 26,000 Palestinians and displaced the majority of the population of the Gaza Strip.\nDearborn Mayor Abdullah Hammoud said he also would not participate in Friday's meeting. \"I will not entertain conversations about elections while we watch a live-streamed genocide backed by our government,\" Hammoud wrote on X.\n\"The lives of Palestinians are not measured in poll numbers... When elected officials view the atrocities in Gaza only as an electoral problem, they reduce our indescribable pain into a political calculation.\"\nThe World Court ordered Israel on Friday to prevent acts of genocide against the Palestinians and do more to help civilians, although it stopped short of ordering a ceasefire as requested by plaintiff South Africa.\nChebbani said he had no desire to meet with Biden during his visit to Michigan.\n\"He has not shown that he's a person of courage to stand against genocide. Unless he calls for a ceasefire, we don't see value in that discussion,\" he said.\nThe Biden campaign source said the meeting was part of its ongoing dialogue with core constituency groups, and the campaign would continue \"to have thoughtful conversations with groups.\""
}