{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0E055_L.jpg",
  "title": "Philippines to develop islands in South China Sea - military chief",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 15, 2024 01:50AM ET",
    "Updated Jan 15, 2024 01:55AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/philippines-to-develop-islands-in-south-china-sea--military-chief-3274210",
  "paragraph": "© Reuters. Armed Forces of the Philippines Chief of Staff General Romeo Brawner Jr. speaks to the media during a press briefing at Western Command in Puerto Princesa, Palawan, Philippines, August 10, 2023. REUTERS/Eloisa Lopez\nMANILA (Reuters) - The Philippines will develop islands in the South China Sea that it considers part of its territory to make them more habitable for troops, Manila's military chief Romeo Brawner told reporters on Monday. The plans come amid heightened tensions between the Philippines and China, both of whom claim territory in the South China Sea and have traded accusations of aggressive behaviour in the strategic waterway. Apart from the Second Thomas Shoal, locally known as Ayungin, the Philippines occupies eight other features in the South China Sea, and considers them part of its exclusive economic zone. \"We'd like to improve all the nine, especially the islands we are occupying,\" Brawner said after attending a command conference led by Philippine President Ferdinand Marcos Jr. at the military headquarters.  The features include Thitu island, the biggest and most strategically important in the South China Sea. Known locally as Pag-asa, Thitu lies about 300 miles (480 km) west of the Philippine province of Palawan.  The military wants to bring a desalination machine for troops living aboard a warship that the Philippines deliberately grounded on Second Thomas Shoal in 1999 to assert its sovereignty claim, he said.  \nBesides the Philippines, Brunei, China, Malaysia, Taiwan and Vietnam have competing claims of sovereignty in the South China Sea, a conduit for goods in excess of $3 trillion every year. Also included in the military's modernisation plans is the acquisition of more ships, radars and aircraft as the Philippines shifts its focus to territorial from internal defence, Brawner said."
}