{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK08002_L.jpg",
  "title": "US top diplomat urges Israel to make hard choices, work with Palestinians",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 08, 2024 07:06PM ET",
    "Updated Jan 09, 2024 06:13PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Rob Roy",
        "2024-01-10 11:33:18",
        "How can any reasonable person keep supporting the Palestinian state solution after Oct 7th? Thinking out of the box and development of a highly sponsored \"land of a dream\" for palestinians in a different location, including generous compensation for every new citizen - this is the only viable solution for the peace and prosperity for the palestinians and the whole Middle East region.",
        "https://www.investing.com/members/250189184"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/blinken-on-diplomatic-push-in-israel-as-it-says-gaza-war-to-continue-through-2024-3269898",
  "paragraph": "5/5\n© Reuters. U.S. Secretary of State Antony Blinken looks on as he speaks to the media, during his week-long trip aimed at calming tensions across the Middle East, at the airport in Al Ula, Saudi Arabia, January 8, 2024. REUTERS/Evelyn Hockstein/Pool\n2/5\nBy Arafat Barbakh, Simon Lewis and Nidal al-Mughrabi GAZA/TEL AVIV/CAIRO (Reuters) -U.S. Secretary of State Antony Blinken urged Israel on Tuesday to make \"hard choices\" to normalize relations with more of its neighbours, a new appeal to smooth the path to creating a Palestinian state. Blinken, in his fourth visit to the Middle East since the war erupted in October, also urged Israel to support Palestinian leaders willing to live peacefully alongside Israelis and warned the daily toll in its war with Hamas in Gaza was far too high. It was also vital that Israel achieve its objective of eradicating the threat from Hamas, he said at the end of a day of talks in Tel Aviv. This followed his tour of Israel's Arab neighbours to discuss plans for the future governance of Gaza and integration in the Middle East. Even as he spoke, intense fighting gripped south and central parts of Gaza. Israeli forces and Hezbollah militants also exchanged fire on the Lebanon-Israel border. International concern has mounted over the huge Palestinian death toll from the Israeli assault on the densely populated enclave and a humanitarian crisis afflicting hundreds of thousands of people. The Israeli air and ground assault, prompted by a cross-border Hamas rampage into southern Israel on Oct. 7, has now killed 23,210 Palestinians, according to Gaza's health ministry, and obliterated large areas from north to south. The U.S. and other countries are also anxious to prevent the war from spreading through the Middle East. Meeting Israeli Prime Minister Benjamin Netanyahu at a military base in Tel Aviv, Blinken stressed \"the importance of avoiding further civilian harm and protecting civilian infrastructure in Gaza\", a State Department spokesperson said. Blinken repeated the Biden administration's support for Israel's right to defend itself and to prevent a repeat of the lightning Oct. 7 attack by Hamas, which killed 1,200 people, according to Israeli tallies. Israel has vowed to wipe out Hamas, the Palestinian Islamist movement that rules Gaza and is sworn to Israel's destruction. Addressing a press conference after his meetings, Blinken said the daily toll of the war on civilians in Gaza was far too high - though he added that charges that Israel was committing genocide were \"meritless\". He also said Palestinians displaced by the war must be able to return home as soon as conditions allow. The U.S. has rejected proposals from some on the far right in Israel that Palestinians be resettled outside Gaza. Israel Defence Minister Yoav Gallant told Blinken the offensive in Gaza's southern Khan Younis area will \"intensify and continue until Hamas leadership is detected and Israeli hostages return home safely,\" the defence ministry said. REGIONAL INTEGRATION Blinken has also been discussing plans for future governance of Gaza when the war eventually ends. In his session with Netanyahu, Blinken \"reiterated the need to ensure lasting, sustainable peace for Israel and the region, including by the realization of a Palestinian state,\" the State Department spokesman said. Prior to his Israel visit, Blinken held talks in Jordan, Qatar, the United Arab Emirates and Saudi Arabia, focused on seeking a longer-term approach to the decades-long Israel-Palestinian conflict. He said Washington's Arab allies wanted closer relations with Israel but only if that included a \"practical pathway\" to a Palestinian state. Many countries in the region are ready to invest in Gaza's future in that case, he said. U.S.-brokered talks on a Palestinian state in territory now occupied by Israel collapsed almost a decade ago. Right-wing leaders in Israel's current ruling coalition oppose Palestinian statehood. At his press conference, Blinken declined to characterize how Netanyahu and his cabinet responded to his appeal on a Palestinian state. He said Israel would have to make \"hard decisions, hard choices\" to take advantage of the opportunity offered by regional integration. \"These goals are attainable, but only if they are pursued together,\" he said. \"To make this possible, Israel must be a partner to Palestinian leaders who are willing to lead their people living side by side in peace with Israel and as neighbours.\" The Palestinian leadership must reform itself and improve its governance, he said, and Israel must stop taking steps that undercut it. \"Extremist settler violence carried out with impunity, settlement expansion, demolitions, evictions, all make it harder, not easier for Israel to achieve lasting peace and security,\" he said, alluding to conflict in the Israeli-occupied West Bank, part of the territory Palestinians want for a state. Reacting to Blinken's words, Hamas official Sami Abu Zuhri said the visit showed there was no fundamental change in the U.S. position. \"The aim of the visit was to support the security of the occupation,\" he told Reuters. \"There are no differences between Israel and the Americans.\" HEAVY FIGHTING IN SOUTH GAZA Israel says it is shifting from a full-blown military assault to more targeted warfare in northern Gaza while maintaining intensive combat in southern areas. It said that since Monday, its troops had killed around 40 Palestinian fighters and raided a militant compound and tunnels in Khan Younis, the main city in the south. It said nine Israeli soldiers had been killed, mostly in engineering units tackling tunnels, one of their deadliest days of the ground assault. The health ministry in Gaza said 126 Palestinians had been killed and 241 wounded in the previous 24 hours. Sean Casey, the World Health Organization Emergency Medical Teams coordinator in Gaza, said the health system in the enclave was collapsing fast. He accused Israel of denying access to more of Gaza for relief trucks. \"Every day we line up our convoys, we wait for clearance, and we don't get it - and then we come back and we do it again the next day.\" \nMedical staff and patients were fleeing, including an estimated 600 patients from one facility, and 66 health workers were in detention. Only about a third of Gaza's hospitals, all in southern and central Gaza, are even partially functional, he said. Casey said many staff at the main Nasser Hospital in Khan Younis had fled to shelters in the strip's southernmost tip, leaving just one doctor for more than 100 burn victims."
}