{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0L09Z_L.jpg",
  "title": "World risks missing deadline for pandemic accord, says WHO chief",
  "category": "Coronavirus",
  "publisher": "Reuters",
  "date": [
    "Published Jan 22, 2024 04:47AM ET",
    "Updated Jan 22, 2024 09:42AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Mark Jannetty",
        "2024-01-22 10:56:14",
        "why is this organization funded. they are bought and paid for and cannot be trusted ",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Mark Jannetty",
        "2024-01-22 17:29:51",
        "Brad Albright",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Brad Albright",
        "2024-01-22 20:09:08",
        "Let me guess, next time you need surgery, you'll instruct the nurses and doctors not to wear masks because you, in your infinite magabilly wisdom, know they don't stop the spread of germs. What a sap.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Mark Jannetty",
        "2024-01-22 21:13:12",
        " wow have you been duped. a mask will prevent the spread through droplets. it does not prevent the spread of a virus. if a doctor does not cough or sneeze, their is no need for the mask ",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Adrian White",
        "2024-01-23 00:24:00",
        "Mark, if you think only coughing and sneezing produces droplets then you are severely misinformed. Try sticking your hand in front of your mouth and breathing on it. Can't you feel the moisture? (Guess what, that's from droplets).",
        "https://www.investing.com/members/202315569"
      ],
      [
        "Brad Albright",
        "2024-01-23 17:20:56",
        "Adrian White",
        "https://www.investing.com/members/236251128"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/coronavirus/who-chief-worried-about-missing-deadline-for-pandemic-accord-3279280",
  "paragraph": "© Reuters. FILE PHOTO: Director-General of the World Health Organisation (WHO) Dr. Tedros Adhanom Ghebreyesus attends an ACANU briefing in Geneva, Switzerland, December 15, 2023. REUTERS/Denis Balibouse/File Photo\nGENEVA (Reuters) - Countries risk missing a May deadline for agreeing a legally binding treaty on fighting pandemics, which would be a big blow for future generations, the head of the World Health Organization (WHO) said on Monday. The new pact and a series of updates to existing rules on dealing with pandemics are intended to shore up the world's defences against new pathogens after the COVID-19 pandemic killed more than 7 million people, according to WHO data.  \"I'm concerned that member states may not meet that commitment and there are several outstanding issues that remain to be resolved,\" said Director-General Tedros Adhanom Ghebreyesus in an address to the global health agency's Executive Board meeting in Geneva. \"In my view, a failure to deliver the pandemic agreement and the IHR (International Health Regulations) amendments will be a missed opportunity for which future generations may not forgive us,\" he said. Only once before in the organisation's 75-year history has the WHO managed to agree such an accord, and that was a Tobacco Control treaty in 2003. Negotiations of this type usually take seven years, said Roland Driece, co-chair of the group negotiating the agreement, and they have only had two years. Speaking at an informal briefing on Monday, he said it was crucial to make progress now because of the \"slipping urgency\" around pandemic prevention. \nTedros said he was upbeat about prospects for battling HIV/AIDS, however, one of the targets of the Sustainable Development Goals (SDG) set by the global body to fight some of the world's most pressing problems by 2030. \"We are now beginning to see a pathway for the SDG target of ending the HIV pandemic,\" Tedros said."
}