{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "US urges China not to interfere in Taiwan elections",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 10, 2024 07:03PM ET",
    "Updated Jan 11, 2024 11:14AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/top-biden-aide-meets-senior-chinese-official-discusses-taiwan-3271904",
  "paragraph": "By Trevor Hunnicutt and Michael Martina WASHINGTON (Reuters) -The United States opposes any outside interference or influence in Taiwan's upcoming presidential and parliamentary elections and plans to send an unofficial delegation to the self-governed island following the polls, a senior Biden administration official said on Wednesday. The delegation is likely to include some former high-ranking American officials, the official said.  The Jan. 13 Taiwan elections come at a delicate time in U.S.-Chinese relations with President Joe Biden and Chinese President Xi Jinping having just re-established military-to-military ties when they met in California last November. The official, briefing reporters on condition of anonymity, said Washington does not take sides in the elections and does not have a favorite or preferred candidate.  \"We oppose any outside interference or influence in Taiwan's elections,\" the official said. \"Regardless of whom is elected, our policy toward Taiwan will remain the same and our strong unofficial relationship will also continue.” The elections are taking place against a backdrop of a ramped-up war of words between Taiwan and China, which views the island as its own territory despite the strong objections of the Taiwanese government. Washington wants to maintain the democratically governed island's status quo. The United States is Taiwan's most important international backer and arms supplier despite the lack of formal diplomatic ties with the island.  The launch of a Chinese satellite that flew over Taiwan, prompting an erroneous air raid alert, sparked a political storm on the island on Wednesday about China's motives only days out from the presidential election. \"I will note that the election is part of a normal, routine, democratic process. Beijing will be the provocateur should it choose to respond with additional military pressure or coercion,\" the Biden administration official said. The official said that sending the delegation was \"well within precedent and is of course consistent with our one China policy.\" U.S. administrations routinely send unofficial delegations to Taiwan in shows of support. Biden has employed the tactic twice so far – in April 2021 and February 2022 – and the official said that at those times Beijing did not view them as \"escalatory\" visits. The U.S. has also made a practice of dispatching former senior officials to Taiwan after its elections, including in January 2016 when William Burns, then a former deputy secretary of State and now the CIA director, visited the island. A top White House official, Jon Finer, met on Wednesday with a senior Chinese official and the two discussed tensions over Taiwan and the South China Sea, the White House said. Finer, who is deputy national security adviser, met Liu Jianchao, head of the International Liaison Department of China's Communist Party, as part of efforts to maintain open lines of communications as directed by Biden and Xi in their California summit. The meeting took place in Washington and the two officials had \"candid and constructive discussions\". They discussed a host of global hotspots, including the Middle East and Russia's war against Ukraine. \"Mr. Finer stressed the importance of peace and stability across the Taiwan Strait and in the South China Sea,\" the White House said. They reaffirmed support for continued high-level diplomacy and interactions between the United States and China, the White House said. \nIn separate talks, senior U.S. and Chinese officials held a virtual meeting on Wednesday and discussed cooperating on law enforcement issues including the illicit flow of synthetic drugs such as fentanyl, the U.S. Department Of Homeland Security said. U.S. Homeland Security Secretary Alejandro Mayorkas and Chinese Minister of Public Security Wang Xiaohong participated in the meeting, along with other senior officials, the department said in a statement."
}