{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "Hundreds of Pro-Palestinian protesters arrested after blocking NYC bridges, tunnel",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 08, 2024 12:10PM ET",
    "Updated Jan 08, 2024 05:36PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Ken Roth",
        "2024-01-08 20:10:42",
        "Why do the propalestinian protesters support HAMAS?",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/propalestinian-protesters-block-new-york-city-bridges-tunnel-3269709",
  "paragraph": "By Shannon Stapleton NEW YORK (Reuters) -Pro-Palestinian protesters blocked several New York City bridges and a tunnel on Monday to demand an immediate ceasefire in the three-month-old Israel-Hamas conflict before police arrested hundreds of them and reopened the roadways.  Dozens of chanting demonstrators sat at entrances to the Brooklyn, Manhattan and Williamsburg bridges across the East River, as well as at the Holland Tunnel connecting New York City with New Jersey across the Hudson (NYSE:HUD) River, local media reported. Police arrested 325 demonstrators, a New York Police Department spokesperson said, and all of the locations were cleared before noon.  New York City Mayor Eric Adams said the right to protest does not give people the right to block bridges. \"The goal is to peacefully protest without doing major disruption to the city, some people are not just driving to and from, across our bridges to go to their place of employment, some of them are dealing with some real emergency-type issues,\" Adams said. Video posted on social media during the protests showed demonstrators chanting: \"NYPD, KKK, IDF they’re all the same,\" referring to the New York Police Department, Ku Klux Klan and the Israel Defense Forces. Protesters at the Holland Tunnel carried banners that said \"Lift the siege on Gaza,\" \"Ceasefire Now\" and \"End the occupation.\" The protests were organized by Jewish Voice for Peace, the Palestinian Youth Movement and the New York chapter of the Democratic Socialists of America, among other advocacy groups, they said on X, formerly called Twitter. \"The siege on Gaza needs to end and I'm ready to put my body on the line to end it,\" said one protester as she was led away by a police officer with her hands behind her back, video showed.  In Charleston, South Carolina, protesters interrupted President Joe Biden's re-election campaign speech at the Mother Emanuel AME Church where a white supremacist killed nine Black church people in 2015. The protesters chanted \"Ceasefire now,\" and the congregation inside the church responded with a chorus of \"four more years\" while the demonstrators were ushered out of the building. \"I've been quietly working, quietly working with the Israeli government to get them to reduce and significantly get out of Gaza,\" Biden said after his speech was interrupted.  \nIsrael's campaign in Hamas-run Gaza has killed more than 23,000 Palestinians, local health officials say, while Israel says Hamas holds more than 100 hostages of 240 seized during its Oct. 7 attack on Israel in which 1,200 people were killed. Israel accuses Hamas of operating among civilians and has released videos and photos it says support the claim. Hamas, which is sworn to Israel's destruction, denies the accusation."
}