{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0E036_L.jpg",
  "title": "Russia says it will build ties with North Korea as foreign ministers set to meet",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 15, 2024 07:50AM ET",
    "Updated Jan 15, 2024 07:56AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Brad Albright",
        "2024-01-15 15:19:26",
        "Putin has backed himself into a corner. His rejection of the West has cut Russia of from any path to modernity. Putting his grandiose personal ambitions ahead of the good of Russia, his only option now to sustain his folly is to align with the world's darkest and most oppressive regimes. These are very sad times for Russia.",
        "https://www.investing.com/members/236251128"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/russia-says-it-will-build-ties-with-north-korea-as-foreign-ministers-set-to-meet-3274406",
  "paragraph": "© Reuters. FILE PHOTO: North Korean Foreign Minister Choe Son Hui meets with Russian Foreign Minister Sergei Lavrov in Pyongyang, North Korea, in this photo released by North Korea's Korean Central News Agency (KCNA) on October 20, 2023. KCNA via REUTERS /File Pho\nBy Josh Smith SEOUL (Reuters) -Russia will develop ties with North Korea in all areas building on agreements between their leaders in September, the Kremlin said on Monday, as their foreign ministers were set to meet in Moscow. North Korean Foreign Minister Choe Son Hui arrived on Sunday on a rare visit to Moscow for talks with her counterpart Sergei Lavrov as the two countries deepen economic, political, and military ties, the North's state news agency KCNA said. As Russia's international isolation has grown over its war in Ukraine, analysts say Moscow has seen increasing value in its ties with North Korea.  For North Korea's part, relations with Russia have not always been as warm as they were at the height of the Soviet Union, but the country is reaping benefits from Moscow's need for friends. \"North Korea is our closest neighbour and partner, with whom we are developing and intend to further develop partnerships in all areas,\" Kremlin spokesman Dmitry Peskov said. The visit is to further discuss agreements reached by North Korean leader Kim Jong Un to a space launch facility in the Russian far east in September where Russian President Vladimir Putin promised to help Pyongyang build satellites, he said. \"Dialogue at all levels will continue...We look forward to intense and fruitful negotiations.\" Russia has stepped up ties with North Korea since the start of the war with Ukraine nearly two years ago, relations that are a source of concern to the West, particularly after accusations that Moscow fired North Korean made ballistic missiles against targets in Ukraine. North Korea continues to push ahead with ballistic missile development and tested a new solid-fuel hypersonic missile with intermediate range, KCNA reported, in a move that was condemned by the United States, South Korea and Japan. Moscow and Pyongyang have denied arms deals but have said they would deepen cooperation across the board and have staged a series of high-level meetings since last year, including the summit between Putin and Kim. Peskov said Russia hoped a Putin visit to North Korea, at Kim's invitation, would take place \"in the foreseeable future\", but he said no date had yet been agreed. \"Given that the Russia-North Korea relationship is shaping up to be quite multi-faceted, all kinds of issues can be discussed between Lavrov and Choe,\" said Artyom Lukin, at Russia's Far Eastern Federal University. \"If she meets the Russian president, this may be another indication Putin will visit Pyongyang this year.\"  A striking sign of deepening ties came in July, when Russian Defence Minister Sergei Shoigu visited Pyongyang and toured a weapons exhibit that included the North's banned ballistic missiles. That was followed by Kim's trip to Russia, his first foreign visit since the COVID-19 pandemic began. \"In a nutshell, North Korea feels increasingly insecure and vulnerable vis-a-vis South Korea,\" Lukin said. \"Russia is currently the only power that can help enhance Pyongyang's military-strategic security.\" Russian Foreign Ministry spokeswoman Maria Zakharova said the visit would include negotiations, but did not elaborate. She also predicted the trip would spark speculation by the West. \"Westerners are constantly throwing in the story that Russia is somehow behaving differently again, has no right to communicate with North Korea,\" Zakharova said on state TV channel Rossiya-1 on Sunday.  \"We have the right to do whatever we consider necessary, taking into account the fact that we constantly declare respect for international law.\" \nChoe said in October that criticism by the United States and its allies of North Korea's suspected arms deliveries to Russia was politicised and distorted, while saying ties between Moscow and Pyongyang would reach a \"new higher phase.\" Russia and North Korea have not commented specifically on the allegations of Moscow using North Korean missiles in Ukraine."
}