{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "Suspect in New Year's crash in upstate New York dead, no link to terrorism found",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 02, 2024 11:40AM ET",
    "Updated Jan 02, 2024 12:11PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/suspect-in-new-years-crash-in-upstate-new-york-dead-no-link-to-terrorism-found-3265699",
  "paragraph": "NEW YORK (Reuters) - A 35-year-old suspect who plowed an SUV full of gasoline canisters into a crowd of New Year's Eve revelers outside a concert in upstate New York died overnight, police in the city of Rochester said on Tuesday. Authorities have not identified a motive or any link to terrorism that could have prompted the suspect, Michael Avery, to carry out the attack that killed 2 people and injured nine early on Monday, said Rochester Police Chief David Smith at a briefing. Conversations with his family suggested he might have had \"undiagnosed mental health issues,\" Smith said. Avery, who was from Syracuse, a city about 60 miles (96.5 km) east of Rochester, rented an SUV at the Rochester airport on Dec. 30 and spent the day buying gasoline from stores around the region, according to Smith. At around 12:52 a.m. on Jan. 1, he arrived at Rochester's Kodak Center as concert-goers were leaving the venue, and struck a ride-share vehicle pulling out of the parking lot, killing the two passengers. The force of the crash pushed the vehicles into the crowd, injuring at least 9 pedestrians.  Officials at Tuesday's press conference said local and federal authorities, including an FBI Joint Terrorism Task Force, would continue probing the incident.  \"Everyone up here still has lots of questions. Why Rochester? Why Syracuse? Why all the gas cans? These are all things that will continue to be investigated,\" said Rochester Mayor Malik Evans. Jeremy Bell, the special agent in charge of the local branch of the FBI, confirmed that the task force was involved in the investigation, but said that was not unusual for a case of this nature. \"What I can tell you is so far we've uncovered no evidence of an ideology and no nexus to terrorism either international or domestic,\" Bell said."
}