{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0A06D_L.jpg",
  "title": "White House official to visit Beirut, seeking to ease Israel-Lebanon tensions",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 10, 2024 11:42PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/white-house-official-to-visit-beirut-seeking-to-ease-israellebanon-tensions-3271954",
  "paragraph": "2/2\n© Reuters. FILE PHOTO: U.S. Special Envoy Amos Hochstein meets with Lebanon's caretaker Prime Minister Najib Mikati [not pictured] in Beirut, Lebanon November 7, 2023. REUTERS/Mohamed Azakir/File Photo\n2/2\nBy Steve Holland and Kanishka Singh WASHINGTON (Reuters) - Senior White House adviser Amos Hochstein is expected to visit Beirut on Thursday, a U.S. official said late on Wednesday, as part of U.S. efforts to ease tensions along the Israel-Lebanon border.  Washington fears Israel's war in Gaza could spread violence across the region, with armed groups backed by Israel's arch-rival Iran launching solidarity attacks in Lebanon, Syria, Iraq and Yemen. Lebanese armed group Hezbollah has been trading fire with the Israeli military across Lebanon's southern border since Palestinian Islamist group Hamas attacked Israel from Gaza three months ago, prompting Israel's heavy assault the Palestinian enclave.  The border violence has forced tens of thousands on both sides to flee and raised fears the conflict in Gaza could spiral into the rest of the region. Lebanon's caretaker Prime Minister Najib Mikati told a senior United Nations official on Tuesday that his country was ready for talks on long-term stability on its southern border with Israel. Hochstein, the U.S. energy envoy, last year floated the possibility of talks on drawing the land border between Israel and Lebanon, after having mediated a 2022 deal setting the maritime borders between the two countries. Israel has said it is giving a chance for diplomacy to prevent Hezbollah from firing on people living in its north and to push Hezbollah back from the border, warning that the Israeli army will otherwise take action to achieve these aims.  \nMore than 130 Hezbollah fighters have been killed in Lebanon during the hostilities. Hezbollah has said it does not seek full-scale war but would not hold back if Israel starts one. Hamas' Oct. 7 attack on Israel killed 1,200, according to Israeli tallies. Israel's subsequent offensive has killed more than 23,000 Gazans, about 1% of Gaza's 2.3 million people, according to the health ministry of Hamas-governed Gaza."
}