{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBR0HS_L.jpg",
  "title": "France, Germany, UK and US condemn Iran's increase in uranium enrichment",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Dec 28, 2023 08:37PM ET",
  "comments": [
    2,
    [
      [
        "Ken Roth",
        "2023-12-29 05:05:37",
        "If Iran gets hold of nuclear weapons not long before isreal will experience an unknown blast",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Ken Roth",
        "2023-12-29 05:03:30",
        "Iran will anything they can to develop a nuclear bomb with the help of russia. Only one way possible to stop it is by bombing the nuclear enrichment sites otherwise isreal will suddenly have a nuclear blast of unknown origin.",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/france-germany-uk-and-us-condemn-irans-increase-in-uranium-enrichment-3264530",
  "paragraph": "© Reuters. FILE PHOTO: The Iranian flag flutters in front of the International Atomic Energy Agency (IAEA) organisation's headquarters in Vienna, Austria, June 5, 2023. REUTERS/Leonhard Foeger/File Photo\nBy Jonathan Landay WASHINGTON (Reuters) -France, Germany, Britain and the United States on Thursday condemned an increase by Iran in the production rate of highly enriched uranium of up to 60% purity, close to the level used for nuclear weapons fuel. In a joint statement, the allies made no mention of any consequences Iran could face for the production hike but called for its reversal and said they remained \"committed to a diplomatic solution\" of the feud over Tehran's nuclear program. \"The production of high-enriched uranium by Iran has no credible civilian justification,\" the statement said. \"These decisions ... represent reckless behavior in a tense regional context.\" Since the start of Israel's offensive against Gaza's ruling Hamas militants, Iran-backed proxies have increased their attacks on shipping in the Red Sea and on U.S. troops in Iraq and Syria, sharply increasing tensions in the region. Israel launched its operation in response to Hamas' Oct. 7 rampage into Israel. The U.N. nuclear watchdog, the International Atomic Energy Agency (IAEA), said in a report on Tuesday that Iran had reversed a months-long slowdown in the production rate of highly enriched uranium up to 60% purity. \"We condemn this action, which adds to the unabated escalation of Iran’s nuclear program,\" the joint statement said. Iran on Wednesday dismissed the IAEA report as \"nothing new\" and said it was running its program \"according to the rules.\" Tehran already has enough uranium of 60% purity, if enriched to 90%, to make three nuclear bombs, according to the IAEA's theoretical definition. \nIran has denied seeking nuclear weapons. Britain, France and Germany remain parties to the 2015 deal designed to prevent Iran from developing nuclear weapons. Former U.S. President Donald Trump reneged on the accord in 2018, prompting Iran to gradually violate its strictures."
}