{
  "image": "https://i-invdn-com.investing.com/news/LYNXNPEA8N0F2_L.jpg",
  "title": "GIFT City attracts major financial players and plans for expansion",
  "category": "World news",
  "publisher": "Investing.com",
  "date": "Published Jan 12, 2024 04:58AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/gift-city-attracts-major-financial-players-and-plans-for-expansion-93CH-3273222",
  "paragraph": "GANDHINAGAR - The Vibrant Gujarat Global Summit has marked a new era for GIFT City, as it becomes a focal point for financial services expansion and investment attraction. Today, the Abu Dhabi Investment Authority commenced operations, becoming GIFT City's inaugural sovereign fund. This move is expected to boost the city's profile as a global financial hub.\nThe summit also witnessed APEX Group announcing its intention to bolster the local workforce by hiring approximately 1000 individuals for fund administration roles over the next three years. Mizuho Bank has furthered GIFT City's international appeal by setting up a new IFSC unit to bring Japanese banking services to the region.\nIn the realm of education and transportation, Deakin University inaugurated its campus, and Transworld Group disclosed its plans to venture into ship and aircraft leasing. The educational sector is set to further benefit as Accenture (NYSE:ACN) and The Education Centre of Australia have expressed interest in establishing their presence in GIFT City.\nMoreover, Stonex Group is gearing up for bullion trading activities, while ONGC has introduced a finance company to the city's growing financial landscape.  Wipro  (NYSE:WIT) is seeking to enter B2B Tech-Fin operations, State Bank of India has relocated its headquarters, and Life Insurance Corporation of India's tower is nearing operational readiness.\nIn a significant policy development, Union Finance Minister Nirmala Sitharaman proposed the establishment of a green credits trading platform within the International Financial Services Centres Authority (IFSCA) at GIFT City. This proposal aligns with the broader vision to position GIFT City as a hub for climate finance.\nAdditionally, the Union government is paving the way for Indian companies to directly list on IFSC exchanges, which is anticipated to open new avenues for capital and growth. This move is part of a larger plan announced by Finance Minister Sitharaman at GIFT City's \"An aspiration of modern India\" session. The plan aims to mitigate India's $10.1 trillion funding gap needed for its net zero ambition by 2070. The proposed IFSC platform where green credits are traded is expected to incentivize eco-friendly initiatives such as afforestation, renewable energy usage, and solid waste management among a network of over 2 million industry professionals.\nIFSCA Chairman K Rajaraman underscored these advancements by announcing the imminent launch of a single window IT system for regulatory approvals, set to go live in March 2024, streamlining processes and reinforcing GIFT City's strategic importance in the global financial ecosystem.\nThis article was generated with the support of AI and reviewed by an editor. For more information see our T&C."
}