{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBS0FS_L.jpg",
  "title": "Russia's air assault on Ukraine draws criticism at UN Security Council meeting",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 29, 2023 08:29PM ET",
    "Updated Dec 30, 2023 12:25PM ET"
  ],
  "comments": [
    2,
    [
      [
        "Ken Roth",
        "2023-12-30 19:35:53",
        "UN security council has become a joke after russia with veto powers are still a member.",
        "https://www.investing.com/members/213081368"
      ],
      [
        "inderjeet virk",
        "2023-12-30 14:25:05",
        "and israeli assault on gaza?",
        "https://www.investing.com/members/201550452"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/russias-air-assault-on-ukraine-draws-criticism-at-un-security-council-meeting-3264866",
  "paragraph": "By Simon Lewis (Reuters) -Russia drew sharp criticism at the UN Security Council on Friday for launching massive missile and drone attacks against Ukraine, after Kyiv and its supporters called for an urgent meeting of the 15-member body to address the strikes. Russian strikes across Ukraine on Friday killed 31 civilians and wounded more than 160 others in the biggest aerial attacks since the start of the war in February 2022, according to officials, and Poland said a Russian missile appeared to have flown into its airspace before returning to Ukraine. \"Tragically, 2023 is ending as it began – with devastating violence against the people of Ukraine,\" UN Assistant Secretary-General Khaled Khiari said after briefing the council on the attacks.  \"Once again, Ukrainians are forced to spend the holidays seeking shelter, clearing the rubble, and burying the dead, amidst freezing temperatures,\" he added.  Most council members, including the United States, France and Britain, condemned the attacks on Ukraine.  \"Rather than peace, (Russian President Vladimir) Putin chose to mark this holiday season and usher in the New Year with an unprecedented number of drone and missile strikes against another UN member state,\" said U.S. Minister-Counselor John Kelley.  China's Deputy Permanent Representative to the UN, Geng Shuang, did not condemn the attacks and called for a \"political solution\" to the war in Ukraine.  Russia's UN ambassador Vasily Nebenzya said in a lengthy response that Russia had launched attacks only on military infrastructure in Ukraine and that Ukraine's air defense systems were responsible for civilian casualties. Britain's ambassador to the UN Barbara  Woodward  (NASDAQ:WWD) responded that Russia's actions were the sole cause of the tragedy in Ukraine. \"The rest is a torrent of lies and disinformation,\" Woodward said of Nebenzya's remarks. \nUN Secretary-General Antonio Guterres condemned the attacks by Russia on Ukraine, spokesperson Stephane Dujarric said in a statement.  \"Attacks against civilians and civilian infrastructure violate international humanitarian law, are unacceptable and must end immediately,\" Dujarric said."
}