{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK070MZ_L.jpg",
  "title": "France's Macron launches political reset with PM change",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 08, 2024 12:20PM ET",
    "Updated Jan 08, 2024 08:57PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/french-pm-borne-resigns-macron-to-name-new-government-3269723",
  "paragraph": "© Reuters. French Prime Minister Elisabeth Borne attends the questions to the government session at the National Assembly ahead of a vote by members of parliament on immigration bill in Paris, France, December 19, 2023. REUTERS/Sarah Meyssonnier\nBy Michel Rose PARIS (Reuters) - French Prime Minister Elisabeth Borne resigned on Monday, as President Emmanuel Macron seeks to give a new impetus to his second mandate ahead of European parliament elections and the Paris Olympics this summer. Macron did not immediately name a successor for Borne, who will stay on as a caretaker along with the rest of the government until a new one is formed, the presidential palace said in a carefully choreographed move. The change was made after a year marred by political crises triggered by contested reforms of the country's pension system and immigration laws. The move will not necessarily lead to a shift in political tack, but rather signal a desire to move beyond the pension and immigration reforms and focus on new priorities, including hitting full employment.  In her resignation letter, Borne said she and Macron agreed in their last meeting that \"it was more necessary than ever to push on with reforms\".  European Parliament elections are scheduled to take place in June, with eurosceptics expected to make record gains at a time of widespread public discontent over surging living costs and the failure of European governments to curb migration flows.  In France, opinion polls show Macron's party trailing that of far-right leader Marine Le Pen by some eight to ten percentage points ahead of the elections.  Speculation of a government reshuffle had been rife in the weeks since the French parliament narrowly adopted toughened immigration rules, a battle that exposed deep cracks in Macron's centrist majority. Macron promised a new political initiative. Among those cited as potential candidates to replace Borne are Education Minister Gabriel Attal, 34, and Defence Minister Sebastien Lecornu, 37, either of whom would be France's youngest prime minister. \"With a young, dynamic profile who can communicate well, the prime minister would be a campaigner, which shows that Emmanuel Macron's priority is the election rather than passing bills,\" Benjamin Morel, a political analyst, said on Franceinfo. Former Agriculture Minister Julien Denormandie, Finance Minister Bruno Le Maire and Interior Minister Gerald Darmanin, have also been mentioned by political sources as possible options for the prime minister's job. TURBULENT ENVIRONMENT A soft-spoken career bureaucrat who served numerous Socialist Party ministers before joining Macron's governments, Borne, 62, had been prime minister since May 2022. She was only the second woman to serve in the post. Macron and his government, led by Borne, have struggled to deal with a more turbulent parliament to pass laws since losing their absolute majority shortly after he was reelected for a second mandate in 2022. The French president's advisers say Macron has managed to pass the most challenging parts of his economic manifesto in the first year and a half of his second mandate, despite the lack of an absolute majority, and that future reforms, on education and euthanasia for instance, will be more consensual. But the president's decision to use executive powers last year to pass a contested increase in the pension age to 64 triggered weeks of violent protests. Borne had become known as \"Madame 49.3\" for invoking the special powers laid out in article 49.3 of the French constitution some 23 times to ram bills through.  The reshuffle is likely to intensify the race in Macron's camp to succeed him in the next presidential election in 2027, with former Prime Minister Edouard Philippe, Darmanin and Le Maire all seen as potential candidates. \nBut with Le Pen having spent the past 18 months in parliament working to detoxify her image and burnish her credentials as a potential president, many politicians now speculate she could win the next presidential election in 2027.  (This story has been refiled to add dropped words in paragraph 2)"
}