{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBU02Y_L.jpg",
  "title": "Congo President Tshisekedi re-elected after contested poll",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 31, 2023 12:11PM ET",
    "Updated Dec 31, 2023 05:30PM ET"
  ],
  "comments": [
    1,
    [
      [
        " ",
        "2023-12-31 17:46:27",
        "welcome all friends ",
        "https://www.investing.com/brokers/"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/congo-president-tshisekedi-reelected-after-contested-poll-3264983",
  "paragraph": "© Reuters. FILE PHOTO: Independent National Electoral Commission (CENI) officials and polling agents gather to count and tally casted ballot papers at a polling centre following the Presidential election in Goma, North Kivu province of the Democratic Republic of Con\nBy Ange Kasongo KINSHASA (Reuters) -Democratic Republic of Congo President Felix Tshisekedi has been re-elected for a second term after getting more than 73% of the vote in a Dec. 20 poll, the country's election commission CENI said on Sunday. The declaration of the result follows days of opposition complaints about the way the election was conducted.  Logistical setbacks, an election day over-run, and an opaque vote count have fuelled a dispute that threatens to further destabilise a country roughly the size of Western Europe which is the world's top producer of cobalt and other prized industrial commodities. Announcing the results in the capital Kinshasa, Denis Kadima, head of CENI, said Tshisekedi had obtained more than 13 million out of over 18 million valid votes, adding that turnout was more than 43%.  Cheers erupted from Tshisekedi's supporters present at the declaration after Kadima announced that Tshisekedi was provisionally elected. Speaking to hundreds who gathered at his campaign headquarters after the announcement, Tshisekedi, flanked by his wife and mother, thanked supporters and promised to speed up programmes during his second term to tackle inequalities. \"You believed in my commitment not to spare any effort so that our country will retake its rightful place, and so that the Congolese people will recover their pride and dignity in belonging to this country,\" he said.  \"You believed in my fight against inequalities that have for a long time characterized our society,\" he said. Rival political parties, candidates and those mandated by them have two days to challenge the outcome of the election at the Constitutional Court. The court then has seven days to rule on the case and proclaim the final result. Opposition frontrunner Moise Katumbi, who came second with 18%, has already ruled out mounting a legal challenge to the results, citing an alleged lack of independence of state institutions.  Other opposition candidates have not clarified whether they will challenge the results. Earlier on Sunday a group of nine opposition presidential candidates, including Katumbi, and six leaders of political parties asked supporters to take to the streets to protest after the release of the provisional results. JOINT DECLARATION  \"We categorically reject the sham election ... and its results,\" the main opposition candidates said in a joint declaration. They demanded fresh elections be held with a new electoral body on a date to be agreed by all. \"We call on our people to take to the streets en masse after the proclamation of the electoral fraud,\" they said. While Tshisekedi's supporters celebrated his win in the streets of the capital, there was calm in other cities with little signs of protest on New Year's Eve.  The government of Congo had previously rejected calls for a rerun of the elections. Since election day, some of Tshisekedi's main challengers, including former oil executive Martin Fayulu, have been calling for a re-run of the contest and of legislative elections, accusing CENI of allowing the vote to be tipped in the president's favour.  \nCENI and the government have dismissed these allegations and also warnings from independent observer groups that the unscheduled extension of voting and other incidents on election day, and during the tabulation of votes, may have compromised the credibility and legal footing of the poll. The United States continues to \"closely follow\" the electoral progress in Congo, a State Department official said on Sunday while noting that any election disputes should be resolved peacefully and in accordance with Congolese electoral law."
}