{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK090O8_L.jpg",
  "title": "US condemns attacks by armed groups in Ecuador, offers more cooperation",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 10, 2024 11:49AM ET",
    "Updated Jan 10, 2024 03:30PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-condemns-attacks-by-armed-groups-in-ecuador-3271720",
  "paragraph": "© Reuters. FILE PHOTO: U.S. National Security Advisor Jake Sullivan speaks during a press briefing, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, in Tel Aviv, Israel, December 15, 2023. REUTERS/Violeta Santos Moura/File Photo\nWASHINGTON (Reuters) -The United States strongly condemns recent attacks by armed groups in Ecuador and pledged to increase cooperation with the government, the White House said on Wednesday as violence escalated in the South American country. Inmates in Ecuador are holding more than 130 prison guards and other staff hostage in at least five prisons, while gunmen took over a TV station live on air and explosions erupted around the country in a dramatic wave of fresh violence this week.  \"We strongly condemn the recent criminal attacks by armed groups in Ecuador against private, public, & government institutions,\" national security adviser Jake Sullivan said in a post on social media platform X, adding that Washington would cooperate with partners to bring perpetrators to justice. White House national security spokesman John Kirby (NYSE:KEX) separately told reporters that the United States was monitoring the situation and was \"willing to take concrete steps to improve our cooperation\" with Ecuador's government to deal with the violence and its impact on the population.  The hostage-takings began in the early hours of Monday, after the apparent escape of a gang leader from prison over the weekend, spurring Ecuador's President Daniel Noboa to declare a 60-day state of emergency. Noboa, who has promised to tackle a growing security problem caused by a rise in drug gangs transporting cocaine through Ecuador, on Wednesday said the country was \"at war,\" a day after naming 22 gangs as terrorist organizations and making them official military targets.  \nKirby, speaking at a press briefing at the White House, said the Biden administration had not had any specific conversations with Noboa or his government but would be willing to talk about what Ecuador needs, including investigative help. There is no plan for the U.S. military to send in any troops, he added.  He urged Americans in Ecuador to \"stay vigilant\" and keep abreast of any possible communications from the U.S. State Department, adding that no determination has been made about U.S. diplomats in the country. He also said it was \"too soon\" to know whether the violence could impact migration to the United States."
}