{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0O0D8_L.jpg",
  "title": "Trump opens up lead over Biden in rematch many Americans don't want",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 25, 2024 06:06AM ET",
    "Updated Jan 25, 2024 06:17PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Mark Jannetty",
        "2024-01-25 22:17:58",
        "even the most liberal rag has Trump winning. we're are the 4 socialists? why are they burying this story 🤣",
        "https://www.investing.com/members/241633026"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/americans-dismayed-by-biden-trump-2024-rematch-reutersipsos-poll-finds-3282610",
  "paragraph": "© Reuters. U.S. President Joe Biden delivers remarks, during a campaign event focusing on abortion rights at the Hylton Performing Arts Center, in Manassas, Virginia, U.S., January 23, 2024. REUTERS/Evelyn Hockstein/File Photo\nBy Jason Lange WASHINGTON (Reuters) - Donald Trump leads Democratic President Joe Biden by six percentage points in a Reuters/Ipsos poll that showed Americans are unhappy about an election rematch that came into sharper focus this week. The nationwide poll of 1,250 U.S. adults showed Trump leading Biden 40% to 34% with the rest unsure or planning to vote for someone else or no one. The poll had a margin of error of three percentage points. That represented a gain for Trump after a Reuters/Ipsos poll conducted earlier this month showed him and Biden tied, though a nationwide survey does not capture the subtleties of the electoral college contest that will be decided this fall in just a handful of competitive states. As Trump handily beat his sole remaining primary challenger, Nikki Haley in New Hampshire on Tuesday, some 67% of respondents polled Monday through Wednesday said they were \"tired of seeing the same candidates in presidential elections and want someone new.\" Still, just 18% said they would not vote if Biden and Trump were their choice. \"I hate to think that we're constantly navigating the lesser of two evils,\" said Kimberly Sofge, a 56-year-old project manager in Washington, D.C., this week. \"I honestly feel that we can do better.\" The two candidates themselves seem ready for a rematch following Trump's back-to-back wins in Iowa and New Hampshire, with the White House regarding Trump as a beatable challenger, and Trump fuming because Haley did not immediately drop out of the Republican race. Trump's six-point lead held even when respondents were given the option of voting for third-party candidates, including anti-vaccine activist Robert F. Kennedy Jr., with Trump drawing 36% support, Biden 30% and Kennedy 8%. Slightly more than half of respondents said they were dissatisfied with the U.S. two-party system, with just one in four satisfied by it. Whitney Tallarico, 33, a consultant interviewed in Washington, is among those considering an alternative.  \"The independents don't really have a voice. Polarizing characters usually take the front seat, and it's a little sad for our country,\" Tallarico said this week. Asked whether she would vote for Biden or Trump, she said, \"I'll probably go for a third party.\" AGE ISSUE Overall, the poll gave numerous signs that voters are not happy with their choices. Seventy percent of respondents - including about half of Democrats - agreed with a statement that Biden should not seek re-election. Fifty-six percent of people responding to the poll said Trump should not run, including about a third of Republicans.  Biden has been weighed down by the widespread view that at 81, already the oldest person ever to be U.S. president, he is too old for the job.  Three-quarters of poll respondents agreed with a statement that Biden was too old to work in government, while half said the same about Trump, who at 77 would also be among the oldest U.S. leaders ever if returned to the White House. Just over half of Democrats saw Biden as too old while a third of Republicans viewed Trump that way. Haley, 52, is trying to marshal dissatisfaction to turn around her well-financed but flagging campaign. \"Most Americans do not want a rematch between Biden and Trump,\" she said on Tuesday after her loss to Trump in New Hampshire. \"The first party to retire its 80-year-old candidate is going to be the party that wins this election.\" The new poll showed Trump with a towering nationwide lead over Haley - 64% to 19% - as they prepare for the Feb. 24 Republican nomination contest in South Carolina, which Haley led as governor 2011-2017.  Turnout could still be high in the November general election in part because voters from both parties are highly motivated to beat the other side. Fifty-nine percent of respondents who said they planned to vote for Biden said they were motivated primarily by opposition to Trump, while Trump voters were more positive about their candidate and his policies, with just 39% describing their vote as one against Biden. Anti-Trump sentiment helped Biden defeat Trump in the 2020 election, when a record-high share of eligible voters cast ballots. \nAnother factor that could weigh on Trump: 55% of Republicans in the poll said he should be convicted and sentenced to prison if he broke the law. Trump, who is currently facing four criminal prosecutions, has argued in court that he should be immune to prosecution for actions taken while he was president. To be sure, most Republicans do not think he is guilty - only one in five Republican respondents said it was believable that Trump solicited election fraud, one of the key charges against him, and four out of five said his political opponents were abusing the legal system to derail his presidential bid."
}