{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "US says it shot down anti-ship cruise missile from Houthi-controlled areas",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 14, 2024 10:15PM ET",
    "Updated Jan 14, 2024 10:20PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Fred Johnson",
        "2024-01-15 03:26:53",
        "\"You violated our airspace\". \"So what if we've shot 250 missiles at your ships\".    lol",
        "https://www.investing.com/members/246856018"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/us-says-it-shot-down-antiship-cruise-missile-from-houthicontrolled-areas-3274188",
  "paragraph": "WASHINGTON (Reuters) - U.S. fighter aircraft shot down an anti-ship cruise missile fired from Houthi militant areas of Yemen toward a U.S. destroyer operating in the Southern Red Sea, the U.S. military said on Sunday. The midair interception is the latest incident in the Red Sea where the Houthis have been attacking international shipping in what they say is a campaign to support Palestinians under seige from Israeli forces in Gaza. It follows a series of American and British airstrikes on Houthi targets in Yemen that have drawn threats of a \"strong\" response from the Iranian-backed militia. There were no injuries or damage reported in the latest incident, according to the U.S. Central Command (CENTCOM), which released the news in a statement posted on the social media platform X. CENTCOM said the missile was shot down near Yemen's port city of Hodeidah. Earlier on Sunday, the Houthis complained that U.S. aircraft were observed flying close to Yemeni airspace and coastal areas. Houthi spokesman Mohammed Abdulsalam described the activity by \"enemy\" aircraft as a blatant violation of national sovereignty. Reuters could not immediately determine whether the incidents were one and the same. CENTCOM did not immediately respond to an email seeking further details about the interception. The Red Sea crisis has added to anxieties over a wider conflict in the Middle East beyond Gaza, which Israel is reducing to rubble in what it says is a campaign to annihilate the Palestinian militant group Hamas, which rules the strip and, like the Houthis, is backed by Tehran. Also on Sunday, pro-Palestinian activists protested at the gates of RAF Akrotiri in Cyprus, angry that the British base was used as a launch pad for strikes against the Houthis. \"We are here because we condemn the complicity of the UK government and using Cypriot land for their agenda to support Israel in their onslaught of Gaza,\" said Natalia Olivia of the Cyprus-based United for Palestine organisation."
}