{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0N0SE_L.jpg",
  "title": "Supreme Court declines to halt first US nitrogen-gas execution in Alabama case",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 24, 2024 03:04PM ET",
    "Updated Jan 24, 2024 08:46PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Charles Manson",
        "2024-01-24 21:17:29",
        "Nitrogen Gas Execution. What a Novel Idea. What will they think of next? Why not just push him off a Tall Building or drop him out of a plane? So many ways to kill people.",
        "https://www.investing.com/members/249519852"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/supreme-court-declines-to-halt-first-us-nitrogengas-execution-in-alabama-case-3282106",
  "paragraph": "© Reuters. Kenneth Eugene Smith, convicted for a murder-for-hire committed in 1988, and who is scheduled to be executed in the U.S. state of Alabama by asphyxiation using pure nitrogen, poses for an undated booking photo at Holman Prison in Atmore, Alabama, U.S. \nBy Andrew Chung (Reuters) -The U.S. Supreme Court on Wednesday declined to halt Alabama from proceeding with the nation's first execution using nitrogen gas to carry out the death penalty on convicted murderer Kenneth Smith, who survived a botched lethal injection in 2022 that helped prompt a review of the state's death penalty procedures. The justices denied Smith's request to stay his execution, which is scheduled for Thursday, and declined to hear his legal challenge contending that a second execution attempt by Alabama - after the first failed attempt caused him severe trauma - would violate the U.S. Constitution's Eighth Amendment protections against cruel and unusual punishment.  No justice publicly dissented from the decision. Smith, 58, is separately contesting the legality of Alabama's nitrogen gas protocol on Eighth Amendment and other grounds. That litigation still could come to the Supreme Court, potentially giving the justices another opportunity to decide whether to halt the execution. A judge ruled against Smith concerning the protocol on Jan. 10. The Atlanta-based 11th U.S. Circuit Court of Appeals upheld that decision on Wednesday. Smith's attorney Robert Grass declined to comment.  A majority of the Supreme Court's justices in 2022 cleared the way for the first attempted execution of Smith, who was sentenced to death for his role in a 1988 murder-for-hire plot. The nine-member court's three liberal justices dissented from that previous decision.  Alabama's gassing method - called nitrogen hypoxia - was designed to deprive Smith of oxygen by placing a mask connected to a cylinder of nitrogen over his face.  Smith's botched execution was the third consecutive instance in which Alabama officials encountered problems or delays inserting intravenous lines for a scheduled lethal injection, with two of the executions, including Smith's, eventually called off, according to court filings.  The problems prompted Alabama Governor Kay Ivey, a Republican, to announce a review of the state's execution procedures. Officials completed the review a few months later, saying they obtained new equipment and would add to the pool of available medical personnel for executions. Smith in May 2023 challenged Alabama's plan for a second execution attempt, asserting in state court that it would violate the Eighth Amendment after the first attempt, according to his lawyers, caused him severe physical and psychological pain, including post-traumatic stress disorder.  State officials during that first execution attempt repeatedly tried but failed to place the necessary intravenous lines or a central line in his collarbone area before calling off the execution after 11 p.m. Smith's lawyers have characterized the experience as torture and said that it \"exposed him to the severe mental anguish of a mock execution.\"  Lower courts in Alabama dismissed Smith's challenge. Smith's lawyers urged the U.S. Supreme Court to intervene, calling Alabama's nitrogen-gas protocol \"recently released and untested,\" and \"a novel method of execution that has never been attempted by any state or the federal government.\" Alabama Republican Attorney General Steve Marshall in a filing called the method \"perhaps the most humane method of execution ever devised.\"  Ivey set Smith's execution to take place within a 30-hour time frame beginning at 12 a.m. on Thursday and expiring at 6 a.m. the following day. Smith was convicted in the 1988 killing Elizabeth Sennett after he and an accomplice were hired by her husband Charles Sennett, a Christian minister who had taken out a large insurance policy on his wife, according to prosecutors. She was stabbed repeatedly and beaten with a blunt object. Charles Sennett later committed suicide. Smith's accomplice also was convicted and sentenced to death, with the execution carried out in 2010. \nThe U.N. human rights office on Jan. 16 called on Alabama to halt the planned execution, saying it could amount to torture and violate American commitments under international law.  U.S. states that still allow the death penalty have found it increasingly difficult to obtain barbiturates used in lethal-injection execution protocols, in part because of a European ban preventing pharmaceutical companies from selling drugs to be used in executions. Alabama, Mississippi and Oklahoma have introduced new gas-based protocols."
}