{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "US says it is looking forward to Turkey finalizing Sweden's NATO process",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 24, 2024 02:28PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-says-it-is-looking-forward-to-turkey-finalizing-swedens-nato-process-3282085",
  "paragraph": "By Humeyra Pamuk WASHINGTON (Reuters) - The United States on Wednesday welcomed the Turkish parliament's ratification of Sweden's NATO membership bid this week and urged Ankara to formally finalize the process. State Department deputy spokesperson Vedant Patel told a briefing that Washington was looking forward to Hungary, which has yet to approve Sweden's NATO bid, moving along in the process. \"We look forward to (Turkish) President (Tayyip) Erdogan taking...steps he needs to within that system to formally finalize that process as well as we look forward to receiving Turkey's instrument of ratification ... in Washington,\" Patel said. \"And we look forward to our Hungarian partners also moving along on this process also.\" Turkey's parliament ratified Sweden's NATO membership bid on Tuesday, clearing the biggest remaining hurdle to expanding the Western military alliance after 20 months of delay, leaving Hungary as the only NATO member yet to ratify the accession. All NATO members need to approve applications from countries seeking to join the alliance. When Sweden and Finland asked to join in 2022, Turkey raised objections over what it said was the two countries' protection of groups it deems terrorists. It endorsed Finland's membership in April last year but, along with Hungary, had kept Sweden waiting. Erdogan is expected to sign the legislation within days. Turkey's ratification of Sweden's NATO bid and the U.S. sale of F-16 fighter jets to Turkey have become linked over the past years. The Biden administration has said it supports the sale but kept urging Ankara to approve Sweden's NATO bid saying Congress might be connecting the two issues. When asked on Wednesday if the State Department would send the formal notification for the jets once Sweden's NATO process is fully formalized, Patel did not commit to a timeline. \"President Biden, Secretary Blinken have been very clear of our support for modernizing Turkey's F-16 fleet, which we view as a key investment in NATO interoperability. But beyond that, we also recognize that Congress has a key role in reviewing arms sales, but I'm just not going to confirm or get ahead of proposed defense sales or transfers until they are formally notified to Congress.\""
}