{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0F0UM_L.jpg",
  "title": "Macron promises wide array of reforms for France as he seeks reset",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 16, 2024 03:13PM ET",
    "Updated Jan 17, 2024 03:36AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/macron-urges-the-french-to-be-united-promises-wide-array-of-reforms-3275531",
  "paragraph": "2/2\n© Reuters. French President Emmanuel Macron speaks during a press conference to answer questions from journalists after naming a new government, at the Elysee Palace in Paris, France, January 16, 2024. REUTERS/Christian Hartmann\n2/2\nBy Elizabeth Pineau and Tassilo Hummel PARIS (Reuters) -French President Emmanuel Macron on Tuesday announced a wide array of measures - from regulating children's screen time to increasing parental leave payments - in a bid to reinvigorate a second mandate marred by his unpopularity and contested reforms. In a rare and lengthy news conference, Macron focused on voters' everyday concerns, including schools and the cost of living, confirming that he wants to turn the page on last year's contested pension and immigration reforms. \"France will be stronger in this world of upheaval if we're more united,\" he said. \"I'm convinced that we have all the assets we need to succeed.\" Discontent over surging living costs and last year's reforms have seriously hit Macron's ratings, and his chances in European Parliament elections in June, where his party trails badly behind Marine Le Pen's far-right National Rally.  In a nod to that, Macron confirmed plans for tax cuts for the middle class and said electricity would remain substantially cheaper than in some neighbouring countries but gave no details. \"There is a blind spot in France, which means many of our compatriots earn too much to get help but not enough to live well,\" Macron said. He said he wanted to address that. Macron's appointment last week of Gabriel Attal, 34, a relatively popular and media-savvy rising star of French politics, as France's youngest ever prime minister, had already signaled the president's desire to move forward and also win back disgruntled voters tempted by Le Pen's far-right party. \"The National Rally has become the party of easy anger,\" he said, urging voters to think twice. \"It's not the National Rally's Europe that would give you access to vaccines,\" he said, in a reference to the EU's concerted efforts to buy COVID vaccines at the height of the pandemic. CHILDREN It remains to be seen how much Tuesday's announcements - many of which were broad-brushed with details expected later from the government - can help change the tide for Macron.  Measures concerning children would include regulating their TV, phone and computer screen time, he said, adding that he could not specify yet how that would be done. He also announced that uniforms would be tried out in about 100 schools, adding there would be more civic instruction classes and that all children in junior high school should have access to drama classes. Parental leave, Macron said, would be shorter than now but better paid. He said there would be reforms of the health system to ensure people have better access to doctors - a major concern for many in France - but remained quite vague about how that would be achieved. Macron, whose margin of manoeuvre is constrained by the lack of an absolute majority in parliament, said he would ask his government to launch more liberal reforms to boost the economy, saying France needed to \"produce more\" and \"innovate more\".  \n\"France will be stronger if it wins back its financial independence\", he said. He reaffirmed his pledge to reach full employment, promising new reforms to reach that goal, including better helping the unemployed to find work - but also being more strict when they refuse job offers."
}