{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK090BE_L.jpg",
  "title": "Russia's Navalny jokes about 'naked party' in first video link from new prison",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 10, 2024 05:34AM ET",
    "Updated Jan 11, 2024 04:16AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/russias-navalny-jokes-about-naked-party-in-first-video-link-from-new-prison-3271112",
  "paragraph": "© Reuters. FILE PHOTO: Russian opposition leader Alexei Navalny is seen on a screen via a video link from the IK-2 corrective penal colony in Pokrov during a court hearing to consider an appeal against his prison sentence in Moscow, Russia May 24, 2022. REUTERS/Evge\nBy Mark Trevelyan (Reuters) - Russian opposition politician Alexei Navalny cracked jokes on Wednesday in his first court appearance since being transferred to an Arctic penal colony, but a judge rejected his latest challenge against his treatment in prison. Navalny appeared by video link from the \"Polar Wolf\" colony to which he was transferred last month from a prison in Melekhovo, east of Moscow, in an arduous three-week journey by road and rail. He drew laughter from the judge when he asked on the call whether the Melekhovo colony had thrown a party to celebrate his departure, and whether it had included karaoke. He later inquired if the prison department in Melekhovo had staged a naked party - a reference to a gathering of scantily clad celebrities in Moscow last month that caused a national scandal. The exchanges showed Navalny's ability to find humour even in his grim situation and to connect with the outside world despite being sent to one of Russia's most remote and inhospitable regions. His frequent court hearings have provided him with a platform to keep up his attacks on President Vladimir Putin and the war in Ukraine and to challenge and mock his incarcerators. He told judge Kirill Nikiforov, who has presided over many such sessions, that \"a tear is flowing down my cheek\" from the pleasure of seeing him again. Navalny, 47, is serving sentences totalling more than 30 years on a range of charges, from fraud to extremist activity, that he says were trumped up to silence him. In 2020 he survived an attempt to poison him with a nerve agent. The Kremlin says he is a convicted criminal and his treatment is a matter for the prison service. It has portrayed him and his supporters as extremists with links to the CIA intelligence agency who they say are seeking to destabilise Russia. 'LONG WAY AWAY' At Wednesday's hearing - a transcript of which was compiled by independent Russian news outlet Mediazona - Navalny unsuccessfully argued that authorities had acted illegally by sending him to an isolation cell in October for insulting a prison inspector. Navalny said the inspector had confiscated his pen despite the fact he was entitled to have writing materials, and acknowledged he \"went overboard\" by calling the official a devil, a moron and a scarecrow. But by the time of that incident, he argued, he should have already been moved from Melekhovo to another detention facility after his latest 19-year sentence was handed down in August. The judge rejected Navalny's complaint. The Polar Wolf colony, some 1,900 km (1,200 miles) northeast of Moscow, is one of Russia's harshest. Navalny joked in a social media post relayed through his lawyers this week that the temperature had \"not been colder than -32°C yet\" and he was finding his early morning exercise \"invigorating\". In Wednesday's hearing he said the food was fine but he had yet to receive any letters or telegrams. \n\"I'm quite a long way away,\" he said.  (This story has been refiled to fix a typo in paragraph 2)"
}