{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBU081_L.jpg",
  "title": "Congo's Tshisekedi fights poll fraud accusations with 'spirit of openness'",
  "category": "Commodities news",
  "publisher": "Reuters",
  "date": "Published Dec 31, 2023 01:46PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/commodities-news/congos-tshisekedi-fights-poll-fraud-accusations-with-spirit-of-openness-3264986",
  "paragraph": "By Ange Kasongo KINSHASA (Reuters) - When Democratic Republic of Congo's President Felix Tshisekedi was declared the winner of another disputed election on Sunday, he pledged be a leader for all its 100 million people.  However, accusations by opposition leaders of electoral fraud and political repression will likely cloud his second term as it did the first. His main rivals rejected Sunday's outcome before it was announced and called for a rerun. Speaking to supporters at his campaign headquarters in the capital, Kinshasa, Tshisekedi appealed for unity.  \"It is with a spirit of openness that I'll govern during this second term,\" Tshisekedi told a jubilant crowd, adding that he would focus on creating jobs, security and a more diversified and competitive economy. The result sets the stage for a tense political standoff with the potential for the kind of violence that followed contested polls in 2018, 2011 and 2006.  There could also be international ramifications. Congo is the world's top supplier of cobalt, used in making batteries for electric vehicles and cell phones, and its third-biggest copper producer.  Tshisekedi, 60, son of longtime opposition leader Etienne Tshisekedi, inherited his father's substantial support base on his death in 2017 after years in the shadows.  However, vote tallies reviewed by Reuters at the time from Congo's Roman Catholic Church, which had a 40,000-strong team of observers, showed second-placed opposition candidate Martin Fayulu as the victor in 2018.  Fayulu suspected that Tshisekedi had struck a deal with outgoing president Joseph Kabila, who was prevented from running by term limits. Fayulu denounced the result as a \"constitutional coup d'etat\", which Tshisekedi and Kabila both dismissed. With Kabila's help, Tshisekedi was able to garner much-needed support in parliament and security institutions in his first years in office. But the alliance quickly fell apart as he moved to strengthen his hand by placing supporters in key positions. 'SHAM ELECTION' When he launched his campaign for re-election, Tshisekedi told supporters he needed more time to consolidate gains and deliver on promises to roll back decades of authoritarian rule, root out corruption, rebuild the economy, tackle inequalities and deal with a prolonged security crisis in Congo's east.  \"In just two years we have been able to do all of these actions that you have seen, but we can do better,\" Tshisekedi told a packed Kinshasa stadium on Nov. 19, adding that his first two years in office were constrained by the power-sharing arrangement with Kabila. Critics, however, said Tshisekedi had fallen short and accused him of stifling dissent, as his predecessors had done.  A group of nine rival presidential candidates, including Fayulu and opposition frontrunner Moise Katumbi, asked supporters on Sunday to take to the streets to protest what they called a \"sham election\". While economic growth rose sharply under Tshisekedi's watch, largely due to demand for key minerals, little of the proceeds reached the around 62% of Congo's population who live on less than a dollar a day. The cost of living soared as the Congolese franc depreciated, with annual inflation running at over 30% in December, according to the country's statistics institute. \nAlthough Tshisekedi declared a state of siege in two eastern provinces in May 2021 and increased defence spending, his administration struggled to contain the numerous armed groups behind attacks that have killed thousands of people and displaced nearly 7 million in the east. In a worrying development, Corneille Nangaa, leader of a new alliance that includes rebels and political groupings in eastern Congo, rejected the election and vowed on Sunday to \"march to Kinshasa\"."
}