{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "Downed power line kills three but baby in diapers survives in Oregon",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 17, 2024 09:20PM ET",
    "Updated Jan 17, 2024 09:26PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/downed-power-line-kills-three-but-baby-in-diapers-survives-in-oregon-3276794",
  "paragraph": "By Daniel Trotta (Reuters) - A downed power line electrocuted three people to death in Oregon after falling onto a vehicle on Wednesday but a baby in diapers survived after a witness retrieved the child from the scene, Portland fire officials said. The deaths appear linked to the severe winter storms and subfreezing temperatures that have pounded the U.S. Northwest in recent days. A fallen tree branch brought the power line onto the top of an SUV, said Rick Graves, a spokesperson for Portland Fire and Rescue who was at the scene. The bodies of two adults and a teenager were found about 25 feet (8 meters) from the car, Graves said. Callers told dispatchers of at least one person and maybe the car on fire, victims lying prostrate, and a loose baby, Graves said. \"It was a very heightened emotional scene, hysteria being reported to the dispatchers from the callers,\" Graves said. The victims remained unidentified. The two adults and the teenager were pronounced dead at the scene and the baby, apparently unharmed, was treated by paramedics and taken to hospital, Graves said, estimating the baby's age at 1 to 2 years. The medical examiner had yet to determine an official cause of death but all indications pointed to electrocution, Graves said. \"Our safety messaging is that if a line comes down across your vehicle, stay in your vehicle ... Once you drop your feet onto the ground, you become part of that electrical current. And you could have some grave results. And that's what we think happened here,\" Graves said. KGW television reported that a neighbor plucked the baby from the arms of one of the bodies before paramedics arrived. \"In my mind I'm just thinking, I have to get this baby.' That's the only thing I was thinking. I have to get this baby,'\" said the neighbor, who asked to remain unidentified, KGW reported."
}