{
  "image": "https://i-invdn-com.investing.com/news/indicatornews_1_800x533_L_1413124982.jpg",
  "title": "U.S. says fuel shipment to Philippines coordinated with authorities",
  "category": "Economy",
  "publisher": "Reuters",
  "date": [
    "Published Jan 10, 2024 10:51PM ET",
    "Updated Jan 11, 2024 12:45AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/economy/us-says-fuel-shipment-to-philippines-coordinated-with-authorities-3271948",
  "paragraph": "MANILA (Reuters) -The U.S. embassy in Manila said on Thursday that the U.S. delivered fuel from one of its naval bases in Hawaii to a facility inside a former U.S. base in the Philippines in coordination with the government. A Philippines senator had criticised the \"inexplicable silence\" over the shipment, which she said raised suspicions about the pre-positioning of military supplies in the country amid concerns about potential Chinese aggression towards Taiwan. The senator, Imee Marcos, who is the president's sister, said the shipment amounted to 39 million gallons of fuel. A spokesperson for the U.S embassy in Manila, Kanishka Gangopadhyay, said the delivery was \"one of multiple shipments of safe, clean fuel\" from a facility in Pearl Harbor to locations in the Pacific. He did not give details about the size of the shipment to Subic Bay, formerly a U.S. Navy base in northern Philippines. \"All shipments of fuel to Subic are conducted in full coordination with the appropriate authorities in the Philippine government, as well as our commercial partners,\" Gangopadhyay said. LSEG shipping data showed a U.S.-registered oil tanker left Hawaii around Dec. 20 and arrived in waters off of the Philippines this week. The vessel is carrying clean fuel, the data shows. \"Subic is not an EDCA site, so where in Philippine territory will millions of gallons of oil be stored?,\" Senator Marcos said on Wednesday. EDCA, or the Enhanced Defense Cooperation Agreement between the Philippines and the United States, gives the U.S. access to military bases in the Southeast Asian country. President Marcos last year granted the United States access to four military bases, on top of five existing locations under the 2014 EDCA, which comes amid China's increasing assertiveness in the South China Sea and over Taiwan, which it views as its own territory. In a statement on Thursday, the Philippines' Department of National Defense said the shipment \"is part of regular commercial transactions between the U.S. Government and Philippine companies.\""
}