{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0S0JA_L.jpg",
  "title": "Freed Israeli hostage fears for resilience of those still held in Gaza",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 29, 2024 11:30AM ET",
    "Updated Jan 29, 2024 11:37AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/freed-israeli-hostage-fears-for-resilience-of-those-still-held-in-gaza-3286240",
  "paragraph": "4/4\n© Reuters. Released hostage Amit Soussana, kidnapped on the deadly October 7 attack by Palestinian Islamist group Hamas, talks to the press in front of her destroyed home at the Kibbutz Kfar Aza, Israel, January 29, 2024. REUTERS/Alexandre Meneghini\n2/4\nBy Leonardo Benassatto and Michal Yaakov Itzhaki KFAR AZA, Israel (Reuters) - An Israeli woman who spent 55 days in Hamas captivity in Gaza said on Monday that every second of that time felt like eternity and she feared for the resilience of the more than 100 remaining hostages abducted on Oct. 7. Returning to the ruins of the Kfar Aza kibbutz, her former home where she was seized by Hamas gunmen during their deadly rampage across southern Israel, Amit Soussana was campaigning in support of the captives alongside some of their relatives. \"I was under an emotional and physical terror the entire 55 days I was held in captivity, feeling like every moment can be my last. Every second felt like eternity,\" said Soussana, 40, wearing a sweatshirt with the slogan \"Bring them home NOW\". She said it was hard to imagine how those still held in Gaza must feel 115 days into their ordeal, with no end in sight. \"I hope that the remaining hostages there are able to keep their faith alive and stay strong. But even the toughest souls can't hold on for such a long time,\" she said. Hamas killed 1,200 people in Israel and abducted 253 on Oct. 7, according to Israel, which responded with a military assault on Gaza that has killed more than 26,600 Palestinians, according to health officials there. It has also displaced most of the strip's population and caused widespread hunger and disease. Almost half of the hostages were released by Hamas during a brief truce in November, while Israel released hundreds of Palestinian prisoners. Diplomatic efforts are ongoing to secure another truce that would allow more hostages to be freed. Monday's public statement by Soussana at Kfar Aza was part of a relentless campaign by families and supporters of the remaining hostages to focus attention on their plight. CCTV footage of Soussana's abduction, released after she was freed, shows her resisting her seven abductors by kicking and writhing as they try and drag her across a field towards Gaza. At one point, one of the men lifts Soussana off the ground and attempts to carry her over his shoulder, but she kicks and writhes so strongly that the man falls to the ground, whereupon one of the other kidnappers is seen beating her. \"I kept resisting until they eventually tied me up by my arms and legs and dragged me on the floor. It took them over an hour to take me to the border. I was beaten up really badly. My entire face and body were bruised and swollen,\" she said. Soussana said that while in Gaza she was moved from location to location, always under guard by heavily armed men from Hamas, given little to eat, supervised even when using the bathroom and subjected to physical and psychological violence. \nOne of the places where she was held was a dark, damp tunnel 40 metres underground where it was hard to breathe. Being there felt like being buried alive, she said. \"When you're in Hamas captivity, everything is just so fragile. You're constantly on the edge. Things can go drastically wrong every second. You're not allowed to speak, not allowed to cry, not even allowed to comfort each other when times get really bad,\" she said."
}