{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "Somalia says it's working to rescue hostages from UN helicopter",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 11, 2024 04:29AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/somalia-says-its-working-to-rescue-hostages-from-un-helicopter-3272055",
  "paragraph": "By Abdi Sheikh MOGADISHU (Reuters) - Somalia's government is working to rescue the passengers of a U.N. helicopter that was captured by al Shabaab militants, a spokesperson said on Thursday, but military officers said it would be difficult to access the area where they were taken. The U.N.-contracted helicopter was conducting an air medical evacuation when a technical problem forced it to make an emergency landing near Hindhere village in central Somalia, an area controlled by the militants. Two Somali men and several foreigners were on board, and many were taken hostage by the militants, two officers told Reuters. It was not clear exactly how many were captured and whether any managed to escape.  \"The government has been undertaking efforts to rescue the crew since yesterday when the accident happened, and efforts still go on,\" Information Minister Daud Aweis told Reuters. He did not provide any other details.  Colonel Abdullahi Isse, who is based in the town of Adado, about 100 km (60 miles) north of Hindhere, told Reuters that troops in the area had no plans to launch a rescue mission. \"No forces have gone to rescue them. I don't believe they will escape,\" he said. \"The area has been controlled by al Shabaab for over ten years. And even the residents there are pro-al Shabaab.\"  Major Hassan Ali, who is based in the city of Beledweyne, from where the helicopter took off, said a land-based operation was not feasible.  \"I do not know if there will be commandos on planes with the help of foreigners. That may be the only possible way to rescue them, but so far it has not happened,\" he told Reuters.  The United Nations said in a brief statement on Wednesday that \"response efforts\" were underway. A spokesperson for the U.N. mission in Somalia was not available for comment on Thursday.  Al Shabaab, an affiliate of al Qaeda, has been waging an insurgency against the Somali government since 2006 in a bid to establish its own rule based on a strict interpretation of Islam. It has thousands of fighters, most in its strongholds in the centre and south of the country. A government offensive since 2022 has managed to recapture some territory in central Somalia, but the campaign suffered significant setbacks last year.  Late on Wednesday, the U.N. World Food Programme, the largest humanitarian operator in Somalia, said the helicopter did not belong to it or the U.N. Humanitarian Air Service and that none of its personnel were on board. It said in a post on social media site X that all WFP flights in the area had been temporarily suspended as a precaution."
}