{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "Exclusive-US, Iraq to initiate talks on end of US-led military coalition",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 24, 2024 03:17PM ET",
    "Updated Jan 24, 2024 04:26PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-iraq-to-initiate-talks-on-end-of-usled-military-coalition-3282117",
  "paragraph": "By Timour Azhari and Phil Stewart BAGHDAD (Reuters) -The United States and Iraq are set to initiate talks on the end of a U.S.-led international military coalition in Iraq and how to replace it with bilateral relations, four sources said, a step forward in a process that was stalled by the Gaza war.  The U.S. conveyed the message in a letter handed over by U.S. Ambassador to Iraq Alina Romanowski to Iraqi Foreign Minister Fuad Hussein on Wednesday, three sources said.     In doing so, the U.S. had dropped preconditions that attacks against it by Iran-backed Iraqi militant groups in Iraq first stop, three sources said.  Iraq's foreign ministry said that an \"important\" letter had been handed over and the prime minister would study it carefully, without elaborating.  The talks are expected to take several months, if not longer, with the outcome unclear and no U.S. troop withdrawal imminent.  The United States has 2,500 troops in Iraq, advising and assisting local forces to prevent a resurgence of Islamic State, which in 2014 seized large parts of Iraq and Syria before being defeated. Hundreds of troops from other mostly European countries are also in Iraq as part of the U.S.-led coalition that was set up to fight Islamic State.  That mission's presence in Iraq has come under increasing pressure. Iraq, a rare ally of both Tehran and Washington, has witnessed escalating tit-for-tat attacks between militias and U.S. forces since the Gaza war began, with the militias seeking to pressure the U.S. over its support for Israel.  U.S. troops in Iraq and Syria have been attacked about 150 times by Iran-aligned militants based in Iraq, and the U.S. has conducted a series of retaliatory strikes, the latest on Tuesday. The escalating violence has led Iraqi Prime Minister Mohammed Shia al-Sudani to call for the quick exit of U.S.-led coalition forces via negotiations, a process that was beginning to be initiated last year but stalled when the Gaza war began.  Washington had been unwilling to negotiate a potential withdrawal while under fire, concerned it would make any change to the mission seem coerced, thereby emboldening regional rivals, including Iran.  But the calculus changed amid a realization that the attacks would likely not stop and that the status quo was leading to steady escalation, two of the sources said.  \"The U.S. and Iraq are close to agreement on starting the Higher Military Commission dialogue that was announced back in August,\" a U.S. official said. They said the commission would allow for joint evaluation of the Iraqi security forces' capacity to fight Islamic State and \"shape the nature of the bilateral security relationship.\" \"We have been discussing this for months. The timing is not related to recent attacks. The U.S. will maintain full right of self-defense during the talks,\" the official said.  \nThe attacks have been led by powerful hardline Iraqi militias with close links to Iran, most of which do not have representation in parliament or government but still influence decision-making. Iraqi and U.S. officials hope that formally initiating the talks could have the effect of lowering political pressure on Sudani's government and potentially decrease attacks on U.S. forces."
}