{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0M0D8_L.jpg",
  "title": "Michigan mom wants school-shooter son to testify in her defense",
  "category": "General",
  "publisher": "Reuters",
  "date": [
    "Published Jan 23, 2024 06:19AM ET",
    "Updated Jan 23, 2024 06:56PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/general/mother-of-boy-who-murdered-four-classmates-faces-manslaughter-trial-3280452",
  "paragraph": "© Reuters. Jennifer Crumbley, parent of accused Oxford High School gunman Ethan Crumbley, listens during a court procedural hearing in Rochester Hills, Michigan, U.S., February 24, 2022. REUTERS/Rebecca Cook/File Photo\nBy Brad Brooks (Reuters) -A Michigan woman facing manslaughter charges for a school shooting carried out by her son wants him to testify in her defense, according to court documents filed Tuesday.  That came as jury selection began in the trial that legal experts say is unprecedented, and that gun safety advocates hope prompts more parents to be held to account for their roles in school shootings. Ethan Crumbley, who was 15 at the time of the 2021 shooting at Oxford High School, pleaded guilty in 2022 to two dozen counts, including four of first-degree murder, and last month was sentenced to life in prison without parole. He carried out the shooting with a gun his parents bought him as a Christmas present. In documents filed with the court in Pontiac, Michigan, Shannon Smith, the defense attorney for Jennifer Crumbley, 45, asked the Sixth Judicial Circuit Court Judge Cheryl Matthews to force Ethan Crumbley to testify in his mother's trial. Smith also asked the judge to order psychiatrists who have treated Ethan Crumbley to testify.  Attorneys from the State Appellate Defender Office, who are representing Ethan Crumbley as he appeals his life sentence, are fighting any order that would compel him or psychiatrists who have treated him to testify in the trial of his mother or father. \"We will advise Ethan to invoke his right to remain silent,\" Ethan Crumbley's attorneys, Jacqueline Ouvry and Alison Swain, wrote in a Tuesday filing. Jury selection began on Tuesday, with lawyers working to seat 12 jurors and five alternates from a pool of at least 300.  Jennifer Crumbley and her husband James Crumbley, 47, are being tried separately after being charged with four manslaughter counts in late 2021. They have remained in jail since. James Crumbley's trial opens on March 5.  When the charges were announced, prosecutors said the Crumbleys' failure to both secure the gun in their home and to respond to warnings that their son, Ethan, was violent and disturbed, justified the charges they face. Defense attorneys have said in court documents that the Crumbleys had no way of knowing their son was going to carry out the shooting. Legal experts have said the parents' trials break new legal ground.  Josh Horwitz, co-director of the Johns Hopkins Center for Gun Violence Solutions, said school shooter's parents are often not held to account because of feelings that \"they've been through enough\" or because of lax enforcement of such measures as safe storage laws.  Holding more parents responsible when appropriate is an important step, Horwitz said, given that studies by the U.S. Department of Homeland Security have shown that around 75% of all school shooters obtained their weapons in the home.  \"Rarely are high school shooters going out and buying guns from a gun store,\" Horwitz said. \"The broader lesson from this case is that every parent who is a gun owner has a role to play, and that's the secure and safe storage of firearms.\"  PREVENTABLE TRAGEDY  Four days before the Nov. 30, 2021, shooting, Ethan Crumbley accompanied his father to a gun shop, where James Crumbley bought a 9mm handgun, prosecutors said. Ethan posted photos of the gun on social media, writing, \"Just got my new beauty today\" and adding a heart emoji. The next day his mother posted that the two of them were at a gun range \"testing out his new Christmas present,\" Oakland County Prosecutor Karen McDonald said when she announced charges against the parents. The day before the shooting at the school about 25 miles (40 km) north of Detroit, a teacher found Ethan Crumbley using his smart phone to search for ammunition and alerted school officials. The officials left messages for his mother that went unreturned. His mother later texted him, \"LOL, I'm not mad at you. You have to learn not to get caught.\" On the morning of the shooting, a teacher discovered drawings by Ethan Crumbley that depicted a handgun, a bullet, and a bleeding figure next to the words \"Blood everywhere,\" \"My life is useless,\" and \"The thoughts won't stop - help me.\" The Crumbleys were called to the school on the morning of the shooting, and told that Ethan urgently needed counseling and that they needed to take him home, prosecutors have said. The parents resisted the idea of taking their son home and did not search his backpack nor ask him about the gun. \nEthan Crumbley was returned to class and later walked out of a bathroom with the gun and began firing, prosecutors say. \"This tragedy could have been prevented if the shooter's parents hadn't played a central role in acquiring the gun for the shooter, or if his parents had taken basic steps to securely store the gun,\" said Nick Suplina, senior vice president of Law and Policy at the anti-gun violence nonprofit Everytown for Gun Safety. \"They should be held accountable.\""
}