{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0R08Y_L.jpg",
  "title": "Israeli ministers join ultranationalist conference urging Gaza resettlement",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 28, 2024 03:12PM ET",
    "Updated Jan 29, 2024 08:51AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/israeli-settlers-hold-conference-on-resettlement-in-gaza-3285374",
  "paragraph": "6/6\n© Reuters. Members of the Israeli settler community gather at a convention calling for Israel to rebuild settlements in the Gaza Strip and the northern part of the Israeli-occupied West Bank, in Jerusalem, January 28, 2024. REUTERS/Ronen Zvulun \n2/6\nJERUSALEM (Reuters) - Israel's hard-right Security Minister Itamar Ben-Gvir urged Jewish settlers to return to Gaza at a packed gathering on Sunday, drawing condemnation from Palestinians who said his words amounted to a call for their forced deportation. The statement from the firebrand Ben-Gvir clashed with the official government position iterated by Prime Minister Benjamin Netanyahu that Israel does not intend to return a permanent presence to Gaza once the war with Hamas is over. The Palestinian Authority quickly said such calls incited the forced displacement of Palestinians and threatened the security and stability of the region. The comments were also condemned on Monday by both Hamas and by Israeli opposition figures.  Ben-Gvir, who leads one of the small nationalist parties in Netanyahu's right-wing coalition, told a conference that a return of Jewish settlers and the military was the only way to ensure there was no repeat of the devastating attack on Israel by Hamas fighters on Oct. 7. \"We yelled and we warned,\" Ben-Gvir told the event organised by settler groups that was attended by hundreds of people and as many as a dozen government ministers, according to Israel's Channel 12 television. \"If we don't want another Oct. 7, we need to return home and control the land.\" He said there was a need to \"encourage emigration\" by Gazans. Israel, which withdrew its military and settlers from Gaza in 2005 after a 38-year occupation, has launched fierce air strikes and a land incursion into the enclave in retaliation after the attack by Hamas. Sunday's meeting underlined the high tension around the issue of Jewish settlements, which has been at the heart of the conflict between Israel and the Palestinians for decades. Attendees chanted their support for rebuilding Jewish settlements in Gaza and the northern part of the occupied West Bank. Finance minister Bezalel Smotrich, another hard-right member of Netanyahu's coalition, said many of the children who were evacuated from settlements in Gaza had returned as soldiers to fight in the war with Hamas. He said he opposed the government's decision to evacuate Jewish settlements from Gaza in the past. \"We knew what that would bring and we tried to prevent it,\" Smotrich said in a speech. \"Without settlements there is no security.\" Israel has said its aim is to destroy Hamas and bring home more than 130 hostages still held in Gaza, but says it does not intend to keep permanent presence in the enclave even though it wants security control once the war ends. The United States, Israel's closest ally, has said that Gaza must be continue to be run by Palestinians after the war and that there must be serious moves towards establishing a Palestinian state. Gaza, the West Bank and East Jerusalem, which Palestinians want as the capital of a future independent state, were captured by Israel in the 1967 Middle East war. Most countries consider Jewish settlements built there to be illegal. Israel disputes this, citing the Jewish people's historical and biblical ties to the land. Benny Gantz, a centrist member of the war cabinet, said on Monday the attendance by government and coalition members hurt Israel's standing abroad and would compromise efforts to bring about a hostage release. Opposition chair and former Israeli prime minister Yair Lapid called the convention delusional and dangerous in a televised statement in the Knesset. The Palestinian Foreign Ministry denounced Sunday's event, which followed hearings at the International Court of Justice of South African allegations - denied by Israel - that public statements on Gaza by some rightist Israeli officials amounted to genocide. \n\"The colonial meeting in Jerusalem poses a blatant challenge to the International Court of Justice decision, accompanied by public incitement to forcibly displace Palestinians,\" it said on X on Monday. Hamas said the meeting \"revealed the intentions to implement the crimes of displacement and ethnic cleansing against our Palestinian people\"."
}