{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "Missile attacks across Middle East raise Gaza escalation risks",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 20, 2024 03:41AM ET",
    "Updated Jan 21, 2024 12:31AM ET"
  ],
  "comments": [
    8,
    [
      [
        "Ken Roth",
        "2024-01-21 11:26:08",
        "We can only hope that Iran enters the war directly so we can k…ill the mullahs",
        "https://www.investing.com/members/213081368"
      ],
      [
        "First Last",
        "2024-01-21 18:01:47",
        "Iran did directly missile strike Iraq, Syria and Pakistan; and Iran did directly committed piracy against US ships.",
        "https://www.investing.com/members/200601457"
      ],
      [
        "First Last",
        "2024-01-21 18:02:46",
        "And directly struck US forces in Iraq in Jan 2020.",
        "https://www.investing.com/members/200601457"
      ],
      [
        "Ken Roth",
        "2024-01-21 11:24:54",
        "We can only hope that Iran enters the war directly so we can hunt down the mullahs who are behind the usefull idiot Hamas, Houthis and Hizbollah",
        "https://www.investing.com/members/213081368"
      ],
      [
        "昱旻 何",
        "2024-01-21 01:59:45",
        "Biden,should take this serious and send the troops, otherwise the war will not in Ukraiane, Middle East and eleven in Taiwan , Korean soon , then US will be in deep serious trouble ",
        "https://www.investing.com/members/212723984"
      ],
      [
        "Sien Hii",
        "2024-01-21 06:33:48",
        "US wants the wars only able to save the dollars",
        "https://www.investing.com/members/203187810"
      ],
      [
        "Mart Mala",
        "2024-01-21 13:03:41",
        "you say it as if the US will send robots. Netanyahu s arrogance putting US soldiers and citizens in harms way. It's time the US tames Netanyahu. ",
        "https://www.investing.com/members/227981860"
      ],
      [
        "Barry Nickerson",
        "2024-01-20 23:39:24",
        "In this case we are using OUR ammunition and equipment to defend OUR men, and OUT ships.\nBlast 'em!",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Barry Nickerson",
        "2024-01-20 23:52:55",
        "Dang T jumped in front of my letter R!   OUR! OUR! OUR!\nThis makes me a hypocrite because I do favor a foreign war -when it comes to defending the U.S.A 's military personnel, citizens, and our own ships.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Tom Saltzman",
        "2024-01-20 22:53:23",
        "Remember when the looney left claimed Trump would get us into World War 3 🤣🤣🤣🤣",
        "https://www.investing.com/members/200520915"
      ],
      [
        "First Last",
        "2024-01-21 02:38:42",
        "Empire Destroyer",
        "https://www.investing.com/members/200601457"
      ],
      [
        "Tom Saltzman",
        "2024-01-21 03:55:07",
        "First Last",
        "https://www.investing.com/members/200520915"
      ],
      [
        "Mark Jannetty",
        "2024-01-21 12:08:55",
        " instead Biden sank the economy with high inflation ",
        "https://www.investing.com/members/241633026"
      ],
      [
        "First Last",
        "2024-01-21 17:49:13",
        "Mark Jannetty",
        "https://www.investing.com/members/200601457"
      ],
      [
        "First Last",
        "2024-01-21 17:51:47",
        "Tom Saltzman",
        "https://www.investing.com/members/200601457"
      ],
      [
        "Mark Jannetty",
        "2024-01-20 17:40:41",
        "only if we still had a leader in the white house that could have helped prevent all these global conflicts. I guess war must be better than mean tweets in a Democrats mind",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Ac Tektrader",
        "2024-01-20 22:03:06",
        "then again he may not be an American.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "First Last",
        "2024-01-21 02:34:05",
        "US never had such a leader.  No nation ever had.",
        "https://www.investing.com/members/200601457"
      ],
      [
        "First Last",
        "2024-01-21 02:42:51",
        "At least Biden isn't praising tyrants and calling them good friends like Trump the simp.",
        "https://www.investing.com/members/200601457"
      ],
      [
        "Eugene Debs",
        "2024-01-21 02:46:57",
        "The United States was still at war in Afghanistan when Trump left office. Submitting to Putins assertions and bending to his will  was not a show of strength neither was abandoning Kurdish allies and appeasing Kim Jung Un .",
        "https://www.investing.com/members/211458609"
      ],
      [
        "First Last",
        "2024-01-21 17:54:57",
        "Eugene Debs",
        "https://www.investing.com/members/200601457"
      ],
      [
        "John Hill",
        "2024-01-20 15:19:10",
        "Israel has the right idea. War is hell and they show it as they should. Biden is weak in every way.",
        "https://www.investing.com/members/200125192"
      ],
      [
        "First Last",
        "2024-01-21 02:32:35",
        "Trump didn't hit back at Iran after Iran struck US forces in Iragi bases in Jan 2020.",
        "https://www.investing.com/members/200601457"
      ],
      [
        "John Avenetti",
        "2024-01-20 17:24:01",
        "you're sick in the head. Israel is the scourge of the world. baby murdering animals",
        "https://www.investing.com/members/225003989"
      ],
      [
        "Charles Manson",
        "2024-01-20 14:45:10",
        "Good.",
        "https://www.investing.com/members/249519852"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/israeli-strike-on-damascus-kills-iranian-guards-official-source-in-regional-prosyria-alliance-3278798",
  "paragraph": "By Phil Stewart and Timour Azhari WASHINGTON/BAGHDAD (Reuters) -Missile attacks in Syria, Lebanon, Iraq and Yemen on Saturday threw into sharp focus the increasing risk of the war in Gaza triggering a wider regional conflict pitting Iran and its allies against Israel and the United States.  Iran said five of its Revolutionary Guards were killed in a missile strike on a house in Damascus which it blamed on Israel, and security sources in Lebanon said an Israeli strike there killed a member of Iran-backed Hezbollah.  Later on Saturday, missiles and rockets launched by Iran-backed militants in Iraq, where such groups have targeted U.S. forces, hit al-Asad air base, the U.S. Central Command said. A number of U.S. personnel were being evaluated for traumatic brain injuries and one Iraqi service member was wounded, it said. The United States also said it had targeted a missile the Iran-backed Houthi group in Yemen was aiming into the Red Sea, which it called a threat to shipping.  The conflict in Gaza began on Oct. 7 when Hamas fighters stormed border defences to attack Israeli bases and towns, killing more than 1,200 people and seizing more than 200 hostages. Israel pounded targets across the Gaza Strip on Saturday while its planes dropped leaflets on the southern area of Rafah urging Palestinians seeking refuge there to help locate hostages held by Hamas, residents said. Hamas is part of Iran's \"Axis of Resistance\", a regional alliance that also includes Lebanon's Hezbollah, the Syrian government of President Bashar al-Assad, Shi'ite militia groups in Iraq and the Houthis who control much of Yemen. Amid increased regional tensions, Iran's President Ebrahim Raisi vowed to punish Israel for its strike in Syria, calling it \"crimes\" that would not go unanswered, according to a statement on Iran state broadcaster IRIB. Three of the Revolutionary Guards officers killed the Israeli strike were described in Iranian state media with an honorific used only for generals, suggesting the targets were senior commanders. There was no comment from Israel, which typically does not discuss such attacks publicly. Israel's intense bombardment of Gaza since Oct. 7, which health authorities in the Hamas-run enclave say has killed nearly 25,000 Palestinians, quickly triggered border clashes between Israel and Lebanon's Hezbollah.  ATTACK AND COUNTERATTACK Over the past three months Israel has also repeatedly struck at Iranian targets in Syria, while Iranian-backed groups in Syria and Iraq have fired at U.S. targets in those countries.  Aside from Gaza, the theatre of conflict with the widest international repercussions has been the Red Sea, where the Houthis have repeatedly targeted shipping they say is bound for or linked to Israel. Some companies are avoiding the key waterway, dealing a blow to global trade.  U.S. and British strikes over the past week have targeted Houthis forces in Yemen. Saudi Arabia's foreign minister expressed concern that tensions in the Red Sea over Houthi strikes and U.S. counterattacks could spiral out of control in the Middle East. \"I mean, of course, we are very worried,\" Prince Faisal bin Farhan told CNN 'Fareed Zakaria GPS' in an interview that will be aired on Sunday. \"We are in a very difficult and dangerous time in the region, and that's why we are calling for de-escalation.\" Regional and Iranian sources say Iran and Hezbollah have personnel in Yemen helping direct attacks on shipping, though the Houthis have denied that. In Gaza on Saturday, Palestinian fighters battled tanks trying to push back into the eastern suburbs of the Jabalia area in the northern strip, where Israel had started pulling out troops and shifting to smaller-scale operations, residents and militants said. \nThe Israeli military said aircraft struck militant squads trying to plant explosives near troops and fire missiles at tanks in northern Gaza and said it was striking targets throughout Gaza. Also on Saturday, the Israeli military said that at the end of a kilometer-long, booby-trapped tunnel in Gaza, soldiers discovered cramped cells where Hamas kept about 20 hostages. No hostages were there when it was found."
}