{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0M0AT_L.jpg",
  "title": "Turkey approves Sweden's NATO membership bid after 20-month delay",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 23, 2024 05:04AM ET",
    "Updated Jan 23, 2024 07:46PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Brad Albright",
        "2024-01-23 14:11:06",
        "Another Putin foreign policy blunder.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Tre Hsi",
        "2024-01-23 15:55:01",
        "Vlad invaded Ukraine to prevent NATO expansion, and guiess what, NATO expanded by adding Sweden and Finland, I guess that \"special military operation\" didn't go as well as he hoped......",
        "https://www.investing.com/members/203741693"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/turkey-set-to-approve-swedens-nato-membership-bid-after-long-delay-3280355",
  "paragraph": "© Reuters. FILE PHOTO: Turkish President Tayyip Erdogan, Swedish Prime Minister Ulf Kristersson and NATO Secretary-General Jens Stoltenberg gather prior to their meeting, on the eve of a NATO summit, in Vilnius, Lithuania July 10, 2023. Henrik Montgomery /TT News Ag\nBy Huseyin Hayatsever and Tuvan Gumrukcu ANKARA (Reuters) -Turkey's parliament ratified Sweden's NATO membership bid on Tuesday, clearing the biggest remaining hurdle to expanding the Western military alliance after 20 months of delay. Turkey's general assembly, where President Tayyip Erdogan's ruling alliance holds a majority, voted 287-55 to approve the application that Sweden first made in 2022 to bolster its security in response to Russia's full-scale invasion of Ukraine.  All NATO members need to approve applications from countries seeking to join the alliance. When Sweden and Finland asked to join in 2022, Turkey raised objections over what it said was the two countries' protection of groups it deems terrorists.  It endorsed Finland's membership in April last year but, along with Hungary, had kept Sweden waiting. \"We support NATO enlargement to improve the alliance's deterrence efforts... We hope Finland and Sweden's attitude towards fighting terrorism sets an example for our other allies,\" Fuat Oktay, head of parliament's foreign affairs commission and a ruling AK Party member, said during debate. \"I greatly appreciate the Turkish Parliament's decision to approve Sweden's entry into NATO today,\" U.S. Ambassador Jeff Flake said in a written statement on Tuesday. He said Turkey's \"commitment to the NATO Alliance clearly demonstrates our enduring partnership.\"  Swedish Foreign Minister Tobias Billstrom also welcomed the Turkish parliament's approval. \"We now look forward to President Erdogan signing the ratification document,\" Billstrom said in a written statement.  Erdogan is expected to sign the legislation within days, leaving Hungary - whose Prime Minister Viktor Orban has friendly relations with Russian President Vladimir Putin - as the only member state not to have approved Sweden's accession.  Orban said earlier on Tuesday he had invited his Swedish counterpart to visit and negotiate his country joining the bloc. Hungary's parliament is in recess until around mid-February.  NATO Secretary General Jens Stoltenberg welcomed the Turkish move and said: \"I also count on Hungary to complete its national ratification as soon as possible.\" Turkey and Hungary maintain better relations with Russia than other members of the U.S.-led North Atlantic Treaty Organization.  While opposing Russia's invasion of Ukraine, Turkey has criticised Western sanctions on Moscow. For its part, Russia has cautioned that it would respond if NATO bolstered military infrastructure in the two Nordic states.  Sweden, whose membership bid marked a historic shift away from a non-aligned security policy, would enhance NATO defences in the Baltic Sea region facing Russia.  DEMANDS AND CONCESSIONS  Turkey's delays had frustrated some of its Western allies and enabled it to extract some concessions.  Ankara had urged Stockholm to toughen its stance on local members of the Kurdistan Workers' Party (PKK), which the European Union and United States also deem a terrorist group.  In response, Stockholm introduced a new anti-terrorism bill that makes being a member of a terrorist organisation illegal. Sweden, Finland, Canada and the Netherlands also took steps to relax policies on arms exports to Turkey.  In parliament, Oktay said Erdogan's AK Party endorsed Sweden's NATO bid after its positive steps fighting terrorism.  The AKP's nationalist allies MHP and the main opposition CHP also endorsed Sweden's bid. Opposition nationalist, Islamist and leftist parties rejected it, while four MPs abstained.  \nErdogan, who had sent Sweden's bid to parliament in October, linked the ratification to U.S. approval of sales of F-16 fighter jets to Turkey.  The White House backs the sale and some analysts expect a deal to swiftly follow Turkey's approval of Sweden's bid. But there is no clear time frame for the U.S. Congress to approve the deal."
}