{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK101DI_L.jpg",
  "title": "Donald Trump's lawsuit over 'Steele dossier' thrown out by UK court",
  "category": "General",
  "publisher": "Reuters",
  "date": [
    "Published Feb 01, 2024 05:24AM ET",
    "Updated Feb 01, 2024 12:01PM ET"
  ],
  "comments": [
    6,
    [
      [
        "TheLast LoserDon",
        "2024-02-02 20:51:05",
        "well done GB",
        "https://www.investing.com/members/206134504"
      ],
      [
        "Ken Roth",
        "2024-02-01 22:06:02",
        "We all know Trump works for Putin which is why he wont help our ally ukraine, because Putin has a video of Trump receiving a golden shower in russia so trump will forever help putin any way he can to make sure this video is never published.",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Ken Roth",
        "2024-02-01 22:03:21",
        "The whole world knows that putin has a video of Trump receiving a golden shower from russian prostitutes while trump was in russia during a model competition, which is why Trump works for Putin and will not help our ally Ukraine. But it will make no difference when Trump is in jail for his crimes.",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Benjamin USA",
        "2024-02-01 18:34:15",
        "Oh no! Anyways",
        "https://www.investing.com/members/200821892"
      ],
      [
        "Warren Wesley",
        "2024-02-01 18:03:53",
        "judge appears to be in error. lies should be allowed to be published, and if so the lies must be punished. ",
        "https://www.investing.com/members/210986750"
      ],
      [
        "Brad Albright",
        "2024-02-01 14:26:52",
        "So much winning!",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Tre Hsi",
        "2024-02-01 16:14:28",
        "Loser streak is now extended internationally.....",
        "https://www.investing.com/members/203741693"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/general/donald-trumps-lawsuit-over-steele-dossier-thrown-out-by-uk-court-3289525",
  "paragraph": "© Reuters. U.S. President Donald Trump leaves Downing Street after attending a reception hosted by Britian's Prime Minister Boris Johnson, ahead of the NATO summit in Watford, in London, Britain, December 3, 2019. Alastair Grant/Pool via REUTERS/File Photo\nLONDON (Reuters) -London's High Court on Thursday threw out Donald Trump's lawsuit against a British private investigations firm over the \"Steele dossier\" which alleged ties between Trump's election campaign and Russia. Trump, the frontrunner for the 2024 Republican presidential nomination, had brought a data protection lawsuit against Orbis Business Intelligence about claims in a dossier written by its co-founder, former British intelligence officer Christopher Steele. Judge Karen Steyn ruled that the former U.S. president's case could not continue, saying in a written ruling that \"there are no compelling reasons to allow the claim to proceed\". Trump said in a witness statement made public in October that he brought the case to prove claims in the so-called Steele dossier, published by the BuzzFeed website in 2017, that he engaged in \"perverted sexual acts\" in Russia, were false. Many of the allegations were never substantiated and lawyers for Trump, 77, said that the report was \"egregiously inaccurate\" and contained \"numerous false, phoney or made-up allegations\". Steyn noted that Trump said the allegations were untrue, adding: \"I have not considered, or made any determination, as to the accuracy or inaccuracy of the (allegations).\" Orbis argued that Trump brought the claim simply to address his \"longstanding grievances\" against the company and Steele. Steyn said in her ruling that she did not need to decide that because Trump had \"no reasonable grounds for bringing a claim for compensation or damages\". The London lawsuit is one of many legal cases involving Trump, who faces four separate criminal prosecutions in the United States. \nTrump campaign spokesman Steven Cheung said in a statement: \"President Trump will continue to fight for the truth and against falsehoods such as ones promulgated by Steele and his cohorts.\" Orbis did not respond to a request for comment."
}