{
  "image": "https://i-invdn-com.investing.com/news/news_pile_69x52._800x533_L_1419494209.jpg",
  "title": "US Navy declares two SEALs missing in Gulf of Aden as deceased",
  "category": "General",
  "publisher": "Reuters",
  "date": [
    "Published Jan 21, 2024 06:15PM ET",
    "Updated Jan 21, 2024 09:15PM ET"
  ],
  "comments": [
    1,
    [
      [
        "haitharu Ss",
        "2024-01-22 00:10:37",
        "imagine your dad/brother went missing boarding an iranian ship thousands of miles away for reasons unknown",
        "https://www.investing.com/members/233405603"
      ],
      [
        "Brad Albright",
        "2024-01-22 14:02:11",
        "Imagine some punk maligning their sacrifice with willful ignorance.",
        "https://www.investing.com/members/236251128"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/general/two-missing-us-navy-seals-have-not-been-found-status-changed-to-deceased-3279039",
  "paragraph": "By Dan Whitcomb (Reuters) - Two U.S. Navy SEALs who went missing in the Gulf of Aden earlier this month during a raid on a boat carrying Iranian weapons have not been located following an exhaustive search and their status has been changed to deceased, military officials said on Sunday.  The SEALs were reported missing after boarding the vessel in a Jan. 11 operation near the coast of Somali, the U.S. Central Command said on X. “We mourn the loss of our two Naval Special Warfare warriors, and we will forever honor their sacrifice and example. Our prayers are with the SEALs’ families, friends, the U.S. Navy, and the entire Special Operations community during this time,” CENTCOM Commander General Michael Erik Kurilla said in a statement. A joint operation carried out by the United States, Spain and Japan searched more than 21,000 square miles of ocean for the missing SEALs, CENTCOM said in the statement.  That mission had now become a recovery operation, CENTCOM said. The U.S. has carried out a string of strikes against Houthi targets in response to Houthi attacks on merchant ships in the Red Sea that have disrupted global trade and raised fears of supply bottlenecks.  U.S. Central Command forces on Saturday struck a Houthi anti-ship missile that was aimed into the Gulf of Aden and prepared to launch, the U.S. military said. The Houthis, who control the most populous parts of Yemen, have claimed their attacks on commercial ships are aimed at supporting the Palestinians in Israel's war in Gaza.  The Houthi movement has vowed to keep up attacks despite the strikes last week against radar and missile capabilities.  (This story has been corrected to clarify that the boat was in Gulf of Aden in headline, not an Iranian ship, and to say it was carrying Iranian weapons in paragraph 1)"
}