{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0A0TT_L.jpg",
  "title": "Families of Ecuador hostages demand action as Noboa details plans for new prisons",
  "category": "World news",
  "publisher": "Investing.com",
  "date": [
    "Published Jan 11, 2024 12:35PM ET",
    "Updated Jan 11, 2024 07:17PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/ecuador-security-forces-conduct-raids-as-prison-guards-remain-hostage-3272756",
  "paragraph": "2/2\n© Reuters. Soldiers keep watch outside the Zonal 8 prison after Ecuador's President Daniel Noboa declared a 60-day state of emergency following the disappearance of Adolfo Macias, leader of the Los Choneros criminal gang, from the prison where he was serving a 34-ye\n2/2\nBy Alexandra Valencia and Tito Correa QUITO/LATACUNGA, Ecuador (Reuters) - Ecuadorean President Daniel Noboa laid out plans for two new high-security prisons on Thursday, part of his pledge to wage war on drug gangs, as the families of nearly 180 prison staff being held hostage by inmates demanded action to rescue them. A dramatic spike in violence this week - including the on-air storming of a TV station, unexplained explosions in multiple cities, and the kidnapping of police officers - appears to be a response by gangs to Noboa's plans to tackle the country's dire security situation, including with the new jails. Since Monday, 158 prison guards and 20 administrative staff have been taken hostage in at least seven prisons. But there has been little information released on the status of the hostages by authorities. The guards' families and union criticized the government's response on Thursday. \"Tonight it will be five nights where we don't know anything about our husbands, sons, daughters,\" said the wife of a guard at a prison in the city of Latacunga, among a group of relatives gathered outside the jail. \"The authorities don't give any solution, they don't say anything.\" \"We are waiting for them with open arms,\" said the woman, who asked not to be named for security reasons, through tears. \"The government must do something.\" Prisons agency SNAI said in a statement on Thursday that operations to liberate the hostages were ongoing. Carlos Ordonez, vice president of the prison workers' association, called the situation \"very worrying.\" \"We still don't know what the conditions are on the inside,\" he said. \"No one goes in, no one comes out; we don't have exact information.\" Ordonez said the military had taken over management of the sites where there are hostages. Videos purporting to show prison staff being subjected to extreme violence, including shooting and hanging, have circulated on social media, although armed forces commander Rear Admiral Jaime Vela said on Wednesday no hostage had been killed. Reuters could not immediately verify the videos. Noboa told a radio station on Thursday that some videos had been altered. \"For now we understand and hope that it's not our colleagues in the videos... We think they are all still alive,\" said Ordonez, adding that his group had filed a habeas corpus petition to try and pressure the government to do more. NEW JAILS Noboa's government blames the deteriorating security situation on an increase in drug trafficking through Ecuador, which borders cocaine-producing Colombia and Peru and has become a major drug shipment point.  The president, with congressional backing, has declared a 60-day state of emergency, sending the military onto the streets and naming 22 gangs as terrorist groups.     He has pledged to hold jailed gang leaders in the new prisons. The facilities will have space for 736 prisoners, divided between high security, maximum security and super-maximum security, Noboa's office said in statement on Thursday. The construction of the facilities \"is the start of an urgent healing of the penitentiary system,\" Noboa said in a video, adding that tougher laws, honest judges and the ability to extradite criminals wanted abroad were also necessary. \"The unrest in prisons and on the street is a clear demonstration of the fear that criminals feel in the face of the security policies that we are implementing,\" he said. \"We will not allow groups of terrorists to hold back this country.\" The facilities will block cellular and satellite signals, generate their own electricity, treat their own water, and employ guards whose faces will be covered for anonymity, the government said. Currently, Ecuador has only about 2,600 prison guards nationally to manage 32,000 prisoners, not including youth detention centers. \"We are working with more than 38 nations who will give us international assistance,\" Noboa told radio station FM Mundo. \"We need military support in terms of manpower, of soldiers, also assistance in intelligence, armament and equipment.\" Noboa has previously said Israeli experts were being consulted about the prisons and on Wednesday said U.S. aid was expected within days. U.S. State Department spokesperson Vedant Patel reiterated in a Thursday briefing that the United States was ready to provide assistance, but declined to give specifics. ACTIVE OPERATIONS Noboa has said he will not negotiate with the gangs, declaring them \"terrorists\" who the country was \"at war\" with. A video circulating on social media on Thursday apparently shows Fabricio Colon Pico - an alleged gang member who is suspected of a plot against the attorney general and who escaped from a penitentiary on Tuesday - asking to surrender if his life would be protected. In response, Noboa said terrorists should be treated like terrorists. Reuters could not immediately verify the authenticity of the video. Meanwhile, the military conducted raids and weapon seizures around the country. Vela said on Wednesday that 329 people, mostly from gangs including Los Choneros, Los Lobos and Los Tiguerones, had been detained since the president declared a state of emergency on Monday. The attorney general's office said its officials were working double shifts to process those arrested. Police in Quito conducted a controlled detonation of an explosive near a road bridge on Thursday, and further arrests for alleged terrorism and drug crimes took place around the country.  Police officers have also been the target of kidnappings. Police had reported nine being held earlier this week, but it was unclear how many were still captive as of Thursday. Oil and mining production have so far been unaffected by the unrest, the government has said, while export routes for products like bananas and cacao are being protected. But streets in Quito and Guayaquil remained quieter than usual on Thursday, with school classes taking place virtually and many people working from home. Images of gunmen taking over a TV studio at public broadcaster TC on Tuesday afternoon were carried live for about 20 minutes and made headlines around the world. \nAlina Manrique, a 39-year-old journalist who was among those held hostage, said she had feared she was going to be killed and imagined never seeing her children again. \"(The gunmens') intention is clear to me - for all the world to see that they were capable of doing this at two in the afternoon, of assaulting a TV channel and putting 50 journalists, a city, a country on their knees,\" Manrique said."
}