{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0N04K_L.jpg",
  "title": "Former Taiwan ally Nauru re-establishes diplomatic ties with China",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 24, 2024 02:09AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/former-taiwan-ally-nauru-reestablishes-diplomatic-ties-with-china-3281261",
  "paragraph": "4/4\n© Reuters. Chinese Foreign Minister Wang Yi, right and Minister of Foreign Affairs and Trade of Nauru Lionel Aingimea shake hands after signing a Joint Communique on the Resumption of Diplomatic Relations between China and Nauru, at Diaoyutai State Guesthouse, in Be\n2/4\nBy Ryan Woo BEIJING (Reuters) -China and Nauru re-established diplomatic ties on Wednesday, after the tiny Pacific island nation unexpectedly severed relations with its now former ally Taiwan in a move the United States described as \"unfortunate\". The Pacific has become a source of intense competition for influence between Washington which has traditionally viewed it as its backyard, and Beijing, which has targeted Taiwanese diplomatic allies there. During a ceremony in Beijing, China's Foreign Minister Wang Yi and his Nauru counterpart Lionel Aingimea formally signed a document to restore bilateral relations, with ties at the ambassadorial level resuming with immediate effect. According to the document Nauru recognises that there is \"only one China in the world\" governed by the People's Republic of China and that Taiwan is an inalienable part of China. Taiwan rejects China's sovereignty claim and accused it of trying to pressure Taiwan immediately after its recent presidential election with news of Nauru's switch. Severing ties with Taiwan was \"an independent political decision made by the Nauruan government,\" Wang told reporters after the signing ceremony. \"We are willing to share with Nauru the development opportunities brought by Chinese-style modernisation.\" Aingimea said his country looked forward to their new relationship. \"It'll be built on strength, built on development strategy. It will have a synergy of policies. It will have good collaboration and shared governmental principles that both our countries enjoy,\" he said.  \"The prospect is bright.\" TAIWAN 'DEEPLY GRIEVED' Taiwan's foreign ministry said it was \"deeply grieved\". \"The Nauru government is ignorant to the lure of financial aid and is a retainer to China's manipulation, ignoring the development assistance and friendship provided by our country for many years,\" it said in a statement. Democratically governed Taiwan lost Nauru, one of its few remaining diplomatic allies, to China on Jan. 15, just two days after a new Taiwanese president was elected. China claims Taiwan as its own territory with no right to state-to-state ties, a position Taiwan strongly disputes. Nauru's government said it was seeking full resumption of diplomatic relations with China \"in the best interests\" of the country and its people.  Nauru had recognised China before, between 2002 and 2005. 'UNFORTUNATE' The United States, which only recognises China but is Taiwan's most important international backer, said last week that Nauru's decision was \"unfortunate\" and \"disappointing\", warning Beijing's promises often go unfulfilled.  Taiwan's 12 remaining diplomatic allies include the Vatican, Guatemala and Paraguay, plus Palau, Tuvalu and the Marshall Islands in the Pacific. Wang said having diplomatic ties with Taiwan ran counter to those nation's own interests, infringes on China's sovereignty and \"should be corrected sooner or later\". \"We urge these countries to recognise the trend of the times, seize historical opportunities, fulfil their obligations under international law, stand with the international community, and correctly align with history,\" he said. Tuvalu expects to review its diplomatic ties with Taiwan after an election on Friday, Finance Minister Seve Paeniu told Reuters, adding voters wanted more financial support from the international community for climate change and development. Taiwan's presidential office said president-elect Lai Ching-te, currently vice president, spoke on Wednesday with Marshall Islands President Hilda Heine and invited her to attend his inauguration on May 20. \"For the people of Taiwan, President Heine's visit will be a symbol of the firm friendship between the two sides,\" it cited Lai as saying. After Nauru said it was cutting ties with Taiwan, the Marshall Islands offered its firm support to Taipei. \nTaiwan's presidential office said Heine assured Lai that relations are \"rock solid\" and she was grateful for Taiwan's development aid. \"Truly Taiwan can help,\" it quoted her as saying."
}