{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0F0T8_L.jpg",
  "title": "El Salvador's Bukele looks set to cruise to controversial presidential reelection -poll",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 16, 2024 01:52PM ET",
  "comments": [
    1,
    [
      [
        "Serdar Ates",
        "2024-01-16 21:39:25",
        "He is a great guy.",
        "https://www.investing.com/members/251763225"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/el-salvadors-bukele-looks-set-to-cruise-to-controversial-presidential-reelection-poll-3275513",
  "paragraph": "By Nelson Renteria SAN SALVADOR (Reuters) - El Salvador's Nayib Bukele holds a large lead ahead of his bid next month to win reelection as president, a poll showed on Tuesday, as one Latin America's most popular leaders rides a wave of support for his hardline security policies. The poll gives Bukele a 71% lead over his nearest rivals from El Salvador's once-dominant political parties, who both poll below 3% in the survey by Francisco Gavidia University. The 42-year-old Bitcoin enthusiast and former mayor of the capital stepped down temporarily as president last November to seek a second five-year term.  He was legally allowed to mount a reelection campaign only after Supreme Court judges declared that Bukele's human right to run outweighed the constitution's ban on serving consecutive terms as president.  Lawmakers from Bukele's New Ideas Party, which dominates the current Congress, appointed the judges who ruled that he could run. About a fifth of those surveyed told the pollster they would either abstain in the Feb. 4 vote, or leave their ballot blank. According to the poll, the party's already strong grip on the legislature could grow stronger, projected to win 57 out of 60 seats under the current make-up of the chamber. Dating back to March 2022, Bukele invoked emergency powers as part of an unprecedented anti-gang push that has seen police arrest more than 75,000 suspected gang members. The powers suspend rights to due process, including mounting a legal defense, which critics argue amount to a creeping authoritarianism in the Central American nation of almost 7 million. The dragnet has led to a sharp reduction in the murder rate, which for years was one of the world's highest, as well as Bukele's sky-high approval rating. \nBukele's government has been accused of brokering a pact with the country's two top criminal gangs, Mara Salvatrucha and Barrio 18, in order to reduce the homicide rate and boost his party's prospects. He has repeatedly denied the accusations. The poll interviewed about 1,900 Salvadorans from Jan. 3-8 and featured a nearly 3% margin of error."
}