{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0J00M_L.jpg",
  "title": "Uvalde DA investigates police over failures in mass shooting - report",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 19, 2024 08:52PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/uvalde-da-investigates-police-over-failures-in-mass-shooting--report-3278744",
  "paragraph": "© Reuters. Memorial crosses stand in front of Robb Elementary School, as U.S. Attorney General Merrick Garland announces the results of a review into the law enforcement response to a 2022 mass shooting in Uvalde, Texas, U.S., January 18, 2024. REUTERS/Kaylee Greenl\n(Reuters) - A prosecutor in Uvalde, Texas, has convened a grand jury to investigate whether police were criminally liable for failing to promptly storm a classroom in a 2022 mass shooting that killed 19 schoolchildren and two teachers, Texas media reported. District Attorney Christina Mitchell said the grand jury would review evidence and weigh possible criminal charges, the San Antonio Express-News reported on Friday.  Mitchell, whose district includes the town of Uvalde about 80 miles (130 km) west of San Antonio, did not respond to Reuters requests for comment. The 18-year-old shooter at Robb Elementary School was shot dead by police but not until they waited more than an hour before breaking into the adjoining fourth-grade classrooms, in what a U.S. Justice Department review called a critical failure. Lives would have been saved if police from several agencies had followed generally accepted practices for an active shooter situation and immediately attempted to take him down, Attorney General Merrick Garland told a press conference in Uvalde on Thursday. It was one of the deadliest school shootings in U.S. history, but like the other has had little effect on gun regulation, as courts and legislatures have generally upheld the individual right to carry arms.  Mitchell said her decision to investigate was not in response to the Justice Department report as she had planned to convene the grand jury before knowing the review would be made public, the Express-News reported. \nShe did not disclose what the grand jury would focus on in its secret proceedings. But she previously said the issues of whether police could be held criminally responsible or whether anyone helped the shooter buy weapons or ammunition could be subject to investigation, the newspaper said. The Uvalde Leader-News, without attribution, reported that a dozen people were selected on Friday to serve on the special grand jury, which was expected to spend at least six months studying the events of May 24, 2022."
}