{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0M0V3_L.jpg",
  "title": "U.S. lawmakers arrive in Taiwan in post-election show of support",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 23, 2024 05:57PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-lawmakers-arrive-in-taiwan-in-postelection-show-of-support-3281139",
  "paragraph": "3/3\n© Reuters. Lai Ching-te, Taiwan's vice president and the ruling Democratic Progressive Party's (DPP) presidential candidate interacts with supporters during an election campaign event in Taipei, Taiwan December 7, 2023. REUTERS/Ann Wang/ File photo\n2/3\nBy Patricia Zengerle WASHINGTON (Reuters) - The leaders of the U.S. House of Representatives Taiwan Caucus, Republican Representative Mario Diaz Balart and Democratic Representative Ami Bera, have arrived in Taipei, their offices said on Tuesday, in a show of support after the island's election. The two members of Congress plan to engage with senior officials and business leaders during their visit.  \"The aim of the trip is to reaffirm U.S. support for Taiwan following their successful democratic elections, express solidarity in their shared commitment to democratic values, and explore opportunities to further strengthen the robust economic and defense relationship between the United States and Taiwan,\" their offices said in a statement. Lai Ching-te from Taiwan's ruling Democratic Progressive Party (DPP) won the Jan. 13 presidential election and will take office on May 20. China, which has never renounced the use of force to bring Taiwan under its control, has criticized several countries for congratulating Lai on his election victory, saying they should not interfere in China's affairs. China views visits by U.S. officials to Taiwan as sending an encouraging signal to the pro-independence camp on the island. Taiwan's government says Beijing has no right to speak for the island's people or represent them on the world stage. \nThe United States is Taiwan's most important international backer, despite the lack of formal diplomatic ties, and a major arms supplier to Taipei.  Lai says he does not seek to change the status quo across the Taiwan Strait, sticking by long-standing policy of neither seeking independence nor union with China and that only Taiwan's people can decide their future."
}