{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "More than 100 Myanmar migrants flee Malaysian detention centre, one dead",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 01, 2024 10:33PM ET",
    "Updated Feb 02, 2024 01:20AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/more-than-100-myanmar-migrants-flee-malaysian-detention-centre-one-dead-3290715",
  "paragraph": "KUALA LUMPUR (Reuters) - An undocumented migrant from Myanmar has died in a road accident while fleeing an immigration detention centre with over a hundred others in Malaysia late Thursday, officials said. The incident was the second reported breakout from a Malaysian detention centre in as many years. In April 2022, 582 ethnic Rohingya refugees from Myanmar escaped an immigration depot in northern Kedah state. Six of those migrants were killed after being hit by vehicles on a highway. A total of 131 migrants escaped from the Bidor immigration detention depot in Malaysia's western Perak state on Thursday night, Immigration Department director-general Ruslin Jusoh said in a statement on Friday.  One of the migrants died following a road accident, he said, adding that search operations were ongoing for the remaining escapees.  The migrants, who escaped from the men's block of the depot, included 115 ethnic Rohingya refugees and 16 Myanmar nationals of other ethnicities, state news agency Bernama reported, citing a statement from Perak police. Bernama reported the man who died had been struck by a vehicle on a highway.  \nMalaysia, which does not recognise refugee status, has long been a favoured destination for ethnic Rohingya fleeing persecution in Myanmar or refugee camps in Bangladesh. But in recent years, Malaysia has turned away boats carrying Rohingya refugees and rounded up thousands in crowded detention centres as part of a crackdown on undocumented migrants."
}