{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "China unveils new images of its next-generation aircraft carrier",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 02, 2024 11:01PM ET",
    "Updated Jan 03, 2024 12:06AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/china-unveils-new-images-of-its-nextgeneration-aircraft-carrier-3265834",
  "paragraph": "(Corrects to remove extraneous word \"in\" in second to last paragraph) BEIJING (Reuters) -Chinese state media unveiled new images of China's most advanced aircraft carrier yet, including next generation launch tracks that can catapult a wider range of aircraft from its deck.  First shown to the public in June 2022, the Fujian was entirely designed and built domestically.  Yet to conduct its first sea trials, the aircraft carrier is larger and technologically more advanced than the Shandong, commissioned in 2019, and the Liaoning, which China bought second-hand from Ukraine in 1998 and refitted domestically. On state television late on Tuesday, the Fujian was seen being towed by a smaller vessel with all of the three tracks of its electro-magnetic catapult system visible on its deck.  \"In the new year, we will seize every minute, work with determination, and strive for combat readiness as soon as possible,\" state television cited a Fujian officer as saying. The Fujian has been conducting tests including mooring tests before its sea trials, which some observers expected to have taken place by 2023. The carrier started launch tests for its electromagnetic catapult system in November, according to state-controlled Chinese newspaper Global Times. Other than Ford-Class aircraft carriers, a new class of nuclear-powered carriers being developed for the U.S. navy, the Fujian will be the only aircraft carrier in the world equipped with the latest Electro-magnetic Aircraft Launch System (EMALS). China's version of the EMALS can launch more kinds of aircraft than the Shandong or the Liaoning, and will also be more reliable and energy-efficient, marking a milestone in the modernisation of the Chinese military. President Xi Jinping has repeatedly called for increased combat-readiness and technological advances ahead of the 100th anniversary of the founding of the People's Liberation Army (PLA) in 2027. Some senior U.S. military officers previously said China would launch a military takeover of Taiwan by that year.  In the run-up to its Jan. 13 presidential and parliamentary elections, Taiwan has reported China continuing with its daily military activities in the Taiwan Strait and around the democratically governed island. Chinese fighter jets have also on occasion crossed the strait's median line, which previously served as an unofficial barrier but which Beijing says it does not recognise."
}