{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0M0RF_L.jpg",
  "title": "Explainer-What Turkey gained in delaying Sweden's NATO bid",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 23, 2024 03:26PM ET",
    "Updated Jan 23, 2024 04:24PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/explainerwhat-turkey-gained-in-delaying-swedens-nato-bid-3280988",
  "paragraph": "© Reuters. FILE PHOTO: Turkish President Tayyip Erdogan, Swedish Prime Minister Ulf Kristersson and NATO Secretary-General Jens Stoltenberg gather prior to their meeting, on the eve of a NATO summit, in Vilnius, Lithuania July 10, 2023. Henrik Montgomery /TT News Ag\nBy Huseyin Hayatsever and Jonathan Spicer ANKARA (Reuters) - Turkey's parliament backed Sweden's NATO membership bid on Tuesday, clearing a last major hurdle toward enlarging the Western bloc after 20 months of delays that frustrated some of Ankara's allies and extracted some concessions.  In May 2022, Turkish President Tayyip Erdogan raised objections to requests by Sweden and Finland to join the military alliance. The Nordic states made the bids after Russia's full-scale invasion of Ukraine.  Turkey ratified Finland's bid in April 2023 but, along with NATO member Hungary, has kept Sweden waiting. Hungary has made no specific demands of Stockholm, but Turkey demanded Sweden take more steps to crack down on what Ankara sees as terrorists in its jurisdiction.  Here is a guide to what Stockholm, Helsinki, Washington and other NATO countries have done to address Ankara's concerns, marking what political analysts say are geopolitical victories for Erdogan even though ties with the West have been strained.  WHAT CONCESSIONS HAVE SWEDEN AND FINLAND MADE? At a NATO meeting in Madrid in 2022, Turkey secured an agreement with Sweden and Finland in which they would lift arms embargoes and take measures against members of the outlawed Kurdistan Workers' Party (PKK), and the separate so-called Gulen movement that Ankara holds responsible for a 2016 coup attempt. The same year, Stockholm reversed a ban on exporting military equipment to Turkey, without revealing details of companies or products.  In June last year, it introduced a new anti-terrorism bill that makes being a member of a terrorist organisation illegal, saying that it had upheld its part of the deal. Later in 2023, a top Swedish court blocked the extradition of two Turks that Ankara says are Gulenists, and an appeals court upheld the conviction of a man for attempting to finance the PKK, which is also deemed a terrorist group by the European Union and United States. Separately, in response to criticism in Turkey and other majority Muslim countries, Justice Minister Gunnar Strommer said Sweden was examining whether it could change the law to stop people burning the Muslim holy book, the Koran, in public. Finland, for its part, agreed in 2022 to consider granting arms export permits to Turkey on a case-by-case basis. After nearly a wait of nearly a year, Ankara said Helsinki had won its blessing. WHAT HAVE OTHER NATO MEMBERS DONE?  When Erdogan signalled at a NATO conference in July last year that Sweden would eventually get the green light, NATO member Canada agreed to re-open talks with Turkey on lifting export controls on drone parts, including optical equipment.  The Netherlands lifted restrictions on arms deliveries to Turkey.  Also last July, following a meeting between Turkish and Swedish leaders, NATO Secretary-General Jens Stoltenberg announced the alliance would establish a special coordinator for counter-terrorism. In October, he appointed Assistant Secretary-General Thomas Goffus to the post.  SWEDEN'S GO-AHEAD FOR U.S. F-16 FIGHTERS? Hanging over discussions has been the question of Washington's endorsement of Ankara's request to purchase $20 billion worth of F-16 fighter jets and 79 modernisation kits.  A day after Erdogan last July gave the go ahead for Sweden to join NATO, the White House said it would move ahead with the transfer of the F-16s to Turkey in consultation with Congress.  While Erdogan sent Sweden's NATO bid to Turkey's parliament for consideration last October, he openly linked the F-16s with its ultimate ratification.  Ankara made the F-16 purchase request in 2021 but has faced objections in the U.S. Congress over its delaying of NATO enlargement and its human rights record. Ankara has since floated a potential purchase of Eurofighter jets instead.  WHAT IS THE CURRENT STATE OF SWEDEN'S BID?  Erdogan is expected to sign parliament's decision into law, probably within days. After that, Turkey would deliver the final document - the instrument of ratification - to Washington under NATO rules.  \nThough Turkey was seen as the main hurdle, Hungary has also not ratified Sweden's bid. Prime Minister Viktor Orban said on Tuesday he had invited Sweden's prime minister to visit and negotiate his country's membership.  Hungary pledged not to be the last to ratify the bid, but its parliament is in recess until around mid-February."
}