{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0B00T_L.jpg",
  "title": "North Korea poised to admit first known tourists since 2020",
  "category": "World news",
  "publisher": "Investing.com",
  "date": "Published Jan 11, 2024 08:59PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/north-korea-poised-to-admit-first-known-tourists-since-2020-3272959",
  "paragraph": "© Reuters. FILE PHOTO: A North Korean tour passport is seen at a souvenir shop at Juche Tower in Pyongyang, North Korea, September 11, 2018. REUTERS/Danish Siddiqui\nBy Josh Smith SEOUL (Reuters) - A group from Russia is poised to be the first known tourists allowed into North Korea since anti-pandemic border lockdowns began in early 2020, according to a post from Russian provincial authorities and a Western tour guide. North Korea imposed some of the strictest border controls in the world during the spread of COVID-19, and has yet to fully reopen to foreigners. The trip, advertised by a Vladivostok-based agency, was arranged when the governor of Russia's far eastern region of Primorsky Krai, which borders North Korea, visited Pyongyang for talks in December, the regional government said in a post on Telegram this week. The four-day tour will depart on Feb. 9 and include stops in Pyongyang and a ski resort, according to an online itinerary. Simon Cockerell, general manager at Beijing-based Koryo Tours, which is not involved in the trip, told Reuters that his partners in North Korea had confirmed the Russian visit is going ahead under special circumstances. \"It is a good sign, but I would hesitate to say it necessarily will lead to a broader opening due to the special circumstances for this one trip,\" he said. \"But given that no tourists have been for four-plus years, any tourism trip can be viewed as a positive step forward.\" North Korean leader Kim Jong Un and Russian President Vladimir Putin met for a summit in eastern Russia in September, where they pledged deepening cooperation on economic, political, and military fronts despite international sanctions. \nTourism is largely unaffected by U.N. Security Council resolutions that restrict business with North Korea over its nuclear weapons and ballistic missile programs. The year before the pandemic began, North Korea saw a surge of Chinese tourists who may have provided the cash-strapped country with up to $175 million in extra revenue in 2019, according to an estimate by Seoul-based NK News."
}