{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0N0BI_L.jpg",
  "title": "Exclusive-In Russia, anti-war candidate tries to harness protest vote against Putin",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 24, 2024 05:08AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/exclusivein-russia-antiwar-candidate-tries-to-harness-protest-vote-against-putin-3281420",
  "paragraph": "4/4\n© Reuters. Boris Nadezhdin, a representative of Civil Initiative political party who plans to run for Russian president in the March 2024 election, attends an interview with Reuters in Moscow, Russia January 23, 2024. REUTERS/Evgenia Novozhenina\n2/4\nMOSCOW (Reuters) - Boris Nadezhdin, a 60-year-old former opposition lawmaker, is running a long-shot campaign to challenge Vladimir Putin for the Russian presidency and says his call to end Russia's war in Ukraine has put rocket boosters under his bid. Nadezhdin, who sometimes appears on state TV where he criticises the authorities before being swiftly drowned out by TV anchors, must collect 100,000 signatures across Russia by the end of January to be registered as a candidate. His supporters say he has already passed the 100,000 mark, garnering considerable support in Moscow and St Petersburg, but still needs more from other parts of Russia as the signatures need to be spread across at least 40 regions of the world's largest country. Nadezhdin said he was confident of being registered and had been surprised by how his call to end Russia's war in Ukraine had prompted people to queue up in the depths of the Russian winter and abroad to give their signature in his support. \"It (opposition to the war) is huge. People are tired of all this. They want to live a normal life in a normal country, they don't want what is happening,\" he told Reuters in an interview. \"People are putting their signature not because they really like me but simply because it's a chance to do something for peace, for this whole story to end, and for people to stop dying,\" said Nadezhdin, who seemed remarkably relaxed for a man challenging the Kremlin's formidable political machine. A small sample of voters interviewed by Reuters appeared to confirm he was attracting a generic anti-war vote.  \"I came here to express my anti-war position. I believe this is the only way to declare your position, we don't have any other yet,\" said 42-year-old Moscow resident Sergei Yasinsky. TIGHT CONTROL In Russia's tightly controlled political system, people have run against Putin in the past and portrayed themselves as genuine opponents, only to disclose years later that they were doing so as part of an agreement with the authorities to make up the numbers.  The Kremlin says the March 15-17 election is a bona fide political contest and that Putin, who enjoys an approval rating of around 80%, is genuinely popular.  Putin, who has chosen to run as an independent rather than as the candidate of the ruling United Russia party, has already collected over three million signatures, more than 10 times the 300,000 he needs, say his supporters.  The Kremlin also says that most Russians support what it calls Moscow's \"special military operation\" in Ukraine. State TV has worked around the clock for nearly two years telling voters that the conflict is an existential struggle with the West for a new world order.  The outcome of the election is not in doubt. Putin, in power as either president or prime minister for more than two decades and in control of all the state's levers, is set to win another six-year term in a contest critics say is a crude imitation of democracy. There are currently 11 presidential candidates. Critics say the Kremlin needs people like Nadezhdin to provide a semblance of competition even if the outcome is a foregone conclusion. Asked on Wednesday if Nadezhdin posed a political threat to Putin, Kremlin spokesman Dmitry Peskov said: \"Not at all, we don't see him as a rival. Any citizen has the right to run for president if they meet a number of conditions.\" If Nadezhdin is allowed to run and garners a small percentage of the vote, the Kremlin will be able to point to how weak opposition to the Ukraine war is. He is also a useful focal point to allow war critics - including some of the wives of mobilised soldiers - to let off steam, those same critics say.  Many opponents of the war have fled Russia or have been fined or imprisoned under tough laws which mandate long jail terms for anyone convicted of spreading \"fake news\" about the Russian army. Nadezhdin said he was careful. \"I'm not trying to break the law or calling for unrest. I'm acting in accordance with the law. I can't see how they can't register me,\" he said. \"I want to change the country. I want Russia to be a peaceful, free country.\" He said his only funding came from grassroots supporters and joked about how he'd taken some modest measures to safeguard his personal security. But he also spoke about his electoral chances in a way that few in modern Russia would dare. \n\"Did you see queues outside the Putin HQ, did you see crowds standing in the frost saying they wanted to give their signature for Putin? It didn't happen,\" he said. \"It seems to me, after we got this campaign going, that Putin himself isn't very sure about that (victory).\""
}