{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0602H_L.jpg",
  "title": "Japan premier vows \"ceaseless\" aid as snow hampers quake relief",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 07, 2024 01:33AM ET",
    "Updated Jan 07, 2024 03:37AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/japan-premier-vows-ceaseless-aid-as-snow-hampers-quake-relief-3268599",
  "paragraph": "5/5\n© Reuters. A worker guides a vehicle in an area damaged by earthquake and landslide in Wajima, Ishikawa Prefecture, Japan, January 7, 2024. REUTERS/Kim Kyung-Hoon\n2/5\nBy Kevin Buckland and Kiyoshi Takenaka WAJIMA, Japan (Reuters) - Japan's prime minister vowed to provide \"ceaseless\" support to areas devastated by the New Year's Day earthquake as snow and sleet hampered rescue and relief efforts and local media reported that the disaster had now claimed at least 126 lives. The adverse weather on the Noto peninsula continued to vex survivors at the epicenter of the magnitude 7.6 quake that left more than 30,000 homeless and cut power to tens of thousands of residences and businesses. At least 222 people are still reported missing and more heavy snow or rain is forecast overnight for the region. Footage on national broadcaster NHK showed construction trucks digging through piles of dirt three meters (almost 10 ft)tall to unearth houses buried by landslides.  \"Rescuing people trapped under the rubble and responding to isolated areas are issues that must be tackled with the highest priority,\" Prime Minister Fumio Kishida said on an NHK program on Sunday. \"As we move forward with ceaseless reconstruction and recovery efforts, we must not hesitate in responding due to budget constraints in the disaster-affected areas,\" he added. Kishida had said on Friday that his government would tap 4.74 billion yen ($32.77 million) of budget reserves for reconstruction efforts. The governor of Ishikawa Prefecture, where the Noto peninsula is located, declared a state of emergency on Saturday, calling the quake \"an unprecedented disaster\" for the region, NHK reported. In the city of Wajima, on the peninsula's northern coast, a line of cars stretching as far as the eye could see had formed to refuel at a petrol station as fuel supply to the region gradually returned. Prefectural governments have sent trailers equipped with several flushable toilets to evacuation centres in Wajima and other disaster-struck cities, where water supplies are only just restarting, NHK reported. At a centre near Wajima's famed \"Asaichi\" morning market, which was burnt to the ground after the quake, some of the 700 people taking shelter there stood in a line on a stairway, passing boxes of water to higher floors. \n\"Some people have left as electricity is restored in parts of the city (but) we are still at capacity and not accepting new evacuees,\" the centre's receptionist said. ($1 = 144.6500 yen)"
}