{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0P0R6_L.jpg",
  "title": "Venezuela court upholds ban on leading opposition presidential candidate Machado",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 26, 2024 04:18PM ET",
    "Updated Jan 26, 2024 06:01PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/venezuela-arrests-allies-of-opposition-candidate-on-conspiracy-accusations-3284597",
  "paragraph": "2/2\n© Reuters. Venezuela's Attorney General Tarek Saab addresses the media, in Caracas, Venezuela January 26, 2024. REUTERS/Gaby Oraa\n2/2\nBy Vivian Sequera, Mayela Armas and Deisy Buitrago CARACAS (Reuters) -Venezuela's Supreme Justice Tribunal on Friday upheld a ban which prevents presidential candidate Maria Corina Machado from holding office, upending the opposition's plans for elections planned later this year. With its ruling, Venezuela's top court has barred Machado, a 56-year-old industrial engineer, from registering her candidacy for presidential elections scheduled for the second half of 2024. The decision came hours after three of Machado's allies were detained on accusations of conspiracy, amid growing tensions between the government of President Nicolas Maduro and the political opposition. The United States has conditioned a continuation of sanctions relief, granted in October on the back of an electoral deal signed in Barbados, on Maduro freeing political prisoners and \"wrongfully detained\" Americans and making progress toward removing bans on holding office imposed on a number of opposition politicians. Venezuela in December released 24 of its own citizens and 10 Americans, including six classed as \"wrongfully detained,\" in exchange for freedom for a Maduro official and the extradition of a Malaysian businessman wanted by the U.S. But the upheld ban on Machado could set relations back between the two countries. The court said it upheld findings that Machado supported U.S. sanctions, had been involved in corruption, and had lost money for Venezuela's foreign assets, including U.S.-based oil refiner Citgo and chemicals company Monomeros, which operates in Colombia. \"The regime decided to finish off the agreement in Barbados. What it didn't finish was our fight to see democracy win via free and fair elections,\" Machado said in a message via X. Earlier, Attorney General Tarek Saab accused Guillermo Lopez, Luis Camacaro and Juan Freites of forming part of a group of at least 11 people who he said tried to rob a military weapons arsenal last year ahead of a planned assault on a pro-Maduro state governor. Machado's Vente Venezuela party, to which the three belong, said on its X account that Camacaro and Freites had appeared in court in Caracas on Thursday without private legal representation and without any contact with their families permitted, calling it an \"illegal and arbitrary\" procedure. It did not mention Lopez. \nSaab said on state television that the three were \"criminals.\" The U.S. State and Treasury departments did not immediately respond to requests for comment. (Report by Vivian Sequera, Mayela Armas and Deisy Buitrago; Writing by Oliver Griffin and Isabel Woodford; Editing by Rosalba O'Brien)"
}