{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0C023_L.jpg",
  "title": "What might happen in Taiwan's election and what the outcome could mean",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 13, 2024 03:06AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/what-might-happen-in-taiwans-election-and-what-the-outcome-could-mean-3273900",
  "paragraph": "© Reuters. A woman casts her vote at a polling station set up in a temple during the presidential and parliamentary elections in New Taipei City, Taiwan January 13, 2024. REUTERS/Carlos Garcia Rawlins\nTAIPEI (Reuters) - Polls closed on Saturday for Taiwan's presidential and parliamentary elections. The outcome should be clear by later on Saturday evening. Opinion polls have not been allowed to be published from Jan. 3 on until the polls close in line with Taiwanese election law. Here are some of the scenarios for who could win, based on pre-Jan. 3 polling, and what it will mean for Taiwan's relations with China and the United States and for domestic policy: TAIWAN'S RULING PARTY WINS PRESIDENCY, LOSES PARLIAMENT MAJORITY: The most likely outcome. This could bring an angry reaction from China, which claims Taiwan as its own territory, and make it hard for Lai to push his policy priorities. Pre-election polls pointed to the ruling Democratic Progressive Party's (DPP) Lai Ching-te winning the presidency but by perhaps a narrow margin and losing the party's majority in parliament.  This will limit Lai's ability to pass legislation and he could appoint a Cabinet that might have to include some opposition or non-party figures to show he is willing to reach across the aisle to get laws passed. But the opposition, which has repeatedly vilified Lai over issues ranging from whether he is a dangerous supporter of Taiwan's formal independence to whether he has over hyped the threat from China, might not want to play ball. That could slow down Taiwan's efforts to boost its defences and build new weapons such as submarines and fighter jets if spending bills are delayed or not passed. China, which had cast the vote as choice between war and peace, might be mollified that Lai, unlike his predecessor President Tsai Ing-wen, will not just have free rein to do what he wants, and not react too strongly to his election. China could also wait and see what is in his inauguration speech on May 20 when he takes office. But it could also respond militarily in some form to a Lai victory, or step up economic pressure. For the United States, Lai is a known quantity, having been vice president since the 2020 election. Lai has repeatedly pledged not to change the status quo across the Taiwan Strait and offered talks with China. He and Tsai both reject Beijing's sovereignty claims and say Taiwan is already an independent country and its future should be decided by its people. Economically, Lai wants to continue cutting reliance on China and trade more with like-minded democratic partners.  TAIWAN'S LARGEST OPPOSITION PARTY WINS PRESIDENCY, PARLIAMENT MAJORITY This could happen if they are able to win over floating voters and capitalise on a desire for change after eight years of DPP government. The Kuomintang's (KMT) candidate Hou Yu-ih, Taiwan's former top policeman, has pledged to both oppose Taiwan independence and to re-start dialogue with China, but said he is committed to boosting the island's defences. That would cheer Beijing and likely lead to a cooling of tensions, though China might also keep up the pressure if it thinks Hou is not moving fast enough towards some sort of resolution of Taiwan's status and accepting China's sovereignty claims.  Hou denies being pro-Beijing, calling such accusations a smear. He supports the KMT's longstanding position that both Taiwan and China belong to \"one China\" but each side can interpret what that means. Beijing has said acknowledging the \"one China\" principle is key to resuming talks with Taipei. But the KMT may have to rely on the small Taiwan People's Party (TPP) for support in parliament if it does not win a majority there. Hou is much more of an unknown quantity to the United States, though he did visit the country last year to offer reassurances that good relations with Washington are a priority for him. Domestically, Hou supports the continued use of nuclear power which the DPP wants to phase out, and signing of more trade deals with China. SMALL OPPOSITION PARTY WINS THE PRESIDENCY The chances the TPP, only founded in 2019, wins the presidency are remote but cannot totally be ruled out. Its presidential candidate and chairman, former Taipei mayor Ko Wen-je, has garnered a passionate support base among mostly younger voters by focusing on bread and butter issues like the high cost of housing. But Ko had lagged in the polls after talks to run a joint ticket with the KMT collapsed in acrimony in November. A more likely situation is the TPP wins enough lawmaker seats to prop up a KMT administration, assuming the KMT wins the presidency but fails - maybe only just - to get a majority in parliament. While some TPP and KMT lawmaker candidates did campaign together, there remains a lot of bitterness between the two parties after the collapse of the joint ticket talks. Ko could also choose to cooperate with the DPP in parliament, and said on Friday he was willing to set politics aside and work with other parties, without naming either the DPP or KMT. \nA Ko presidency would be a wild card in terms of relations with China and the United States given he is largely untested on the international stage, though he did also visit the United States twice last year. Ko has spoken of the close cultural links between Taiwan and China, and indeed visited China when he was Taipei mayor, but said on the campaign trail any talks with Beijing need to ensure Taiwan's democracy and way of life are guaranteed."
}