{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0I0HW_L.jpg",
  "title": "Prince Harry withdraws libel claim against British tabloid",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 19, 2024 11:19AM ET",
    "Updated Jan 19, 2024 11:39AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/prince-harry-withdraws-libel-claim-against-british-tabloid-3278549",
  "paragraph": "© Reuters. FILE PHOTO: Britain's Prince Harry, Duke of Sussex and his wife Meghan, Duchess of Sussex attend a panel held during Project Healthy Minds' second annual World Mental Health Day Festival and The Archewell Foundation Parents' Summit: Mental Wellness in the\nLONDON (Reuters) -Britain's Prince Harry on Friday withdrew his libel claim against the publisher of the Mail on Sunday newspaper over an article about his security arrangements, with his spokesperson saying he wanted to focus on his family's safety. Harry, King Charles' younger son, had sued Associated Newspapers over a 2022 article which stated he only offered to pay for police protection after bringing a separate legal fight against the British government. The report also accused Harry, 39, of attempting to mislead the public about his willingness to pay for the policing, which was withdrawn after he stepped back from royal duties in 2020. In December, he lost his attempt to have the paper's defence to his libel lawsuit thrown out, meaning he would have likely had to give evidence at London's High Court later this year. The Daily Mail, the Mail on Sunday's sister title, reported that Harry, the Duke of Sussex, had abandoned his case hours before his lawyers were required to hand over relevant documents.  The paper said he would now be obliged to pay the paper's costs of 250,000 pounds ($316,900.00) along with his own fees which it put at 500,000 pounds. Both Harry's lawyer and a spokesperson for Associated declined to comment. The prince's spokesperson, who said the legal costs had not been determined, said he had withdrawn the claim because he wanted to focus on the safety of his family and his case against the British government over the decision to strip him of automatic police protection when he was in Britain. Harry, his U.S. wife Meghan and their two children now live in California after the couple stepped down from royal duties in 2020. His claim against the government was heard in December with a ruling expected in the next few months. That case was Harry's focus and not the libel action which would \"give a continued platform to the Mail’s false claims all those years ago\", the spokesperson said. London's High Court had ruled last July that the Mail report was defamatory - paving the way for Harry to take the case forward against one of Britain’s biggest media publishers. But his bid to have the case decided in his favour without a trial then subsequently failed. The legal action was one of a number of cases the royal is taking against British tabloids at the High Court. He and six other high-profile figures including singer Elton John are also suing Associated alleging widespread unlawful behaviour including phone-hacking by its journalists. \nA judge ruled in November that their case could go to trial after the publisher tried to have it thrown out.  ($1 = 0.7889 pounds)"
}