{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0J04U_L.jpg",
  "title": "At Putin campaign HQ, soldier's wife says bring him home",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 20, 2024 08:49AM ET",
    "Updated Jan 20, 2024 04:37PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Ken Roth",
        "2024-01-21 11:27:28",
        "Putin could not care less about these wives, they can get a muscovite car for free and go home",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/at-putin-campaign-hq-soldiers-wife-says-bring-him-home-3278831",
  "paragraph": "4/4\n© Reuters. Maria Andreeva, whose husband was mobilised in October 2022 to join the Russian armed forces involved in a military campaign in Ukraine, and other wives of mobilised servicemen walk to lay flowers at the Tomb of the Unknown Soldier by the Kremlin wall in \n2/4\nMOSCOW (Reuters) - The wife of a Russian soldier delivered an emotional appeal for his return from Ukraine on Saturday at the election headquarters of President Vladimir Putin, a defiant gesture in a country where open criticism of the war is banned. \"Vladimir Vladimirovich Putin has issued a decree that my husband has to be there (in Ukraine). I'm interested to know when he will issue a decree that my husband has to be home,\" Maria Andreyeva said as campaign workers looked on. She became involved in a heated exchange with a woman who told her that Russian soldiers in Ukraine were defending the motherland and she should pray for them. \"So what's next? The Ministry of Defense has spent its money, now we need to squeeze everything out of our guys, get the last life out of them? So that they come back to us just as stumps?\" Andreyeva demanded. \"Will they give me the stump? What will I get back? A man without legs, without arms, a sick man? Don't you know what's happening there?\" The exchange took place during a visit to Putin's election base by a small delegation from \"The Way Home\", an organisation of soldiers' wives that is campaigning for their return from the front. It showed the depth of anger and despair among some soldiers' families as the war grinds on, with no end in sight after nearly two years.  Putin mobilised 300,000 reservists in September 2022 in an unpopular move that he has said there is no need to repeat because hundreds of thousands more have signed up voluntarily as contract soldiers.  He told the country last month that Russia was in a strong position across the entire front line and would press ahead to meet the goals of what he calls its \"special military operation\". Putin chose a gathering with soldiers last month to announce his plan to run for a new six-year term at an election in March, where supporters and opponents alike see his victory as a foregone conclusion. He also frequently appears with soldiers' families, including relatives of those who have died in combat, whom he has praised for their sacrifice and heroism. Andreyeva said she did not detect any urgency from the authorities to address the concerns of soldiers' wives, and it was time to step up their campaign. \nShe told reporters her toddler daughter was suffering from arrested speech development because of her father's absence. \"All my family's problems can only be solved by one thing - by my husband being demobilised. Because she is a completely different child when her father comes home.\""
}