{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0G00Z_L.jpg",
  "title": "US Senate rejects measure to force human rights report on Israel",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 16, 2024 07:51PM ET",
    "Updated Jan 16, 2024 08:26PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/senate-rejects-measure-to-force-human-rights-report-on-israel-3275654",
  "paragraph": "© Reuters. U.S. Senator Bernie Sanders (I-VT) speaks to the media following a meeting with U.S. President Joe Biden at the White House in Washington, U.S., July 17, 2023. REUTERS/Evelyn Hockstein/File Photo\nBy Patricia Zengerle WASHINGTON (Reuters) -The U.S. Senate rejected a resolution on Tuesday that would have frozen security aid to Israel unless the State Department produces a report within 30 days examining whether Israel committed human rights violations in its campaign against Hamas in Gaza. Seventy-two senators voted to set the resolution aside, versus 11 who backed it, easily clearing the simple majority needed to kill the resolution in the 100-member chamber. The vote was forced by Senator Bernie Sanders, an independent who caucuses with Democrats. While the resolution was handily defeated, it reflected growing concern among some of President Joe Biden's fellow Democrats, especially on the left, over the supply of U.S. weapons to Israel despite the Gaza conflict's steep toll on Palestinian civilians. \"We must ensure that U.S. aid is being used in accordance with human rights and our own laws,\" Sanders said in a speech urging support, lamenting what he described as the Senate's failure to consider any measure looking at the war's effect on civilians. The White House had said it opposed the resolution, which could have paved the way toward the imposition of conditions on security assistance to Israel. Senators who opposed the measure said it sent the wrong message, at a time when Israel had said it was shifting to a more targeted campaign.  \"This resolution is not only off-base, it's dangerous. It sends absolutely the wrong signal at the wrong time,\" said Republican Senator Lindsey Graham. The United States gives Israel $3.8 billion in military assistance each year, ranging from fighter jets to powerful bombs that could destroy Hamas tunnels. Biden has asked Congress to approve an additional $14 billion. Sanders' resolution was filed under the Foreign Assistance Act, which allows Congress to direct State to provide a human rights report and other information on any country received U.S. security assistance. If the resolution had passed, it would have required the State Department to provide a report to Congress within 30 days. After receiving the report, Congress could consider another resolution proposing changes to security assistance to Israel. Israel launched the war to eradicate Hamas, an Iran-backed group sworn to Israel's destruction, after militants stormed across the border fence on Oct. 7, killing 1,200 people and capturing 240 hostages, Israeli tallies showed. Gaza health authorities, whose data the United Nations has deemed broadly reliable, said the war, now in its fourth month, had by Tuesday killed 24,285 people in the Palestinian enclave. Thousands more bodies are feared lost in the rubble left after Israeli bombing. \nThe war has driven most of Gaza's 2.3 million people from their homes, some of them several times, and caused a humanitarian crisis, with food, fuel and medical supplies running low. Biden's administration says it has pushed Israel to reduce civilian casualties, but Israel says it will not rest until Hamas is wiped out, and the militants are showing no sign of losing the means to resist."
}