{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "Nicaragua arrests four more priests, intensifies crackdown on Catholic Church",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Dec 30, 2023 01:13PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/nicaragua-arrests-four-more-priests-intensifies-crackdown-on-catholic-church-3264908",
  "paragraph": "By Ismael Lopez SAN JOSE (Reuters) - Nicaraguan police detained four more priests early on Saturday, bringing the total number to 12 over the past three days, according to a high-ranking member of the Catholic Church with knowledge of the matter and local media. Nicaraguan President Daniel Ortega, who has governed the Central American country since 2007, has started a crackdown on the Catholic Church and political opponents.  Priests Mikel Monterrey, Gerardo Rodriguez and Raul Zamora, along with Monsignor Miguel Mantica, the son of one of the richest families in Nicaragua, were taken from their respective homes, the source said. \"They're all from the Archdiocese of Managua,\" said the source, who spoke to Reuters on the condition of anonymity for fear of reprisals. The Nicaraguan government and police did not respond to a request for comment. La Prensa, one of the country's last remaining newspapers, also reported the four arrests of the priests.  Among those arrested early Saturday were two priests - Monterrey and Zamora - who opened the doors of their parish to students from two universities that were attacked by the government in 2018. In total, 12 priests and Bishop Isidro Mora have now been arrested in recent days. In August 2022, Bishop Rolando Alvarez was arrested and sentenced to 26 years in prison.  Since the 2018 protests, Ortega has accused priests of organizing themselves and orchestrating a coup; the bishops had asked the president for justice for those who died during the protests, and early elections."
}