{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK030BK_L.jpg",
  "title": "Gaza's child amputees face further risks without expert care",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 04, 2024 06:28AM ET",
    "Updated Jan 04, 2024 01:29PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/gazas-child-amputees-face-further-risks-without-expert-care-3267056",
  "paragraph": "6/6\n© Reuters. Palestinian girl Eman Al-Kholi, whose limb was amputated after being wounded in an Israeli strike that killed her parents, looks on as she sits in a wheelchair at the European Hospital, in Rafah in the southern Gaza Strip, December 28, 2023. REUTERS/Arafa\n2/6\nBy Arafat Barbakh, Maggie Fick and Emma Farge KHAN YOUNIS, Gaza (Reuters) - Eleven-year-old Noor's left leg was almost entirely torn off when her home in Jabalia, Gaza was hit by an explosion in October. Now her right leg, fitted with a heavy metal bar and four screws drilled into the bone, may have to be amputated. \"It hurts me a lot ... I'm afraid that they'll have to cut off my other leg,\" she said from her hospital bed, staring at her clunky fixation device. \"I used to run and play, I was so happy with my life, but now when I lost my leg, my life became ugly and I got sad. I hope I can get an artificial limb.\" In bombed-out Gaza, a generation of child amputees is emerging as Israel's retaliatory blitz after Hamas' deadly Oct. 7 attacks has led to blast and crush injuries as explosive weapons tear through densely-packed high-rise housing blocks. Israeli authorities have previously said they work to minimise harm to civilians. Israel's military spokesperson's unit pointed to what it called Hamas' strategy of the \"exploitation of civilian structures for terror purposes\" but provided no specific comment on child amputees. Doctors and aid workers say Gaza's collapsed medical system is ill-placed to give children the intricate follow-up care they need to salvage their still-growing, truncated bones. Only 30% of pre-conflict medics are working due to killings, detentions and displacements, according to the World Health Organization. More than 1,000 children had undergone leg amputations, sometimes more than once or on both legs, by end-November, according to U.N. children's agency UNICEF, in a conflict where Gaza health authorities say nearly a quarter of injuries are among children. Poor hygiene and medicine shortages spell more complications and amputations on existing injuries, some of which may not be survivable, doctors say.  \"Many limbs that apparently had been saved, will go on to require amputation. And many (people with) amputations and limbs that we think have been saved may still go on to die of the longer term consequences,\" said Dr. Chris Hook, a British emergency medicine doctor with medical charity MSF who returned from Gaza in late December. FLIES AND DECAY Staff at the European Hospital in Gaza where Noor is being treated, which is running at triple capacity, cannot provide the new limb she dreams of. Even painkillers to help amputees with chronic pain are running low, staff say. Flies were buzzing around the ward when a Reuters journalist visited. \"I try as much as I can to make things easier for them as a nurse, but no matter what you do, they have severe psychological problems, they feel incomplete with lots of pain,\" said nurse Wafa Hamdan.  The enclave's main prosthetic limb centre, the Qatari-funded Hamad hospital in Gaza City, was shuttered weeks ago after being hit by Israel, Gaza health authorities say. Israel's military spokesperson's unit did not immediately respond to a request for comment on Hamad hospital. Children with war-related amputations will need up to a dozen surgeries on the limb by the time they reach adulthood because the bone keeps growing, experts say. But even before the conflict there was a shortage of vascular and plastic surgeons, medics say, and Palestinian health authorities say over 300 healthcare workers have been killed since.  Still, Noor, whose right leg may survive intact, is luckier than some children whose limbs were amputated swiftly due to a lack of time or medical expertise, sometimes without anaesthetics. \"Unfortunately many of them are really unnecessary,\" said Sean Casey, WHO Emergency Medical Teams coordinator. At other times, amputation is the only choice because wounded children arrive in hospital days after the injury. UNICEF spokesperson James Elder said he saw a child whose injured left leg had begun to decompose because he had been stuck on a bus for more than three days due to military checkpoint delays. Israel's military spokesperson's unit said an operational debrief was held to draw immediate lessons from the incident and that it would be further examined. 'NOBODY'S COMING TO SEE THEM' While Gaza health authorities do not have an official tally, doctors and aid workers say UNICEF's 1,000 figure is accurate for the first two months of the conflict but has likely been far surpassed since, making the Gaza amputation rates unusually high compared to other conflicts and disasters. In Ukraine, where missiles have also struck residential towers during Russia's invasion, there are 30 known cases of child amputees, according to the ombudsman's office.  British-Palestinian surgeon Dr. Ghassan Abu-Sittah said he performed six amputations in Gaza in one night. Once, he had to reopen a child's thigh stump after amputation to clean out the pus.  MSF's Hook also reported many people returning to its Rafah wound care clinic with infected stumps.  The president of the International Committee of the Red Cross, Mirjana Spoljaric, said she could not forget the images of children, often orphans, with multiple amputations lying in hospital wards after visiting Gaza in December. \"On top of the wounds that you see and the lack of pain medication, they are lying there and nobody's coming to see them.\" In some cases, as with 10-year-old Gaza orphan Ritash, her right leg had to be re-amputated higher up and just below the knee after it became infected, according to a U.N. humanitarian office (OCHA) aid worker Gemma Connell who met her. \nA photograph showed her frowning from a wheelchair on a dirty hospital floor, her stump jutting up in the air. \"I think what I have seen would break anyone's heart,\" said Connell. (This story has been refiled to say 'pus' instead of 'puss' in paragraph 24)"
}