{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0H0JK_L.jpg",
  "title": "Somalia rejects mediation efforts with Ethiopia over port deal",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 18, 2024 08:17AM ET",
    "Updated Jan 18, 2024 03:56PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/somalia-rejects-mediation-efforts-with-ethiopia-over-port-deal-3277406",
  "paragraph": "© Reuters. FILE PHOTO: Somaliland President Muse Bihi Abdi and Ethiopia’s Prime Minister Abiy Ahmed attend the signing of the Memorandum of Understanding agreement, that allows Ethiopia to use a Somaliland port, in Addis Ababa, Ethiopia, January 1, 2024. REUTERS/T\nBy Giulia Paravicini and Dawit Endeshaw NAIROBI (Reuters) - Somalia rejected any discussions with Ethiopia about Addis Ababa's agreement to lease a port in the breakaway region of Somaliland, as regional heads of state gathered on Thursday to try to defuse a growing diplomatic crisis.  Under a memorandum of understanding signed on Jan. 1, Ethiopia would consider recognising Somaliland's independence in return for gaining access to the Red Sea, partly through the port lease. Somaliland declared independence from Somalia in 1991 but has not won recognition from any country and the port lease deal, which would be a boon to landlocked Ethiopia, has enraged Somalia.  An escalating war of words, including threats by Somalia to go to war to prevent the deal from going through, led the African Union to call on Wednesday for restraint and \"meaningful dialogue\".  \"There is no space for mediation unless Ethiopia retracts its illegal MOU and reaffirms the sovereignty and territorial integrity of Somalia,\" Somalia's ministry of foreign affairs said in a statement on Thursday. Under the deal, which still has to be finalised, Ethiopia would lease 20 km (12 miles) of coastland around the port of Berbera, on the Gulf of Aden, for 50 years for military and commercial purposes.  Ethiopia's current main port for maritime exports is in the neighbouring country of Djibouti. Heads of state from a regional group, the eight-member Intergovernmental Authority on Development (IGAD), met in Entebbe, Uganda, on Thursday to seek a peaceful solution.  Those in attendance included the presidents of Djibouti, Kenya, Somalia and South Sudan as well as the leader of the Sudanese paramilitary Rapid Support Forces (RSF), Mohamed Hamdan Dagalo.  AL-SHABAAB FEARS The U.S. special envoy for the Horn of Africa, Mike Hammer, who attended as an observer along with the European Union, Saudi Arabia and Turkey, said the MOU threatened to further undermine regional security and had been weaponized by Al Shabaab militants.  \"We have already seen troubling indications that al-Shabaab is using the MOU to generate new recruits,\" he told delegates in Uganda, according to a copy of the remarks seen by Reuters.  Ethiopia did not send a delegation, saying it was informed too late about the summit.  \nAt a news conference on Thursday, Ambassador Meles Alem, Ethiopia's foreign affairs spokesperson, rejected a statement by the Arab League on Wednesday that called the MOU \"a clear violation of international law\".  \"The statement is a disservice to the organisation itself as well as member countries. More than anything it shows a disregard to Africans,\" Meles said."
}