{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0708V_L.jpg",
  "title": "Daughter of Bangladesh's founding father secures fifth poll win",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 08, 2024 03:30AM ET",
    "Updated Jan 08, 2024 06:37AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/bangladesh-pm-hasina-from-champion-of-democracy-to-iron-lady-3268906",
  "paragraph": "3/3\n© Reuters. FILE PHOTO: A student holds a placard of Prime Minister Sheikh Hasina as they celebrate the formation day of Bangladesh Chhatra League, the student wing of Bangladesh Awami League, at the University of Dhaka, ahead of the general election in Dhaka, Bangla\n2/3\nBy Sudipto Ganguly and Ruma Paul DHAKA (Reuters) -Bangladesh Prime Minister Sheikh Hasina once joined rivals in a fight to restore democracy but critics say her long reign has been marked by unjustified arrests of opposition leaders and suppression of dissent, allegations she denies. Hasina, 76, won a fourth straight term and fifth overall by sweeping Sunday's general election, which was boycotted by the main opposition Bangladesh Nationalist Party (BNP) for the second time in the last three polls because she refused to resign for a neutral government to oversee the vote. The daughter of the country's founding father, Sheikh Mujibur Rahman, who led Bangladesh's independence from Pakistan, Hasina was visiting Europe when most of her family were assassinated in a military coup in 1975. Born in 1947 in southwestern Bangladesh, then East Pakistan, Hasina is the eldest of five children. Hasina graduated with a degree in Bengali Literature from Dhaka University in 1973 and gained political experience as a go-between for her father and his student followers. She returned to Bangladesh from India, where she lived in exile, in 1981 and later joined hands with political foe and BNP chief Khaleda Zia to lead a popular uprising for democracy that toppled military ruler Hossain Mohammad Ershad from power in 1990. But the alliance with Zia did not last long and the bitter and deep-rooted rivalry between the two women, often called the \"battling begums\", went on to dominate Bangladeshi politics for decades. Hasina first led the Awami League to victory in 1996, serving a one five-year term before regaining power in 2009, never to lose again. She is credited with turning around the economy of the poor country of 170 million people and its export-dependent garments industry, before the Russia-Ukraine war led to a sharp increase in prices of fuel and food imports and the country had to seek a $4.7 billion bailout from the International Monetary Fund last year. Political opponents say she became increasingly autocratic as she consolidated power. Her son Sajeeb Wazed told Reuters in 2018 that Hasina regarded being called authoritarian a \"badge of honour\", that there was space for dissent in the country, and that the Western media was unfair in its portrayal of his mother. Zia, herself a former prime minister, was jailed in 2018 on graft charges which the opposition says were trumped up. The ailing former premier was allowed to stay at home in Dhaka under a special provision since the COVID pandemic but was barred from political activity. Zia's son, Tarique Rahman, is the acting chairman of the BNP party, but he is in exile after several charges were brought against him. He has denied all of them. The party's next most senior leader, Mirza Fakhrul Islam Alamgir, and several others have been in jail since a deadly protest at the end of October. BNP and rights groups say police arrested 10,000 opposition party workers on trumped up charges ahead of Sunday's general election after deadly anti-government protests in October. Police say they arrested only those responsible for the violence. Both Hasina and her rivals have accused their opponents of trying to create chaos and violence to thwart political peace and jeopardise democracy. Ahead of the latest election, Human Rights Watch said the government had failed to \"create an environment where all parties could agree to give Bangladeshis the right to choose their leaders in a free and fair vote\", while the International Crisis Group, a think tank, said the election lacked credibility. \nHasina said she did not need to prove the credibility of the election to anyone. \"What is important is if the people of Bangladesh will accept this election.\""
}