{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0U0TQ_L.jpg",
  "title": "Pennsylvania man accused of decapitating father and showing head on YouTube",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 31, 2024 02:49PM ET",
    "Updated Jan 31, 2024 05:41PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/pennsylvania-man-charged-with-decapitating-father-showing-head-on-youtube-3288767",
  "paragraph": "2/2\n© Reuters. Justin Mohn, a suspect arrested in his father's murder and decapitation, speaks on a Youtube broadcast from his home in the Levittown neighborhood of Middletown Township, Pennsylvania, U.S. January 30, 2024 in a still image from video. Youtube/ via REUTE\n2/2\n(Reuters) -A Pennsylvania man was ordered to be held without bail on Wednesday after being charged with killing his father and showing his decapitated head in a YouTube video, a local prosecutor said. Justin Mohn of Middletown Township was charged on Wednesday with first-degree murder, abuse of a corpse and possession of an instrument of crime in a Bucks County court, where a judge ordered to the 32-year-old to remain in custody, the district attorney's office said in a statement.  On Tuesday evening, police went to the family's Middletown Township home after receiving a call from Mohn's mother. There they found Mohn's 68-year-old father Michael decapitated in a bathroom with a large amount of blood around him and a knife and machete in the bathtub, the prosecutor said.  After the killing, Mohn posted a 14-minute video on YouTube titled \"Mohn's Militia - Call to Arms for American Patriots,\" police said in a probable-cause affidavit posted online. The video was viewed more than 5,000 times before it was taken down, CNN reported. During the video, Mohn showed viewers his father's head twice and identified him by his name, saying \"he is now in hell for eternity\" as he read from a script, police said in the document.  He also said his father, who worked for the federal government, was a traitor, railed against the Biden administration and described himself as a militia leader, NBC News reported.  The killing comes amid the most sustained spate of political violence in the United States since the 1970s, according to a Reuters investigation last year. That reporting documented at least 232 politically motivated acts of violence since Trump supporters stormed the U.S. Capitol on Jan. 6, 2021. Those attacks included riots and brawls at political demonstrations plus politically motivated beatings and killings. Among the 22 fatal incidents of political violence identified in the Reuters tally, at least 15 were attributed by police or prosecutors to assailants who expressed beliefs associated with the extreme right.  \nPolice were alerted when Mohn's mother reported she had not seen her son and that her husband's car was gone. Hours after police responded to the grisly scene, authorities took Mohn into custody at the Fort Indiantown Gap, a National Guard training center in Lebanon County, about 110 miles (177 km) from the home."
}