{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0G035_L.jpg",
  "title": "Canada minister says study permits to students from India drop due to dispute",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 22, 2024 03:09PM ET",
    "Updated Jan 22, 2024 07:06PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/canada-minister-says-study-permits-to-students-from-india-drop-due-to-dispute-3279988",
  "paragraph": "2/2\n© Reuters. FILE PHOTO: People walk on the grounds of the University of Toronto in Toronto, Ontario, Canada September 9, 2020. Picture taken September 9, 2020. REUTERS/Carlos Osorio/FILE PHOTO\n2/2\n(This Jan. 16 story has been corrected to reflect the lack of official figures for December in paragraph 6) By Steve Scherer OTTAWA (Reuters) - The number of study permits Canada issued to Indian students fell sharply late last year after India ejected Canadian diplomats who would process the permits and fewer Indian students applied due to a diplomatic dispute over the murder of a Sikh separatist leader in Canada, a top Canadian official told Reuters.  Immigration Minister Marc Miller added in an interview that he believes the number of study permits to Indians is unlikely to rebound soon. Diplomatic tensions erupted after Canada Prime Minister Justin Trudeau in September said there was evidence connecting Indian government agents to the murder of Hardeep Singh Nijjar in British Columbia. The tensions are likely to weigh on the numbers going forward, Miller said.  \"Our relationship with India has really halved our ability to process a lot of applications from India,\" Miller said.  In October, Canada was forced to pull 41 diplomats, or two-thirds of its staff, out of India on orders from New Delhi. In addition, the dispute has prompted Indian students to seek to study in other countries, a spokeswoman for the minister said. Those factors led to a more than 80% drop in study permits issued to Indians in October and November of last year compared with the first two months of the third quarter, according to official data that have not been previously reported. C. Gurusubramanian, counselor for the High Commission of India in Ottawa, said some Indian international students were looking at other options besides Canada due to \"concerns, in the recent past, regarding lack of residential and adequate teaching facilities\" at some Canadian institutions.  Indians have formed the largest group of international students in Canada in recent years, with more than 41% - or 225,835 - of all permits going to them in 2022. \"I can't tell you about how the diplomatic relationship will evolve, particularly if police were to lay charges,\" Miller said. \"It's not something that I see any light at the end of the tunnel on.\" International students are a cash cow for Canadian universities as they bring in about C$22 billion ($16.4 billion) annually and slowdown will be a blow to the institutions. In September, Canada said there were \"credible\" allegations linking Indian agents to the murder of Nijjar in a Vancouver suburb. India has rejected that allegation. Canadian authorities have yet to charge anyone for the killing. Last year, the U.S. Justice Department charged a 52-year-old man who had worked with an Indian government employee with plotting to assassinate a New York City resident who advocated for a Sikh sovereign state in northern India. The Canadian government also has been seeking to reduce the overall number of international students entering the country, in part as a response to an ongoing housing shortage. \"Right now we have a challenge with the sheer volume\" of students coming in, Miller said. \"It's just gotten out of control and needs to be reduced - I would say - significantly over a short period of time.\" Miller said the government would introduce other measures to lower the volume of international students during the first half of this year, including a possible cap.  Canada is a popular destination for international students since it is relatively easy to obtain work permits after finishing courses.  The government intends to address \"a very generous\" program for postgraduate work permits and to crack down on \"fly-by-night\" universities, called designated learning institutes, he said. \nThe government already plans curbs to the number of off-campus work hours for international students, which the food service and retail industries fear could cause labor shortages.  In 2023, the government projected that some 900,000 international students would study in Canada that year, about three times that of a decade ago. Miller said 40% of those students - or some 360,000 - were Indian. The number of permits given to Indian students declined by 4% last year, but they remained the largest group."
}