{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "Dozens of US lawmakers back resolution supporting Taiwan democracy",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 10, 2024 01:04PM ET",
    "Updated Jan 10, 2024 05:57PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/dozens-of-us-lawmakers-back-resolution-supporting-taiwan-democracy-document-3271737",
  "paragraph": "By Michael Martina and Patricia Zengerle WASHINGTON (Reuters) -Dozens of U.S. lawmakers co-sponsored legislation on Wednesday praising democracy in Taiwan ahead of its presidential and parliamentary elections, prompting China to call for the U.S. to stop official contact with the island. \"Resolved, That the Senate ... is committed to supporting Taiwan's self-defense and the liberty of its people through effective deterrence using all elements of United States power,\" read the resolution, which has at least 28 Republican and Democratic sponsors in the Senate. The resolution praises Taiwan's \"rule of law and vibrant civil society, diverse economy, and stable political system,\" and contrasts that with the situation in China.  Taiwan's voters head to the polls on Saturday for presidential and parliamentary elections that are taking place against a backdrop of a ramped-up war of words between Taiwan and China, which views the island as its own territory despite the strong objections of the Taiwanese government. Taiwan's government has accused China of an unprecedented campaign of election interference, using everything from military activity to trade sanctions to sway the vote toward candidates Beijing may prefer. The resolution's sponsors hope it will pass by unanimous consent this week.  Republican Dan Sullivan, who led the resolution with Democratic Senator Tim Kaine, said, \"I think it's really important for the United States in a bipartisan way to show steady, unwavering support and commitment to Taiwan's democracy and continue to undertake policies to enhance cross-Strait deterrence.\"  He stressed that the measure's backers are not choosing sides in Taiwan's presidential race. \"There's three strong candidates, three strong parties. Our commitment just needs to be to a fair process that's not undermined by coercive activities by Beijing,\" he told Reuters. Asked for comment on the resolution, Liu Pengyu, a spokesperson for China's embassy in the U.S., said in an emailed statement that China \"firmly opposes\" the U.S. having any official contact with Taiwan and said Washington must refrain from \"interfering\" in its elections. SECURITY ASSISTANCE IN LIMBO  The U.S. is Taiwan's most important international backer and arms supplier despite the lack of formal diplomatic ties with the island, which China views as its own territory. Democratic President Joe Biden asked the Senate last year to approve billions of dollars in security assistance for Taiwan, but lawmakers have not yet voted on his request. Republicans insist the aid package - which also includes money for Ukraine's war with Russia - be tied to an overhaul of U.S. immigration policy.  Sullivan said negotiators were \"making progress\" on the Taiwan component of the supplemental funding request, but that it depended on whether Democrats would agree to a significant border security component.  Republicans and Democrats in the House of Representatives introduced a nearly identical measure on Taiwan. The House version of the resolution is led by Democratic Representatives Gerald Connolly and Ami Bera, and Republicans Andy Barr and Mario Diaz-Balart, leaders of the Taiwan caucus. \nTaiwan's de facto ambassador to the United States, Alexander Yui, met with House of Representatives Speaker Mike Johnson on Tuesday, prompting a complaint from China. Beijing says Taiwan is the most sensitive and important issue in Sino-U.S. relations."
}