{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0H0ES_L.jpg",
  "title": "Texas school shooting victims 'deserved better' from police, US review finds",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 18, 2024 06:06AM ET",
    "Updated Jan 18, 2024 06:57PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Ken Roth",
        "2024-01-18 15:15:42",
        "I thought Texas had every nutcase under control with their gun policies and extreme right wing government???",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/us-justice-dept-to-release-report-on-uvalde-school-shooting-response-3277136",
  "paragraph": "© Reuters. Attendees hold candles during a vigil at Uvalde Memorial Park, one year after a gunman killed 19 children and two adults in Robb Elementary School, in Uvalde, Texas, May 24, 2023. REUTERS/ Evan Garcia/ File Photo\nBy Andrew Goudsward, Brad Brooks (Reuters) -Police failed in their response to the 2022 elementary school shooting in Uvalde, Texas, that killed 19 children and two teachers, the U.S. Justice Department concluded on Thursday, saying the victims \"deserved better.\" The report faulted law enforcement officers for waiting more than an hour to breach the classroom where the 18-year-old gunman was holed up with 33 students and three teachers, despite calls for help from the children. \"The victims and survivors of the mass shooting at Robb Elementary School deserved better,\" Attorney General Merrick Garland said during a press conference in Uvalde, adding that the law enforcement response \"was a failure that should not have happened.\" The report criticized responding officers for not immediately confronting the gunman, who remained in a set of adjoining classrooms with students and staff for 77 minutes until he was killed by a police tactical team. \"Lives would have been saved\" had police followed accepted practices and immediately advanced toward the shooter, Garland said. The review found that the first officers on scene moved to breach the classroom, but after being met with gunfire, law enforcement began approaching the situation as a \"barricaded subject scenario\" and not an active shooting. Law enforcement, including the chief of the school district police force, focused on evacuating other classrooms and requesting more police resources, leaving children trapped with the gunman, the report found. Officers waited outside in a hallway even as a child called 911 from inside the classroom and the gunman continued to shoot, according to the report. The report details the results of the department’s “Critical Incident Review,” of the law enforcement response, a review which began days after the shooting at the request of Uvalde’s then-mayor. HOPES 'THE FAILURES END TODAY' Kimberly Mata-Rubio, whose daughter Lexi was among those killed inside Robb Elementary, choked back sobs as she told reporters that she hoped the report means that \"the failures end today, and that local officials do what wasn't done that day, do right by the victims and survivors of Robb Elementary (with) terminations and criminal prosecutions.\" Families are still awaiting the results of a separate criminal investigation by local prosecutors and another independent review ordered by the city government. Uvalde County District Attorney Christina Mitchell said in a statement that \"while I am hopeful that the DOJ report will be informative, my office will continue our independent review for any potential criminal charges.\"  The City of Uvalde has filed multiple lawsuits against Mitchell, alleging that she's not doing her job and is engaged in a cover-up by not providing any information or transparency about her office's investigation. She did not immediately reply to a request for comment about the lawsuits. The city government of Uvalde said on Thursday that it has already made changes in law enforcement leadership and training. Ericka Miller, a spokesperson for the Texas Department of Public Safety, which had over 90 officers at the scene of the shooting, said in a written statement that \"as DPS Director Steven McCraw first stated in the weeks after the shooting, the law enforcement response that day was an abject failure, and this report's observations underscore those failures.\" The Justice Department report identified failures in law enforcement leadership, concluding that none of the law enforcement officials took charge at the scene. The review also found missteps in officials' communication with families and the public, including inaccurate social media posts stating that students were safe inside the school and a shooter was in custody. State and local officials later presented a misleading narrative of the shooting at press briefings, the report found. The review follows several state and local investigations that have also examined shortcomings in the response. \nThe shooting in a rural part of southwestern Texas, carried out by a former student, was one of the deadliest school shootings in U.S. history. Nineteen students, ranging from ages 9 to 11, were killed along with two teachers. The Justice Department’s Office of Community Oriented Policing Services led the assessment with the help of outside experts in emergency management, active shooter response and school safety."
}