{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0E0F4_L.jpg",
  "title": "Ukraine ground commander says his troops, now on 'active defence', can still surprise",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 15, 2024 10:07AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/ukraine-ground-commander-says-his-troops-now-on-active-defence-can-still-surprise-3274433",
  "paragraph": "3/3\n© Reuters. Colonel general Oleksandr Syrskyi, Commander of the Ukrainian Ground Forces, attends an interview with Reuters, amid Russia's attack on Ukraine, in Kharkiv region, Ukraine January 12, 2024. REUTERS/Valentyn Ogirenko\n2/3\nBy Dan Peleschuk KHARKIV REGION, Ukraine (Reuters) - His demeanour is dispassionate and his message is clear: Ukraine's ground forces are focused first and foremost on defence along the eastern stretch of the 1,000-km (600-mile) front under his command.  They should not be counted out, however, as an offensive force.  In an interview late last week, Colonel-General Oleksandr Syrskyi - a key figure in Kyiv's response to Russia's full-scale invasion - underlined the shifting realities on the battlefield that have tempered hopes of a major Ukrainian breakthrough. Despite initial optimism for a much-vaunted Ukrainian summer counteroffensive, Russian defences largely held, limiting early advances to a few kilometres in some spots before Moscow's forces hit back elsewhere. \"Our goals remain unchanged: holding our positions ... exhausting the enemy by inflicting maximum losses,\" Syrskyi, Ukraine's number two commander, told Reuters. The 58-year-old, wearing combat fatigues and speaking cautiously at an undisclosed location in the eastern region of Kharkiv, noted how Russia was looking to seize the initiative as the invasion neared its second anniversary. They were pressing in multiple directions along the eastern front, Syrskyi said, with the aim of wresting full control of the industrial Donbas region despite heavy losses in men and supplies. Russia also hopes to claw back ground it lost in the southern Kherson and Zaporizhzhia regions, he added. Ukrainian troops, for their part, are staging smaller counter-attacks in what Syrskyi described as \"active defence\": keeping the enemy on its toes by seeking opportunities to strike while they look to regain the initiative. Engagements on both sides are on a smaller scale to conserve ammunition and men, he added, suggesting Russia has also learned to react and stem losses. \"Offensives at the level of a battalion are a major rarity,\" said Syrskyi, adding that wider use of drones has forced the change in tactic. Ukraine says it does not have enough ammunition to sustain the desired level of attacks, and has urged Western partners to do more to supply it. 'CUNNING AND COURAGEOUS' Syrskyi has commanded troops against combined Russian forces since 2014, when he earned his call sign \"snow leopard\". They fought a Moscow-backed insurgency in eastern Ukraine using \"tactics that were similar to how this cat hunts,\" he explained. \"This creature is very careful, cunning and courageous.\" He burnished his reputation in September 2022, leading a lightning counteroffensive to retake swathes of the Kharkiv region which stunned Russian forces into a retreat. The operation capitalised on Ukraine's strengths, particularly nimble units capable of bypassing fortified positions to drive deep into enemy territory. But Syrskyi's record as a commander is not unquestioned. Through much of early 2023, he led Ukraine's defence of the eastern city of Bakhmut, where thousands of soldiers on both sides are widely believed to have been killed in the deadliest battle of the conflict so far. Some military analysts questioned whether fighting for a ruined city that was ultimately lost was worth so many dead and wounded. Syrskyi said Ukraine harmed Russia's war effort there by neutralising the Wagner mercenary group. Moscow still considers him a threat, Syrskyi said, evidenced by more than one assassination attempt. \"Let's say this: we're familiar with rocket strikes,\" he said. With artillery and trench warfare yielding few major advances, Syrskyi agreed with Ukraine's top commander Valery Zaluzhny that technology would likely play a major role if Kyiv wanted to win the war. Electronic warfare has intensified over the past year, Syrskyi said, as the proliferation of drones and other guided weaponry has created more opportunities for jamming. To gain an advantage, Ukrainian forces need higher quantities of advanced kit that works across multiple frequencies at once. But there were still opportunities to advance by creating what Syrskyi called a \"artificial advantage\", just as Ukraine had done in the fall of 2022. \n\"No matter what, there will be certain areas that will be heavily defended, and other areas less defended,\" he said. The key, Syrskyi added, was to concentrate forces at the most vulnerable point at the best time, a principle which \"has not lost its relevance\"."
}