{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK12084_L.jpg",
  "title": "Forest fires kill 51 in Chile, menace urban areas",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 03, 2024 12:23PM ET",
    "Updated Feb 04, 2024 09:47AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/raging-forest-fires-kill-at-least-19-in-chile-toll-expected-to-rise-3291925",
  "paragraph": "8/8\n© Reuters. Smoke from wildfires blankets the sky in Vina Del Mar, Chile February 2, 2024. REUTERS/Rodrigo Garrido \n2/8\n(Reuters) -Forest fires raging in central Chile have killed at least 51 people and the death toll is likely to keep climbing, authorities said on Saturday, as emergency services battled to snuff out flames threatening urban areas. Black smoke billowed into the sky over many parts of the Valparaiso region, home to nearly one million inhabitants in central Chile, while firefighters using helicopters and trucks struggled to quell the fires. Areas around the coastal tourist city of Vina del Mar have been some of the hardest hit and rescue teams were struggling to reach all the affected areas, Chilean authorities said. The death toll rose when five bodies were found on public roads, and information indicates \"we are going to reach much higher figures\" in coming hours, said Interior Minister Carolina Toha. \"The condition of Valparaiso is the most delicate,\" Toha said, saying the country was facing its worst disaster since a 2010 earthquake that killed about 500. President Gabriel Boric told the nation in a televised address, \"The situation is really very difficult.\" Wildfires are not uncommon in Chile over summer months. Last year, on the back of a record heat wave, some 27 people died and more than 400,000 hectares (990,000 acres) were affected. \"The area with fires today is much smaller than last year, (but) at this time the number of hectares affected is multiplying very rapidly,\" Toha said. \nBetween Friday and Saturday the area affected by the wildfires increased to 43,000 hectares (110,000 acres) from 30,000.  Toha said the authorities' greatest concern was that some of the active fires were developing very close to urban areas \"with the very high potential to affect people, homes and facilities.\""
}