{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0E09X_L.jpg",
  "title": "US Deputy Treasury Secretary to discuss use of new Russia sanctions authority in trip to Europe, Japan",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 15, 2024 06:19AM ET",
    "Updated Jan 15, 2024 07:13AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-deputy-treasury-secretary-to-discuss-use-of-new-russia-sanctions-authority-in-trip-to-europe-japan-3274382",
  "paragraph": "© Reuters. U.S. Treasury Department Deputy Secretary Wally Adeyemo attends the Reuters NEXT Newsmaker event in New York City, New York, U.S., December 1, 2022. REUTERS/Brendan McDermid\nBy Daphne Psaledakis WASHINGTON (Reuters) - U.S. Treasury Deputy Secretary Wally Adeyemo will travel to Europe and Japan this month, where he will coordinate with partners on the use of a new Russia sanctions authority that takes aim at financial institutions, a Treasury spokesperson told Reuters. Adeyemo will travel to Rome, Berlin, Frankfurt and Tokyo from Jan. 16-23, where he will meet with G7 partners as well as key private sector representatives, including financial institutions, academics and other industry leaders, to discuss the executive order, the spokesperson said. The trip, first reported by Reuters, comes after U.S. President Joe Biden last month signed an executive order threatening penalties for financial institutions that help Russia circumvent sanctions, as Washington seeks to increase pressure on Moscow over its invasion of Ukraine. \"The Deputy Secretary will coordinate with key G7 partners in Italy, Germany, and Japan on using this new tool to crack down on Russian attempts to evade sanctions and obtain critical goods for its military from G7 economies,\" the spokesperson, speaking on condition of anonymity, said. The order also gave Washington the ability to broaden import bans of certain Russian goods, such as seafood and diamonds. Adeyemo's trip to Europe and Japan comes ahead of the two-year anniversary of Russia's February 2022 invasion, which has killed or wounded tens of thousands and reduced cities to rubble. Washington and its allies have imposed rafts of sanctions targeting Moscow since its invasion of Ukraine, including sanctions on Russian banks, oligarchs and President Vladimir Putin. The United States has continued to ratchet up pressure on Russia and has sought to crack down on Moscow's evasion of the sanctions. The executive order issued last month clarifies that the U.S. can target financial institutions involved in transactions on behalf of those hit with U.S. sanctions or tied to Russia's military industrial base, including the sale of certain critical items. Senior administration officials said at the time it was being issued in coordination with allies. The United States has repeatedly warned companies against skirting U.S. sanctions imposed on Russia, and has targeted firms in the United Arab Emirates, Turkey and China that it has accused of helping Moscow avoid the measures. \nSenior U.S. officials have also traveled to Turkey, the UAE and other countries to warn that businesses could lose access to G7 markets if they do business with entities subject to U.S. curbs. While in Japan, Adeyemo will also discuss energy security and the G7 price cap on Russian oil, and will discuss the Inflation Reduction Act and collaboration between the U.S. and Europe on bolstering the resilience of critical supply chains while in Italy and Germany, the spokesperson said."
}