{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0S0KL_L.jpg",
  "title": "Palestinians in Gaza see UNRWA funding cuts as 'death sentence'",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 29, 2024 12:10PM ET",
    "Updated Jan 30, 2024 11:43AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/palestinians-in-gaza-see-unrwa-funding-cuts-as-death-sentence-3286293",
  "paragraph": "5/5\n© Reuters. A Palestinian girl looks at bags of flour distributed by the United Nations Relief and Works Agency (UNRWA), amid the ongoing conflict between Israel and Hamas, in Rafah in the southern Gaza Strip January 29, 2024. REUTERS/Ibraheem Abu Mustafa\n2/5\nBy Fadi Shana and IbraheemAbu Mustafa RAFAH, Gaza Strip (Reuters) - Palestinian mother Mazouza Hassan stood aghast at the potential threats to the work of the U.N. agency that handles most aid in Gaza after some Western states suspended funding to it over allegations employees took part in the Hamas attack on Israel. \"We are thrown into tents and our children need to be vaccinated and pregnant women need to give birth ... Where will these people go?\" said Hassan, one of the 85% of Gaza residents made homeless by Israel's military campaign in Gaza. The war has plunged Gaza into a humanitarian catastrophe, leaving its shelled-out population at risk from famine and disease with the medical system in collapse, schools turned into shelters and much of the population living in tents. For many of Gaza's 2.3 million Palestinians, the United Nations Relief and Works Agency for Palestine Refugees (UNRWA) was already critically important even before the latest Israel-Hamas war began on Oct. 7.  UNRWA ran Gaza's schools, primary healthcare clinics and other social services. As the main conduit for aid in the tiny, crowded enclave it now stands to many Palestinians as a last barrier between them and total disaster.  An UNRWA spokesperson said the agency would not be able to continue such operations after February if funding were not resumed. More than 10 countries including major donor the United States have suspended funding.  \"UNRWA is our future and our life from the beginning until today. Who will support us?\" Hassan said, standing near her children in Rafah at the southern end of the Gaza Strip.  The agency employs about 13,000 people in Gaza, part of a total workforce of about 30,000 working with Palestinian refugees around the Middle East.  Israel has alleged that 13 of UNRWA's Gaza employees took part in the surprise Hamas incursion into Israel that killed more than 1,200 people and triggered the conflict. A dossier Israel has produced says a total of 190 UNRWA staff have also been militants with Hamas or Islamic Jihad. The agency has said it has fired some staffers and is investigating Israel's allegations.  Israel's assault on Gaza since Oct. 7 has killed at least 26,600 people, say health authorities in the Hamas-run enclave, prompting a South African charge of genocide, denied by Israel, at the International Court of Justice.  'DEATH SENTENCE' At an UNRWA aid distribution point in Rafah, a city on the border with Egypt swollen by displaced people, men toted heavy sacks of flour as Palestinians stood in line for supplies.  Former UNRWA spokesperson Chris Gunness said the organisation had long faced funding problems as it worked to provide core services such as education. However, it was UNRWA's emergency humanitarian work that he now feared for most.  \"Its emergency programme now is most important. You can't procure food if you have no money to pay suppliers,\" he said.  \"The real risk is that the most desperate people, women with newborn babies turning up for food and medicine and water and hygiene products, will face the worst impact.\"  One man waiting at the distribution centre, Ahmed al-Nahal, called the funding halts \"a death sentence\", saying people would starve in the streets if aid supplies were halted.  \"If it were not for God and then the UNRWA agency, we would be dead,\" he added.  UNWRA was founded in 1948 to carry out relief operations for Palestinian refugees from the war which accompanied the foundation of the state of Israel. Israel has long called for it to be dismantled, arguing its mission is obsolete and that it fosters anti-Israeli sentiment among its staff, which the agency denies. \"It is about time to dissolve UNRWA and to think about other ways to support the Palestinians,\" said Israeli lawmaker Danny Danon from Prime Minister Benjamin Netanyahu's Likud party.  \nCooking flat bread with UNRWA-supplied flour in a homemade oven next to the tent where she now lives, Umm Hassan al-Masry said she relied on the agency for everything.  \"We are waiting for their aid by the hour,\" she said."
}