{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0607S_L.jpg",
  "title": "Mexican authorities investigate massacre after rival criminal groups clash in remote desert",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 07, 2024 11:37AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/mexican-authorities-investigate-massacre-after-rival-criminal-groups-clash-in-remote-desert-3268706",
  "paragraph": "2/2\n© Reuters. Authorities take part in an operation following an attack by an armed group, in Buenavista de los Hurtado, Guerrero state, Mexico, in this handout distributed on January 6, 2024. Fiscalia General del estado de Guerrero/Handout via REUTERS\n2/2\nMEXICO CITY (Reuters) - Mexican authorities in the violence-plagued southwestern state of Guerrero said they were investigating a gruesome massacre that took place in a part of a remote desert where two rival criminal groups have been fighting for control. Police investigators had found five burned bodies stacked onto a burned vehicle when they arrived in Buenavista de los Hurtado on Friday, the state attorney general said in a statement shared late on Saturday. Citing footage shared by alleged members of the Familia Michoacana on social media and interviews with unnamed sources in the area, local media reported that 30 people had died after a drone attack.  In the footage shot in the desert, heavily armed men dressed in military clothing were shown piling bodies - some naked, their clothes scattered around the ground - on the hood and the rear of a red pickup riddled with bullet holes.  Some of the men appeared to have limbs cut off and at least one had a head missing.  A severed head is shown being arranged atop the human pile by one man while another, holding the camera and filming the pickup from all sides, says in heavy Mexican swear words to \"send more.\"  Since being posted on Friday night, the video racked up 3.1 million views on X, the platform formerly known as Twitter.  Reuters was unable to independently verify the video, but several local media later published widely-shared videos showing what appeared to be the same pickup and burned bodies. Mexican authorities in the statement said they were aware of a \"confrontation between the criminal groups of Familia Michoacana and Los Tlacos, which have a running dispute for control of the area.\" \nPolice investigators in the area found no evidence of other crimes, the statement said, adding that villagers had declined to give DNA samples that would allow for the identification of the remains and advance investigations.  Reuters was unable to get comment from villagers."
}