{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK010HP_L.jpg",
  "title": "Hamas' Arouri was a key player until death in sudden Beirut strike",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 02, 2024 02:20PM ET",
    "Updated Jan 02, 2024 02:55PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Stoxer One",
        "2024-01-03 07:02:11",
        "A downright eulogy by Reuters for this ter/rorist s c u m.",
        "https://www.investing.com/members/200770726"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/hamas-arouri-was-a-key-player-until-death-in-sudden-beirut-strike-3265728",
  "paragraph": "© Reuters. FILE PHOTO: Head of Hamas delegation Saleh al-Arouri speaks during a reconciliation deal signing ceremony in Cairo, Egypt, October 12, 2017. REUTERS/Amr Abdallah Dalsh/File Photo\nBy Nidal al-Mughrabi CAIRO (Reuters) -Deputy Hamas leader Saleh al-Arouri had long expected the Israeli drone strike that security sources said killed him in Beirut on Tuesday, three months after his group's surprise cross-border assault that triggered a devastating war in Gaza.  \"I am waiting for martyrdom and think that I lived too long,\" he said in August, as he urged Palestinians in the Israeli-occupied West Bank to take up arms amid a surge of violence.  His killing comes at a defining moment for the organisation, as Israel attempts to eradicate it in retaliation for the Oct. 7 attack, when Hamas fighters rampaged across the border, killing 1,200 people and seizing 240 hostages.  Israel has long accused him of lethal attacks on its citizens, but a Hamas official said he was also \"at the heart of negotiations\" over the outcome of the Gaza war and the release of hostages conducted by Qatar and Egypt.  \"Whoever did this did a surgical strike against the Hamas leadership,\" said Mark Regev, a senior adviser to Israel's prime minister. Israel does not typically confirm or deny responsibility for such attacks.  Though less influential than Hamas' leaders in Gaza, Arouri was seen as a key player in the movement, masterminding its operations in the West Bank from exile in Syria, Turkey, Qatar and finally Lebanon after long stints in Israeli prisons.  As the group's senior official in Lebanon he played a big role in cementing Hamas' relations with the Lebanese Shi'ite group Hezbollah, and through it with Iran, the main backer for both groups.  Arouri met Hezbollah leader Hassan Nasrallah several times, as well as Iranian officials in Lebanon and Hamas sources said he worked with them to coordinate positions regarding the conflict in Gaza.  Hamas has confirmed his death but not otherwise commented. Islamic Jihad, an allied group, swore revenge for his killing in a statement on Tuesday, saying it would \"not go unpunished\". Within Hamas, Arouri was described as a leading advocate of reconciliation between rival Palestinian factions, enjoying a good relationship with Fatah, the party of Palestinian President Mahmoud Abbas which holds sway in the West Bank.  Hamas and Fatah have been at odds for years, fighting a brief civil war in 2007 when Hamas seized power in Gaza, though the rival organisations have continued to hold periodic negotiations.  But when it came to the conflict with Israel, Arouri was seen as a hardliner. He helped found the group's military wing, the Izz el-Deen al-Qassam Brigades, and Israel accused him of orchestrating deadly attacks over the years.  It says he was behind the kidnapping and killing of three Israeli teenagers in the West Bank in 2014, an act that triggered a seven-week Israeli assault on Gaza that killed 2,100 Palestinians.  ATTACKS As Israel's occupation of the West Bank continued, with Jewish settlements expanding and Palestinian statehood appearing ever more distant, Arouri said there was \"no other option\" but to engage in what he called comprehensive resistance.  He was one of the senior Hamas officials behind the group's strong expansion into the West Bank, where its gunmen have carried out a string of attacks on Israeli settlers over the past 18 months.  Several shootings last year took place shortly after Arouri had made televised threats against Israel.  With the group's Gaza leaders Yahya Sinwar, Mohammed Deif and Marwan Issa in deep hiding, Arouri was closely involved in negotiations around the war, saying in December that no more hostages would be released until there was a full ceasefire. As a member of Hamas' politburo under the group's Qatar-based overall leader Ismail Haniyeh, Arouri was well used to dialogue, even - indirectly - with his bitter enemies the Israelis.  In 2011, soon after his own release from prison, Arouri was one of the Hamas negotiators involved in a prisoner swap with Israel that the group hopes to replicate after the current war using hostages seized on Oct. 7. Born near Ramallah in the West Bank in 1966, Arouri was an early recruit to Hamas, joining the movement when it was formed in 1987 as Palestinians began their first Intifada uprising against Israeli occupation.  He was jailed in 1992, a year before Fatah's leadership agreed the Oslo accords with Israel, accepting its existence and abandoning armed struggle in favour of a push to negotiate the creation of a Palestinian state.  \nHamas rejected that approach and when Arouri was released in 2007 he soon returned to the struggle. He was jailed again until 2010 when the Israeli high court ordered his expulsion. He spent three years in Syria before moving to Turkey until Israel pressed Ankara to make him leave in 2015. He has since been residing in Qatar and Lebanon, working from Hamas' office in Beirut's Dahiyeh district, a Hezbollah stronghold, until Tuesday's sudden strike."
}