{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0L0T2_L.jpg",
  "title": "US pushes for pause in Gaza as Israel suffers worst loss of soldiers",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 22, 2024 06:39PM ET",
    "Updated Jan 23, 2024 05:28PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-calls-for-israel-to-protect-innocent-as-forces-storm-gaza-hospital-3280115",
  "paragraph": "By Arafat Barbakh, Emily Rose and Jeff Mason GAZA/JERUSALEM/WASHINGTON (Reuters) - Intense international mediation efforts are working toward exchanging Israeli hostages for Palestinian prisoners during a proposed month-long ceasefire in Gaza, Reuters reported on Tuesday, as the White House said its envoy was having active discussions on the issue.  Qatar, the U.S. and Egypt have held shuttle diplomacy since Dec. 28 and Israel and Hamas broadly agree in principle to the framework plan, sources said. It is being held up by the two sides' differences over how to bring a permanent end to the Gaza war, sources said. The U.S. State Department and White House, Qatar's foreign ministry and Egypt's State Information Service did not immediately respond to requests for comment on the Reuters report.  On Monday, Israel suffered its worse loss of soldiers in over three months of conflict, 24 deaths in two separate incidents. Israeli officials reiterated that the objectives of its war against the Palestinian Hamas movement that runs Gaza were unchanged and that efforts were being made to bring about release of more than 100 hostages. Prime Minister Benjamin Netanyahu said: \"In the name of our heroes, for the sake of our lives, we will not stop fighting until absolute victory.\" Israeli government spokesman Eylon Levy said there would be no ceasefire that left Hamas in power and hostages in Gaza, following the militant group's cross-border rampage on Oct. 7 in which some 1,200 Israelis were killed. Palestinian health officials said at least 195 Palestinians had been killed in the past 24 hours, raising the documented death toll from Israeli air strikes and shelling to 25,490. Thousands more are feared lost in the rubble. \"The entire population of Gaza is enduring destruction at a scale and speed without parallel in recent history,\" United Nations Secretary-General Antonio Guterres told the Security Council. \"Nothing can justify the collective punishment of the Palestinian people,\" he said, denouncing Israel's opposition to creation of a Palestinian state that would exist alongside Israel.  The soldiers' deaths came on the day the Israeli military launched its biggest operation in a month, to seize remaining parts of Khan Younis, encircling Gaza's main southern city that is sheltering hundreds of thousands of displaced Palestinians. Israeli forces have killed more than 100 militants in western Khan Younis in the past 24 hours, military spokesman Rear Admiral Daniel Hagari said on Tuesday evening. Israel says it has killed around 9,000 militants in total. Reuters is unable to verify the number.  U.S. ENVOY IN CAIRO Earlier in the day, Qatar's foreign ministry spokesperson Majed Al-Ansari said it had \"presented ideas to both sides, we are getting a constant stream of replies from both sides, and that in its own right is a cause for optimism.\" Later, White House spokesperson John Kirby (NYSE:KEX) said U.S. Middle East envoy Brett McGurk was in Cairo and would travel in the region for \"active\" discussions on ensuring release of hostages and securing a humanitarian pause. \"The conversations are very sober and serious about trying to get another hostage deal in place,\" Kirby told reporters. Each of the warring sides blamed the other for causing the collapse of a seven-day truce in November by rejecting terms to extend the daily release of hostages held by militants in exchange for Palestinian detainees. Women, children and foreign hostages were freed, but mediators failed at the final hour to find a formula to release more, including Israeli soldiers and civilian men. TANKS SHUT KHAN YOUNIS ROAD Hamas' armed wing said it was responsible for a rocket attack that killed 21 Israeli soldiers on Monday. Israeli military spokesperson Rear Admiral Daniel Hagari told reporters in Tel Aviv that the militants' rockets hit a building where Israeli forces had laid explosives to demolish it. The strike caused that building and one next to it to collapse, he said.  Three soldiers were killed in a separate attack. In total, 220 Israeli soldiers have been killed since the start of the ground offensive in late October. On Tuesday, advancing Israeli tanks shut the road out of Khan Younis towards the Mediterranean coast, blocking the escape route for civilians trying to reach Rafah, the last town on Gaza's southern edge bordering Egypt - now crammed with more than half the enclave's 2.3 million people. The Israelis have blockaded hospitals, which Palestinian officials say makes it impossible to rescue the wounded. At the European Hospital, reached by Reuters in southern Khan Younis, Ahed Masmah brought in five corpses, piled on a mattress on his donkey cart. \"I found them face down in the street,\" he said.  At Khan Younis' main Nasser hospital, the biggest still functioning in the Gaza Strip, bodies were being buried on the grounds because it was unsafe to go out to the cemetery.  Ashraf Al-Qidra, spokesperson for Gaza's health ministry, said medical teams were unable to transfer critical cases from the Nasser Medical Complex to the nearby Jordanian field hospital due to ongoing shelling. \nIsrael says Hamas fighters operate in and around hospitals, which hospital staff and Hamas deny. Martin Griffiths, U.N. coordinator of emergency relief, said on Tuesday that 24 people were killed in strikes on an aid warehouse, U.N. centre and humanitarian zone in the Khan Younis area. A distribution centre where families receive aid was under heavy bombardment, he said on social media platform X."
}