{
  "image": "https://i-invdn-com.investing.com/news/Ethereum_800x533_L_1637103971jpg_800x533_L_1637446954.jpg",
  "title": "Samson Mow Takes Subtle Jab at Ethereum (ETH), Is XRP Next?",
  "category": "Cryptocurrency news",
  "publisher": "U.Today",
  "date": "Published Feb 05, 2024 01:58PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/cryptocurrency-news/samson-mow-takes-subtle-jab-at-ethereum-eth-is-xrp-next-3293073",
  "paragraph": "U.Today - Samson Mow, the chief executive officer of investment firm Jan3 and prominent Bitcoin (BTC) bull and evangelist, has taken his advocacy for the top coin to a new level. In his latest post on X, he took a subtle jab at alternative investment assets, including Silver and Ethereum (ETH), as his way of reducing their viability in comparison to their counterparts Gold and Silver.\nSamson Mow analogyAccording to Samson Mow, Silver is the poor man’s Gold, a statement that shows that investors who consider the latter to be too expensive typically opt in for the former. While both are respected metals and investment assets, Gold is still considered the superior of the two.Samson Mow deflated Ethereum’s ego to end the long-standing superiority debate with Bitcoin. The vocal investor noted that \"Ethereum is the stupid man's Bitcoin,\" a statement that spooked members of the ETH community.\nBy valuation, Bitcoin’s market cap currently stands at $809,923,408,001, while that of Ethereum comes in at $297,575,053,741. The price differentials of $41,344.01 to $2,476.66 also show that Bitcoin is the most valuable of the two. Over time, there have been conversations about shifting capital from BTC to ETH, a trend that might be amplified in the coming months if Ethereum’s key fundamentals come into play.\nThe harsh criticism of Ethereum did not go down well with its community members, with some pointing out the key improvements the protocol has made as a blockchain in itself.\nIs XRP next?As a Bitcoin Maxi, Samson Mow was asked by one of the commenters on his post what he thinks about XRP if Ethereum is the poor man’s Bitcoin. He simply answered that the demand is a \"tricky one.\"Samson Mow’s confidence in Bitcoin has made him forecast a $1 million price target, and his lack of confidence in XRP and Ethereum has undoubtedly made his bearish stand subtle.\nThis article was originally published on U.Today"
}