{
  "image": "https://i-invdn-com.investing.com/news/Ethereum_800x533_L_1556445174.jpg",
  "title": "Ethereum's Vitalik Buterin Makes Surprising Visit to Binance, SHIB Rep Shares Shibarium's Plans to Onboard Thousands of Projects: Crypto News Digest by U.Today",
  "category": "Cryptocurrency news",
  "publisher": "U.Today",
  "date": [
    "Published Feb 04, 2024 01:58PM ET",
    "Updated Feb 04, 2024 05:01PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/cryptocurrency-news/ethereums-vitalik-buterin-makes-surprising-visit-to-binance-shib-rep-shares-shibariums-plans-to-onboard-thousands-of-projects-crypto-news-digest-by-utoday-3292110",
  "paragraph": "U.Today - Take a look at the most important crypto events with U.Today's top three news stories.\nEthereum's Vitalik Buterin makes surprising visit to BinanceAs has been recently shared by Binance CEO Richard Teng on the X platform, Ethereum cofounder Vitalik Buterin made a surprising visit to the Binance office. Teng thanked Buterin for finding time to speak to his team in person, saying that it was a privilege to have him in the company's office. This spontaneous visit caused quite a stir in the crypto community, with many users speculating about a potential collaboration between these two giants of the crypto market. As a reminder, Binance is currently struggling with a $4 billion fine and ongoing regulatory challenges; considering this, Buterin's focus (described in his essay entitled \"Make Ethereum Cypherpunk Again\") on security, privacy and scalability, and concern for centralized exchanges and their vulnerability to hacking, feed rumors about possible cooperation between Buterin and Binance. However, neither Buterin nor Teng made any statements in this regard.Shibarium: Thousands of projects to join L2 network with numerous partnerships – SHIB repIn a recent X post, Shiba Inu team member Lucie shared Shibarium's plans for the future. Lucie wrote that the layer-2 solution aims to \"onboard 1,000 projects with numerous partnerships,\" reminding the community that supporting new projects does not necessarily mean canceling existing ones. The SHIB representative then called on all meme token supporters to stay strong as a community during challenging times, stating that there is hardly any point in giving up now if they got \"this far\" in their support for the project's team. Lucie's post has evoked mixed reactions among SHIB army members; even though many of them praised the SHIB developers, some users questioned the project team's ability to accomplish anything more than just making plans and promising new advances.JPMorgan: Bitcoin ETF hype coolingAccording to Kenneth Worthington, analyst at JPMorgan, the initial enthusiasm surrounding Bitcoin ETFs may be waning, with a shift toward a \"more normalized flow environment\" being potentially on the horizon. On Jan. 26, spot Bitcoin ETFs experienced net sales of about $15 million following a four-day streak of redemptions. This reversal could be an indication of changing investor sentiment on these novel financial products. Since their launch, the Bitcoin price has plunged by about 9% but has since stabilized around $42,000 as the new trading week gets underway. Previously, JPMorgan correctly predicted that the approval of Bitcoin ETFs would be a sell-the-news event. Before the approval, the price of the leading cryptocurrency dropped from above $47,000 to below $39,000. The sell-off coincided with large outflows from Grayscale’s Bitcoin Trust (GBTC), which transitioned into a spot Bitcoin ETF after the SEC's approval. This article was originally published on U.Today"
}