{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBP089_L.jpg",
  "title": "Rapper Ye, the former Kanye West, apologizes in Hebrew for anti-Jewish remarks",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 26, 2023 08:53AM ET",
    "Updated Dec 26, 2023 02:25PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/rapper-kanye-west-apologies-to-jewish-community-for-antisemitic-remarks-3263573",
  "paragraph": "By Kanishka Singh and Dan Williams (Reuters) - The rapper Ye, formerly known as Kanye West, issued an apology in Hebrew to the Jewish community on Tuesday for his past antisemitic remarks, saying he sought forgiveness and regretted any pain that his words had caused. Ye's apology, posted to X and Instagram, follows reports that the release of his new album, \"Vultures,\" has been delayed until January. The release has been pushed back several times from its original date in October. The artist sparked outrage last year after he made a series of antisemitic social media posts, including one that appeared to accuse musician Sean \"Diddy\" Combs of being controlled by \"the Jewish people\" and another that appeared to show a swastika symbol inside a Star of David.  The Anti-Defamation League (ADL) advocacy group, which documents antisemitism, had described the musician's remarks as inflammatory and conspiratorial. It said he was directly referenced in 59 antisemitic incidents tracked by the group during 2022. \"I sincerely apologize to the Jewish community for any unplanned outburst... It was not my intent to hurt or disrespect, and I very much regret any pain I may have caused,\" the musician wrote on Instagram in Hebrew. The ADL welcomed the rapper's apology on Tuesday while noting the impact of his past remarks. \"Ultimately, actions will speak louder than words but this initial act of contrition is welcome,\" the ADL said in a statement. Ye's remarks led to him losing his partnership with Adidas (OTC:ADDYY) and Gap for Yeezy products, as well as restrictions on his social media accounts at the time. \"I am committed to begin with myself and to learn from this experience in order to ensure greater sensitivity and understanding in the future,\" Ye wrote on Tuesday. \n\"Your forgiveness is important to me,\" he wrote, adding that he was committed to making amends and advancing unity. The rapper's comments on social justice issues have also sparked controversy, including in 2022 when he used a racial slur to describe comedian Trevor Noah. The same year he wore a shirt with \"White Lives Matter\" on it at Paris Fashion Week."
}