{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0P01G_L.jpg",
  "title": "World Court says Israel must prevent genocide in Gaza, stops short of ceasefire order",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 25, 2024 08:49PM ET",
    "Updated Jan 27, 2024 01:31AM ET"
  ],
  "comments": [
    2,
    [
      [
        "Santosh Oak",
        "2024-01-27 10:02:43",
        "Is the ICJ strong enough or Just enough to order JEHADI terrorists to refrain from spreading terror? ",
        "https://www.investing.com/members/233913887"
      ],
      [
        "Carl Tom",
        "2024-01-27 09:45:22",
        "Jews are new. atzi🦴",
        "https://www.investing.com/members/248294422"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/israel-braces-for-world-court-ruling-focuses-attack-on-south-gaza-3283632",
  "paragraph": "3/3\n© Reuters. An Israeli tank manoeuvres near the Israel-Gaza border, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, in Israel, January 25, 2024. REUTERS/Amir Cohen\n2/3\nBy Stephanie van den Berg, Bassam Masoud and Nidal al-Mughrabi THE HAGUE/GAZA (Reuters) -The World Court ordered Israel on Friday to prevent acts of genocide against Palestinians and do more to help civilians, although it stopped short of ordering a ceasefire as requested by the plaintiff South Africa. While the ruling denied Palestinian hopes of a binding order to halt the war in Gaza, it represented a legal setback for Israel, which had hoped to throw out a case brought under the genocide convention established in the ashes of the World War Two Holocaust that targeted European Jews. The International Court of Justice (ICJ) found there was a case to be heard about whether Palestinian rights were being denied in a war it said was causing grievous humanitarian harm. It also called for Palestinian armed groups to release hostages captured in the Oct. 7 attacks on Israel that precipitated the conflict. The Palestinian Foreign Ministry said the decision was a welcome reminder \"no state is above the law\". Senior Hamas official Sami Abu Zuhri told Reuters it would contribute to \"isolating the occupation and exposing its crimes in Gaza\". Israeli Prime Minister Benjamin Netanyahu welcomed the ICJ's decision not to order a ceasefire, but rejected the claim of genocide as \"outrageous\" and said Israel would continue to defend itself. REPORT BACK IN A MONTH Israel had sought to have the case thrown out when South Africa brought it to the ICJ, also known as the World Court, this month under the legal principle that genocide is such a grave crime that all countries are duty-bound to prevent it. Pretoria accused Israel of state-led genocide in its offensive, begun after Hamas militants stormed into Israel killing 1,200 and kidnapping more than 240. It asked the court to grant emergency measures to halt the fighting, which Palestinian officials say has killed more than 26,000 Palestinians and displaced the majority of the population in a more than three-month campaign of intensive bombardment. The ICJ judges ordered Israel to take all measures within its power to prevent its troops from committing genocide, punish acts of incitement, take steps to improve the humanitarian situation and report back on its progress in a month. It did not decide the merits of the genocide allegations, which could take years. Although the ruling cannot be appealed, the court has no mechanism to enforce its decision. In reading out the decision, ICJ President Judge Joan Donoghue described the plight of Palestinians in Gaza, singling out harm to children and quoting detailed descriptions of the humanitarian emergency from U.N. officials. This, she said, justified the court's decision to take emergency action to prevent irreparable harm. She also read out calls from Israeli officials for a harsh campaign, which she said justified the court's order to Israel to punish people guilty of incitement. Israel called South Africa's allegations false and \"grossly distorted\". It says it has acted in self defence against a foe that attacked first, and goes to great lengths to protect civilians, blaming Hamas for operating among them, which the fighters deny. South Africa called the court order a \"decisive victory\" for international rule of law and both it and the European Union said Israel must implement it immediately and in full. The United States noted the ruling did not make a finding about genocide and said it aligned with the U.S. view that Israel had the right to take action in accordance with international law to prevent any repeat of the Oct. 7 attacks. ASSAULT ON KHAN YOUNIS On the ground in Gaza, the heaviest fighting in weeks is now taking place in crowded areas jammed with hundreds of thousands of people who fled from earlier fighting elsewhere. Palestinians sheltering in southern Gaza said they felt let down by the lack of a ceasefire order from the court, but also hopeful the ruling would bring accountability. \"What happened was a victory,\" said Mustafa Ibrahim, a human rights activist. In Israel, Jonathan Dekel-Chen, whose son is being held hostage in Gaza, said he was encouraged by the ICJ's call for the release of the captives, which he said reflected a largely neglected point that the Hamas assault sparked the war. The militants released a video on Friday featuring three female hostages calling for an end to the conflict. Israel has said such videos amount to psychological abuse. Talks on a possible temporary pause in fighting to release hostages and Palestinians held in Israel and allow more aid in Gaza are gathering pace. U.S. President Joe Biden discussed the issue on Friday in a phone call with the emir of mediator Qatar and the White House said Washington was hopeful about progress. A source with knowledge of the matter told Reuters U.S. Central Intelligence Agency Director William Burns and his Israeli counterpart are expected to meet Qatar's prime minister and Egypt's spy chief in Europe on Sunday for talks on a second potential Gaza hostage deal. The U.S. and Israeli intelligence chiefs met previously with Qatari and Egyptian officials to help broker a short-lived truce in November that saw more than 100 hostages freed. The Biden administration has been trying to facilitate the release of the more than 100 remaining hostages. Israel kept up its bombardment of the main southern city of Khan Younis on Friday, reporting \"intensive battles\" and strikes on Hamas fighters and infrastructure from the air and ground. It said it had discovered some 200 tunnel shafts and destroyed more than 130 militant infrastructure sites in its latest operations. Residents said Israeli forces blew up buildings and houses in the western part of the city as gun battles raged. Palestinians say Israel has hampered efforts to rescue the dead and wounded as well as blockading hospitals, which Israel denies, blaming Hamas fighters for operating near them. Hezbollah announced that four of its fighters were killed in an Israeli strike on southern Lebanon late on Friday. The group has been exchanging fire with Israeli since it launched rockets across Lebanon's southern border on Oct. 8 in support of its ally Hamas.  It said on Friday that it had fired rockets at Israeli military targets nine times during the day, including the Burkan (Volcano), which carry hundreds of kilograms of explosives. \nIn a new setback for stricken Palestinians, the United States said it was pausing funding to the UN aid agency for Palestinian refugees (UNRWA) after Israel alleged that 12 UNRWA employees were involved in the Oct. 7 attacks. UNRWA said it was urgently investigating and \"any UNRWA employee who was involved in acts of terror\" would be held accountable."
}