{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0B07A_L.jpg",
  "title": "Taiwanese pack election rallies, China vows to 'smash independence plots'",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 12, 2024 01:54AM ET",
    "Updated Jan 12, 2024 09:23AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/taiwan-parties-to-make-final-push-for-support-in-critical-election-3273024",
  "paragraph": "3/3\n© Reuters. Lai Ching-te, Taiwan's vice president and the ruling Democratic Progressive Party's (DPP) presidential candidate, waves to supporters while riding in the back of a vehicle during a campaign event ahead of the elections in New Taipei City, Taiwan January 1\n2/3\nBy James Pomfret and Sarah Wu NEW TAIPEI, Taiwan (Reuters) - Hundreds of thousands of people attended final pre-election rallies in Taiwan on Friday ahead of critical presidential and parliamentary polls, as China's defence ministry warned it would \"smash any Taiwan independence plots\". Taiwan, a neighbouring island China claims as its own, has been a democratic success story since holding its first direct presidential election in 1996, the culmination of decades of struggle against authoritarian rule and martial law. The ruling Democratic Progressive Party (DPP), which champions Taiwan's separate identity and rejects China's territorial claims, is seeking a third term in office with its candidate, current Vice President Lai Ching-te. China, which has never renounced the use of force to bring Taiwan under its control, has framed the elections as a choice between \"peace and war\", calling the DPP dangerous separatists and urging Taiwanese to make the \"right choice\". The DPP rejects China's sovereignty claims, and says only Taiwan's people can decide their future. Speaking at a rally in Taipei's neighbouring city New Taipei, Lai said the world was watching how Taiwan voted. \"If Taiwan moves closer to China again, Taiwan will lose its advantage, and foreign investment in Taiwan is more likely to be suspended or stopped,\" he told the crowd which the DPP estimated at more than 200,000. \"Therefore, Taiwan must win this battle.\" In the run-up to Saturday's election, China repeatedly denounced Lai and rebuffed repeated calls from him for talks. \"Without democracy and freedom, we have nothing,\" said Jay Liao, 26, a data scientist attending Lai's rally with his husband. \"China could take all this away, including our marriage.\" China's defence ministry, responding to a question earlier on Friday on Taiwan's air force upgrading F-16 fighter jets and buying more from the United States, said even with purchases of U.S. weapons the DPP \"cannot stop the trend of complete reunification of the motherland\". \"The Chinese People's Liberation Army remains on high alert at all times and will take all necessary measures to resolutely crush any form of 'Taiwan independence' separatist plots and firmly defend national sovereignty and territorial integrity,\" said ministry spokesperson Zhang Xiaogang. Lai says he is committed to preserving peace across the Taiwan Strait. The DPP has accused China of seeking to interfere in the vote by spreading disinformation and putting further military and economic pressure on the island. Beijing says election interference allegations are DPP \"dirty tricks\". CHINA LOOMS LARGE Lai is facing two opponents for the presidency - Hou Yu-ih of Taiwan's largest opposition party the Kuomintang (KMT) and former Taipei mayor Ko Wen-je of the small Taiwan People's Party (TPP), only founded in 2019. No matter who wins, China looms in the background. Taiwan's government believes China is likely to attempt to put pressure on its incoming president after the island votes, including staging military manoeuvres near the island this spring, two senior government officials said. Hou wants to re-start engagement with China, beginning with people-to-people exchanges, and has, like China, accused Lai of supporting Taiwan's formal independence. Lai says Hou is pro-Beijing, which Hou rejects. The KMT and TPP say Taiwan needs a change of government after eight years of DPP rule, though an effort by the two parties late last year to form a joint ticket to take on the DPP collapsed in acrimony. The KMT also held its packed final rally in New Taipei. \"If Lai Ching-te is elected, the Taiwan Strait will likely fall into turmoil. Do you also want Taiwan to fall into war, folks?\" Hou told his supporters. The TPP had the prime spot in central Taipei near the presidential office, and an estimated 300,000 supporters turned out.  \"He can unite all of Taiwan,\" said software engineer Cherry Chang, 34, attending the Ko rally. \"He's very hard working and very upright.\" The DPP and KMT alike face a challenge from the TPP, seeking to break the mould of two-party politics. \"This political status quo has led to an increasing wave of people hoping for reform. It has also pushed the TPP, which represents Taiwan's third force, on to the stage of Taiwan's politics,\" the TPP's Ko told foreign reporters in Taipei on Friday. Ko has won a passionate support base, especially among young voters, for focusing on bread and butter issues like the high cost of housing. He also wants to re-engage China, but insists that cannot come at the expense of protecting Taiwan's democracy and way of life. Polls open at 8.00 a.m. (0000 GMT) and close at 4.00 p.m. (0800 GMT), with ballot counting by hand starting almost at once. There is no electronic, absentee, proxy or early voting. The result should be clear by late evening Saturday when the losers concede and the winner gives a victory speech. \nTsai is constitutionally barred from standing again after two terms in office.  For an in-depth look at the election listen now to a special edition of the Reuters World News podcast."
}