{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0I0DM_L.jpg",
  "title": "Asylum seekers 'missing' after crossing Russia border to Finland",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 19, 2024 07:01AM ET",
    "Updated Jan 19, 2024 08:26AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/asylum-seekers-missing-after-crossing-russia-border-to-finland-3278150",
  "paragraph": "© Reuters. FILE PHOTO: Barriers are placed at the closed Vaalimaa border check point between Finland and Russia in Virolahti, Finland, January 14, 2024. Finland, which shut all eight checkpoints along its eastern frontier with Russia again in December 2023 amid susp\nBy Greta Rosen Fondahn (Reuters) -Some 160 people who applied for asylum at Finland's eastern border last year have since disappeared, amid a sudden surge of asylum seekers arriving via Russia, Finland's immigration authority said. Finland closed its eastern border with Russia late last year amidst a growing number of arrivals from countries including Syria and Somalia. It accused Moscow of funnelling migrants to the border, a claim the Kremlin has denied.  The immigration authority Migri said it got 1,323 asylum applications at the eastern border between August and December last year, about 900 of those in November and more than 300 in December. Now 160 people are missing from reception centres, most with unknown whereabouts, Migri's Director of the Asylum Unit, Antti Lehtinen told Reuters.  Eighteen people have turned up in other European countries, including the Netherlands, Belgium, Norway, Sweden, France, Germany and Switzerland, to refile an asylum application.  \"It's of course possible that of these 160 most of them have continued to another country, but they haven't yet applied for asylum in that country,\" Lehtinen said. Every asylum seeker in Finland has their fingerprint taken to the Eurodac-system, Europe's shared fingerprint database, Lehtinen added. Under EU rules, the EU country where a migrant first applies for asylum is responsible for processing the application.  Earlier in January, Finland extended the closure of its border with Russia until Feb. 11, saying it was likely that the inflow of asylum seekers would restart if the border opened. Finnish president Sauli Niinisto called last year for an EU-wide solution to stop uncontrollable entry to Europe's passport-free Schengen area. On Thursday, a coast guard unit of the Finnish Border Guard said it was investigating several cases of \"assisting illegal immigration\" related to the eastern border, suspecting criminal organisations of large-scale human smuggling.  \n\"Smuggling activities have taken advantage of the border security disruptions on the eastern border,\" it said in a statement. \"We suspect that there are at least hundreds of people still trying to proceed their trip from Finland to other EU and Schengen countries,\" the head of the coast guard's investigation team, Antti Raassina, told Reuters."
}