{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0502Y_L.jpg",
  "title": "US top diplomat warns of risk of Gaza conflict 'metastasizing'",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 06, 2024 04:15AM ET",
    "Updated Jan 07, 2024 04:04PM ET"
  ],
  "comments": [
    3,
    [
      [
        "inderjeet virk",
        "2024-01-07 15:12:05",
        "the solution is there if west does not bring their own interest first.",
        "https://www.investing.com/members/201550452"
      ],
      [
        "Brad Albright",
        "2024-01-07 19:13:11",
        "What is the solution in your opinion?",
        "https://www.investing.com/members/236251128"
      ],
      [
        "First Last",
        "2024-01-07 21:31:59",
        "Destroying Hamas is part of the solution, and that's not a western idea.",
        "https://www.investing.com/members/200601457"
      ],
      [
        "Levan Jackson",
        "2024-01-07 10:00:29",
        "Israel and Palestine have been at War for 70 some odd years. I'll say it again, 70 some odd. You would think, by now, they would be tired and willing to come to some sort of agreement; one would think. It seems to me they'll likely be fighting another 70. 🤦‍♀",
        "https://www.investing.com/members/206341051"
      ],
      [
        "First Last",
        "2024-01-07 21:25:30",
        "Muslim powers, esp. Iran and Hamas leadership, outside that region want the conflict to continue,. Palestinian leaderships need foreign aid to continue flowing for them to embezzle.",
        "https://www.investing.com/members/200601457"
      ],
      [
        "Peng Zhong Wong",
        "2024-01-07 01:51:46",
        "stop the war",
        "https://www.investing.com/members/236430529"
      ],
      [
        "Stoxer One",
        "2024-01-07 07:38:37",
        "same goes for Taiwan, right? ",
        "https://www.investing.com/members/200770726"
      ],
      [
        "Ac Tektrader",
        "2024-01-07 21:01:12",
        "Taiwan must remain free of Chinese enslavement and recognized as a free nation.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "First Last",
        "2024-01-07 21:20:05",
        "The Gazans should themselves get rid of Hamas and install a democratic gov't like Taiwan has.  Then Israel doesn't have to do it for them and we don't have to hear the Gazans whining about it.",
        "https://www.investing.com/members/200601457"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/heavy-fire-from-lebanon-targets-northern-israel-amid-concern-over-gaza-spillover-3268545",
  "paragraph": "5/5\n© Reuters. A man works on a tank near the border with northern Gaza, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, January 5, 2024. REUTERS/Amir Cohen\n2/5\nBy Simon Lewis, Nidal al-Mughrabi and Emily Rose AMMAN/CAIRO/JERUSALEM (Reuters) -The top U.S. diplomat swept through the Middle East on Sunday, warning that the Gaza conflict could spread across the region without concerted peace efforts, although Israel's leader vowed to continue the war until Hamas was eliminated. U.S. Secretary of State Antony Blinken, at the start of a five-day trip in the region, also sought to assure Arab leaders that Washington opposes the forcible displacement of Palestinians from Gaza or the occupied West Bank. \"This is a moment of profound tension for the region. This is a conflict that could easily metastasize, causing even more insecurity and suffering,\" Blinken said at a press conference in Doha. He was in Jordan and Qatar on Sunday before landing in the United Arab Emirates for talks on Monday. He will then visit Saudi Arabia, Israel, the West Bank and Egypt. Jordan's King Abdullah urged Blinken to use Washington's influence over Israel to press it for an immediate ceasefire, a palace statement said, warning of the \"catastrophic repercussions\" of Israel's continued military campaign. Despite global concern over the death and destruction in Gaza and widespread calls for a ceasefire, Israeli public opinion remains firmly behind the operation aimed at wiping out the Hamas group that rules Gaza, although support for Prime Minister Benjamin Netanyahu has fallen sharply.  Netanyahu has vowed to press on with the retaliatory action. \"The war must not be stopped until we achieve all the goals - the elimination of Hamas, the return of all our hostages and ensuring that Gaza will no longer pose a threat to Israel,\" Netanyahu said at the start of a weekly cabinet meeting on Sunday. \"I say this to both our enemies and our friends.\"  Some 1,200 people were killed and 240 were taken hostage in Hamas' cross-border attack on Oct. 7, according to Israeli officials. More than 100 hostages are still believed to be held by Hamas. For Israelis, the deadliest day in the country's history and the accounts of atrocities that later emerged left a sense that its survival is at stake.  Israel's offensive has so far killed 22,835 Palestinians in Gaza, after 111 dead and 250 wounded were added to the tally over the past 24 hours, Palestinian health officials said on Sunday. An Israeli air strike on a car near Rafah in southern Gaza on Sunday killed two Palestinian journalists, according to health officials in Gaza and the journalists' union there.  Central Gaza has been the focus of a heavier Israeli ground and air offensive in the past two weeks, with residents there reporting tank shelling east of the area as explosions lit the skies overnight on Sunday. Palestinians in southern Gaza Strip said Israeli air strikes pummelled the area east of Khan Younis and Rafah.  Israel denies targeting civilians and says Hamas militants deliberately embed themselves among civilian populations. Hamas, which is backed by Iran and is sworn to Israel's destruction, denies that. The fighting has displaced most of Gaza's 2.3 million population, with many homes and civilian infrastructure left in ruins amid acute shortages of food, water and medicine. \"We hope that ... Blinken looks at us with an eye of mercy, ends the war, ends the misery we are living in,\" Um Mohamad Al-Arqan said, as she stood by the tent where she is living. REJECTING FORCIBLE DISPLACEMENT Following meetings with King Abdullah in Amman and with Qatari Emir Sheikh Tamim bin Hamad al-Thani and Prime Minister Mohammed bin Abdulrahman al-Thani, Blinken said the United States rejected any forcible displacement of Palestinians from the West Bank and Gaza. \"Palestinian civilians must be able to return home as soon as conditions allow,\" Blinken said in Doha. Blinken and Qatari officials also discussed efforts to free hostages still believed to be held by Hamas after an earlier agreement mediated by Qatar broke down, something that the Qatari prime minister said was affected by the recent killing of a top Hamas leader.  Blinken also aimed to press hesitant Muslim nations in the Middle East to prepare to play a role in the reconstruction, governance and security of Gaza if and when Israel manages to eliminate Hamas, a State Department official said earlier. \"Our partners are willing to have these difficult conversations and to make hard decisions,\" Blinken told reporters, adding that he plans to press Israeli leaders to do more to prevent civilian casualties and allow in more humanitarian aid. Gun battles intensified in the southern Gaza town of Khan Younis as well as in central districts of the densely populated enclave. Israeli strikes on houses in the city killed 50 people, health officials in Nasser Hospital said on Sunday. Outside Gaza, there was more violence in the occupied West Bank. Israeli aircraft fired on Palestinian militants who had attacked troops in the area, the military said, and Palestinian health officials said seven Palestinians died in the strike. An Israeli border police officer was killed and others wounded when their vehicle was hit by an explosive device during operations in the West Bank city of Jenin, the military and police said. \nIsraeli police killed a young Palestinian girl in a car at a West Bank crossing when they opened fire on another car suspected of a ramming attack, Israeli emergency services said. Hundreds of Palestinians have been killed in clashes with Israeli soldiers and settlers over the past weeks."
}