{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0F0FK_L.jpg",
  "title": "Gaza combat surges anew as Israeli tanks storm back into areas they left",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 16, 2024 06:33AM ET",
    "Updated Jan 16, 2024 11:57AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/israeli-tanks-storm-back-into-north-gaza-areas-where-they-had-withdrawn-3274829",
  "paragraph": "6/6\n© Reuters. Israeli soldiers operate in the Gaza Strip amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, in this handout picture released on January 16, 2024. Israel Defense Forces/Handout via REUTERS\n2/6\nBy Nidal al-Mughrabi, Arafat Barbakh and Tyrone Siu GAZA/ISRAEL-GAZA BORDER (Reuters) -Israeli tanks stormed back into parts of the northern Gaza Strip they had left last week, residents said on Tuesday, reigniting some of the most intense fighting since the New Year when Israel announced it was scaling back its operations there. Massive explosions could be seen over northern areas of Gaza from across the border with Israel - a rarity over the past two weeks after Israel announced a drawdown of forces in the north as part of a transition to smaller, targeted operations. The rattle of gunfire reverberated across the border through the night. In the morning, contrails snaked through the sky as Israel's Iron Dome defences shot down rockets fired by militants across the fence, proof they retain the capability to launch them despite more than 100 days of war. Israel said its forces had killed dozens of Hamas fighters overnight in clashes in Beit Lahiya on Gaza's northern edge. Gaza health authorities said the last 24 hours of Israeli bombing had killed 158 people in the Palestinian enclave, raising their toll for the war, now in its fourth month, to 24,285, with thousands more bodies feared lost in the rubble. Israel launched the war to eradicate Hamas after militants stormed across the border fence on Oct. 7, killing 1,200 people and capturing 240 hostages. The war has driven nearly all Gazans from their homes, some several times, and caused a humanitarian crisis, with food, fuel and medical supplies running low. Under U.S. pressure to reduce civilian casualties, Israel had said it was transitioning from a full-scale ground assault to targeted operations against the Hamas militants that control the enclave. It began that shift with a pullback in the north. Defence Minister Yoav Gallant also said on Monday that the more recent ground assault in the south was drawing to a close. But any path toward de-escalating the war still seems remote, with Israel saying it will not rest until Hamas is destroyed, and the militants showing no sign of losing the ability to resist. Israel Ziv, a retired general who formerly commanded Israeli forces in Gaza, told Reuters that 10-15% of Hamas' pre-war rocketry corps of some 1,000 personnel were believed to be still alive, with some 2,000 rockets left to be fired.  However, Ziv said, Israeli forces had by now established \"extensive control\" in Gaza, meaning they could \"manoeuvre freely\", except in Rafah, Deir al-Balah and Nusseirat, the launch point of Tuesday's rocket salvo. CHANGE OF PLANS Some of the hundreds of thousands of residents who fled the north earlier in the war had begun returning last week to bombed-out areas where the Israelis had withdrawn. But residents who spoke to Reuters on Tuesday said the abrupt resurgence of fighting in the north would now halt plans to try to go home. \"We almost planned to return to our house in Nazla, east of Jabalia, but thank God we didn't. This morning people living nearby arrived here and told us the tanks pushed back there,\" said Abu Khaled, 43, a father of three now living with relatives in severely damaged Gaza City. \"The sounds of bombing from the tanks, from the planes didn't stop all night. It reminded us of the first day of the ground incursion.\" Israeli forces have fought their way to the centre of Gaza's main southern city of Khan Younis, and into towns north and east of the central city of Deir al-Balah. Israeli commando forces carried out targeted raids in Khan Younis to take out militant infrastructure, including offices of several senior regional Hamas commanders, the military said. The Gaza war has inflamed tensions across the region, including in the Red Sea, where the Iran-aligned Houthi movement that controls most of Yemen has been attacking commercial ships. The route is used by 15% of world shipping. The group says it is targeting vessels linked to Israel in solidarity with Gaza. The United States and Britain responded by bombing Yemen to prevent what they called a threat to global commerce. The latest ship to be attacked, a Malta-flagged, Greek-owned bulk carrier, sustained minor damage on Tuesday when it was hit with a missile in the Red Sea. No injuries were reported. 'FORGIVE ME, MY SON, I COULD NOT PROTECT YOU' Defence Minister Gallant's announcement on Monday that the major ground offensive in the south would end soon raises the question of whether the Israelis will still try to advance into remaining areas they have yet to enter. Most of Gaza's 2.3 million people are now crowded into those few areas, including Deir al-Balah and Rafah, which is located on the southern edge of the Strip bordering Egypt. In Khan Younis, Zaher Abu Zarifa wept and cradled a black plastic body bag holding his seven-year-old son Saif, one of at least 11 bodies brought out at a hospital morgue. The boy was killed by a missile while playing on a bicycle by a school gate, his father said.  \nLater, by a small freshly dug grave, a gravedigger unzipped the bag so the father could kiss the boy's face, then zipped it back up, took the boy and gently laid him in the ground. \"Forgive me, my son. I could not protect you,\" the father repeated. \"Forgive me, my son. I could not protect you.\""
}