{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0302V_L.jpg",
  "title": "As Japan's Wajima city digs out from quake, hopes fade for tourism recovery",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 03, 2024 10:42PM ET",
    "Updated Jan 04, 2024 04:07AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/as-japans-wajima-city-digs-out-from-quake-hopes-fade-for-tourism-recovery-3266787",
  "paragraph": "9/9\n© Reuters. A man makes his way along Asaichi-dori street, which burned down due to a fire following an earthquake, in Wajima, Japan, January 4, 2024. REUTERS/Kim Kyung-Hoon\n2/9\nBy Kiyoshi Takenaka WAJIMA, Japan (Reuters) - Hotel chef Makoto Wakabayashi was among those in Wajima hoping for a banner year as visitors returned to the scenic, seaside town that weathered more than two years of pandemic gloom. Those dreams came apart in minutes of violent shaking on New Year's Day, when the strongest earthquake to strike Japan in 13 years and multiple aftershocks devastated the city and claimed dozens of lives. Days later, buckled roads continue to hamper the influx of aid, while rescuers search for survivors among the flattened structures. Among the badly damaged buildings is Wakabayashi's employer, the seaside Hotel Koshuen. The total toll on lives and industry in the region from the 7.6 magnitude quake is far from known. But it is already clear that Wajima - renowned for its fisheries, lacquerware, and markets - faces a long road to recovery from not just the quake but a massive fire in a major tourist centre. Tourism was just making a comeback from the COVID-19 crisis, Wakabayashi said, but he worries this quake may be a knockout blow. \"It's absolutely bad,\" Wakabayashi, 62, told Reuters at a community centre now serving as an evacuation centre.  He was among some 600 people of all ages packed into the building's three floors, where many slept on tatami mats and plastic sheets. Nearby was the nine-story Hotel Koshuen, one of the biggest accommodation centres in the city and boasting hot spring baths with views of the ocean. The upper floors were the most damaged as the force of the quake moved up the building, he said. \"Parts of walls came off and ceilings came down,\" Wakabayashi said. \"I believe it will take half a year to a year to fully refurbish all the guest rooms.\" Tourism was a bright spot for Japan's economy last year as infection controls were lifted and the weak yen lured international travellers. Inbound arrivals in October exceeded levels in 2019 for the first time since the pandemic clamped down international travel. Wajima, about 450 km (280 miles) northwest of Tokyo, has always been more of a draw for domestic visitors.  Just 15 minutes by foot from the Hotel Koshuen and near the evacuation centre lays Wajima's famed \"Asaichi\" morning market, a 1,000-year old shopping district with some 200 stalls selling seafood, snacks and crafts. Now much of it lays in ruin after a conflagration set off during the earthquake. \"Wajima's morning market is one of Japan's top three,\" Wakabayashi said. \"The fire practically destroyed it, as well as the houses of many who work there, just when the crab season is about to arrive.\" \nThe veteran chef counts himself luckier than many Wajima residents who lost their homes, as he lives in an apartment provided by the hotel. He endured a substantial cut in wages during the pandemic, as both he and his employer held out for a recovery in tourism. \"Customers were bound to come back following the end of the pandemic,\" Wakabayashi said. \"But now, hotels need to do costly repairs. I'm not sure if they'll be able to keep their employees.\""
}