{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0N0F2_L.jpg",
  "title": "Explainer-How Ethiopia's quarrel with Somalia could destabilise Horn of Africa",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 24, 2024 07:05AM ET",
    "Updated Jan 24, 2024 07:13AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/explainerhow-ethiopias-quarrel-with-somalia-could-destabilise-horn-of-africa-3281593",
  "paragraph": "3/3\n© Reuters. FILE PHOTO: Somalia's President Hassan Sheikh Mohamud addresses the parliament regarding the Ethiopia-Somaliland port deal, in Mogadishu, Somalia January 2, 2024. REUTERS/Feisal Omar/File Photo\n2/3\nBy Giulia Paravicini NAIROBI (Reuters) - Ethiopia's deal to lease a port in Somalia's breakaway region of Somaliland has infuriated the government in Mogadishu and prompted concern it will further destabilise the Horn of Africa region.  Under a memorandum of understanding signed on Jan. 1, landlocked Ethiopia would lease 20 km (12 miles) around Somaliland's port of Berbera for 50 years, in exchange for stakes in Ethiopian state-run companies and possible recognition as an independent nation.  Somalia has responded by calling the deal an act of agression and says it will block it. Ethiopia says it is merely striking a commercial arrangement to address a need for access to the sea.  WHY DOES ETHIOPIA WANT A PORT?  Ethiopia, Africa's second most-populous country with 120 million people, depends for more than 90% of its trade on ports in neighbouring Djibouti, costing it more than $1.5 billion a year in fees.  In a speech in October, as Abiy publicly made the case for Ethiopia to gain sea access, he cited an 19th-century Ethiopian general, who had called the Red Sea the country's \"natural boundary.\"  Ethiopia lost sea access in the early 1990s when its then-province Eritrea seceded following a three-decade war. Abiy's drive to reclaim it is seen as enjoying wide political support.  The prime minister also wants a sea base for Ethiopia's navy, which has been rebuilt in recent years but is currently limited to conducting training exercises on an inland lake.  WHY IS SOMALIA SO ANGRY?  The Mogadishu government considers Somaliland an integral part of Somalia even though it enjoys effective autonomy.  While Somaliland declared its independence in 1991, it has not been recognised by any country. If Ethiopia does so, it could set a precedent that other countries would follow.  Somalia's President Hassan Sheikh Mohamud signed a law that claimed to nullify the deal, and his government rejected an African Union proposal for dialogue with Ethiopia, saying it would not negotiate over its sovereignty.  WHAT ARE REGIONAL COUNTRIES SAYING?  Given chronic instability in Somalia, Ethiopia and Sudan as well as the Horn of Africa's strategic location across the Red Sea from the Gulf, some analysts fear the dispute could draw in outside actors if it escalates. Middle Eastern powers, including Saudi Arabia, the United Arab Emirates (UAE), Turkey and Qatar, have been vying for influence in the region by making economic investments, opening military bases and selling weapons.  So far, no country has publicly backed the port deal. The Arab League, of which Somalia is a member, reaffirmed its support for Somalia's sovereignty over Somaliland, as did the African Union, European Union and United States.  President Abdel Fattah al-Sisi of Egypt, which has a frosty relationship with Ethiopia related to a dispute about a dam Ethiopia has built on a tributary of the Nile River, said on Sunday he would not allow anyone to threaten Somalia.  \nEritrea has not commented on the deal but its President Isaias Afwerki invited Somalia's Mohamud to Asmara shortly after it was was announced.  The UAE, which is a strong ally of Ethiopia and Somaliland and manages the Berbera port through state-run DP World, has not commented on the deal beyond the Arab League statement."
}