{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBQ08B_L.jpg",
  "title": "Indonesian protesters storm refugee shelter calling for deportation of Rohingya",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 27, 2023 06:54AM ET",
    "Updated Dec 27, 2023 12:29PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/indonesian-protesters-storm-refugee-shelter-calling-for-deportation-of-rohingya-3263959",
  "paragraph": "© Reuters. Two suspects, a Bangladesh national and a Rohingya, stand while an Aceh police official, Fadillah Aditiya Pratama speaks during a news conference, after smuggling at least 400 Rohingyas refugees in early December, at a police office in Banda Aceh, Aceh pr\nBANDA ACEH, Indonesia (Reuters) -A large crowd of Indonesian students stormed a convention centre housing hundreds of Rohingya refugees from Myanmar in the city of Banda Aceh on Wednesday, demanding they be deported, Reuters footage showed. A city police spokesperson in Banda Aceh did not immediately respond to a request for comment. Footage showed the students, many wearing green jackets, run into the building's large basement space, where crowds of Rohingya men, women and children were seated on the floor and crying in fear. The Rohingya were then led out, some carrying their belongings in plastic sacks, and taken to trucks, as the protesters looked on. The United Nations Refugee Agency (UNHCR) said it in a statement it was \"deeply disturbed to see a mob attack on a site sheltering vulnerable refugee families, (the) majority being children and women\" and called for better protection. \"The mob broke a police cordon and forcibly put 137 refugees on two trucks, and moved them to another location in Banda Aceh. The incident has left refugees shocked and traumatized,\" it said. It added the attack was the result of a coordinated online campaign of misinformation and hate speech.  Rohingya refugees have experienced increasing hostility and rejection in Indonesia as locals grow frustrated at the numbers of boats arriving with the ethnic minority, who face persecution in Buddhist-majority Myanmar.  Indonesian President Joko Widodo has blamed the recent surge in arrivals on human trafficking, and pledged to work with international organisations to offer temporary shelter. According to the UNHCR over 1,500 Rohingya have landed in Indonesia since November.  Arrivals tend to spike between November and April, when the seas are calmer, with Rohingya taking boats to neighbouring Thailand and Muslim-majority Indonesia and Malaysia.  Wariza Anis Munandar, a 23-year-old student in Banda Aceh speaking at an earlier protest rally in the city on Wednesday called for the deportation of the Rohingya while another student, 20-year-old Della Masrida, said \"they came here uninvited, they feel like it is their country.\" \nIndonesia is not a signatory to the 1951 United Nations Convention on Refugees but has a history of taking in refugees if they arrive. For years, Rohingya have left Myanmar, where they are generally regarded as foreign interlopers from South Asia, denied citizenship and subjected to abuse."
}