{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0O0CB_L.jpg",
  "title": "Gaza health ministry says 20 Palestinians killed in strike on food aid queue",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 25, 2024 05:36AM ET",
    "Updated Jan 25, 2024 06:22PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Charles Manson",
        "2024-01-25 19:28:05",
        "Great Battle Tactic. Send in a Food Truck. After they climb on the truck, KA-BOOM! After they come back to cleanup the Mess, another KA-BOOM, anyway, gotta go feed the birds, Love to All, Charles.",
        "https://www.investing.com/members/249519852"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/israeli-tanks-batter-hospital-districts-in-gazas-khan-younis-3282575",
  "paragraph": "5/5\n© Reuters. Smoke rises during an Israeli ground operation in Khan Younis, amid the ongoing conflict between Israel and Hamas, as seen from a tent camp sheltering displaced Palestinians in Rafah, in the southern Gaza Strip, January 25, 2024. REUTERS/Bassam Masoud\n2/5\nBy Fadi Shana, Nidal al-Mughrabi and Dan Williams GAZA/DOHA/JERUSALEM (Reuters) - An Israeli strike on Gaza City killed 20 Palestinians and wounded 150 who were queuing for food aid on Thursday, Gaza's Hamas-run health ministry said, in what a Palestinian coalition called a \"war crime.\"  The Israeli military said it was looking into the report. The National and Islamic Forces Follow-up Committee, a coalition of militant and political groups, said Israeli forces targeted the civilians waiting for relief aid. Dozens were killed and injured in a \"war crime and genocide,\" the group said in a statement.  Also in central Gaza, Palestinian health officials said an Israeli air strike at nightfall on a house in Al-Nusseirat refugee camp killed six people. In the south of the enclave, Israeli tanks battered areas around two hospitals in Gaza's main southern city Khan Younis, forcing displaced people into a new desperate scramble for safety, residents said. Meanwhile in the north, a World Health Organization official described the food situation as \"absolutely horrific\" and humanitarian workers said rare deliveries of aid were mobbed by desperate people who were visibly starving with sunken eyes. Most of the Gaza Strip's 2.3 million population is now squeezed into Khan Younis and towns just north and south of it, after being driven out of Gaza's northern half earlier in Israel's military campaign, now in its fourth month. Gaza health officials said at least 50 Palestinians had been killed in the past 24 hours in Khan Younis, where Israel has shifted full-blown military operations after starting to pull forces out of northern areas it says it now largely controls. \"There's no safe area, where shall we go? Stop the war, it is enough,' a Palestinian woman said in Rafah, on Gaza's southern edge. In its latest update, the Israeli military said forces in Khan Younis were fighting militants at close quarters and were using precision air strikes and snipers to take out multiple Hamas targets. Palestinian medics said Israeli tanks had cut off and were shelling targets around the city's two main still-functioning hospitals, Nasser and Al-Amal, trapping medical teams, patients and displaced people huddled inside or nearby. Israel says Hamas militants use hospital premises as cover for bases, something the Islamist group and medical staff deny. Two U.S. officials told Reuters that the U.S. has created a channel with Israel to discuss concerns over civilian casualties of the Israeli military in Gaza.  Through the channel, which has been active for the last few weeks, Washington raises with the Israelis \"every specific incident of concern\", a U.S. official said. The Israelis investigate and provide feedback to the Americans. CIVILIANS FLEE On Thursday, thousands of homeless people sheltering in Khan Younis sought to flee to Rafah, 15 km (nine miles) away, the U.N. relief agency for Palestinians (UNRWA) said.  Israeli tank forces ordered more than 30,000 civilians inside a U.N. centre in Khan Younis to leave, U.N. officials said. The compound was hit by shelling on Wednesday, when 13 were killed and 56 injured, they added. There was no immediate comment from the Israeli military. Video posted on X by Philippe Lazzarini, head of UNRWA, showed a crowd of people walking en masse on Thursday on a dirt road. \"A sea of people forced to flee Khan Younis, ending up at the border with Egypt. A never ending search for safety that #Gaza is no longer able to give\", Lazzarini wrote. The International Committee of the Red Cross said less than 20% of the narrow enclave - around 60 square kilometres (23 square miles) - now harboured over 1.5 million homeless people in the south, where the escalation of fighting \"threatens their survival\". Some 25,900 Palestinians have been killed by Israeli strikes in Gaza, Palestinian health officials say, with large tracts of the heavily built-up enclave flattened by bombing. Israel unleashed its war to eradicate Hamas after militants stormed through the border fence in a shock incursion into nearby Israeli towns and bases on Oct. 7, killing 1,200 people and seizing around 240 hostages, according to Israeli figures. The Israeli military has said it has killed more than 9,000 Gaza militants and lost 220 soldiers in the 3-1/2-month-old war. Hamas has dismissed Israel's figures on militant deaths. Ahead of a ruling by U.N. judges on Friday on South Africa's request for an immediate halt to Israel's military operation in Gaza, which it has accused of state-led genocide, Hamas said it would abide by any ruling for a ceasefire if Israel reciprocates. Israel has asked the International Court of Justice in The Hague to reject the case outright. An Israeli government spokesperson on Thursday said they expect the U.N.' s top court to \"throw out these spurious and specious charges\". 'HUMANITARIAN PAUSE' TALKS SNAGGED Urgent international appeals for a ceasefire to spare civilians who have borne the brunt of casualties have fallen on deaf ears with Israel vowing not to relent until Hamas has been eradicated and all hostages freed.  Hamas says any deal must hinge on Israel ending its offensive and siege and withdrawing from the Gaza Strip. Mediated talks on a month-long truce that could see hostages freed in swaps for Palestinian prisoners in Israel have resumed, but have snagged on the two sides' differences over how to bring an end to the war, sources told Reuters. \nThe directors of Israel's Mossad intelligence service and the U.S. Central Intelligence Agency will meet Qatar's prime minister in Europe this weekend to discuss a ceasefire in the Gaza Strip and release of hostages, an official briefed on the meeting told Reuters on Thursday.  Gaza's conflict threatens to destabilise the Middle East, stoking hostilities ranging from the Israeli-occupied West Bank to the Israel-Lebanon border region, Syria, Iraq and Red Sea shipping lanes crucial to international trade."
}