{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "Massachusetts man charged with threatening to kill Jews, bomb synagogue",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 29, 2024 04:36PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/massachusetts-man-charged-with-threatening-to-kill-jews-bomb-synagogue-3286434",
  "paragraph": "By Nate Raymond BOSTON (Reuters) - U.S. prosecutors on Monday charged a Massachusetts man with threatening to kill members of the Jewish community and bomb a synagogue in what authorities called a \"disturbing\" example of rising antisemitism nationally after the Israel-Hamas war began. Federal prosecutors in Boston charged John Reardon, 59, after they said he left a voice mail with the Congregation Agudas Achim, a synagogue in Attleboro, Massachusetts, on Thursday, threatening to bomb places of worship and kill children. Prosecutors said Reardon in the voice mail said that \"if you can kill the Palestinians we can kill you,\" and that \"you do realize that by supporting genocide that means it's OK for people to commit genocide against you.\" Prosecutors said that 10 minutes after leaving that voicemail, Reardon called another synagogue and a local Jewish affiliated organization. He was arrested by local police after those calls. A spokesperson for the local district attorney in Bristol County said his office was dismissing earlier charges filed in state court against him after federal prosecutors took jurisdiction. Acting U.S. Attorney Joshua Levy in a statement called the allegations \"deeply disturbing\" and an example of a \"torrent of antisemitism\" nationally. \"The numbers do not lie - incidents of antisemitism and Islamophobia are spiking,\" he said. U.S. Attorney Merrick Garland has cited a rising number of such threats domestically since the Oct. 7 attack by Hamas that killed some 1,200 Israelis and prompted the war in Gaza.  Israel's assault on Gaza has killed at least 26,600 people, according to health authorities in the Hamas-run enclave. Reardon was charged with using a facility of interstate commerce to threaten a person or place with harm via an explosive. The charge carries a maximum of 10 years in prison. He is being held without bail. A court-appointed lawyer did not respond to a request for comment."
}