{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBU00A_L.jpg",
  "title": "Russia pounds Kharkiv with missiles and drones, Ukraine says",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 30, 2023 08:15PM ET",
    "Updated Dec 31, 2023 09:27AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Ken Roth",
        "2024-01-01 04:40:09",
        "Dont need speak need US action delivering military assistance and a clear signal to Putin that whatever he is doing in trying to make western allies leave ukraine to russia, he is mistaken and the sooner he leaves ukraine the better for the russian people.",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/russia-launches-overnight-air-assault-targeting-kyiv-ukraine-says-3264920",
  "paragraph": "© Reuters. Firefighters and police investigators work at the site of a Russian missile strike, amid Russia's attack on Ukraine, in Kharkiv, Ukraine December 30, 2023. REUTERS/Yevhen Titov\nBy Vitalii Hnidyi KHARKIV, Ukraine (Reuters) -Russia pounded the Ukrainian city of Kharkiv with missiles and drones in the hours leading into New Year's Eve, Ukrainian officials said, hours after Moscow accused Kyiv of carrying out a deadly air assault just across the border on nearby Belgorod. In the first wave of Russia's attacks, at least six missiles hit Kharkiv, regional governor Oleh Syniehubov said on Sunday, injuring at least 28 people and hitting residential buildings, hotels and medical facilities. Earlier, Ukrainian officials said that two boys aged 14 and 16 and a security adviser for a team of German journalists were among those injured in Kharkiv, Ukraine's second-largest city. Closer to midnight, as part of a wider bombardment of Ukraine that also targeted Kyiv, several waves of Russian drones hit residential buildings in Kharkiv's centre, causing fires, the city's mayor said. \"On the eve of the New Year, the Russians want to intimidate our city, but we are not scared - we are unbreakable and invincible!\" Mayor Ihor Terekhov said. Images from Kharkiv showed badly damaged buildings, including a hotel with many windows blown out.  Ukraine's air force said the military had shot down 21 out of 49 drones launched overnight by Russia. Most were aimed at the front line and parts of the Kharkiv, Kherson, Mykolaiv and Zaporizhzhia regions, it said. In a separate attack, three people were killed when Russian forces shelled a village in the Kharkiv region near the front line, Syniehubov said. The attacks came within hours after what Moscow called an \"indiscriminate\" Ukrainian air attack on the city of Belgorod, near Kharkiv and just north of Ukraine's border, that killed at least 22 people. Russian newspaper Kommersant cited a source close to the Russian Investigative Committee as saying that Ukraine launched its attack on Belgorod from a multiple rocket launcher in the Kharkiv region. \nBoth sides have increased attacks in the last week of 2023, with Russia killing at least 31 civilians in its biggest air assault of the 22-month war on Ukraine on Friday. U.S. President Joe Biden, asked if he'll speak to Ukraine's President Volodymyr Zelenskiy after Russia's latest attacks in Ukraine, said: \"I speak to him regularly.\""
}