{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0P00W_L.jpg",
  "title": "Exclusive-China presses Iran to rein in Houthi attacks in Red Sea, sources say",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 25, 2024 08:03PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/exclusivechina-presses-iran-to-rein-in-houthi-attacks-in-red-sea-sources-say-3283626",
  "paragraph": "By Parisa Hafezi and Andrew Hayley DUBAI (Reuters) - Chinese officials have asked their Iranian counterparts to help rein in attacks on ships in the Red Sea by the Iran-backed Houthis, or risk harming business relations with Beijing, four Iranian sources and a diplomat familiar with the matter said. The discussions about the attacks and trade between China and Iran took place at several recent meetings in Beijing and Tehran, the Iranian sources said, declining to provide details about when they took place or who attended. \"Basically, China says: 'If our interests are harmed in any way, it will impact our business with Tehran. So tell the Houthis to show restraint',\" said one Iranian official briefed on the talks, who spoke to Reuters on condition of anonymity. The attacks, which the Houthis say are in support of Palestinians in Gaza, have raised the cost of shipping and insurance by disrupting a key trade route between Asia and Europe used widely by ships from China.  The Chinese officials, however, did not make any specific comments or threats about how Beijing's trading relationship with Iran could be affected if its interests were damaged by Houthi attacks, the four Iranian sources said. While China has been Iran's biggest trading partner for the past decade, their trade relationship is lopsided.  Chinese oil refiners, for example, bought over 90% of Iran's crude exports last year, according to tanker tracking data from trade analytics firm Kpler, as U.S. sanctions kept many other customers away and Chinese firms profited from heavy discounts. Iranian oil, though, only accounts for 10% of China's crude imports and Beijing has an array of suppliers that could plug shortfalls from elsewhere. The Iranian sources said Beijing had made it clear it would be very disappointed with Tehran if any vessels linked to China were hit, or the country's interests were affected in any way. But while China was important to Iran, Tehran also had proxies in Gaza, Lebanon, Syria and Iraq, besides the Houthis in Yemen, and its regional alliances and priorities played a major role in its decision making, one of the Iranian insiders said. Asked for comment about meetings with Iran to discuss the Red Sea attacks, China's ministry of foreign affairs said: \"China is a sincere friend of the countries of the Middle East and is committed to promoting regional security and stability and seeking common development and prosperity.\"  \"We firmly support Middle Eastern countries in strengthening their strategic independence and uniting and collaborating to resolve regional security issues,\" it told Reuters. Iran's foreign ministry was not immediately available to comment. AXIS OF RESISTANCE Military strikes by U.S. and British forces on Houthi targets in Yemen this month have failed to stop attacks on shipping by the group, which controls a large chunk of Yemen including the capital Sanaa and much of the country's Red Sea coast by the Bab al-Mandab strait. The Houthis, who first emerged in the 1980s as an armed group in opposition to Saudi Arabia's Sunni religious influence in Yemen, are armed, funded and trained by Iran and are part of its anti-West, anti-Israel \"Axis of Resistance\". A senior U.S. official said Washington had asked China to use its leverage with Iran to persuade it to restrain the Houthis, including in conversations Secretary of State Antony Blinken and National Security Advisor Jake Sullivan had this month with senior Chinese Communist Party official Liu Jianchao. A senior Iranian official said while Chinese officials discussed their concerns thoroughly in the meetings, they never mentioned any requests from Washington. On Jan. 14, China's foreign minister Wang Yi called for an end to attacks on civilian ships in the Red Sea - without naming the Houthis or mentioning Iran - and the maintenance of supply chains and the international trade order.  Victor Gao, chair professor at China's Soochow University, said China, as the world's biggest trading nation, was disproportionately affected by the shipping disruption and restoring stability in the Red Sea was a priority. But Gao, a former Chinese diplomat and an adviser to oil giant  Saudi Aramco  (TADAWUL:2222), said Beijing would view Israel's treatment of the Palestinians as the root cause of the Red Sea crisis and would not want to publicly ascribe blame to the Houthis. A U.S. State Department spokesperson declined to comment when asked about bilateral Iran-China discussions on the issue. A diplomat familiar with the matter said China had been talking to Iran about the issue but it was unclear how seriously Tehran was taking Beijing's advice. Two officials in the Yemeni government, an enemy of the Houthis, said they were aware that several countries, including China, had sought to influence Iran to rein the Houthis in. Analysts Gregory Brew of Eurasia Group and Ali Vaez of the International Crisis Group said China had potential leverage over Iran because of its oil purchases and because Iran was hoping to attract more Chinese direct investment in future. However, both said China had so far been reluctant to use its leverage, for several reasons. \"China prefers to free-ride on the U.S. safeguarding freedom of navigation in the Red Sea by bloodying the Houthis' nose,\" said Vaez, adding that Beijing was also aware that Iran did not have total control over its Yemeni allies. INFLUENCE NOT ABSOLUTE Houthi spokesman Mohammed Abdulsalam said on Thursday that Iran to date had not conveyed any message from China about scaling back attacks. \"They will not inform us of such a request, especially since Iran's stated position is to support Yemen. It condemned the American-British strikes on Yemen, and considered Yemen's position honourable and responsible,\" he said. The four Iranian sources said it was unclear whether Iran would take any action following the discussions with Beijing. The stakes are high for Iran as China is one of the few powers capable of providing the billions of dollars of investment Tehran needs to maintain the capacity of its oil sector and keep its economy afloat. China's influence was evident in 2023 when it facilitated an agreement between Iran and regional rival Saudi Arabia to end years of hostilities. Yet while there are robust economic ties between China and Iran, Beijing's influence on Tehran's geopolitical decisions was not absolute, one of the Iranian insiders said. Some within Iran's ruling establishment have questioned the value of the partnership with Beijing, pointing to relatively low non-oil trade and investment volumes since China and Iran signed a 25-year cooperation agreement in 2021. Iranian state media says Chinese firms have only invested $185 million since then. State media also said last year that Iranian non-oil exports to China fell 68% in the first five months of 2023 while Iran's imports from China rose 40%. By contrast, Chinese companies committed last year to invest billions in Saudi Arabia after the countries signed a comprehensive strategic partnership in December 2022. Two of the Iranian insiders said while China could not be ignored, Tehran had other priorities to consider and its decisions were shaped by a complex interplay of factors. \"Regional alliances and priorities as well as ideological considerations contribute significantly to Tehran's decisions,\" one of the people said. The second person said Iran's rulers had to adopt a nuanced strategy when it came to the Gaza war, as well as the Houthi attacks, and that Tehran would not abandon its allies. \nIran's role as leader of its \"Axis of Resistance\" - which includes the Houthis, Lebanon's Hezbollah, Hamas and militias in Iraq and Syria - had to be balanced against avoiding getting sucked into a regional war over Gaza, the Iranian sources said. Tehran's messaging to - and about - the Houthis required a measure of deniability about the extent of its control over them - but also an ability to claim some credit for their anti-Israel actions, one of the people said."
}