{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "Philippine military says second joint patrol with US underway in South China Sea",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 03, 2024 05:48AM ET",
    "Updated Jan 03, 2024 06:12AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/philippine-military-says-second-joint-patrol-with-us-underway-in-south-china-sea-3266093",
  "paragraph": "MANILA (Reuters) -The Philippines and the United States began a two-day joint patrol in the South China Sea on Wednesday, the Philippine military said in a statement, a move that would likely irk China. Security engagements between the treaty allies soared last year amid growing tensions in the South China Sea, where the Philippines and China have traded blame over a spate of run-ins.  The Philippines and the U.S. first launched joint patrols in November, holding military drills for three days in waters near Taiwan and in the West Philippine Sea, Manila's term for South China Sea waters within its exclusive economic zone.  The Philippine military said their second joint patrol this week involved four vessels from the Philippine navy and four ships from the U.S. Indo-Pacific command that include an aircraft carrier, a cruiser and two destroyers.  Philippine armed forces chief Romeo Brawner said the second such joint military activity this week marked a \"significant leap\" in Manila's alliance with the U.S. and its interoperability with the American military.  \"Our alliance is stronger than ever, sending a message to the world. We are advancing a rules-based international order and a free and open Indo-Pacific region in the face of regional challenges,\" Brawner said. \nThe latest patrols would likely irk China amid rising tensions in the South China. Last week, Beijing said it would not turn a blind eye to repeated \"provocations and harassment\" by the Philippines. Chinese state media has also accused Manila of relying on U.S. support to continually antagonise China."
}