{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK040BX_L.jpg",
  "title": "Russia fires North Korean missiles at Ukraine for first time - Kyiv official",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 05, 2024 08:40AM ET",
    "Updated Jan 05, 2024 03:36PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/russia-fires-nkorean-missiles-at-ukraine-for-first-time-presidential-aide-says-3268210",
  "paragraph": "(Reuters) -Russia has hit Ukraine with missiles supplied by North Korea for the first time during its invasion, a senior Kyiv official said on Friday, corroborating an earlier assertion by the U.S. White House.  The statement on social media platform X came after the governor of the northeastern region of Kharkiv said that his region had been struck by missiles fired by Russia that were not Russian-made.  \"There is no longer any disguise ... as part of its outright genocidal war, the Russian Federation for the first time struck at the territory of Ukraine with missiles received from ... North Korea,\" the senior Kyiv official, Mykhailo Podolyak, said. He did not provide evidence for the missiles being North Korean. In its statement on Thursday, Washington cited declassified intelligence. \"(Russia) is attacking Ukrainians with missiles received from a state where citizens are tortured in concentration camps for having an unregistered radio, talking to a tourist, watching TV shows,\" Podolyak said. The Kremlin did not respond to a request for comment on the U.S. assertion that Russia had fired North Korean-supplied short-range ballistic missiles at Ukraine. Earlier on Friday, the Kharkiv regional governor said missiles produced outside Russia had been fired into the province at the end of December and the beginning of January. A Reuters video operator filmed the aftermath of a Russian air strike on the regional capital of Kharkiv on Jan. 2, in which a missile landed close to the city centre, leaving behind a deep crater and missile debris. Shown the Reuters footage for review, Joost Oliemans, a Dutch researcher and expert on North Korea's military, said the missile remnants looked like they were from North Korea.  \"It (the footage) appears to show the main body as well as the engine section of a missile that is pretty much a dead match for a North Korean type of missile that we've actually seen pretty clear photos of in the past few years,\" he said.  Kharkiv regional prosecutors said they were conducting an investigation into the country of origin of three missiles used by Russia to hit the provincial capital on Tuesday. Their statement did not name North Korea. That attack on Kharkiv city killed two people and wounded 62, the prosecutor's office said. Ukraine's air force said earlier on Friday it could not yet confirm the country of manufacture of the missiles in question. While the United States would not say specifically what type of missiles Pyongyang had sent to Russia, U.S. spokesman John Kirby (NYSE:KEX) said they had a range of about 900 km (550 miles). He released a graphic that appeared to show KN-23 and KN-25 short-range ballistic missiles (SRBMs). North Korea has been under a United Nations arms embargo since it first tested a nuclear bomb in 2006.  U.N. Security Council resolutions - approved with Russian support - ban countries from trading weapons or other military equipment with North Korea. \nIn November, South Korean authorities said North Korea may have supplied SRBMs to Russia as part of a larger arms deal that also included anti-tank and anti-air missiles, artillery and mortar shells, and rifles. Both Moscow and Pyongyang have previously denied conducting any arms deals, but vowed last year to deepen military relations."
}