{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK1306H_L.jpg",
  "title": "Forest fires kill 123 in Chile's worst disaster since 2010 earthquake",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 04, 2024 11:44AM ET",
    "Updated Feb 05, 2024 09:47PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/chile-president-says-wildfires-death-toll-jumps-to-64-likely-to-rise-3292066",
  "paragraph": "2/2\n© Reuters. Smoke fills the air following the spread of wildfires affecting many parts of the Valparaiso region, in Vina del Mar, Chile February 3, 2024. REUTERS/Sofia Yanjari\n2/2\n(Reuters) -Firefighters in central Chile on Monday battled to quell fierce forest fires that have killed 123 people so far and razed entire neighborhoods, while President Gabriel Boric warned the country faces a \"tragedy of very great magnitude\". Hundreds of people are still missing, authorities say, stoking fears the death toll will keep climbing as more bodies are found on hillsides and houses devastated by the wildfires.  The fires that gathered momentum on Friday now menaced the outer edges of Vina del Mar and Valparaiso, two coastal cities popular with tourists. The urban sprawl of those cities accounts for more than a million residents west of the capital Santiago.  Drone footage filmed by Reuters in Vina del Mar area showed whole neighborhoods scorched, with residents rummaging through husks of burnt-out houses where corrugated iron roofs have collapsed. On the streets, singed cars littered the roads. \"The wind was terrible, the heat scorching. There was no respite. People dispersed everywhere,\" said Pedro Quezada, a local builder in the Valparaiso region, standing amid charred debris of his destroyed home. Videos shared on social media showed hillside fires burning close to apartment blocks in the Valparaiso area, spewing smoke into the air. Thick haze blanketed other urban zones, hobbling visibility. Chilean authorities have introduced a 9 p.m. curfew in the hardest-hit areas and sent in the military to help firefighters stem the spread of fires, while helicopters dumped water to try to douse the flames from the air. Chile's Legal Medical Service, the state coroner, said 123 people had died in the fires as of Monday evening. The death toll stood at 51 on Saturday. A day earlier, Boric, announcing two days of national mourning starting on Monday, said Chile should prepare itself for more bad news. \"It is Chile as a whole that suffers and mourns our dead,\" Boric said in a televised speech to the nation. \"We are facing a tragedy of very great magnitude.\"  Deputy Interior Minister Manuel Monsalve on Sunday said 165 fires raged across Chile and estimated about 14,000 homes have been damaged in the Vina del Mar and Quilpué areas alone. Those who returned to their ravaged homes found them almost unrecognizable, with many losing all their life's possession. Sergio Espejo, 64, a welder, poked through the ashes of his soldering workshop and home in the Vina del Mar region with his wife, Maria Soledad Suarez. Suarez, 61, was able to retrieve a plate and part of a porcelain doll from the embers as she scoured the ground in search of jewelry. Espejo, lamenting the loss of all his tools scattered beneath mangled iron beans, gazed at the damage. \"Here is my workshop, it's totally destroyed,\" he said. \"All the sacrifice, all in a lifetime.\"  Although wildfires are not uncommon during the Southern Hemisphere's summer, the lethality of these blazes stands out, making them the country's worst national disaster since the 2010 earthquake in which about 500 people died. Last year, on the back of a record heat wave, some 27 people died and more than 400,000 hectares (990,000 acres) of land were affected. Late on Monday, U.S. President Joe Biden said he and his administration were in contact with Chilean partners and ready to provide assistance. \"(First Lady) Jill and I are deeply saddened by the loss of life and devastation caused by the ongoing wildfires in Chile,\" he said in a statement. \"The United States stands with Chile at this difficult time.\" \nBoric has sought to channel funds to the hardest-hit areas, many of which are popular with tourists. \"We are together, all of us, fighting the emergency. The priority is to save lives,\" Boric said."
}