{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBR0HD_L.jpg",
  "title": "Venezuela's Maduro slams deployment of British warship to Guyana",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 28, 2023 01:55PM ET",
    "Updated Dec 28, 2023 05:21PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/venezuelas-maduro-slams-deployment-of-british-warship-to-guyana-3264475",
  "paragraph": "4/4\n© Reuters. Venezuela's President Nicolas Maduro addresses military staff during a meeting at the Ministry of Defence, in Caracas, Venezuela December 28, 2023. Zurimar Campos/Miraflores Palace/Handout via REUTERS\n2/4\nCARACAS (Reuters) - Venezuelan President Nicolas Maduro on Thursday said the deployment of a British warship to waters off the coast of Guyana breaches the \"spirit\" of an agreement reached between Venezuelan and Guyanese authorities. Guyana and Venezuela agreed earlier this month to avoid the use of force and avoid increasing tensions in the long border dispute over the oil-rich Essequibo territory. The 160,000-square-km (62,000-square-mile) Essequibo region is generally recognized as part of Guyana, but in recent years Venezuela has revived its claim to the territory and to offshore areas after major oil and gas discoveries. Royal Navy patrol vessel HMS Trent is visiting Guyana, a British ally and former colony, as part of a series of engagements in the region, the UK's defense ministry said in a statement earlier this month, without referring to Venezuela or the border dispute. \"It is the breaking of the spirit of dialogue, diplomacy and peace of the agreements,\" Maduro said on Thursday. He said the deployment was \"practically a military threat from London.\" Maduro has ordered \"the activation of a joint defensive action of the Bolivarian National Armed Forces\" off the coast of Essequibo, he said in a state televised broadcast, but did not give more information.  \nMilitary leaders in Venezuela's east said during the broadcast that 5,600 uniformed personnel were ready for the operation. In a statement, Venezuela's Foreign Ministry said the country \"reserves all actions, within the framework of the Constitution and International Law, to defend its maritime and territorial integrity.\""
}