{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK101R9_L.jpg",
  "title": "US State Dept approves nearly $4 billion sale of 31 armed drones to India",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 01, 2024 11:28AM ET",
    "Updated Feb 01, 2024 12:21PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-state-dept-oks-possible-sale-of-31-armed-drones-to-india-pentagon-3290289",
  "paragraph": "© Reuters. FILE PHOTO: A model MQ-9B manufactured by General Atomics is displayed at the 54th International Paris Airshow at Le Bourget Airport near Paris, France, June 21, 2023. REUTERS/Benoit Tessier/File Photo\nBy Mike Stone and Ismail Shakil WASHINGTON (Reuters) -The U.S. State Department has approved the potential sale of 31 armed MQ-9B SkyGuardian drones, related missiles and equipment to India for nearly $4 billion, the Pentagon said on Thursday, years after the two countries started discussing a deal. India has long expressed interest in buying large, armed drones from the United States, but bureaucratic stumbling blocks hampered a hoped-for deal. Talks over an armed version for India date back to 2018, while discussions over unarmed versions date back even further. Thursday's approval by the State Department does not mean the deal is a sure thing, but demonstrates progress as the U.S. continues a campaign to coax India away from buying Russian military equipment.  The State Department nod signals that the deal likely has cleared one stumbling block, approval by leaders of U.S. congressional committees. Senator Ben Cardin, a Democrat who chairs the Senate Foreign Relations Committee, said he had ended his \"hold\" on the agreement now that President Joe Biden's administration had agreed to fully investigate an Indian assassination plot on U.S. soil. \"The (Biden) administration has demanded that there be investigation and accountability in regards to the plot here in the United States, and that there is accountability within India against these types of activities,\" Cardin told reporters. Ahead of Indian Prime Minister Narendra Modi's state visit to Washington last June, before the plot was uncovered, the Biden administration had pushed New Delhi to cut through its own red tape and advance a deal.  Currently, India is leasing a few MQ-9Bs as part of an intelligence-gathering operation. The deal includes sophisticated communications and surveillance equipment, 170 AGM-114R Hellfire missiles and 310 Laser Small Diameter Bombs, a precision glide bomb. \nGeneral Atomics Aeronautical Systems will be the principal contractor, the Pentagon said. The Pentagon's Defense Security Cooperation Agency notified Congress of the possible sale on Thursday."
}