{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK1100S_L.jpg",
  "title": "Michigan school shooter's mom says she was not responsible for guns",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 01, 2024 07:36PM ET",
    "Updated Feb 01, 2024 08:26PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/michigan-school-shooters-mom-says-she-was-not-responsible-for-guns-3290622",
  "paragraph": "2/2\n© Reuters. FILE PHOTO: Jennifer Crumbley, the parent of accused Oxford High School gunman Ethan Crumbley, is escorted into the courtroom by an Oakland County Sheriff during a court procedural hearing in Rochester Hills, Michigan, U.S., February 24, 2022. REUTERS/Reb\n2/2\nBy Brad Brooks (Reuters) -The mother of a Michigan boy who shot and killed four high-school classmates in 2021 testified in her own defense on Thursday, saying she was not responsible for buying or storing the gun used in the killings.  Jennifer Crumbley, 45, took the stand in what is believed to be the first trial to target a parent of a school shooter. She and her husband, James Crumbley, 47 - for whom a separate trial is to start in March - are both charged with involuntary manslaughter.  The couple's son, Ethan, who was 15 at the time of the shooting at Oxford High School near Detroit, pleaded guilty in 2022 to two dozen counts, including four of first-degree murder. He was sentenced to life in prison without parole in December.  Prosecutors allege that Jennifer and James Crumbley knew their son was mentally in a \"downward spiral\" and posed a danger to others, yet allowed him to have access to firearms, including the 9mm pistol he used to kill classmates.  Asked by her lawyer, Shannon Smith, who was responsible for securely storing firearms in the family home, Jennifer Crumbley replied: \"My husband is.\" \"I just didn't feel comfortable being in charge of that, it was more his thing,\" Crumbley testified. \"So I let him handle that.\"  She said James Crumbley kept the 9mm pistol secured in its case with a cable lock, and that the key for that lock was hidden inside one of several decorative beer steins inside the family home. Jennifer Crumbley said she did not know in which stein the key was hidden. Jennifer Crumbley said that while her son had been anxious about getting into college and what he might do with his life, at no point did she think his problems were \"to a level where I felt he needed to go see a psychiatrist.\" Prosecutors will cross-examine Jennifer Crumbley on Friday. WAKE-UP CALL FOR PARENTS Prosecutors said as the trial opened that Jennifer and James Crumbley failed to do several \"tragically small and easy things\" that could have prevented the school shooting. They argued that the guns in the home were not securely stored and that the parents should have responded to signs their son was having mental health issues. Gun safety experts have said they hope the Crumbley trials serve as a wake-up call for parents around the country to better secure weapons in their homes. About 75% of school shooters obtained the guns they used in attacks within their own homes, government research has shown.  Prosecutors say James Crumbley purchased the 9mm handgun used in the attack four days before his son carried it out on Nov. 30, 2021.  On the morning of the shooting, a teacher discovered drawings by Ethan Crumbley that depicted a handgun, a bullet, and a bleeding figure next to the words \"Blood everywhere,\" \"My life is useless,\" and \"The thoughts won't stop - help me.\" The Crumbleys were called to the school on the morning of the shooting, and told that Ethan needed counseling and they needed to take him home, prosecutors have said. They said the parents resisted the idea of taking their son home and did not search his backpack or ask him about the gun. But Jennifer Crumbley rejected that version of the school meeting in her testimony. She said that she, her husband and the teachers in the meeting mutually agreed that Ethan could remain in school that day, and that at no point did she think he was a danger to his fellow students.  \nThe meeting \"was pretty nonchalant, it was pretty brief,\" Crumbley testified, adding that school staff in the meeting said they \"didn't feel my son was a risk.\"  Ethan Crumbley was returned to class and later walked out of a bathroom with the gun and began firing, prosecutors say."
}