{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0A0BO_L.jpg",
  "title": "Defiant Navalny disputes prison rules in hearing with Russian judge",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 11, 2024 04:49AM ET",
    "Updated Jan 11, 2024 09:07AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/russias-navalny-disputes-prison-rules-in-supreme-court-hearing-3272082",
  "paragraph": "© Reuters. Russian opposition leader Alexei Navalny appears on a screen via a video link from the IK-3 penal colony in Kharp in the Yamal-Nenets region during a hearing against the Ministry of Justice in Supreme Court, in Moscow, Russia, January 11, 2024. REUTERS/Ma\nBy Mark Trevelyan and Filipp Lebedev (Reuters) -Jailed Russian opposition leader Alexei Navalny appeared before a Supreme Court judge by video link on Thursday to argue unsuccessfully for the right to longer meal breaks and access to more books in prison. Wearing a black prison uniform and standing behind bars in a small, bare room, Navalny, 47, appeared gaunt but spoke animatedly, at length and without notes. At one point he said some prison directors were \"malicious people and fascists, lunatics\", drawing a rebuke from judge Oleg Nefyodov. It was the second day running that Navalny had taken part in legal hearings from the Arctic \"Polar Wolf\" penal colony, one of Russia's harshest, to which he was transferred last month after his cumulative sentences were extended to more than 30 years. Navalny said prison rules limiting inmates to one book at a time meant that someone who chose to have a Bible or a Koran could not have any other religious or secular literature, including newspapers or magazines. \"One book is not enough for me. It clearly violates my religious rights,\" he said. He also argued that meal breaks were too short. \"I get two mugs of boiling water and two pieces of disgusting bread. I want to drink this boiling water normally and eat this bread. I have 10 minutes to eat. And I am forced to choke on this boiling water,\" he said. His arguments prompted a detailed discussion with Nefyodov and a representative of the justice ministry on prison libraries, meal arrangements and cell furnishings. Both his complaints were rejected, independent Russian news site Mediazona said. Navalny has frequently used such hearings in the past as a means of defying the authorities, demonstrating his resilience and maintaining a link to the outside world despite the harsh conditions of his imprisonment. \nHe and his supporters say the many charges against him, ranging from fraud to extremism, were trumped up to silence his criticism of President Vladimir Putin. Human rights groups and Western governments regard him as a political prisoner. The Kremlin makes a point of not speaking his name and says he is a convicted criminal whose treatment is a matter for the prison system."
}