{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0G0EL_L.jpg",
  "title": "Israel presses southern Gaza assault, Jordan decries damage to hospital",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 17, 2024 06:44AM ET",
    "Updated Jan 18, 2024 07:49AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/jordan-says-southern-gaza-hospital-badly-damaged-by-israeli-shelling-nearby-3276081",
  "paragraph": "By Arafat Barbakh, Tyrone Siu and Nidal al-Mughrabi GAZA/ISRAEL-GAZA BORDER/DOHA (Reuters) - Israel pressed its assault on Khan Younis in southern Gaza on Wednesday, sending tanks westwards while Jordan decried shelling that badly damaged its field hospital in the city. The Jordanian army said it held Israel responsible for a \"flagrant breach of international law\" in damage to the facility. Israel's military denied striking or damaging the hospital, saying it opened fire after encountering a \"terrorist cell\" next to the hospital.  In a statement, Israel's military said it coordinated the presence of troops in the area in advance with authorities and added medics were instructed to go to safer area. It said it could not identify the source of gunfire that injured a medical worker and the hospital remained \"fully functioning.\" People in and around another hospital, Nasser, fled as tanks approached the district overnight following an Israeli army statement that it had come under fire from the area.  Palestinian health officials said seven people were killed by Israeli air strikes that damaged homes near the hospital, one of only a third of Gaza's hospitals still partially operational. Farther south from the hospital in nearby Rafah, Palestinian health official said 16 people were killed when an Israeli missile hit a house in the city just before midnight on Wednesday. Several other people were wounded, they said, expecting the number of fatalities to increase. Israeli government spokesperson Eylon Levy said extra field hospitals were expected to be up and running in the coming days. \"These have of course been necessitated by Hamas' strategic militarization of Gaza's existing hospitals,\" he said, adding this showed that Hamas militants were the ones breaching international law. Hamas denies using hospitals for cover. Explosions from shelling and air strikes sounded further west in Khan Younis as the Israeli tanks moved on. Lines of thick black smoke rose from bomb sites. As night fell, residents reported heavy Israeli tank and aerial bombing in Khan Younis as well as the Al-Maghazi refugee camp in central Gaza. Israel said it had killed six Palestinian fighters, including the southern district Hamas officer in charge of interrogating suspected spies. The military said in a statement that the killing of counter-espionage officer Bilal Nofal \"significantly impacts the terrorist organisation's capacity to develop and enhance its capabilities\". 'MISSILES FALLING ON US' Further south in Rafah, where hundreds of thousands of people have moved on Israeli advice, people cried over several shrouded bodies, including of a young girl, Masa. \"We were asleep and then we found the missiles falling on us. We got up and couldn't see anything. We started checking on each other. The girl was martyred,\" said her aunt, Tahreer Shoman, adding that her siblings had been wounded but survived. In central Gaza, the Israeli military said it killed militants in Deir al-Balah who tried to fire mortars at its forces. It said soldiers apprehended seven militants and killed several others and destroyed rocket launchers in the area of Bureij, from which it said 25 rockets had been fired on Tuesday. Fighting also raged in densely populated Jabalia in northern Gaza on Wednesday, a day after Israeli tanks stormed back into parts of the north they left last week. In early January, Israel announced it was scaling back operations in the north of the Palestinian enclave as part of what it called a more targeted approach in its war against Hamas after operations that flattened entire residential districts. At least $15 billion will be needed just to rebuild houses in Gaza, the head of the Palestine Investment Fund, Mohammed Mustafa, told the World Economic Forum in Davos, Switzerland, on Wednesday, without taking into account the extensive damage to basic infrastructure and hospitals. Israel's military campaign has left Gaza's population facing crisis levels of hunger and at growing risk from disease as supplies run low, aid agencies say. \"If the war in Gaza continues, more people are likely to die of hunger or famine than war,\" Mustafa said. Aid destined for Palestinian residents and Israeli hostages in Gaza arrived in Egypt's Sinai Peninsula on Wednesday under a deal brokered by France and Qatar, Egyptian security and Red Crescent officials said. The Palestine Red Crescent Society later said 146 trucks carrying humanitarian aid entered Gaza from the Kerem Shalom crossing with Israel. From the Rafah crossing with Egypt, 48 trucks entered carrying food, water and medical supplies in addition to 12 commercial trucks, it said. The head of the United Nations' relief agency UNRWA, Philippe Lazzarini, described desperate scenes of overcrowding in Rafah on the Egyptian border. He said more than 1.2 million people there were seeking shelter from the fighting. With \"the struggle for survival consuming every hour\", Gazans are trying to protect themselves from the cold and rain using makeshift structures of plastic sheeting, said Lazzarini in a post on the UNRWA website, renewing his call for a humanitarian ceasefire. Communications were down across Gaza on Wednesday for a sixth day, leaving its Palestinian inhabitants unable to receive warnings on social media from the movement of Israeli forces. Most have already been forced to flee several times.  HOSTAGES Palestinian health officials said 163 Gazans had been reported killed over the past 24 hours, taking the death toll to 24,448. Israel's war on Gaza is in its fourth month. Israel reported two more soldiers killed, taking the toll since it began ground operations in Gaza to 193. \nIsrael says it has killed 9,000 Hamas militants and has vowed to \"eliminate\" the enclave's Hamas rulers after gunmen stormed into southern Israel, killing 1,200 people, according to Israeli tallies. On Wednesday, Israel adjusted the number of people it says were taken hostage on Oct. 7 to 253 from 240. Around half of the hostages were released in an October truce during which some Palestinian prisoners were also freed."
}