{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0O05Z_L.jpg",
  "title": "Taiwan begins extended one-year conscription in response to China threat",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 25, 2024 01:42AM ET",
    "Updated Jan 25, 2024 11:42AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/taiwan-begins-extended-oneyear-conscription-in-response-to-china-threat-3282445",
  "paragraph": "© Reuters. The first batch of new recruits listens to instructions as they set to begin one-year compulsory military service in Taiwan, after the previous four-month conscription period was extended starting 2024, in Taichung, Taiwan January 25, 2024. REUTERS/Ann Wa\nBy Fabian Hamacher and Ann Wang TAICHUNG, Taiwan (Reuters) - The first batch of new recruits began serving their one-year compulsory military service in Taiwan on Thursday after the conscription period was extended from four months due to government concerns about China's rising military threat. President Tsai Ing-wen announced the extension in late 2022. China has ramped up military, diplomatic and economic pressure on Taiwan to assert its sovereignty claims, including almost daily Chinese air force missions near the island over the past four years. At a recruitment centre in central Taiwan's Taichung, a group of young men gathered in the morning cold to be inducted, as dogs checked their bags for drugs and barbers shaved their heads before changing into army fatigues.     \"It is our shared responsibility to adjust the structure of the military and improve combat power. It is also a foundation for us to strengthen our military power,\" officer Lien Chih-wei told reporters. Taiwan's army said in a statement that it expected a total of 670 conscripts to join in the first batch under the newly extended scheme. \"In the face of a complex international environment, it is our first priority to build the strong will to resist the enemy,\" it said. \"The extension of compulsory service to one year will not only enhance immediate combat effectiveness, but will also improve the quality of reserve personnel, strengthen mobilisation energy, and enhance the overall combat effectiveness of national defence.\"  Tsai has described the previous military system, including training reservists, as inefficient and insufficient to cope with China's rising military threat, especially if it launched a rapid attack on the island. Conscripts will undergo more intense training, including shooting exercises, combat instruction used by U.S. forces, and operating more powerful weapons including Stinger anti-aircraft missiles and anti-tank missiles, according to previously announced plans. Yin Hsin-shih, 18, said he was a \"little bit excited\" to be joining up. \"For the country, it will provide the needed defence power given that our neighbouring country is a great threat to our nation,\" he said, referring to China.  The United States, Taiwan's most important international backer and arms seller despite the lack of formal diplomatic ties, has welcomed the conscription reform as part of Taiwan's efforts to boost its ability to defend itself. However, the period of service in Taiwan is still shorter than the 18 months mandated in South Korea, which faces a hostile and nuclear-armed North Korea. \nAfter Taiwan announced the extension in 2022, China criticised Taiwan for seeking to use the Taiwanese people as \"cannon fodder\". Taiwan's government rejects Beijing's sovereignty claims and says only the Taiwanese people can decide their future."
}