{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK150PK_L.jpg",
  "title": "Trump civil fraud case judge to probe potential perjury by ex-CFO",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 06, 2024 01:43PM ET",
    "Updated Feb 06, 2024 01:53PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/trump-civil-fraud-case-judge-to-probe-potential-perjury-by-excfo-3294278",
  "paragraph": "© Reuters. FILE PHOTO: Republican presidential candidate and former U.S. President Donald Trump holds a campaign rally ahead of the Republican caucus in Las Vegas, Nevada, U.S., January 27, 2024. REUTERS/Ronda Churchill\nBy Jack Queen (Reuters) -A New York judge overseeing Donald Trump's civil fraud trial has asked lawyers in the case for information about possible perjury by the former U.S. president's onetime finance chief, who is reportedly facing criminal charges for lying on the stand.  In a letter docketed Tuesday, Justice Arthur Engoron told lawyers for Trump and the New York Attorney General’s Office that he wants to know whether former Trump Organization Chief Financial Officer Allen Weisselberg “is admitting he lied under oath in my courtroom.”  Engoron said the matter could affect the timing of his final ruling in the case, which is expected by mid-February.  Lawyers for Weisselberg did not immediately respond to requests for comment.  Trump, the frontrunner for the 2024 Republican presidential nomination, is accused in the lawsuit by New York Attorney General Letitia James of inflating his net worth by billions of dollars to secure better loan terms. James, an elected Democrat, seeks $370 million in penalties and sharp restrictions on Trump’s ability to do business in New York.  Trump has denied wrongdoing and called the case a political vendetta.  The New York Times reported last week that Weisselberg, who is also a defendant in the case, is \"negotiating a deal with Manhattan prosecutors that would require him to plead guilty to perjury\" for testifying that he did not play a role in Trump's false statements about the values of his properties.  Engoron presided over a contentious three-month trial last year and will decide the case without a jury. In his letter dated Monday, he asked the lawyers in the case to advise him on whether Weisselberg's reported plea negotiations should affect the timing of his ruling.  He also indicated that he may write off Weisselberg's trial testimony as unreliable if the former finance chief pleads guilty to perjury.  Before the trial began in October, Engoron found Trump liable for fraud and ordered the dissolution of companies that control pillars of his real estate empire, including Trump Tower and 40 Wall Street in lower Manhattan. That ruling is on hold while Trump appeals, and its practical implications remain unclear.  The case is part of a maelstrom of legal troubles Trump faces as he marches toward the Republican nomination to face Democratic President Joe Biden in the November 2024 election. \nHe is under indictment in Washington and Georgia for his efforts to overturn his 2020 election loss, in Florida for his handling of classified documents after leaving the White House and in New York over hush money payments to a porn star.  Trump has pleaded not guilty in all of the cases and said they are political witch hunts."
}