{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "In Gaza, rows of white shrouds symbolise mounting civilian deaths",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 29, 2023 06:25AM ET",
    "Updated Dec 29, 2023 04:48PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/in-gaza-rows-of-white-shrouds-symbolise-mounting-civilian-deaths-3264636",
  "paragraph": "By Nidal al-Mughrabi, Fadi Shana, IbraheemAbu Mustafa and Saleh Salem GAZA, RAFA, CAIRO (Reuters) -\"My life, my eyes, my soul,\" a husband writes on the white shroud wrapped around his wife after the war devastating Gaza took her life. A bereaved son writes \"my mother and everything\" on the burial cloth covering his mother, another of the more than 21,000 Palestinians killed in the Israel-Hamas confrontation. Over the past 12 weeks the piece of white cloth has become a symbol of civilian deaths wrought by Israel as it retaliates for Hamas killing 1,200 people and taking 240 hostages in its Oct. 7 cross-border raid, the deadliest day in Israel's history. While the besieged Palestinian territory faces severe shortages of food, water and medicine, the white coverings used to wrap dead Palestinians have remained in abundant supply. Not all the shrouds bear loving words. Such is the war's chaos, some of the dead cannot immediately be identified.  In such cases, the shrouds bear the words \"unknown male\" or \"unknown female\", and before burial pictures are taken and the date and place of the strike documented so individuals can be identified by relatives later. If the conflict escalates, the supply of the white coverings donated by Arab governments and charities is expected to keep pace with demand. But there are difficulties brought on by the sheer number of the dead, and sometimes there are gaps in the local availability of the shrouds. \"The challenges we face are too much, there is shortage in the knives and the scissors that we need to prepare the shrouds and cut them,\" said Mohammed Abu Mussa, a volunteer at Keratan society, which prepares dead bodies for burial. KNIVES, SCISSORS, COTTON \"As you know, there is a blockade and there are no materials in the Gaza Strip, so we find difficulties getting knives, scissors, and cotton,” he said, adding that so many people are dying that sometimes donated shrouds are not enough and he has to wrap four of five people in one shroud. Marwan Al-Hams, director of Abu Yousef Al Najjar hospital, said the prevalence of the shrouds signifies Gaza's suffering. “The big number of the martyrs made the white shroud a symbol for this war and it became parallel to the Palestine flag in its influence and the knowledge of the world about the significance of our cause,\" he said.  The white covering goes back to a narration by the Prophet Muhammed, who encouraged his followers to wear white clothes and also wrap the dead in white. Shrouds from Arab donors come packed with a bar of soap, perfume, cotton, and eucalyptus, for the preparation of bodies for burial, a doctor at a hospital in the southern town of Rafah told Reuters.  A Gaza Health Ministry official told Reuters shrouds are manufactured either from textile or nylon material. While the nylon ones are made in both white and black, white is the traditional colour and is preferred. In Gaza in normal times the minute someone dies, a relative goes to the market and buys a \"Kafan\", or shroud. SCENES OF CHAOS But for Abdel-Hamid Abdel-Atti, a local journalist, the process in war-time Gaza began amid scenes of chaos and devastation, with bodies of six of his loved ones including his mother and brother being pulled from rubble. The six were killed in an Israeli strike on Al-Nusseirat refugee camp in central Gaza Strip on Dec. 7. The strike smashed a building on top of them as they slept. Describing the procedure as the most painful experience of his life, he obtained shrouds from a hospital and wrapped them around his relatives' bodies. \"The first one I did was my brother, the rest came wrapped in blankets and I asked they don't be taken off, I put the shrouds over the blankets, and tied them carefully, before paying them farewell,\" Abdel-Atti told Reuters.  \"As I wrapped them in shrouds I wondered what was their fault ... Why did Israel kill them as they slept in peace?\" \nThe only consolation, he said, was his relatives are going to heaven. \"White resembles peace, resembles calm. It is part of our tradition and belief and by white shrouds, it is as if we are asking God to remove and clear all their sins and accept them in heaven,” said Abdel-Atti. Asked how much the risk of death preoccupied him, the journalist replied: \"Each one of us is afraid. With nightfall, people feel as if they are in a closed cage and each awaits his or her turn to die.\""
}