{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0S0HY_L.jpg",
  "title": "US appeals court won't block West Point's race-conscious admissions policy",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 29, 2024 10:29AM ET",
    "Updated Jan 29, 2024 10:35AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-appeals-court-wont-block-west-points-raceconscious-admissions-policy-3286153",
  "paragraph": "© Reuters. FILE PHOTO: Graduating senior Cadets attend the U.S. Military Academy's Class of 2022 graduation ceremony at West Point, New York, May 21, 2022. REUTERS/David Dee Delgado/File Photo\nBy Nate Raymond (Reuters) - A federal appeals court on Monday declined to block the U.S. Military Academy at West Point from considering race as a factor in admissions decisions, as the U.S. Supreme Court weighs whether to halt the elite U.S. Army school from doing so. The New York-based 2nd U.S. Circuit Court of Appeals declined to issue an injunction sought by Students for Fair Admissions, the group behind a successful Supreme Court challenge to race-conscious collegiate admissions policies. That group, founded by affirmative action opponent Edward Blum, had been seeking an injunction pending its appeal of a federal judge's Jan. 3 ruling rejecting its bid to halt West Point from considering race as an admissions factor. With time running out before the current application deadline of Jan. 31, Students for Fair Admissions on Friday asked the U.S. Supreme Court to likewise block West Point's admissions policy while it pursues appeals.  It did so before the 2nd Circuit had ruled. But Blum's group in a filing on Sunday asked the 2nd Circuit to rule, saying it would withdraw its Supreme Court appeal if the 2nd Circuit ruled in its favor. West Point is a prestigious military service academy in New York state that educates cadets for commissioning into the U.S. Army. The U.S. Justice Department in court filings has said that West Point is a \"vital pipeline to the officer corps\" and that its race-conscious admissions practices help the Army achieve its \"mission critical\" goal of having officers as diverse as its enlisted military personnel. Blum declined to comment on Monday, citing the pending Supreme Court appeal. President Joe Biden's administration has until Tuesday to respond to the group's Supreme Court appeal. Blum's group sued West Point in September with the goal of ending what was essentially an exemption for military academies included in the Supreme Court's ruling on college admissions in June 2023 that allowed these institutions to continue to consider race in admissions. In the ruling powered by its 6-3 conservative majority, the Supreme Court rejected policies long used by American colleges and universities to increase the number of Black, Hispanic and other minority students on American campuses. In invalidating admissions policies at Harvard University and the University of North Carolina, the Supreme Court did not address race in admissions at military academies, which Chief Justice John Roberts in a footnote said had \"potentially distinct interests.\" Blum's group accused West Point of using admissions practices that discriminated against white applicants and violated the principle of equal protection in the U.S. Constitution. \nThe Biden administration has argued that senior military leaders long have recognized that a scarcity of minority officers can create distrust within the armed forces. Although Black people make up 20.2% of the Army's active duty enlisted personnel, only 11% of officers are Black, the Justice Department said. Hispanic people constitute 18% of active personnel but only 9% of officers, it added. White people constitute 51.7% of the Army active duty enlisted corps and 68% of its officers, the Justice Department said."
}