{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0O0V5_L.jpg",
  "title": "Exclusive-US sets up channel with Israel seeking answers on civilian casualties",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 25, 2024 04:29PM ET",
    "Updated Jan 25, 2024 06:11PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/exclusiveus-sets-up-channel-with-israel-seeking-answers-on-civilian-casualties-3283517",
  "paragraph": "© Reuters. Palestinians fleeing Khan Younis, due to the Israeli ground operation, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, move towards Rafah, in the southern Gaza Strip, January 25, 2024. REUTERS/Ibraheem Abu Mustafa\nBy Humeyra Pamuk WASHINGTON (Reuters) - The United States has created a channel with Israel to discuss concerns over incidents in Gaza in which civilians have been killed or injured by the Israeli military and civilian facilities have been targeted, two U.S. officials with knowledge told Reuters. The channel was set up after a meeting earlier this month between U.S. Secretary of State Antony Blinken and Israel's war cabinet during which Blinken expressed concern about the \"constant\" reports of Israeli strikes that either hit humanitarian sites or resulted in large numbers of civilian deaths. In the meeting, Blinken told Israeli Prime Minister Benjamin Netanyahu, Defense Minister Yoav Gallant and minister Benny Gantz that Washington needed to know \"what the answers are\" when it comes to reports of strikes, and sought a \"reliable channel\" through which the United States can raise such issues with the Israelis regularly, one of the U.S. officials said. The existence of this initiative has not been previously reported and the U.S. officials requested anonymity to discuss the sensitive details around it. The channel comes as a response to the mounting pressure on the Biden administration over the steep toll on Palestinian civilians of Israel's campaign against Hamas that has killed more than 25,000 people, according to Palestinian health ministry, and displaced millions. It also underscores Washington's frustration with Israel's failure to alleviate the plight of a civilian population deprived since mid-October of most of the aid that previously flowed into Gaza, and of adequate medical care for the more than 62,000 people who have been wounded. Through the channel, which has been active for the last few weeks, Washington raises with the Israelis \"every specific incident of concern\" related to Israel's military campaign in Gaza, another U.S. official said. The Israelis investigate and provide feedback to the Americans. In some instances, the Israelis have conveyed additional information that sheds light on an incident while in others, they admitted they \"made a mistake,\" the officials said, without specifying which ones. The United States set up the process to drive accountability for Israel, one of the officials said. It was not clear what action, if any, Washington would take against Israel as a result of what it learns. Asked about the channel, a State Department spokesperson declined to address it directly but said Washington was making clear that Israel must protect humanitarian infrastructure and take every possible precaution to minimize civilian casualties. \"When we see reports of incidents that raise concerns, we raise those incidents directly with the government of Israel and seek additional information,\" the spokesperson said. The channel works through diplomats in the U.S. embassy in Jerusalem, the State Department's regional bureau focusing on the Middle East, and President Joe Biden's special envoy for the region's humanitarian issues, David Satterfield, the officials said. Most recently, the United States used the channel to seek details on what the United Nations said on Wednesday was an attack by Israeli tanks on one of its compounds in Gaza sheltering displaced Palestinians. It was not clear how Israel responded, officials said. ACCOUNTABILITY The effort, which is the first formal push by Washington to demand explanations from Israel on the high civilian death toll, falls short of the more robust tools Washington has deployed in the past to investigate allegations of large-scale killings of civilians.  One of those is the atrocity determination process, which the U.S. conducted in 2022 to address Russia's invasion of Ukraine. That effort concluded that members of Russia's forces have committed war crimes. In December 2023, the State Department used the same process to determine formally that warring parties in Sudan committed war crimes. Human rights advocates have urged the U.S. to do more to force a change from Israel.  “Nearly four months in, the Biden administration should be doing so much more than simply discussing concerns, which they’ve raised publicly for months. It should be conditioning assistance and support on dramatic improvements and accountability for continued violations,” said Seth Binder of the Project on Middle East Democracy rights group. The Biden administration has so far refused to criticize Israel directly over the civilian Palestinian death toll, even though senior Biden aides have said \"far too many\" Palestinians have been killed in the conflict. U.S. officials have also declined to say if Washington was considering investigating whether Israel's battlefield actions have violated the international rules of war. The United States provides Israel $3.8 billion in annual military assistance. While Washington has traditionally used such aid to influence the behavior of its allies, it has largely ruled out using that leverage with Israel, which critics say provides a sense of impunity for the country. State Department deputy spokesperson Vedant Patel said on Wednesday that any civilian death was \"heart-breaking\" but it was not an American operation and it was up to the Israeli army to investigate \"credible allegations of law or of war violations when they arise.\"  \nIsrael unleashed its war to eradicate Hamas after militants from Gaza launched a shock incursion into southern Israel on Oct. 7, killing 1,200 people and seizing around 240 hostages. Urgent international appeals for a ceasefire to spare civilians have been unsuccessful, with Israel vowing not to relent until Hamas has been destroyed and all hostages freed."
}