{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "Struggling Caracas restaurants, bars offer tour to boost sales",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 31, 2023 06:16AM ET",
    "Updated Dec 31, 2023 06:47AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/struggling-caracas-restaurants-bars-offer-tour-to-boost-sales-3264966",
  "paragraph": "By Efrain Otero CARACAS (Reuters) -Several bars and restaurants in Venezuela's capital Caracas are offering an eight-hour tour where customers visit each establishment in a bid to boost low sales at a time of persistent inflation.  The so-called \"Route of Pagan Temples\" takes diners through two restaurants and seven bars in the city in a tour which has been organized by the businesses involved.  \"It's about rescuing the bars (...) giving these spaces a showcase so that they can survive,\" said Freddy de Freitas, owner of a Spanish food restaurant in Caracas' center which is more than 40 years old.  \"The business activity of bars in this part of the city isn't what it was due to the situation of the economy,\" he added.  The government of President Nicolas Maduro relaxed control of the economy in 2019, allowing de facto dollarization which provided breathing space for businesses, though not a complete recovery. This year, businesses have seen lower sales due to delays in wage payments and year-on-year inflation of 282%.  The nine-venue tour starts in de Freitas' Spanish restaurant, where visitors can chow down on tapas including croquettes and potato tortilla among others, before continuing on to the other establishments in private transport.  The tour - which costs $80 per person - winds up in a bustling part of Caracas filled with street musicians. \"The route seeks to reconnect people with these places, to know their history, so that there's no gap between the east and west of the city, that there is only one Caracas,\" said Maxwell Briceno, a photographer and tour organizer. \nOne recent tour saw a number of foreign visitors join in the fun, according to Reuters witnesses. \"I have the opportunity to see this spectacle. It's wild,\" said German tourist Rafael Braumann. \"The beer tastes good and there's music,\" he added."
}