{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK010GO_L.jpg",
  "title": "Harvard President Gay resigns after rocky testimony, plagiarism allegations",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 02, 2024 01:11PM ET",
    "Updated Jan 03, 2024 06:41PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Stoxer One",
        "2024-01-03 06:41:52",
        "Finally. Took long enough. ",
        "https://www.investing.com/members/200770726"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/harvard-president-gay-resigns-harvard-crimson-student-newspaper-3265713",
  "paragraph": "© Reuters. Incoming President of Harvard University and current Dean of the Faculty of Arts and Sciences Claudine Gay listens during Harvard University’s 372nd Commencement Exercises in Cambridge, Massachusetts, U.S., May 25, 2023. REUTERS/Brian Snyder\nBy Gabriella Borter and Doina Chiacu WASHINGTON (Reuters) - Harvard President Claudine Gay said she would resign from her position on Tuesday, ending a six-month tenure marred by allegations of plagiarism and backlash over her congressional testimony about antisemitism on campus. Gay had come under pressure to resign from Harvard's Jewish community and some members of Congress over her comments at the Dec. 5 congressional hearing, while also facing several allegations of plagiarism for her academic work in recent months.  In a letter to the Harvard community, Gay said her decision to step down had been \"difficult beyond words.\" \"After consultation with members of the (Harvard) Corporation, it has become clear that it is in the best interests of Harvard for me to resign so that our community can navigate this moment of extraordinary challenge with a focus on the institution rather than any individual,\" she wrote. The Harvard Corporation, the university's 11-member governing body, said in an email to the community that its members had accepted Gay's resignation \"with sorrow,\" and that the school's provost and chief academic officer, Alan Garber, would take over as interim president. Gay, former University of Pennsylvania President Liz Magill and Massachusetts Institute of Technology President Sally Kornbluth testified before a U.S. House of Representatives committee on Dec. 5 about a rise in antisemitism on college campuses following the outbreak of the Israel-Hamas war in October. The trio declined to give a definitive \"yes\" or \"no\" answer to a question by U.S. Republican Representative Elise Stefanik as to whether calling for the genocide of Jews would violate their schools' codes of conduct regarding bullying and harassment, saying they had to balance it against free-speech protections. Citing dissatisfaction with their testimony, more than 70 U.S. lawmakers signed a letter demanding that the governing boards of the three universities remove the presidents. Magill resigned after receiving backlash for her comments. \"TWO DOWN,\" Stefanik wrote on social-media platform X, formerly known as Twitter, on Tuesday. \"Harvard knows that this long overdue forced resignation of the antisemitic plagiarist president is just the beginning of what will be the greatest scandal of any college or university in history.\"  'RACIST VITRIOL' Despite the controversy ensnaring Gay, the Harvard Corporation last month reaffirmed its confidence that she could lead the school through a period of high tension over the war in the Middle East. It also said an independent review of Gay's academic work found she had not committed research misconduct. She has submitted several corrections for citation errors in recent weeks. Gay, the first Black president in Harvard's 388-year history, and the members of the Harvard Corporation said in their letters to the community on Tuesday that she had been subject to racist attacks.  Some of Gay's critics, including billionaire hedge fund manager Bill Ackman, have argued that she was chosen for the role as part of the school's effort to promote diversity rather than for her qualifications. Right-wing activists, including journalist and researcher Christopher Rufo, celebrated Gay's resignation on Tuesday as a win in their mission to dismantle diversity, equity and inclusion programs. Ackman, who heads Pershing Square Capital Management, could not immediately be reached for comment on Tuesday. He reposted the Harvard Crimson's story about Gay's resignation on social media platform X.  \"It has been distressing to have doubt cast on my commitments to confronting hate and to upholding scholarly rigor - two bedrock values that are fundamental to who I am - and frightening to be subjected to personal attacks and threats fueled by racial animus,\" Gay said in her statement. \nThe Harvard Corporation wrote that she had been subjected to \"deeply personal and sustained attacks\" that included \"racist vitriol directed at her through disgraceful emails and phone calls.\" Reverend Al Sharpton, president of the National Action Network, said in a statement on Tuesday that Gay's resignation was \"an assault on the health, strength, and future of diversity, equity and inclusion.\" He blamed it on what he called Ackman's \"relentless campaign\" against Gay. Sharpton said the National Action Network was planning a protest outside Ackman's New York office on Thursday."
}