{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0Q077_L.jpg",
  "title": "More countries pause funds for UN Palestinian agency; Israel wants it replaced",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 27, 2024 10:11AM ET",
    "Updated Jan 27, 2024 04:05PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Mark Gesswein",
        "2024-01-28 02:32:13",
        "The entire UN organization is a criminal enterprise. It should be shut down entirely.",
        "https://www.investing.com/members/245851936"
      ],
      [
        "Brad Albright",
        "2024-01-28 03:59:02",
        "Yes. Let's turn back the clock 80 years.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Buj HK",
        "2024-01-28 11:15:17",
        "I second that. UN is dictated by the decisions of the 5 permanent members i.e USA, China, France, Russia and UK. UN should be democratic and no one country should have veto power. We need a new UN",
        "https://www.investing.com/members/200555387"
      ],
      [
        "Brad Albright",
        "2024-01-28 14:05:51",
        "Now, that is a worthwhile observation -- but it entails a change to the adminstration of the UN while adhering to its mission, not an abolishment so that autocrats and dictators can better subjugate people as the above commenter would hope.",
        "https://www.investing.com/members/236251128"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/britain-italy-and-finland-pause-funding-for-un-refugee-agency-in-gaza-3284971",
  "paragraph": "© Reuters. A truck, marked with United Nations Relief and Works Agency (UNRWA) logo, crosses into Egypt from Gaza, at the Rafah border crossing between Egypt and the Gaza Strip, during a temporary truce between Hamas and Israel, in Rafah, Egypt, November 27, 2023. R\nLONDON (Reuters) -Six European countries paused funding for the U.N. refugee agency for Palestinians (UNRWA) on Saturday, following allegations that some of its staff were involved in the Oct. 7 Hamas attacks on Israel. Britain, Germany, Italy, the Netherlands, Switzerland and Finland on Saturday joined the United States, Australia and Canada in pausing funding to the aid agency, a critical source of support for people in Gaza, after the allegations by Israel. \"Palestinians in Gaza did not need this additional collective punishment,\" Philippe Lazzarini, UNRWA commissioner-general, said on X. \"This stains all of us.\" The agency said on Friday it had opened an investigation into several employees and severed ties with those people. Encouraging more donor suspensions, Israeli Foreign Minister Israel Katz said UNRWA should be replaced once fighting in the enclave dies down and accused it of ties to Islamist militants in Gaza. \"In Gaza's rebuilding, @UNRWA must be replaced with agencies dedicated to genuine peace and development,\" he added on X. Deputy U.N. spokesperson Farhan Haq, asked about Katz's remarks, said: “We are not responding to rhetoric. UNRWA overall had had a strong record, which we have repeatedly underscored.” Lazzarini said the decision by the nine countries threatened its humanitarian work across the region, especially in Gaza. “It is shocking to see a suspension of funds to the Agency in reaction to allegations against a small group of staff, especially given the immediate action that UNRWA took by terminating their contracts and asking for a transparent independent investigation,\" he said in a statement. The Palestinian foreign ministry criticised what it described as an Israeli campaign against UNRWA, and Hamas condemned the termination of employee contracts \"based on information derived from the Zionist enemy\". AGENCY PLAYS BIG ROLE IN GAZA AID UNRWA was set up to help refugees of the 1948 war at Israel's founding and provides education, health and aid services to Palestinians in Gaza, the West Bank, Jordan, Syria, and Lebanon. It helps about two thirds of Gaza's 2.3 million population and has played a pivotal aid role during the war that Israel launched to eliminate Hamas after the Oct. 7 attacks. Announcing the investigation, Lazzarini said on Friday that he had decided to terminate the contracts of some staff members to protect the agency's ability to deliver humanitarian assistance. Lazzarini did not disclose the number of employees allegedly involved in the attacks, nor the nature of their alleged involvement. He said, however, that \"any UNRWA employee who was involved in acts of terror\" would be held accountable, including through criminal prosecution. During weeks of Israeli bombardment of the Palestinian enclave, UNRWA has repeatedly said its capacity to render humanitarian assistance to people in Gaza is on the verge of collapse. Hussein al-Sheikh, head of the Palestinians' umbrella political body the Palestine Liberation Organization (PLO), said cutting support to the agency brought major political and relief risks.  \"We call on countries that announced the cessation of their support for UNRWA to immediately reverse their decision,\" he said on X. \nThe Foreign Ministry in Germany, a major donor to UNRWA, welcomed UNRWA's investigation, saying it was deeply concerned about the allegations raised against agency employees. \"We expect Lazzarini to make it clear within UNRWA's workforce that all forms of hatred and violence are totally unacceptable and will not be tolerated,\" it said on X."
}