{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBT063_L.jpg",
  "title": "Burundi's president says gay people should be stoned",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 30, 2023 12:35PM ET",
    "Updated Dec 30, 2023 12:41PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Ken Roth",
        "2023-12-30 19:41:10",
        "Time to stop all money transfer to africa, considering the billions they have received in the past 100 years from western countries its time to ask ourselves what are we paying for ? Dictators, corruption ?",
        "https://www.investing.com/members/213081368"
      ],
      [
        "mubark adriss",
        "2023-12-30 23:50:34",
        "Money originally taken from Africa and god create only 2 genders ",
        "https://www.investing.com/members/206761918"
      ],
      [
        "Fraj Ouardani",
        "2023-12-31 00:57:24",
        "100 years? go back to history books you shmuck",
        "https://www.investing.com/members/254484699"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/burundis-president-says-gay-people-should-be-stoned-3264907",
  "paragraph": "© Reuters. Burundi President Evariste Ndayishimiye addresses the 78th Session of the U.N. General Assembly in New York City, U.S., September 21, 2023. REUTERS/Brendan McDermid\nBUJUMBURA (Reuters) - Burundi's President Evariste Ndayishimiye has called on citizens to stone gay people, escalating a crackdown on sexual minorities in a country where LGBT people already face social ostracism and jail terms of up to two years if convicted of same-sex offences. \"If you want to attract a curse to the country, accept homosexuality,\" Ndayishimiye said in a question and answer session with journalists and the public held in Burundi's east on Friday. \"I even think that these people, if we find them in Burundi, it is better to lead them to a stadium and stone them. And that cannot be a sin,\" he said, describing homosexuality as imported from the West. His comments were the latest show of widening intolerance of LGBT people in the region. Uganda passed a law in May that carries the death sentence for certain categories of same-sex offences and lengthy jail sentences for others - a move that was widely condemned by Western governments and human rights activists.  The United States has imposed a range of sanctions including travel restrictions and removing Uganda from a tariff-free trade deal. The World Bank also suspended all future loans to the east African country in protest.  \nSome lawmakers in Kenya, South Sudan and Tanzania are pushing for similarly tough anti-gay laws in their countries. The politicians in these countries see their efforts as buttressing African values and sovereignty against what they view as Western pressure on the issue."
}