{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK1306Q_L.jpg",
  "title": "Canada to sanction West Bank settlers and Hamas leaders - minister",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Feb 04, 2024 12:09PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/canada-to-sanction-west-bank-settlers-and-hamas-leaders--minister-3292076",
  "paragraph": "© Reuters. FILE PHOTO: Canada's Foreign Minister Melanie Joly arrives at Oslo City Hall during NATO's informal meeting of foreign ministers in Oslo, Norway June 1, 2023. Hanna Johre/NTB/via REUTERS/File Photo\nOTTAWA (Reuters) - Canada will impose sanctions on Israeli settlers who incite violence in the West Bank and introduce new sanctions on Hamas leaders, Foreign Minister Melanie Joly said on Sunday, after the United States took similar action last week. On Thursday, the United States sanctioned four Israeli men accused of being involved in violence in the occupied territory. In an interview with the Canadian Broadcasting Corp on Sunday, Joly said some settlers \"will be sanctioned\" and \"we will also bring new sanctions on Hamas leaders\". \"We're working actively on it,\" Joly said, speaking from Ukraine. \"I'm making sure that while I'm in Ukraine, the work is being done in Ottawa and I look forward to doing an announcement soon.\" Canadian Prime Minister Justin Trudeau on Friday said he was considering imposing sanctions on \"extremist\" settlers in the West Bank. \nSince the 1967 Middle East war, Israel has occupied the West Bank of the Jordan River, which Palestinians want as the core of an independent state. It has built Jewish settlements there that most countries deem illegal. Israel disputes this and cites historical and biblical ties to the land. In the 18 months before Hamas's Oct. 7 attack on Israel, the West Bank had already seen its highest levels of unrest in decades. Confrontations there have risen sharply since Israeli forces launched their retaliatory offensive on Gaza."
}