{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0T0N2_L.jpg",
  "title": "Exclusive-UNC pays anti-affirmative action group $4.8 million after US Supreme Court loss",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 30, 2024 12:58PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/exclusiveunc-pays-antiaffirmative-action-group-48-million-after-us-supreme-court-loss-3287338",
  "paragraph": "© Reuters. FILE PHOTO: Members of the University of North Carolina’s student body mingle in Chapel Hill, North Carolina, U.S., March 28, 2023. REUTERS/Jonathan Drake\nBy Nate Raymond (Reuters) - The University of North Carolina has agreed to pay $4.8 million to cover the fees and expenses of a group founded by affirmative action critic Edward Blum that won a U.S. Supreme Court challenge to the school's consideration of race in student admissions. The university disclosed those details in response to a public records request by Reuters seeking information on how much it agreed to pay to settle the fee demand by Students for Fair Admissions, a Virginia-based nonprofit organization. Under a federal law called the Civil Rights Attorney's Fees Award Act of 1976, courts are authorized to award plaintiffs who prevail in certain civil rights cases reasonable attorneys' fees. UNC agreed to pay Blum's group $3.9 million to cover its fees and $900,000 for its expenses, according to the university's records request response made on Monday. The university did not immediately respond to a request for comment. The group had sought to recoup some of its legal expenses from UNC after the Supreme Court issued its landmark rulinglast June that the consideration of race in admissions to colleges and universities violated the U.S. Constitution's promise of equal protection under the law. The court, with its conservative majority, ruled against UNC and Harvard University. Many U.S. colleges and universities long considered race as one of numerous factors in admissions decisions to raise the number of Black, Hispanic and certain other underrepresented minority students on American campuses. Many schools place a premium on achieving a diverse student population to bring a range of perspectives onto campuses. Blum over the years has pursued numerous lawsuits against universities to challenge to race-conscious admissions. Students for Fair Admissions accused UNC, located in Chapel Hill, of unlawfully discriminating against white and Asian American applicants in its admissions process to favor underrepresented Black and Hispanic applicants. The UNC and Harvard cases arrived at the Supreme Court after years of litigation. Blum's group first sued both schools in 2014. Judges initially ruled against the group in both cases following non-jury trials, prompting its appeals. According to tax filings, Students for Fair Admissions has spent about $8 million on legal expenses during the course of its various lawsuits since 2015, with nearly $6.9 million going to its primary law firm, Consovoy McCarthy.  Blum on Tuesday noted that UNC and Harvard each spent much more - tens of millions of dollars - to defend themselves against his lawsuits. Harvard this month resolved a similar fees request by the group. The financial terms of its agreement with the private university are not public. A Harvard spokesperson did not immediately respond to a request for comment. In the wake of its Supreme Court victory, Students for Fair Admissions filed lawsuits starting in September against U.S. military service academies seeking to challenge an exemption for them nestled in last year's ruling.  \nThe group on Friday asked the Supreme Court to block the U.S. Military Academy at West Point, the prestigious U.S. Army school, from considering race as a factor in admissions decisions while a dispute over the practice proceeds in a lower court. Affirmative action had withstood Supreme Court scrutiny for decades, most recently in a 2016 ruling involving a white student backed by Blum who sued the University of Texas after being rejected for admission."
}