{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0O0DO_L.jpg",
  "title": "Former Trump adviser Navarro gets four months for contempt of Congress",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 25, 2024 06:13AM ET",
    "Updated Jan 25, 2024 06:26PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/former-trump-adviser-navarro-to-be-sentenced-for-contempt-of-congress-3282629",
  "paragraph": "© Reuters. FILE PHOTO: Peter Navarro, adviser to former U.S. President Donald Trump, faces reporters after he was convicted of contempt of Congress for refusing to cooperate with the House of Representatives committee investigating the January 6, 2021 attack on the \nBy Andrew Goudsward WASHINGTON (Reuters) -Former President Donald Trump's trade adviser Peter Navarro was sentenced on Thursday to four months in prison for contempt of Congress, with a judge scolding him for defying a subpoena in an investigation into the Jan. 6, 2021, U.S. Capitol attack and telling him, \"You are not a victim.\"  U.S. District Judge Amit Mehta told Navarro, 74, during the sentencing hearing in Washington federal court that his refusal to provide documents and testimony had hindered the work of the Democratic-led House of Representatives committee. \"They had a job to do and you made it harder,\" Mehta said. Navarro said he would appeal. \"It is a case that really asks the important question of whether a senior White House aide and alter ego for the president can be compelled to testify by Congress,\" Navarro said outside the courthouse, as protesters blew whistles behind him. Navarro also asked for donations to help pay his legal costs.  He was found guilty by a jury in September of two misdemeanor counts of contempt of Congress for defying a subpoena from the committee. The panel investigated the Jan. 6 attack by Trump supporters and broader attempts by the former president to overturn his 2020 election loss to Democrat Joe Biden. \"You are not a victim. You're not the object of a political prosecution. You have received every process you are due,\" the judge told Navarro. Mehta also reprimanded Navarro for his past statements that Biden and other prominent Democrats were behind the prosecution. \"Joe Biden is not responsible for your prosecution,\" the judge told Navarro. \"It's those kinds of statements from somebody who knows better that contributes to why our politics are so corrosive.\" Federal prosecutors had asked Mehta to give Navarro a six-month sentence, arguing that he chose allegiance to Trump over the rule of law. \"The defendant brazenly defied Congress,\" prosecutor John Crabb said during the hearing. Navarro's lawyers had asked for probation.  He faced a maximum of two years in prison on the charges. Navarro asked that any sentence be put on hold while he pursues an appeal. The judge did not immediately decide that issue.  Navarro has argued that he believed that he did not have to cooperate with Congress because he thought Trump had invoked the legal doctrine of executive privilege, which shields some presidential records and communications from disclosure. During the hearing, Mehta told Navarro, \"The words 'executive privilege' are not magical dust to avoid a duty that you have when Congress issues process. It's not a get-out-of jail-free card.\" The judge said he believes Navarro thought he had a duty to invoke executive privilege. \"It's not a legal defense in my view. It arguably mitigates your conduct somewhat,\" the judge said. Navarro advised Trump on trade issues during his presidency and served on a COVID-19 task force. He became a vocal supporter of Trump's false claims of widespread voting fraud in the 2020 election. Trump supporters sought to prevent Congress from certifying Biden's victory, clashing with police and rampaging through the Capitol.  \nThe House committee had sought to interview Navarro about his plan, dubbed the \"Green Bay Sweep,\" to derail the certification of the election results.  Navarro is the second prominent Trump adviser to be convicted of contempt of Congress for spurning the House panel. Former Trump adviser and right-wing firebrand Steve Bannon was sentenced to four months in prison in 2022. He has avoided serving the sentence while he appeals his conviction."
}