{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK101FD_L.jpg",
  "title": "Inside Trump's election A-team: Lean, mean and largely unseen",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 01, 2024 06:06AM ET",
    "Updated Feb 01, 2024 06:13AM ET"
  ],
  "comments": [
    2,
    [
      [
        "Tre Hsi",
        "2024-02-01 16:15:19",
        "\"Lean, mean and largely unseen\"  - sounds more like the description of his mistresses",
        "https://www.investing.com/members/203741693"
      ],
      [
        "Ken Roth",
        "2024-02-01 11:43:07",
        "The nutcase A-team rule over our country and head of the free world?….no thanks.",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/inside-trumps-election-ateam-lean-mean-and-largely-unseen-3289613",
  "paragraph": "By Alexandra Ulmer, Nathan Layne and Steve Holland (Reuters) - A veteran tactician who worked on Ronald Reagan's campaign. An ex-Marine wounded in the Middle East. The former voice of UFC cage-fighting. A golf caddie turned social media maestro.  Meet Donald Trump's election A-team. They are among a handful of distinctive figures who form a tight, disciplined inner circle around the former president in his bid for the White House, according to interviews with more than a dozen people close to the Trump campaign including current and former officials, donors and strategists. This core campaign team of a half-dozen aides is unswervingly loyal to their boss and chooses to stay mostly in the background, the people interviewed said, marking a stark departure from Trump's previous, looser orbit of advisers which was characterized by infighting, media leaks and firings. \"We go to war with people that we trust,\" said Trump's campaign co-manager Chris LaCivita, a 57-year-old former Marine injured in the 1991 Gulf War who became a political consultant.  \"There is no confusion about a chain of command,\" LaCivita told Reuters. \"He's at the top.\" The public got a rare glimpse of LaCivita and fellow campaign mastermind Susie Wiles when Trump took the stage to celebrate his victory in Iowa's Republican presidential nominating contest last month when he took 51% of the vote. Behind him on the edge of the stage, wearing a red blazer with her hands clasped in front of her, stood Wiles. Poking out behind her was LaCivita's bald head.  \"They want no accolades, they just want a victory and they want to make America great again,\" Trump said as he turned to the pair. \"They don't want to be speaking, they don't want to have pictures, they just want to do their job, right?\"  The two veteran political operators and their small team have helped Trump build a huge lead in the race for the Republican nomination. They have helped him land major endorsements, lobby state Republican parties for beneficial rule changes, relentlessly mock his rivals, develop the successful strategy of campaigning on his multiple criminal indictments, and make sure events are packed with red cap-wearing supporters. \"Most people don't know who Susie Wiles is. Most people don't know who Chris LaCivita is. That's not a bad thing,\" Corey Lewandowski, a campaign manager of Trump's 2016 operation who remains close to him, said in an interview. \"They're doing their job every day. And there's one guy whose name is on the side of the plane: It's Donald Trump, and he likes it that way.\" The team's success to date suggests Trump could give Democratic President Joe Biden a much tougher time than four years ago in their likely November match-up.  \"Biden is going to be facing a first-class Trump operation this time around,\" said veteran Republican consultant Scott Reed, who has worked on presidential and senatorial races. \"Most of the hangers-on have been jettisoned.\" Regardless of advisers, though, Trump is widely seen as an architect of both his successes and misfortunes and frequently goes off-script to make remarks that could turn off crucial moderate and independent voters in a general election. There have been no outward signs that Trump's new inner circle has pushed back against his polarizing plans to embark on the biggest deportation effort in American history, fire what he terms \"corrupt\" actors in national security positions, and \"root out\" his political opponents. Asked about the prospect of facing a more disciplined Trump operation, Biden campaign spokesperson Ammar Moussa said Biden - who calls his rival a threat to U.S. democracy - would beat him regardless of his campaign team. \"Voters are learning how dangerous a Trump return to the Oval Office would be,\" Moussa said.  ULTIMATE FIGHTING AND GOLF Trump's 2024 campaign team is stripped down from his 2020 battle against Biden, when multiple power centers had his ear. Back then, Brad Parscale as campaign manager commanded a 10-division structure, while many other people weighed in including Trump's sons Don Jr. and Eric, daughter Ivanka, son-in-law Jared Kushner and Republican National Committee chair Ronna McDaniel. Added to that mix was a large White House apparatus that included chief of staff Mark Meadows, adviser Kellyanne Conway, then-Vice President Mike Pence, and a host of others. This time round, Trump's campaign relies heavily on Wiles, who worked on Ronald Reagan's 1980 presidential campaign and helped Trump win Florida in 2016 and 2020 as a senior adviser.  Wiles oversees everything from budgeting to travel, according to a campaign source with direct knowledge of the matter, who like many of the other people interviewed asked to remain anonymous to speak freely.  Wiles brought another key asset to the campaign team: Deep knowledge of Trump's main rival at the time, Ron DeSantis. She helped elect him Florida's governor in 2018 before they parted on poor terms. That helped Trump's camp define DeSantis early, several sources aware of the strategy said, before he had even announced his presidential run.  LaCivita and Wiles have different temperaments, according to people who know them and Reuters' observations on the campaign trail. LaCivita is gregarious and likes chatting with reporters, whereas Wiles is quieter and, on the rare times she faces journalists, typically provides short responses.  The pair always presents united recommendations to Trump, another source familiar with the campaign's inner workings said.  Media strategy is managed by Jason Miller, a campaign strategist, and Steven Cheung, who worked as a communications chief at the Ultimate Fighting Championship (UFC) mixed martial arts cage-fighting franchise. Also in the inner circle are Brian Jack, a former White House political director under Trump, who oversees much of the outreach to other politicians and helps secure endorsements, and Dan Scavino who tackles social media. Scavino is one of Trump's longest-serving aides, going back to the 1990s when he served as golf caddie to the real estate tycoon. He has been at Trump's side throughout three campaigns for president and four years in the White House. See FACTBOX on campaign team. LaCivita told Reuters he does not try to rein in Trump's habit of seeking advice from a wide array of people. \"But what we do have from a structure standpoint is a tight group,\" he said on the sidelines of a Trump rally in Iowa. In a separate interview last August, LaCivita spoke about the combativeness of their efforts: \"You know, it's easy for us to wage an aggressive campaign and be very aggressive when we have a candidate who doesn't care, and lets us do it.\" Trump's sons Don Jr. and Eric remain active participants in the 2024 outreach, having spent considerable time on the ground in Iowa and New Hampshire and made frequent TV appearances for their father. MORNING HUDDLES IN PALM BEACH Roughly three dozen Trump campaign officials in total work out of a nondescript building in Palm Beach, Florida, close to Trump's Mar-a-Lago home, according to one of campaign sources with knowledge of the operation. The inner circle - compromised of Wiles, LaCivita and the others - kick off every day with a 9 a.m. meeting to plan, hash out problems and, crucially, ensure everyone gets heard to avoid leaks or infighting, according to the same campaign source.  \"We insist that we don't leave a meeting where we are not all on board,\" the source said.  Wiles then typically brings anything challenging to Trump, whom she usually meets with several times a week.  Outside the inner circle, the former president's wider campaign team includes Ross Worthington and Vince Haley, who worked in Trump's White House and remain his main speechwriters, according to a half-dozen sources close to the campaign.  Trump's speeches have come under the microscope in recent weeks after he told supporters that immigrants were \"poisoning the blood of our country\" and branded his political enemies \"vermin\", remarks denounced by critics as xenophobic and echoing Nazi rhetoric.  It is not clear whether those comments came from Worthington and Haley, or from an off-the-cuff Trump. The \"poisoning the blood\" line did not appear in prepared remarks issued to the media ahead of Trump's Dec. 16 New Hampshire speech, and Wiles and other aides have made no effort to amplify them in emails or statements. Cheung had dismissed criticism of the former president's language as \"nonsensical,\" arguing that similar language was prevalent in books, news articles and on TV. Reuters was not able to reach Haley and Worthington for comment. It is also difficult to get an exact sense of who is crafting policy recommendations for Trump.  Two sources said former White House senior adviser and hardline anti-immigration advocate Stephen Miller was a go-to on the southern border with Mexico. Keith Kellogg (NYSE:K), a retired lieutenant general was the chief of staff of Trump's National Security Council, is an adviser on national security, according to Lewandowski, the ex-Trump campaign manager. Miller and Kellogg declined to comment. Cheung said Trump \"speaks with a number of qualified individuals who are experts in various subject areas,\" without elaborating.  \nSeveral insiders said the fact Trump's children had largely stayed away had meant competing power centers had not emerged. Still, during the victory speech in Iowa, it was his eldest two sons who flanked him on stage. Just out of the camera's lens were Wiles and LaCivita."
}