{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0D000_L.jpg",
  "title": "Major events during 100 days of war between Israel and Hamas",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 13, 2024 07:05PM ET",
    "Updated Jan 13, 2024 07:18PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/major-events-during-100-days-of-war-between-israel-and-hamas-3274015",
  "paragraph": "5/5\n© Reuters. A tank manoeuvres next to a destroyed building in central Gaza, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, near the Israel-Gaza border, as seen from Israel, January 13, 2024. REUTERS/Amir Cohen\n2/5\n(Reuters) - Israel and Hamas have been at war in Gaza for 100 days since gunmen from the Palestinian militant group ran amok in southern Israel, prompting a fierce Israeli military campaign in which almost 24,000 Palestinians have been killed. Following is a timeline of the war between Israel and Hamas, the Islamist movement that controls the Gaza Strip. Oct. 7, 2023: Hamas gunmen storm into southern Israel from Gaza and rampage through communities, killing 1,200 people and taking 240 hostages back to Gaza, according to Israeli tallies. Prime Minister Benjamin Netanyahu says Israel is at war and retaliatory airstrikes on densely populated Gaza begin, along with a total siege of the coastal enclave, which is squeezed between Israel and Egypt. Oct. 8: Lebanon's Hezbollah, like Hamas an Iranian ally, begins cross-border shelling attacks against Israel that will continue throughout the war, drawing Israeli counter-strikes. Oct. 13: Israel tells residents of Gaza City, where more than 1 million of the enclave's 2.3 million people live, to evacuate and move south. Over the course of the next weeks, Israel will push for the evacuation of the entire north. Hundreds of thousands of Gazans will flee their homes, beginning a process that will soon uproot nearly the entire population of the Gaza Strip, with families often forced to flee several times as Israeli forces advance. Oct. 17: An explosion at al-Ahli al-Arabi Baptist hospital in Gaza City triggers outrage in the Arab world. Palestinians say hundreds died and blame the blast on an Israeli airstrike; Israel says it was caused by a misfiring Palestinian rocket, an assertion later backed by Washington. The blast overshadows a visit the following day to the region by U.S. President Joe Biden, whose planned summit with Arab leaders is called off. In Israel, Biden gives full support to its right to defend itself but also tells Israelis not to be blinded by their anger. Oct. 19: A U.S. navy warship intercepts missiles and drones launched from Yemen over the Red Sea in the direction of Israel. Yemen's Houthi group, like Hamas an Iranian ally, will continue sporadic long-range attacks on Israel and against Red Sea shipping in what is describes as solidarity with Gaza.  Oct. 21: Aid trucks are allowed through the Rafah border crossing from Egypt into Gaza after days of diplomatic wrangling. It is only a small fraction of what is required in Gaza, where food, water, medicines and fuel are running out. The issue of securing adequate supplies through Israel's blockade persists through coming months as the humanitarian crisis worsens. Oct. 27: A week after mounting limited incursions, Israel launches a broad ground offensive in Gaza, beginning with an assault on the north, vowing to free all its hostages and eradicate Hamas. Oct. 31: Fifteen Israeli soldiers are killed in Gaza fighting - the military's biggest single-day losses of the war.  Nov. 1: Evacuations begin from Gaza through the Rafah crossing for an estimated 7,000 foreign passport-holders, dual nationals and their dependents, and people needing urgent medical treatment. The overwhelming majority of Gaza residents still have no way out of the enclave. Nov. 9: Israel says a drone launched from Syrian territory hit its southern city of Eilat. The next day, the Israeli military said it attacked the militia responsible. Israel will later say Syria is among new fronts in the expanding Gaza war. Nov. 15: Israeli troops enter Gaza's biggest hospital, Al Shifa in Gaza City, after a siege of several days during which medical staff say patients including newborn babies died from a lack of power and supplies. The Israelis say the hospital had been used to conceal an underground headquarters for Hamas fighters, which staff deny. The military later takes media on a tour of a tunnel there. Within a few more weeks, all hospitals serving the northern half of Gaza will have ceased functioning. Nov. 21: Israel and Hamas announce the first truce of the war: an agreement to pause fighting for four days to exchange women and children hostages held in Gaza for Palestinian women and teenagers detained or jailed by Israel on security grounds, and allow in more aid. The ceasefire would eventually be extended for a week in total, freeing 105 hostages and about 240 Palestinian detainees, before it collapses and war resumes on Dec. 1. Around Dec. 4: Days after the truce expires, Israeli forces launch their first big ground assault in southern Gaza, on the outskirts of the main southern city, Khan Younis. International organisations say the next phase of the war, which extends the military campaign from the north to the entire length of the enclave including areas already sheltering hundreds of thousands of displaced people, will drastically worsen the humanitarian situation. Dec. 12: Biden says Israel's \"indiscriminate bombing\" of Gaza is costing it international support, a clear shift in rhetoric from Israel's closest ally, the United States. Over the coming weeks, several senior U.S. officials visit Israel, urging it to do more to protect civilians, scale down the war, and shift to a more targeted campaign against Hamas leaders. Dec. 15: Israeli forces mistakenly kill three hostages in Gaza. The incident leads to some of the most pronounced criticism of the conduct of the war within Israel, although the campaign still has widespread domestic support. Dec. 22: The Islamic Resistance in Iraq, an Iranian-backed militia, says it launched a long-range attack on Israel. Israel reports no impact. Israel's defence minister later says Iraq is among regional fronts to which the Gaza war has expanded. Around Dec. 26: Israeli forces launch a major ground assault on areas in the central Gaza Strip, preceded by a campaign of airstrikes that again sends hundreds of thousands of people to flight, most of them already displaced. From Jan. 1, 2024: Israel signals it will start withdrawing some troops from Gaza in a more targeted new phase of its campaign that it says will last for many months. Officials say this transition in tactics will begin in the north of Gaza, while intense fighting continues in southern areas. \nJan. 11: U.S. and British warplanes, ships and submarines launch dozens of airstrikes across Yemen in retaliation against Houthi forces for their attacks on Red Sea shipping. The United States carries out another strike in Yemen the following day. The Houthis say five of their fighters were killed in the initial strikes, and that they will retaliate and continue their attacks on shipping. Also on Jan. 11, the International Court of Justice hears opening statements in a case in which South Africa accuses Israel of committing a state-led genocide campaign against the Palestinian population. Israel denies the accusation."
}