{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0L0BT_L.jpg",
  "title": "UN migration agency seeks $7.9 billion for migrant support",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 22, 2024 05:34AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/un-migration-agency-seeks-79-billion-for-migrant-support-3279305",
  "paragraph": "© Reuters. A group of migrants wait to disembark from a wooden boat after being rescued by a Spanish coast guard vessel in the port of Arguineguin, on the island of Gran Canaria, Spain, January 18, 2024. REUTERS/Borja Suarez/File Photo\nBy Ted Hesson WASHINGTON (Reuters) - The United Nations migration agency aims to raise $7.9 billion this year through a new funding push to bolster efforts to protect migrants, reduce displacement and expand avenues to migrate legally, it said on Monday. The Geneva-based International Organization for Migration (IOM) is seeking funds from governments, private sector companies and individual donors, according to the announcement. \"The evidence is overwhelming that migration, when well-managed, is a major contributor to global prosperity and progress,\" IOM Director General Amy Pope said in a written statement. \"We can and must do better.\" The funding effort comes as the number of people forced to move reached 117 million by the end of 2022, including a record 71 million forcibly displaced within their own countries, IOM said in a report accompanying the appeal. Illegal immigration and asylum have become contentious political issues in Europe, the United States and other nations in the past decade as more migrants have taken dangerous journeys across the Mediterranean and to the U.S.-Mexico border. \nPope, a former senior White House official, took the helm at IOM in October 2022 pledging to partner with the private sector to address migration issues. As part of its fundraising goal, IOM is seeking $2.7 billion to prevent forced displacement, including in cases where people move due to climate change."
}