{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0600S_L.jpg",
  "title": "US appeals court prevents California from banning guns in most public places",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 08, 2024 05:23AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-appeals-court-prevents-california-from-banning-guns-in-most-public-places-3269009",
  "paragraph": "© Reuters. FILE PHOTO: AR-15 style rifles are displayed for sale at Firearms Unknown, a gun store in Oceanside, California, U.S., April 12, 2021. REUTERS/Bing Guan/File Photo\nBy Nate Raymond (Reuters) -A federal appeals court on Saturday allowed a judge's ruling that barred California from enforcing a new law that bans the carrying of guns in most public places on the grounds that it was unconstitutional to take effect. The 9th U.S. Circuit Court of Appeals dissolved an order by a different 9th Circuit panel from a week earlier that suspended an injunction issued by a judge who concluded the Democratic-led state's law violated the right of citizens to keep and bear arms under the U.S. Constitution's Second Amendment. Last week's order had temporarily stayed the injunction and allowed the law to take effect on Jan. 1. Gun rights groups then asked the 9th Circuit to reconsider, and on Saturday a different panel of judges dissolved the order suspending the injunction. \"So the politicians' ploy to get around the Second Amendment has been stopped for now,\" C.D. Michel, a lawyer for the gun rights groups, said in a statement. California's appeal of the injunction will now be heard in April. The state's attorney general in court papers had argued \"tens of millions of Californians will face a heightened risk of gun violence\" if the law was blocked. \"This dangerous decision puts the lives of Californians on the line,\" said Daniel Villaseñor, a spokesperson for Democratic Governor Gavin Newsom, who signed the measure into law in September. The law was enacted after a landmark ruling in June 2022 by the conservative-majority U.S. Supreme Court that expanded gun rights nationwide. The Supreme Court in that case struck down New York's strict gun permit regime and declared for the first time that the right to keep and bear arms under the Second Amendment protects a person's right to carry a handgun in public for self-defense. The ruling, New York State Rifle & Pistol Association v Bruen, also set out a new test to assess the constitutionality of gun laws by holding they must be \"consistent with the nation's historical tradition of firearm regulation.\" California was among a group of states with similar laws as New York, and following the U.S. Supreme Court's decision moved to revamp its firearms regulations. Under California's new law, people could not carry concealed guns in 26 categories of \"sensitive places\" including hospitals, playgrounds, stadiums, zoos and places of worship, regardless whether they had permits to carry concealed weapons. \nThe law, Senate Bill 2, also barred people from having concealed guns at privately owned commercial establishments that are open to the public, unless the business's operator posts a sign allowing license holders to carry guns on their property. U.S. District Judge Cormac Carney, an appointee of Republican former President George W. Bush, on Dec. 20 sided with permit holders and groups including the Firearms Policy Coalition, Second Amendment Foundation and Gun Owners of America in finding the law ran afoul of the Second Amendment."
}