{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0E09L_L.jpg",
  "title": "Trump cements frontrunner status to face Biden with record Iowa win",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 15, 2024 06:07AM ET",
    "Updated Jan 16, 2024 05:12AM ET"
  ],
  "comments": [
    9,
    [
      [
        "Ken Roth",
        "2024-01-18 15:05:47",
        "14% of the republicans actually voted in the Iowa caucus so Trump got 51% of 14% of the republican...Record???",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Ken Roth",
        "2024-01-17 20:31:05",
        "Great easy win for Biden.",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Charles Manson",
        "2024-01-16 13:54:47",
        "So .....  Big Don had a Big Win in Iowa? The Beta-Male MAGA-Phobes on this site are Freaking Out. No surprise here. Gonna be a \"Summer of Love\". Gonna put in my application for those Federal Re-Education Camps in New Mexico along the I-10 corridor. \"The Times, They are a Changin'\". Gotta go trim my Lemon Tree, Love to All, Charles.",
        "https://www.investing.com/members/249519852"
      ],
      [
        "Barry Nickerson",
        "2024-01-16 11:48:30",
        "I guess that Reuters is -All In- , betting on a Trump win.  There's still 49 states to  go, and the blue states might not be so forgiving to The Donald.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Evan Williams",
        "2024-01-16 11:30:56",
        "\"falsifying records over hush money payments to a porn star.\" Reuters is nothing but a GIGO scandal sheet; Garbage in Garbage out. That statement is grounds for a 100% winnable case in a Lible Suit. Trump WON by BLOWOUT! Get over it!",
        "https://www.investing.com/members/255256591"
      ],
      [
        "Ken Roth",
        "2024-01-16 11:50:20",
        "That you defend this fraud tells everything about you and your values. Trump could not care less about you and your family so you will find that your loyalty only goes one way….",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Brad Albright",
        "2024-01-16 13:12:18",
        "And yet, even the litigious Trump won't bring a libel suit for this report. I wonder why?",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Evan Williams",
        "2024-01-16 14:56:58",
        "Ken Roth",
        "https://www.investing.com/members/255256591"
      ],
      [
        "Ken Roth",
        "2024-01-16 15:48:40",
        "Yea dont give a shit about other than yourself is a great philosophy that will give USA many friends and make sure that all the american people prosper, especially those that are not fortunate. History",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Ken Roth",
        "2024-01-16 15:49:26",
        "Evan Williams",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Tim Barak",
        "2024-01-16 10:56:47",
        "Let's check your cognitive abilities\nObama imported 20-30 % more oil form Russia than Trump, Biden almost twice more oil than Trump\nhttps://www.eia.gov/dnav/pet/hist/LeafHandler.ashx?n=PET&s=MTTIM_NUS-NRS_2&f=M\nWhat do you think about who is Putin's friend?",
        "https://www.investing.com/members/200156699"
      ],
      [
        "Brad Albright",
        "2024-01-16 15:05:03",
        "Trump.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Ken Roth",
        "2024-01-16 09:57:29",
        "Guess the stink of Trumps leaking diaper could not break through the Iowa manure, so that the voters could actually smell him and his rotten body.",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Barry Nickerson",
        "2024-01-16 11:36:31",
        "A little bit triggered this morning, eh?  Take your Prozac and relax.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Ken Roth",
        "2024-01-16 07:42:03",
        "The only good thing out of iowa caucus was we are now free from looking at the indian swarma who tried to copy the sociopat Trump as much as possible, that did not work their is only 1 sociopat Trump. No one is able to lie 25 times pr. day to the people and tell you straight in your face that you care about them when in reality you dont give shi,,,t about them and only care about yourself.",
        "https://www.investing.com/members/213081368"
      ],
      [
        "john wick",
        "2024-01-16 03:30:31",
        "Yes! My president Donald Trump! ",
        "https://www.investing.com/members/256103011"
      ],
      [
        "Ken Roth",
        "2024-01-16 07:44:16",
        "Putin agrees with you the best thing that can happen for Russia and China is Trump in the presidency with an america first program and screw all allies. That leaves the world for Putin and XI.",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Tim Barak",
        "2024-01-16 10:38:04",
        "Ken Roth",
        "https://www.investing.com/members/200156699"
      ],
      [
        "Brad Albright",
        "2024-01-16 13:12:54",
        "Dupe says what?",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Ken Roth",
        "2024-01-16 13:51:52",
        "Tim USA under Biden have never produced more oil than know so we are selling to europe. If you get your truth from newsmax or foxnews I suggest you change channels.",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/trump-seeks-knockout-punch-as-iowa-delivers-first-verdict-on-republican-race-3274374",
  "paragraph": "© Reuters. FILE PHOTO: Former U.S. President and Republican presidential candidate Donald Trump speaks during a campaign event, in Clinton, Iowa, U.S., January 6, 2024. REUTERS/Cheney Orr/File Photo\nBy Tim Reid, Nathan Layne and Gabriella Borter DES MOINES, Iowa (Reuters) - Donald Trump secured a resounding win in the first 2024 Republican presidential contest in Iowa on Monday, asserting his command over the party despite facing scores of criminal charges as he seeks an election rematch with President Joe Biden. Trump took over half the votes, propelling him towards what looks set to be a close and deeply acrimonious election campaign against Biden, a Democrat, in November. Florida Governor Ron DeSantis, 45, finished well behind Trump in second place in Iowa, edging out former U.N. Ambassador Nikki Haley, 51, as they both failed to emerge as the chief opponent.  Trump, 77, the only current or ex-U.S. president to be charged with criminal activity, won by an unprecedented margin for an Iowa Republican contest, strengthening his case that his nomination is a foregone conclusion given his massive lead in national polls. Trump garnered 51%, DeSantis 21% and Haley 19%, with 99% of the expected vote tallied, according to Edison Research. That victory margin far surpassed the previous record of 12.8 percentage points for Bob Dole in 1988. \"THANK YOU IOWA, I LOVE YOU ALL!!!\" Trump wrote on his social media platform, Truth Social. He is hoping to fast-track the normally months-long Republican selection process with a series of convincing early primary wins to force out his rivals. Entrepreneur Vivek Ramaswamy ended his long-shot presidential bid after winning just under 8% of the vote on Monday, and he endorsed Trump. The candidates immediately move on to New Hampshire on Tuesday. The state's more moderate Republicans will choose their nominee next Tuesday and polls show Trump with a smaller lead over Haley there, and DeSantis far behind. LEGAL TROUBLES  Trump's performance in Iowa showed his enduring popularity among Republican voters even after the Jan. 6, 2021, attack on the U.S. Capitol by a mob of his supporters and his 91 criminal charges for trying to overturn the 2020 election, retaining classified documents after leaving the White House and falsifying records over hush money payments to a porn star. Trump has used his legal travails to fundraise and boost his support as he protests his innocence and says he is the victim of a \"witch hunt\". Nearly two-thirds of Iowa caucus-goers embraced his false claims about voter fraud in the 2020 presidential election, saying they did not think Biden legitimately beat Trump.  More than 60% said Trump would still be fit to serve as president even if convicted of a crime. Trump dominated across the board, according to an Edison entrance poll: he won a majority among men and among women; among those who consider themselves very conservative, somewhat conservative and independent; among those who graduated college and those who did not. He captured a majority of Republicans who put immigration as their top concern - and a majority of those who said the economy was their main worry. \"Absent a quick consolidation of the field, Trump appears to be on a fast track to the nomination,\" said Jimmy Centers, an Iowa-based Republican strategist.  Still, both DeSantis and Haley vowed to press ahead, ensuring Trump's opposition will remain fractured as the campaign moves on. \"We've got our ticket punched out of Iowa!\" DeSantis, who had stake a lot on a strong performance in the state, told supporters in West Des Moines on Monday. \"When you look at how we're doing, in New Hampshire, in South Carolina and beyond, I can safely say tonight Iowa made this Republican primary a two-person race,\" Haley said on Monday night.  Trump has aimed to create an air of inevitability around his campaign, skipping all five of the Republican debates thus far and largely eschewing the county-by-county politicking that most candidates do ahead of the Iowa vote. LIFE-THREATENING COLD Iowans braved life-threatening temperatures to gather at schools, community centers and other sites for the state's first-in-the-nation caucus, as the 2024 presidential campaign officially got under way after months of debates and rallies. \"Trump is very narcissistic, he's very cocky, but he's going to get stuff done,\" said Rita Stone, 53, a Trump backer, who attended a caucus at a West Des Moines high school.  Like many other voters, Stone said her leading concern was the U.S. southern border with Mexico, praising Trump's effort to build a wall when he was president. Unlike a regular election, Iowa's caucus requires voters to gather in person in small groups, where they cast secret ballots after speeches from campaign representatives. Edison projected there would be approximately 111,000 votes counted, far short of the record 187,000 cast in the 2016 Republican caucus.  Iowa has historically played an outsized role in presidential campaigns due to its early spot on the campaign calendar. \nBut the winner of Iowa's Republican caucuses did not go on to secure the nomination in the last three competitive contests in 2008, 2012 and 2016. Read Reuters' full U.S. election coverage here:"
}