{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0R079_L.jpg",
  "title": "Reaction to drone strike on US troops in Jordan",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 28, 2024 01:22PM ET",
    "Updated Jan 29, 2024 09:06AM ET"
  ],
  "comments": [
    7,
    [
      [
        "Ken Roth",
        "2024-01-29 17:32:25",
        "Time to take the gloves off. The whole world knows Iran is behind these attacks. They must be hit where it hurts.",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Maximus Maximus",
        "2024-01-29 15:37:59",
        "traitor-trump unilaterally pulling out of the iran-deal paved the way for the recent conflicts in the Middle East. and that was just one of his countless mistakes and blunders...",
        "https://www.investing.com/members/204570756"
      ],
      [
        "Mark Jannetty",
        "2024-01-29 16:33:32",
        "pulled out of Obamas deal that gave the green light to Iran to pursue the bomb. good thing Trump did, too bad Biden restarted it. what a🤡",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Csaba Kiss",
        "2024-01-29 11:21:15",
        "biden, the worst president of all time, shame on those who voted for him, in a delicate situation, an interest rate cut is not possible at the skyrocketing WTI price, his hands are tied, on Wednesday FED.",
        "https://www.investing.com/members/202836560"
      ],
      [
        "Csaba Kiss",
        "2024-01-30 16:54:35",
        "When the Russians launched the attack in Ukraine, the USA called the allies the night before that they were now loading the missile launchers inward, if they had seen it, I think from satellites, they would also know where the drone was launched from, Trump would have already ordered a Tomahawk barrage, now there is silence, there are already many rocket launchers in Yemen, not that there would be an attack on Iran. In the Arab world, running away from the Taliban in Kabul, wearing sandals and equipped with $20 Kalashnikovs, resulted in a fatal loss of prestige, and they are no longer able to increase Saudi production.",
        "https://www.investing.com/members/202836560"
      ],
      [
        "Brad Albright",
        "2024-01-31 01:34:54",
        "Csaba Kiss",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Csaba Kiss",
        "2024-01-31 08:30:38",
        "Brad Albright",
        "https://www.investing.com/members/202836560"
      ],
      [
        "Brad Albright",
        "2024-01-31 18:28:52",
        "Csaba Kiss",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Csaba Kiss",
        "2024-01-31 19:01:38",
        "Brad Albright",
        "https://www.investing.com/members/202836560"
      ],
      [
        "sam ss",
        "2024-01-28 23:51:12",
        "Iran is paid to do this. Unless there is a regime change in iran, this will get a lot worse.",
        "https://www.investing.com/members/200496711"
      ],
      [
        "Mark Jannetty",
        "2024-01-28 22:14:26",
        "Biden we are still waiting for you to hold the ones accountable for the deaths in Afghanistan, as you promised . worst president ever ",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Maximus Maximus",
        "2024-01-29 15:32:14",
        "'mark' is a russian/rightwing troll, operating multiple profiles in this comments section...",
        "https://www.investing.com/members/204570756"
      ],
      [
        "Mark Jannetty",
        "2024-01-29 16:36:51",
        " 1 profile unlike the 4 communists here",
        "https://www.investing.com/members/241633026"
      ],
      [
        "chess reed",
        "2024-01-28 20:27:01",
        "Guys US can't respond because it might stop a deal to stop iran from making a nuclear bomb So I guess  let them kill another 1000 American's but we have to make 'diplomatic' negotiations .....blablablabla\nJUST WIPE THEM FROM THIS PLANET !",
        "https://www.investing.com/members/207347322"
      ],
      [
        "Trader Central",
        "2024-01-28 18:58:58",
        "Sound like DOW , NAS, SP Gonna Crash",
        "https://www.investing.com/members/250455937"
      ],
      [
        "Aftab Sajjad Khan",
        "2024-01-28 21:45:08",
        "10% or 5% you mean?",
        "https://www.investing.com/members/200434311"
      ],
      [
        "Andrew Sandoval",
        "2024-01-29 07:37:50",
        "War will not make stocks crashes. Poor consumer spending or failure to pay debt buy private or companies will . Remember war makes money . ",
        "https://www.investing.com/members/200053065"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/reaction-to-drone-strike-on-us-troops-in-jordan-3285360",
  "paragraph": "© Reuters. FILE PHOTO: U.S. President Joe Biden delivers a prime-time address to the nation about his approaches to the conflict between Israel and Hamas, humanitarian assistance in Gaza and continued support for Ukraine in their war with Russia, from the Oval Offi\nWASHINGTON (Reuters) -Three U.S. service members were killed and as many as 34 wounded, United States officials said on Sunday, after a drone attack in Jordan that they linked to Iranian-backed militants.  The attack is a major escalation of the tensions in the Middle East sparked by Hamas' attack in Israel on Oct. 7 and Israel's retaliatory strikes that have devastated Gaza.  Here are reactions from key policy makers in the United States and several countries:  DEMOCRATIC U.S. PRESIDENT JOE BIDEN \"The three American service members we lost were patriots in the highest sense. And their ultimate sacrifice will never be forgotten by our nation ... We will carry on their commitment to fight terrorism. And have no doubt - we will hold all those responsible to account at a time and in a manner our choosing.\" REPUBLICAN FORMER U.S. PRESIDENT AND PRESIDENTIAL CANDIDATE DONALD TRUMP \"The drone attack on a U.S. Military Installation in Jordan, killing 3 American service members, and wounding many more, marks a horrible day for America ... This brazen attack on the United States is yet another horrific and tragic consequence of Joe Biden's weakness and surrender.\" REPUBLICAN U.S. PRESIDENTIAL CANDIDATE NIKKI HALEY \"What they should be doing is going after every ounce of production of those missiles. Wherever those missile sites are, you take that out. You take out the training sites... You go after the leaders making the decisions. It's not after Iran the country.\" \"Biden still to this second has not increased sanctions on Iran... there are things we can do that are not war... You have to be tough. That doesn't mean starting a war. That actually means preventing a war.\" LLOYD AUSTIN, U.S. DEFENSE SECRETARY \"Iran-backed militias are responsible for these continued attacks on U.S. forces, and we will respond at a time and place of our choosing.\" BEN CARDIN, DEMOCRATIC U.S. SENATE FOREIGN RELATIONS CHAIR \"This attack on U.S. and coalition troops in Jordan — our steadfast regional partner — is an escalation, and cannot go unanswered. I support President Biden in a deliberate and proportionate response.\" MICHAEL MCCAUL, REPUBLICAN U.S. HOUSE FOREIGN AFFAIRS PANEL CHAIR \"We need a major reset of our Middle East policy to protect our national security interests and restore deterrence.\" CHUCK SCHUMER, U.S. SENATE DEMOCRATIC LEADER \"We mourn the deaths of the three service members killed by a drone attack in Jordan from an Iran-backed militant group. We are all praying for the safety and recovery of the dozens who were injured. My heart is with the families of those killed and injured. We must work to hold those responsible accountable.\" MITCH MCCONNELL, U.S. SENATE REPUBLICAN LEADER \"The cost of failure to deter America's adversaries was again measured in American lives. We cannot afford to keep responding to this violent aggression with hesitation and half-measures ... The entire world now watches for signs that the President is finally prepared to exercise American strength to compel Iran to change its behavior. Our enemies are emboldened.\" MIKE JOHNSON, U.S. HOUSE SPEAKER \"America must send a crystal clear message across the globe that attacks on our troops will not be tolerated.\" REPRESENTATIVE HAKEEM JEFFRIES, DEMOCRATIC U.S. HOUSE MINORITY LEADER \"Every single malignant actor responsible must be held accountable.\" EGYPT'S FOREIGN MINISTRY \"Egypt affirmed its strong condemnation of any terrorist acts that threaten the security and stability of the Hashemite Kingdom of Jordan, expressing full solidarity with Jordan in this delicate situation... Egypt emphasized the necessity of confronting all forms of terrorism and rejecting all manifestations of violence to ensure the stability of the region.\" IRAQI GOVERNMENT SPOKESPERSON BASIM ALAWADI  \"The Iraqi government condemns the ongoing escalation, particularly the recent attack on the Syrian-Jordanian border, and is closely monitoring with great concern the alarming security developments in the region.\"  ISRAEL'S FOREIGN AFFAIRS MINISTER ISRAEL KATZ \"We stand united in our values and battle against a common enemy. Their sacrifice will always be remembered. Rest in peace. Wishing a speedy recovery to the injured.\"  JACK REED, DEMOCRATIC U.S. SENATE ARMED SERVICES COMMITTEE CHAIR \"The Department of Defense is still gathering all the facts from this attack. I am confident the Biden administration will respond in a deliberate and proportional manner.\" \nROGER WICKER, U.S. SENATE ARMED SERVICES COMMITTEE RANKING REPUBLICAN  \"We must respond to these repeated attacks by Iran and its proxies by striking directly against Iranian targets and its leadership. The Biden administration's responses thus far have only invited more attacks.\""
}