{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0M0HZ_L.jpg",
  "title": "Europe should boycott Alabama over nitrogen execution - peace group",
  "category": "General",
  "publisher": "Reuters",
  "date": [
    "Published Jan 23, 2024 09:11AM ET",
    "Updated Jan 23, 2024 09:16AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Mark Jannetty",
        "2024-01-23 17:24:52",
        "who cares. the only people who should have a say, are the families of his victims ",
        "https://www.investing.com/members/241633026"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/general/europe-should-boycott-alabama-over-nitrogen-execution--peace-group-3280781",
  "paragraph": "By Philip Pullella ROME (Reuters) - A peace group with close ties to the Vatican said on Tuesday it will appeal to European businesses and tourists to boycott the U.S. state of Alabama if it went ahead with the execution of an inmate by nitrogen gas this week. The warning by the Sant' Egidio Community involves Kenneth Smith, who was convicted of a 1988 murder and who survived a botched execution attempt by lethal injection in 2022. His lawyers appealed to the U.S. Supreme Court last week to block the second attempt, saying it violates the U.S. Constitution's Eighth Amendment ban on cruel and unusual punishment. Smith's case has also alarmed the U.N. human rights office, which said last week that the execution planned for Jan. 25 could amount to torture and violate U.S. commitments under international law. At a news conference where he spoke about an eventual boycott, Mario Marazziti, Sant' Egidio's expert on the death penalty, mentioned that Germany automaker Mercedes Benz (ETR:MBGn) has a plant in Alabama and that many Europeans go to the southern state for its golf courses. \"This is a proposal that we will make if the execution of Kenneth Smith goes ahead,\" he said, adding that he believed European trade or investment in Alabama amounted to hundreds of millions of dollars a year. \"There is a moment in which you have to choose. Even for South Africa, it seemed that to boycott could not be effective but it became decisive to end the apartheid regime. I think we must try something that has not been tried so far,\" Marazziti told Reuters in a separate interview. He told the news conference that Europeans could \"study alternatives to their investments in the United States\" depending on how states dealt with human rights issues. The Sant' Egidio Community, which has branches in many countries and brokered peace deals, has close ties to the Vatican. Pope Francis, who supports a global ban on capital punishment, has often praised the group. Smith's lawyers have argued that the decision to gas Smith by strapping to his face a commercially made industrial-safety breathing mask connected to a canister of pure nitrogen comes with risks of botching the second attempt to execute him. \nMarazziti rejected a statement by Alabama Solicitor General Edmund LaCour that using nitrogen was the most painless and humane method. \"There is no painless method of execution,\" Marazziti said."
}