{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0906O_L.jpg",
  "title": "Ukrainians seek recognition for fallen soldiers",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 10, 2024 02:02AM ET",
    "Updated Jan 10, 2024 10:55AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/ukrainians-seek-recognition-for-fallen-soldiers-3270905",
  "paragraph": "4/4\n© Reuters. Ukrainian actor Anna Birzul walks to a grave of her younger brother Bohdan Krotov, a Ukrainian combat medic who was killed in a fight against Russian troops near the Bakhmut town, amid Russia's attack on Ukraine, at a cemetery in Kyiv, Ukraine December 28\n2/4\nBy Dan Peleschuk KYIV (Reuters) - After her younger brother was killed in November fighting Russian forces in eastern Ukraine, Anna Birzul spent two days stricken with grief. Then she sprang into action, penning a petition asking President Volodymyr Zelenskiy to award 29-year-old Bohdan Krotov the highest military honour, Hero of Ukraine. \"We buried him on the 26th, and already on the 27th I had written it,\" said a tearful Birzul, 35, standing at Krotov's grave in a Kyiv cemetery. A portrait of the combat medic, smiling, hung beneath a fluttering Ukrainian flag that featured his Interior Ministry unit's insignia. Birzul's petition is one of at least 2,000 submitted, usually by a relative or a friend, since Russia's February 2022 full-scale invasion calling on Zelenskiy to honour a fallen soldier with the award.  Fewer than 400 service members have been named Hero of Ukraine since the war began, many of them posthumously, for valorous acts such as helping thwart enemy advances. The petitions, introduced in 2015 as a platform for popular appeals to the president, are not a formal part of the nomination process for the award, which was established in 1998. When Ukrainian troops were fighting a lower-intensity insurgency by Moscow-backed separatists, appeals were registered sparingly. Now, new petitions appear almost daily from grieving widows, mothers and children - first on the president's website, then splashed across social media - and have become a common ritual in a war that has rallied the nation but shows no signs of abating.  They offer a window into the collective trauma Ukrainians are living through, and underline how virtually every soldier who is killed in battle is seen as a \"hero\" for helping to defend the country from invading forces. The government does not disclose its losses, but Western intelligence services have estimated that tens of thousands of Ukrainian soldiers have been killed. WIDELY PROMOTED Birzul described her brother, who joined an assault brigade before Ukraine began a counteroffensive last June, as cheerful and selfless. He had been sensitive and supportive when they were young and lacked a strong father figure. Krotov, who commonly went by the name Hlib, dreamed of starting a family of his own, she said, but while at war he felt a sense of purpose. He had hauled wounded men off the battlefield and rescued them under heavy fire, Birzul wrote in her petition. His comrades-in-arms recalled him fondly, \"with tears in their eyes\". He saved four people the day he was killed, Birzul told Reuters, citing Krotov's fellow soldiers. Like some others, Birzul has promoted her appeal widely on social media, urging friends and followers - among them public figures - to share it on their own accounts. It is a race against time, she said, to collect within 90 days of publication the 25,000 signatures needed for consideration. \"Right now, I'm still on their minds because I call them up all emotional and beg, 'Now, please, I'm ready to get down on my knees',\" Birzul said.  As of Tuesday, her petition had collected more than 18,800 signatures. Successful appeals must still pass through the soldier's chain of command and be evaluated by a presidential committee established last May to handle the new influx.  In a statement announcing its creation, Zelenskiy said: \"We must know the names of all our heroes.\" His office did not answer questions for this article. REMEMBERING THE DEAD The award comes with substantial financial compensation, including free housing for honorees or their surviving relatives. But money is not a big consideration for people such as Viktoriia Vlasenko, whose husband Oleksandr, 29, was killed in June 2022 during a Ukrainian military campaign to retake the southern city of Kherson from Russian forces. \"This isn't important to me at all,\" she said of the financial reward. Vlasenko, 26, said her goal was to preserve his memory for their one-year-old son Makar, whom Oleksandr was never able to meet. \"Let him carry at least this piece of his heart through life and pass it on to his descendants,\" she wrote in her petition. It collected 25,721 signatures and is currently under consideration. Memorialising the fallen is likely to become an increasingly urgent issue in Ukraine as the war grinds on, said Yuliya Yurchuk, an expert on memory and nationalism. Last month, officials approved long-delayed plans for a national military cemetery to be built in Kyiv after pressure from activists and bereaved relatives. Some Ukrainian veterans have questioned the flood of petitions, saying that bestowing the honour too widely would devalue it. The phenomenon presents a challenge for the government, which must chose who should be formally recognised while also maintaining collective morale, said Yurchuk, a senior lecturer at Sweden's Södertörn University. \n\"On one hand, there's the individual and the family's memory,\" she said. \"And on the other, there's the state, which is responsible for working with this memory in a way that consolidates and mobilises people.\""
}