{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "Spain's Madrid region partially revokes trans, LGBTQ rights laws",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 22, 2023 01:31PM ET",
    "Updated Dec 22, 2023 07:03PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/spains-madrid-region-partially-revokes-trans-lgbtq-rights-laws-3262532",
  "paragraph": "By David Latona MADRID (Reuters) - Madrid's regional assembly on Friday passed a proposal by the Spanish capital's ruling conservative People's Party (PP) to strip back protections for transgender people, sparking outcry from the opposition and LGBTQ activists. The bill, which amended a regional trans rights law and an LGBTQ rights law - both passed in 2016 with the PP's backing - makes Madrid the first Spanish region to roll back such legislation.     It was approved with 80 votes in favour and 53 against thanks to the absolute majority the PP holds in the chamber. It was also supported by the far-right Vox party, which governs in coalition with the PP in some Spanish cities and regions but not in Madrid. Under the reform, discriminating against workers on the basis of their sexual orientation or gender identity is no longer a punishable offence. It is also no longer a punishable offence to beat a person without causing injury on the basis of their sexual orientation or gender identity. Amid jeers from the opposition, the PP's Monica Levin defended the reform as a way to stop what she described as \"social engineering\" and \"getting into people's privacy and manipulating them in order to pit them against each other and then come to their rescue\". Carla Antonelli, an assemblymember for the left-wing Mas Madrid party who is trans, wore red gloves symbolising bloodied hands during the raucous debate preceding the vote.  She called the bill an \"abomination\" and compared it to the actions of Nazi SS doctor Josef Mengele, who \"also spoke of science to exterminate Jews and LGTBQ people\".  \"When you press that button to vote for this infamy...you will all have blood on your hands. This is terrorism towards trans people. You won't be able to wash your dirty conscience because we will remind you of it every day,\" Antonelli said. Under the reform lawmakers also replaced the terms \"trans people\" and \"gender identity\" with \"transsexuals\" and \"transsexuality\", terms which activists say are archaic and demeaning. The option of changing names on regional documents before adapting the national ID was also eliminated. Mas Madrid said it would ask Spain's human rights ombudsman to challenge the law before the Constitutional Court. The party's lawmakers unfurled Trans Pride flags and activists displayed red gloves while shouting slogans before being expelled from the gallery.  In addition under the reform, the region's underage trans people will only be able to start hormone replacement therapies after examination by a paediatrician and a psychologist or psychiatrist. \nIn December 2022, Spain had passed a nationwide bill allowing transgender people aged 14 and over to change their legal gender without the need for psychological or other medical evaluation, though those aged 14 to 16 would still need parental or guardians' agreement. Fourteen other Spanish regions out of the country's 17 have laws for the protection of trans rights, LGBTQ rights, or both on the books."
}