{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0E0K4_L.jpg",
  "title": "Trump lawyer Tacopina withdraws from Manhattan legal team",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 15, 2024 02:43PM ET",
    "Updated Jan 16, 2024 05:06AM ET"
  ],
  "comments": [
    3,
    [
      [
        "Stephen Fa",
        "2024-01-16 13:56:59",
        "Meanwhile, in Washington, the Biden crime family get closer to justice with contempt of Congress and impeachment for accepting foreign bribes.",
        "https://www.investing.com/members/200910591"
      ],
      [
        "Brad Albright",
        "2024-01-16 15:05:43",
        "They really have you snowed, don't they?",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Ken Roth",
        "2024-01-16 20:06:38",
        "Stephen you got to stop taking drugs they make you weird and totally out of touch with reality.",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Ken Roth",
        "2024-01-16 13:56:41",
        "He was thrown under the bus by trump when trump said he got bad advice from lawyer not to testfy in carrol defermation case that he lost…remember he was in Scotland just to be out of the country. But in reality trump did not dare to testify because that could potentially incriminate himself under oath.",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Brad Albright",
        "2024-01-16 13:14:06",
        "Must not be comfortable supporting the ant-American efforts of his former client.",
        "https://www.investing.com/members/236251128"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/trump-lawyer-tacopina-withdraws-from-manhattan-legal-team-3274512",
  "paragraph": "© Reuters. File photo: Joseph Tacopina attorney of U.S. President Donald Trump departs Manhattan Federal Court as the civil case goes into deliberations, in New York City, U.S., May 8, 2023. REUTERS/David 'Dee' Delgado/File photo\nBy Hannah Lang (Reuters) - Joseph Tacopina, an attorney on former U.S. President Donald Trump's legal team, on Monday said he will no longer represent him in a criminal case in Manhattan related to alleged hush money payments or a separate appeal of a civil case.  Tacopina withdrew from representing Trump in two of the former president's ongoing legal battles, including a state criminal case in which Trump was charged with falsifying business records over a hush money payment to a porn star before his victory in the 2016 presidential election, the lawyer confirmed in an email to Reuters.  The New York Times had earlier reported that Tacopina had withdrawn from the two cases.  Trump has pled not guilty to the charges, and will face a trial this year, although the timing is uncertain.  Tacopina also will no longer represent Trump in his appeal of a verdict in a civil case brought by writer E. Jean Carroll, who accused him of rape, he confirmed. A jury in May awarded Carroll $5 million after finding Trump liable for sexual assault and defamation. Trump has also maintained his innocence in that case.  The shift in Trump's legal team comes as Iowans are set to cast the first votes in the 2024 campaign on Monday, with Trump as an early favorite to claim victory in the early contest in the Republican presidential primary.  Tacopina is a frequent cable news commentator who has represented high-profile clients including rapper Meek Mill, former Yankees baseball star Alex Rodriguez and Donald Trump Jr.'s fiancée Kimberly Guilfoyle. \nAsked about Tacopina's shift, Trump spokesman Steven Cheung told Reuters, \"President Trump has the most experienced, qualified, disciplined, and overall strongest legal team ever assembled as he continues to fight for America and Americans against these partisan, Crooked Joe Biden-led election interference hoaxes.\"  Tacopina is one of several Trump lawyers to have stopped representing him in ongoing cases. At least three members of his legal team in Florida stepped down after Trump was indicted in June on charges he unlawfully kept national-security documents when he left office."
}