{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK04022_L.jpg",
  "title": "US readies aid as Japan earthquake death toll nears 100",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 04, 2024 10:26PM ET",
    "Updated Jan 05, 2024 06:22AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/japan-to-accept-earthquake-relief-from-us-only-nikkei-3267753",
  "paragraph": "By Kiyoshi Takenaka and Sakura Murakami WAJIMA, Japan (Reuters) -The United States said on Friday it is preparing military logistical support and aid for regions in Japan devastated by an earthquake that killed 94 people, forced about 33,000 people to leave their homes, and left over 200 people unaccounted for. \"The U.S. is here to support our friend and ally in its earthquake response. Military logistical support, food, and other supplies are being readied,\" U.S. ambassador to Japan Rahm Emanuel posted on social media site X. Japan is in talks with the U.S. about emergency assistance and rejected offers for help from other countries including China for the time being. \"We are not accepting any personnel or material aid from other countries or regions at the moment given the situation on the ground and the effort that would be required to receive them,\" Japan's top spokesperson Yoshimasa Hayashi said. A U.S. official who declined to be named told Reuters the two governments were coordinating on possible assistance from U.S. troops. About 54,000 U.S. forces personnel are based in Japan, the biggest U.S. military presence abroad, according to the Chicago Council on Global Affairs. U.S. armed forces were deeply involved in disaster relief efforts in the 2011 earthquake, providing over 24,000 personnel with 24 ships and 189 aircraft. They also provided earthquake aid in Kyushu island in 2016. \"All of U.S. Forces Japan remain ready to support our Japanese Allies during this difficult time. We are unable to provide specifics on military support operations at this time, but we will provide updates when we have more that we can share,\" the U.S. Forces in Japan said in a statement. MORE THAN 100 TRAPPED The 7.6 magnitude quake struck western Japan's Noto peninsula on the afternoon of New Year's Day, flattening homes, triggering a tsunami and cutting off remote communities. As the emergency response moved from rescue to aid and recovery, Japanese Prime Minister Fumio Kishida said there were offers for help and messages of condolence from governments including Taiwan and China. The full extent of the damage remains unclear, with rescue teams struggling to reach remote areas due to severed roads and broken infrastructure. But with more than 200 people missing, the disaster is likely deadlier than the 2016 earthquake and could be the worst since a massive earthquake and tsunami struck the east coast of Japan in 2011. Shigeru Sakaguchi, the mayor of badly-hit Wajima city, said there are likely more than 100 people still trapped under collapsed buildings and rubble, according to the Mainichi newspaper. The U.S. will provide a $100,000 aid package that includes resources such as blankets, water, and medical supplies, according to a statement released by its embassy in Japan. Volunteers such as Aydin Muhammet, who is usually based in Nagoya, are also heading into areas wrecked by the tremor to give whatever aid they can provide. \"You can't turn a blind eye after seeing that ... I felt like I had to go, I just had to do something,\" he said. TSUNAMI DAMAGE At least 120 hectares (296 acres) of land also appears to be flooded from a tsunami triggered by the earthquake, according to Japan's land ministry. \"We still don't have a full picture, and it's likely that the area flooded by the tsunami could spread,\" an unnamed land ministry official said to the daily Asahi newspaper. A preliminary probe led by researchers at the University of Tokyo estimated that the highest point of the tsunami on the western coast of the peninsula could have reached up to 4.2 meters (14 ft) above normal sea level.  The first wave of the tsunami may have reached the northern-most tip of the Noto peninsula within a minute of the initial quake, according to Tohoku University tsunami expert Fumihiko Imamura, giving residents barely any time to evacuate.  Details of the tsunami had been unclear as the tide gauge stopped emitting data immediately after the initial quake, Japan's Meteorological Agency said. Japan's Coast Guard said it was searching one missing person who was washed away by tsunami in Suzu city, the first known potential casualty from the tsunami so far. \nSurvivors still face a long road to recovery, even as businesses rush to return to business as usual. The earthquake has also cast doubt over Japan's push to restart nuclear plants that have been idled. Japan will spend 4.74 billion yen ($32.7 million) from state budget reserves to support those hit by the quake, Finance Minister Shunichi Suzuki told reporters on Friday, according to media reports."
}