{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0N00H_L.jpg",
  "title": "Lula upset by lack of clear goals in Brazil's new industry plan, sources say",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 23, 2024 07:14PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/lula-upset-by-lack-of-clear-goals-in-brazils-new-industry-plan-sources-say-3281159",
  "paragraph": "© Reuters. FILE PHOTO: Brazil's Vice President Geraldo Alckmin talks with Brazil's President Luiz Inacio Lula da Silva during a meeting of the National Industrial Development Council (CNDI) at the Planalto Palace in Brasilia, Brazil January 22, 2024. REUTERS/Adriano\nBy Lisandra Paraguassu BRASILIA (Reuters) - Brazilian President Luiz Inacio Lula da Silva was displeased by a new industrial development plan announced on Monday by the government and told ministers it lacked clear targets, said two people familiar with the matter. Lula's complaints were made during a meeting ahead of the public announcement of the plan on Monday, the sources said, in which his agenda listed two ministers. Lula's office did not immediately respond to a Reuters request for comment outside usual working hours. The 10-year plan, led by Geraldo Alckmin, who is both vice president and Brazil's minister of development and industry, is aimed at boosting sluggish growth with state credits and subsidies.  Brazil's real slipped 1.2% against the U.S. dollar on Monday as investors saw the plan as a risk factor for the country's fiscal health. On Tuesday the currency regained some ground, closing up 0.7%.  Lula said in the internal government meeting that the plan lacked specific parameters to monitor progress, especially in areas linked to industry financing, the sources said. The National Development Bank BNDES said it had earmarked 250 billion reais ($50.5 billion) in funds for the plan, with another 50 billion reais coming from other state sources. Lula gave a public speech at the event to launch the plan, calling it a \"re-industrialization\" effort to boost Brazil's agricultural production and exports. Despite having gone ahead with the announcement on Monday, Lula asked for adjustments, mainly on how to monitor the plan's progress, according to the sources.  \nThe launch event on Monday was delayed by almost two hours. Lula apologized in his speech, saying the setback was due to \"a bad discussion over good things,\" without giving more detail. ($1 = 4.9535 reais)"
}