{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK070G4_L.jpg",
  "title": "US fighter jets to fly over Bosnia in warning to 'secessionist' Serbs",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 08, 2024 08:22AM ET",
    "Updated Jan 08, 2024 08:40AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-fighter-jets-to-fly-over-bosnia-in-warning-to-secessionist-serbs-3269530",
  "paragraph": "© Reuters. FILE PHOTO: Bosnia's Serb Republic President Milorad Dodik waves as he attends his region's national holiday, banned by the constitutional court, in East Sarajevo, Bosnia, January 9, 2023. REUTERS/Dado Ruvic/File Photo\nSARAJEVO (Reuters) - Two F-16 fighter jets will fly over Bosnia on Monday to underline U.S. support for its territorial integrity against \"secessionist activity\" by Serbs at odds with the country's 1990s Dayton peace accords, the U.S. embassy in Sarajevo said. The overflight will be part of bilateral air-to-ground training conducted along with Bosnia´s national armed forces in areas of the Balkan country's north not controlled by Serbs, the U.S. Embassy in Sarajevo said in a statement. An embassy statement referred to renewed separatist agitation by Milorad Dodik, the nationalist, pro-Russian leader of Bosnia's post-war Serb region who has long called for it to secede and join its neighbouring ally Serbia. \"This bilateral training is an example of advanced military-to-military cooperation that contributes to peace and security in the Western Balkans, as well as demonstrates the United States’ commitment to ensuring the territorial integrity of Bosnia-Herzegovina in the face of anti-Dayton and secessionist activity,\" the statement said.  Washington brokered the Dayton deal that ended Bosnia´s 1992-95 war, in which about 100,000 people were killed and two million displaced. The treaty divided Bosnia into a Serb Republic (RS) and a Federation shared by Croats and Bosniaks, with a relatively weak central government. \"The United States has underscored that the Bosnia-Herzegovina Constitution provides no right of secession, and it will act if anyone tries to change this basic element of Dayton,\" the embassy statement added.  On Monday evening Bosnian Serbs will begin celebrations of their self-proclaimed statehood day, which was banned as discriminatory against non-Serbs by Bosnia´s constitutional court. A parade of police and special forces is slated for Tuesday. \nDodik faces Sarajevo state court charges for having signed RS legislation suspending decisions of the constitutional court and the international envoy who oversees the implementation of the Dayton accords. Dodik's trial for defying the rulings of the peace envoy should have begun on Dec. 20 but was adjourned until Jan. 20 over procedural issues brought up by his legal team. Dodik has refused to enter a plea."
}