{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBS0D0_L.jpg",
  "title": "Brazil shows concern as Venezuela slams UK warship sent to Guyana",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Dec 29, 2023 11:08AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/brazil-shows-concern-as-venezuela-slams-uk-warship-sent-to-guyana-3264758",
  "paragraph": "© Reuters. National flags of Brazil and Venezuela flutter at the Brazil-Venezuela border in the Brazilian city of Pacaraima, Roraima state, Brazil December 8, 2023. REUTERS/Ueslei Marcelino/File Photo\nBRASILIA (Reuters) - Brazil expressed concern on Friday after Venezuela complained about the deployment of a British warship off the Guyana coast, raising tensions in a border dispute over the oil-rich Esequibo region of the former British colony. \"The Brazilian government believes that military demonstrations of support for any party must be avoided, so that the ongoing dialogue process can produce results,\" the Brazilian foreign ministry said in a statement. It urged all parties to \"contain themselves\" and resume talks. Britain has dispatched the Royal Navy patrol vessel HMS Trent to Guyana, where it was due to arrive on Friday morning. Venezuelan President Nicolas Maduro on Thursday slammed the warship's deployment and said it breached the \"spirit\" of an agreement reached between Venezuelan and Guyanese authorities. Neighbors Venezuela and Guyana agreed earlier this month to avoid using force or increasing tensions in their long-running dispute border dispute over the Esequibo territory. The 160,000-square-km (62,000-square-mile) region is generally recognized as part of Guyana, but in recent years Venezuela has revived its claim to the territory and to offshore areas after major oil and gas discoveries.  Western diplomats have urged the government of Brazilian President Luiz Inacio Lula da Silva, who has maintained friendly relations with Maduro, to ease tensions in the Guyana border dispute. Brazil said on Friday the \"Argyle Declaration for Dialogue and Peace\" signed by Guyana and Venezuela on Dec. 14 was \"a milestone in efforts to peacefully address the issue.\" \n\"The two countries also agreed to cooperate to avoid incidents on the ground and unilateral measures that could lead to an escalation of the situation,\" Brazil's statement said. The UK defense ministry said this month that HMS Trent would visit Guyana as part of a series of engagements in the region, without referring to Venezuela or the border dispute."
}