{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0F01H_L.jpg",
  "title": "Ukraine foreign minister muses about 'punching' Russia's Lavrov",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 15, 2024 08:31PM ET",
    "Updated Jan 15, 2024 08:39PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Ken Roth",
        "2024-01-21 11:32:25",
        "Nobody would blame him if he hits Lavrov in the head. Lavrov is a parrot for putin and have no opinions so he will not be missed",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/ukraine-foreign-minister-muses-about-punching-russias-lavrov-3274538",
  "paragraph": "© Reuters. FILE PHOTO: Ukrainian Foreign Minister Dmytro Kuleba and his Bulgarian counterpart Teodora Genchovska attend a news conference in Sofia, Bulgaria, April 19, 2022. REUTERS/Stoyan Nenov/File Photo\n(Reuters) - Ukrainian Foreign Minister Dmytro Kuleba, in an interview made public on Monday, said there had been times when he had felt the urge to \"punch in the face\" his Russian opposite number Sergei Lavrov in talks during the early stage of Moscow's invasion. Kuleba's brief remarks were part of an hour-long informal interview with a Ukrainian video blogger focusing on topics ranging from cooking to hobbies and Ukrainian soccer. When asked, as part of a series of rapid-fire questions, about his most difficult set of negotiations, Kuleba said: \"The most difficult talks are those in which you feel simply that you want to go and punch your opposite number in the nose, but you really can't do that. \"And I can say that this occurred two or three times. One occasion was with Lavrov in (the Turkish resort of) Antalya in spring of 2022.\" Ukrainian and Russian negotiators met for several rounds of talks in the early weeks after the February 2022 invasion -- first near Ukraine's border with Belarus and later in Turkey. Kuleba said at the time that the talks in Turkey had been difficult and dealt with a ceasefire and arranging humanitarian corridors. No agreement was clinched in those talks and there have been no negotiations since.  Ukrainian President Volodymyr Zelenskiy rejects talks with Moscow until Russian troops are withdrawn from the slightly less than 20 percent of Ukraine they now hold. Kremlin leader Vladimir Putin says Russia is ready for talks but has vowed to pursue what Moscow calls its \"special military operation\". In Moscow, Russia Foreign Ministry spokesperson Maria Zakharova said Kuleba's latest remarks underscored the incompetence of Ukraine's leadership. \n\"And that is the problem: uneducated, aggressive people were recruited under the guise of serving as ministers to ruin Ukraine for American money,\" Zakharova told the daily Izvestia.  \"Perhaps he belongs in a no-holds-barred bout rather than the foreign ministry?\""
}