{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0A0KF_L.jpg",
  "title": "EU lawmakers consider stronger plastic pollution law after spill hits Spain",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 11, 2024 08:08AM ET",
    "Updated Jan 11, 2024 12:50PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/eu-lawmakers-consider-stronger-plastic-pollution-law-after-spill-hits-spain-3272439",
  "paragraph": "© Reuters. A teams sent by Spain’s Environment ministry clean-up plastic pellets that have spread from the Spanish northwestern Galicia region to the Asturias region, triggering environmental concerns and a political blame game in San Juan beach in Asturias, Spain\nBy Kate Abnett BRUSSELS (Reuters) - Some European Union lawmakers are pushing to strengthen a planned law on microplastics pollution, after millions of plastic pellets washed up on the coast of Spain's northwestern Galicia region. Tiny plastic pellets are used to manufacture everyday items from water bottles to shopping bags. They are also an environmental menace, adding to the scourge of plastic in the oceans - and fiendish to clean up because of their tiny size. The EU is developing a law to prevent spillages of pellets, 176,000 metric tons of which are accidentally released each year, according to the European Chemicals Agency. Joao Albuquerque, the EU Parliament's lead negotiator on the new law, on Thursday said he had proposed expanding the requirements for companies to prevent spills to also include the shipping sector - particularly after the incident in Galicia.  \"This has become extremely urgent. These dramas are almost always avoidable,\" Albuquerque told an EU Parliament committee meeting.  His proposal would also expand the law to cover not only pellets, but the plastic flakes, powders and dust used to manufacture products. The Parliament is racing to agree its negotiating position, to give talks with EU countries to finish the law a chance of concluding before EU elections in June.  Green and liberal lawmakers backed the stronger measures on Thursday. The centre-right European People's Party resisted some, including Albuquerque's attempt to increase the number of companies covered.  The millions of pellets washed up in Spain came from at least one container that fell from a vessel off the coast of neighbouring Portugal last month. \nMicroplastics have been found in the human body, polar sea ice and the deepest ocean trenches, and can kill birds and turtles that eat them. The European Commission said its original proposal for the law omitted maritime transport because environmental issues in international shipping are handled by the International Maritime Organization. It suggested, however, the law could be strengthened to at least cover plastic pollution from journeys within the EU."
}