{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0A0KJ_L.jpg",
  "title": "Ukraine to submit revised mobilization bill after criticism",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 11, 2024 08:17AM ET",
    "Updated Jan 11, 2024 01:31PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/ukraines-criticized-draft-bill-on-mobilization-withdrawn-for-amendments-3272446",
  "paragraph": "© Reuters. FILE PHOTO: New Ukrainian army brigade recruits take part in a military exercise conducted by foreign instructor Magnus Ek, 53, in infantry training, combat tactic, shooting range practice and first aid training, in the eastern Donetsk region, Ukraine, Ma\nKYIV (Reuters) -Ukraine's hotly debated draft law on tightening mobilization rules has been withdrawn from parliament and a new version is ready for the government to review, Defence Minister Rustem Umerov said. The bill would enable Kyiv to call up more people to the army as the war with Russia approaches the two-year mark. The initial draft included electronic call-ups and a series of tight sanctions for those who flout the mobilization law. Thousands of Ukrainians rush to enlist immediately after Russia invaded on Feb. 24, 2022. However, nearly two years into the war, many men are trying to avoid the fight. Submitted by the government in late December after consultations with the military, the draft law immediately drew criticism from the public and politicians.  Lawmakers and analysts said that some of its provisions violated the constitution and carried corruption risks. The parliamentary committee for security and defence had been reviewing the draft for days. On Thursday, Umerov said the draft was withdrawn.  \"Our team has already prepared a new version of the draft law, taking into account all the proposals agreed in the working order with the members of parliament at the meetings of the committee,\" he said on Facebook (NASDAQ:META).  The ministry was ready to submit the draft for the government's approval in the near future. \"We need it as soon as possible,\" he added.  Parliamentary speaker Ruslan Stefanchuk earlier cited \"a joint decision\" between parliamentary, government representatives and military commanders that the bill would be reworked. Umerov said that preparation of the initial version of the draft had taken six months and had involved representatives of all parliamentary factions.  \"Now the mobilization, military registration and rotations, which are critically important for the state, are being politicised and stalled. This is unacceptable in wartime,\" he said.  The debate of the legislation highlighted a rift in parliament, with several opposition MPs from the former president's \"European Solidarity\" party accusing the parliamentary leadership of violating the rules of the parliamentary procedures and preventing coordinated work. \nThe draft law needs to be passed in several readings and then signed by President Volodymyr Zelenskiy.  Zelenskiy said last month the military had proposed mobilising 450,000-500,000 more people. Army Chief Valeriy Zaluzhnyi has said the figure took into account military plans and projections of possible losses. Military analysts say the half a million figure would be for the whole year."
}