{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0T0Q5_L.jpg",
  "title": "What California's atmospheric rivers means for water, snowpack levels",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 30, 2024 03:43PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/what-californias-atmospheric-rivers-means-for-water-snowpack-levels-3287404",
  "paragraph": "© Reuters. FILE PHOTO: A local resident walks along a pier as rain storms known as \"atmospheric river\" slam Northern California, in Santa Cruz, California, U.S., March 28, 2023. REUTERS/Carlos Barria/File Photo\n(Reuters) - The first of two atmospheric rivers over the next two weeks was expected to pound California on Wednesday and Thursday with heavy downpours or snow, which could cause dangerous flash flooding, landslides and white-out conditions.  WHAT IS A ATMOSPHERIC RIVER?  An atmospheric river is vast airborne current of dense moisture carried aloft for hundreds of miles from the Pacific and funneled over land to fall as bouts of heavy rain and snow. It can appear as a trail of wispy clouds that can stretch for hundreds of miles.  Some atmospheric rivers are weak weather systems that bring beneficial rain or snows that feed water supplies and are a crucial element to the global water cycle.  WHAT ARE THE CURRENT WATER, SNOWPACK LEVELS IN CALIFORNIA? The heavy rains and snow are welcome in California, which has experienced below average precipitation since the beginning of October. The state has received 9.81 inches of precipitation over that time, about 82% of its historic average, according to the California Water Watch.  Major reservoir levels in California are 116% above their average levels, but snowpack across the state is only 32% of its average, according to California Water Watch. More specifically, snowpack in the Sierra Nevada mountains is well below average, while to the north around Mount Shasta it is closer to average. Reservoirs and melting snowpack help offset arid conditions during drier months.  HOW COMMON ARE ATMOSPHERIC RIVERS? These \"rivers in the sky\" are relatively common, with about 11 present on Earth at any time, according to NASA. Most atmospheric rivers are weak and do not cause damage. In fact, they can provide much needed rain or snow.  HOW BIG ARE THEY AND CAN THEY BE DANGEROUS? Atmospheric rivers can carry up to 15 times the volume of the Mississippi River, according to the National Oceanic and Atmospheric Administration.  The atmospheric river is expected to douse California on Wednesday and Thursday with heavy rains of up to 6 inches (15 cm) that could cause flash flooding and wash out roadways. Wind gusts may take down trees and powerlines, causing power outages, the National Weather Service said.  Some high-elevation areas could see heavy snows of up to 3 feet (91 cm) that may cause dangerous whiteout conditions on roadways, the service said.  Last winter, a series of a dozen atmospheric rivers drenched the state, causing urban flooding, landslides and road closures. Some 21 people were killed in the storms that caused, according to researchers at the Stanford University, more than $3 billion in losses.  The bountiful rainfall triggered considerable growth in grasses and scrub and contributed to a less potent wildfire season in 2023 than in previous recent years. Heavy rains, however, can create dangers around burn scars from previous wildfires. The denuded land becomes susceptible to mudslides. In 2019, an atmospheric river nicknamed the \"Pineapple Express\" hit California. The water vapor from near Hawaii brought rain and triggered mudslides that forced motorists to swim for their lives and sent homes sliding downhill. WHAT IMPACT WILL CLIMATE CHANGE HAVE ON THEM? Atmospheric rivers that drenched California and flooded British Columbia in recent years will become larger — and possibly more destructive — because of climate change, scientists have said. They will also become more frequent and more likely to arrive as part of series, causing up to four times more economic damage than they would have individually, a study in Science Advances said. IS CALIFORNIA FREE OF DROUGHT? \nThe U.S. Drought Monitor, an initiative of the University of Nebraska-Lincoln, shows small portions of northern and southeastern California are currently \"abnormally\" dry. From the beginning of 2020 until 2023, the state experienced periods of \"extreme\" and \"exceptional\" drought, according to the monitor.  Experts warn that California and the West have not escaped longer-term conditions that, according to a study by Nature Climate Change, created the region's driest 22-year span in 12 centuries during the period of 2000 to 2021."
}