{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0605I_L.jpg",
  "title": "Israeli strike kills two Palestinian journalists in Gaza, officials say",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 07, 2024 09:32AM ET",
    "Updated Jan 07, 2024 04:46PM ET"
  ],
  "comments": [
    2,
    [
      [
        "Eliyahu RS",
        "2024-01-07 23:30:55",
        "not enough, gaza must be wiped out",
        "https://www.investing.com/members/213047028"
      ],
      [
        "Ken Roth",
        "2024-01-07 20:14:26",
        "I hope somebody explains the risks to the journalists hunting a good picture or a story in the midst of a war against Hamas",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/israeli-strike-kills-two-palestinian-journalists-in-gaza-officials-say-3268700",
  "paragraph": "5/5\n© Reuters. Children watch as Palestinians inspect the remains of a car where Palestinian journalist Hamza Al-Dahdouh was killed along with another journalist in an Israeli strike, in Rafah in the southern Gaza Strip, January 7, 2024. REUTERS/Ibraheem Abu Mustafa\n2/5\nBy Nidal al-Mughrabi CAIRO (Reuters) -An Israeli air strike on a car near Rafah in southern Gaza on Sunday killed two Palestinian journalists who were reporting, according to health officials in Gaza and the journalists' union there. Hamza Al-Dahdouh and Mustafa Thuraya were both freelancers. Al-Dahdouh had done freelance work for Al Jazeera and was the son of the Qatar-based TV station's chief correspondent in Gaza, Wael Al-Dahdouh. A third freelancer, Hazem Rajab, was wounded. Al Jazeera Media Network condemned the killing of the two and said it had been a deliberate attack. \"We urge the International Criminal Court, the governments and human rights organisations, and the United Nations to hold Israel accountable for its heinous crimes and demand an end to the targeting and killing of journalists,\" the network said in a statement. A statement from the Israeli military said that \"an IDF aircraft identified and struck a terrorist who operated an aircraft that posed a threat to IDF troops.\" \"We are aware of the reports that during the strike, two other suspects who were in the same vehicle as the terrorist were also hit,\" the statement said. In a statement on Dec. 16, in response to the death of another Al Jazeera journalist in Gaza, the Israeli army, said \"the IDF has never, and will never, deliberately target journalists\". The Israel-Hamas war that started on Oct. 7 has been deadly for journalists. The Committee to Protect Journalists (CPJ), an international watchdog, said that as of Saturday, 77 journalists and media workers had been killed - 70 Palestinians, four Israelis and three Lebanese. The Hamas-run Gaza government's media office said the two new deaths raised its own tally of journalists killed by the Israeli offensive to 109. A video posted on an Al Jazeera-linked YouTube channel showed Wael Al-Dahdouh crying next to his son's body and holding his hand. Later, after his son's burial, he said in televised remarks that journalists in Gaza would keep doing their job. \"All the world needs to see what is happening here,\" he said. Wael Al-Dahdouh is particularly well known to viewers across the Middle East after he learned during a live broadcast last month that his wife, another son, daughter and grandson had been killed in an Israeli air strike. U.S. Secretary of State Antony Blinken said Sunday's killings were an \"unimaginable tragedy\" and that he was \"deeply deeply sorry\" for the Al-Dahdouh family's loss.  \n\"One (journalist killed) is far too many\" Blinken said at a press conference in Doha, the Qatari capital. Another journalist who died covering the conflict was Reuters visuals journalist Issam Abdallah. A Lebanese citizen, he was killed on Oct. 13 by an Israeli tank crew while filming cross-border shelling in Lebanon, a Reuters investigation found."
}