{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0P0MC_L.jpg",
  "title": "In South Carolina, Biden woos Black voters in a changing U.S. South",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 26, 2024 11:55AM ET",
    "Updated Jan 26, 2024 03:46PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Mark Gesswein",
        "2024-01-28 16:50:42",
        "Black folk are tired of being pandered to by the Democrats, and then never seeing any benefit for their loyalty. There’s a reason that Blacks for Trump is a thing.",
        "https://www.investing.com/members/245851936"
      ],
      [
        "Tre Hsi",
        "2024-01-30 10:20:47",
        "\"There’s a reason that Blacks for Trump is a thing.\"  - there is a reason, but it's not the reason you are thinking",
        "https://www.investing.com/members/203741693"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/in-south-carolina-biden-woos-black-voters-in-a-changing-us-south-3284457",
  "paragraph": "2/2\n© Reuters. FILE PHOTO: U.S. President Joe Biden poses for a selfie in Hannibal's Kitchen restaurant, during his visit in Charleston, South Carolina, U.S., January 8, 2024. REUTERS/Kevin Lamarque/File Photo\n2/2\nBy Trevor Hunnicutt, Jarrett Renshaw COLUMBIA, South Carolina (Reuters) -Democrats have no chance of winning South Carolina in November, but the state is pivotal to Joe Biden's reelection anyway. Democrats hope South Carolina's new role as host of the party's first official primary on Feb. 3 will bolster support among Black voters. Top party officials also see it as a springboard to an audacious new strategy: retaking the American South in years to come. The Democratic Party has struggled to win elections in the South since the 1960s Civil Rights era. But spiking migration to the region in recent years and a string of statewide wins in Kentucky and North Carolina, as well as Biden's nail-biting win in Georgia in 2020, have raised hopes that it can improve, starting with the general election in November. Despite his poor poll numbers nationally, Democrats hope Biden can this year flip North Carolina, a state that has only backed a Democratic presidential candidate once since 1980, and that the party can also win back a handful of key congressional districts in the South. In the longer term, they have set their sights on gubernatorial and Senate campaigns in Louisiana and Mississippi. They are relying on legal challenges, voter drives and a new influx of cash, according to Reuters interviews with over a dozen top Democrats in the region, as the president and other high-profile Democrats around the country parachute in. Biden visits South Carolina for the second time this month on Saturday, for a primary election celebration dinner. It follows visits from rising Democratic stars, including California Governor Gavin Newsom and U.S. Representative Ro Khanna. \"Out of the ashes of the Old South, we will see, like a phoenix, the rise of a New South,\" predicts Democratic National Committee Chair Jaime Harrison, a South Carolina native. \"South Carolina's impact is not just relegated to the borders of South Carolina.\" Reversing Republicans' deep hold on the South will not be easy. South Carolina Republican Party Chairman Drew McKissick says the Democratic Party's liberal stances on everything from the economy to culture will repulse many of the region's more conservative voters. \"Having an earlier primary is not going to help grow their party in the state when at the root of their problem is their issue positions,\" he said. Republicans' primary in the state is Feb. 24, after nominating contests in Iowa, New Hampshire and Nevada. Republican former President Donald Trump is heavily favored to win the Republican nomination and go up against Biden in November. SOUTH CAROLINA SANDBOX? South Carolina, population 5 million, ranks low among U.S. states by income and education. But its population is also growing at the fastest rate of any U.S. state as inflation-conscious, pandemic-weary Americans, including retirees, seek more space, a lower cost of living and its warmer, subtropical climate. Unemployment in the state is at 3%, near historic lows. South Carolina last voted for a Democratic presidential candidate - Barack Obama - in 2008. In 2020 it went to Trump by nearly 12 percentage points. Biden's victory in the 2020 Democratic primary there rescued his broke and flailing campaign, convincing rivals that he was best positioned to win with Black voters and defeat Trump. Democrats think the state, where it is cheap to hire and run campaigns, can be a sort of sandbox to cultivate political talent, test voter outreach and spotlight issues that are relevant to rural and Black voters. A quarter of the state's eligible voters are Black, according to a Pew Research Center analysis. \"It will be transformative. Not overnight, but over time,\" predicts Clay Middleton, a senior adviser at the DNC and a Charleston resident. TURNING OUT VOTERS This year, nonpartisan voting rights and legal groups are aiming to boost voter registration and participation, which is lower in the South than in any other region, across demographic groups. The NAACP is leading lawsuits from Alabama to North Carolina aimed at blocking Republican efforts to reshape congressional districts in ways that dilute Black voting power. Black people vote 9-to-1 for Democrats in presidential races, and one in five Southerners are Black, versus one in seven in all of the U.S. But Southern Black voter participation lags that of white people. Some 3.5 million people moved to the South from other parts of the country or the world between 2020 and 2023, census data shows, and Democrats are courting liberal transplants. \"The bottom line is for a lot of Southern states there's just a ton of folks who are not engaged in the process, who are on the sidelines,\" said Tolulope Kevin Olasanoye, executive director of the Democratic Party of Georgia. \"The earlier the investment, the earlier the return on the investment.\" Kristin Powell, deputy director of the Black to the Future Action Fund, which helps mobilize and register Black voters, said Democrats too often focus on large U.S. cities and ignore rural Black voters, like those in South Carolina, Georgia and Louisiana. \nHer organization targeted low-propensity voters – those who skipped at least two of the last four major elections – in North Carolina, Wisconsin and Georgia in 2022. They increased voting rates by 85% in Wisconsin, 46% in North Carolina and an astounding 2,000% in Georgia, she said. \"They don't have a sense that they are politically powerful. And that really was the case in Southern Georgia. And if that changed, it could be the reason that Biden, for example, could stay in office,\" Powell said."
}