{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0O0CW_L.jpg",
  "title": "Several Ukrainian state-run bodies report cyber attacks",
  "category": "Commodities news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 25, 2024 05:47AM ET",
    "Updated Jan 25, 2024 04:46PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/commodities-news/several-ukrainian-staterun-bodies-report-cyber-attacks-3282576",
  "paragraph": "© Reuters. A hand is seen on a laptop with binary codes displayed in front of the Ukrainian flag in this illustration taken, August 19, 2022. REUTERS/Dado Ruvic/Illustration/File Photo\nKYIV (Reuters) -Several major Ukrainian state organisations on Thursday reported cyber attacks on their systems, in the latest wave that a source close to the government blamed on Russian intelligence. Ukraine's state-run energy company Naftogaz said one of the data centres had been hit by a \"large-scale cyberattack.\" \"Our websites and call centre are currently down,\" it said on the Telegram messaging app. Ukrainian national postal service Ukrposhta reported a \"significant technical failure\" in its IT systems. \"Last night there was an attack on the information infrastructure of our partners,\" Ukrposhta head Ihor Smeliansky said on Telegram. The company said its specialists were working to fix the problem and restore full operations.  Ukrtransbezpeka, a state transport safety agency, which maintains the border crossing system for Ukrainian drivers, also reported problems with its data centre. Interfax Ukraine news agency later quoted CERT-UA, the state body responsible for countering cyber attacks, as saying its specialists were working to resolve problems. A convention centre and the ticket sales system for Ukrainian state railways also reported suspected cyber attacks. A source close to the Ukrainian government said there were other \"victims,\" mainly in the finance and banking sector, but that government policy was to disclose only those whose services go down. The source said those responsible had yet to be identified but that the attacks were not \"too bad\", compared to a major attack and outage last month at Kyivstar, Ukraine's largest mobile operator. \"Ukraine is moving very fast to restore the systems. It usually takes a few days,\" the source said, adding that the attackers were \"almost certainly\" hackers associated with Russia's FSB intelligence service.  \nUkrainian resources are often the target of cyber attacks, which authorities blame on Russia, which invaded Ukraine in February 2022.  Kyivstar's services were knocked out after hackers used an employee's compromised account to carry out the attack."
}