{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "Biden says American Judith Weinstein was killed by Hamas on Oct. 7",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 28, 2023 03:18PM ET",
    "Updated Dec 28, 2023 07:00PM ET"
  ],
  "comments": [
    1,
    [
      [
        "dylan mulvaney",
        "2023-12-29 01:04:46",
        "Anti-semetic democrats went to the Twin Tower today and caused the building to get shut down while they were changing pro-Hamas slogans and alluah akbar.",
        "https://www.investing.com/members/250212425"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/biden-says-american-judith-weinstein-was-killed-by-hamas-on-oct-7-3264482",
  "paragraph": "By Andrea Shalal and Kanishka Singh CHRISTIANSTED, St. Croix (Reuters) -American Judith Weinstein, who was believed to have been kidnapped by Hamas, was killed by the Palestinian Islamist group on Oct. 7 when it attacked Israel, President Joe Biden said on Thursday, adding he was devastated by the news. Weinstein, 70, was also an Israeli and the last missing Canadian from the Oct. 7 attack. Last week Biden said her husband, Gadi Haggai, 73, was killed on Oct. 7. \"This tragic development cuts deep, coming on the heels of last week’s news that Judith’s beloved husband, Gad Haggai, is believed to have been killed by Hamas,\" Biden said in a statement, vowing to continue attempting for the release of other hostages still held by Hamas. Canadian Foreign Minister Melanie Joly said her country also mourned the loss of Weinstein. Working while on holiday in the U.S. Virgin Islands, Biden said he would never forget what the couple's daughter and the family members of other Americans held hostage in Gaza told him when he met with them this month. \"They have been living through hell for weeks. No family should have to endure such an ordeal,\" Biden said. Biden and his national security adviser, Jake Sullivan, have been deeply engaged on the hostage issue, according to administration officials. Biden has spoken numerous times with Israeli Prime Minister Benjamin Netanyahu and the emir of Qatar on securing their release. Hamas attacked kibbutzim, border towns and a music festival in Israel on Oct. 7 in a rampage that left 1,200 dead, with 240 people taken to Gaza as hostages, according to Israeli tallies. Israel's assault on Gaza has killed over 21,000 Palestinians, according to Gaza health authorities. Of the hostages, 110 were freed during a short truce in late November and another 23 have now been declared dead in absentia, an Israeli government spokesperson said on Thursday. The Hostages and Missing Families Forum said that between five and 10 of the hostages hold U.S. citizenship."
}