{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBU04H_L.jpg",
  "title": "US sinks 3 ships, kills 10 after Houthi Red Sea attack",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 31, 2023 12:13PM ET",
    "Updated Dec 31, 2023 07:50PM ET"
  ],
  "comments": [
    7,
    [
      [
        "Mark Loughran",
        "2024-01-01 21:04:17",
        "How will crude go folks",
        "https://www.investing.com/members/218131265"
      ],
      [
        "Charles Manson",
        "2024-01-01 14:05:08",
        "Don't worry \"Subbuilder\". My comments get removed often. I determined it was one of the Beta-Male MAGA-Phobe comment reviewers that works the night shift. Keep plugging away. Gotta go feed my Pitbulls. They tore up my neighbor's fence yesterday. Later, Charles.",
        "https://www.investing.com/members/249519852"
      ],
      [
        "Mark Jannetty",
        "2024-01-01 22:06:55",
        "you don't like freedom of speech?",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Charles Manson",
        "2024-01-01 22:34:15",
        "Mark Jannetty",
        "https://www.investing.com/members/249519852"
      ],
      [
        "Charles Manson",
        "2024-01-01 13:59:35",
        "“The US Navy helicopters returned fire in self-defense, sinking three of the four small boats, and killing the crews. The fourth boat fled the area. There was no damage to US personnel or equipment,”\nGREAT TARGET PRACTICE!!",
        "https://www.investing.com/members/249519852"
      ],
      [
        "Barry Nickerson",
        "2024-01-01 12:05:02",
        "My comment disappeared, perhaps somebody does not appreciate my encouragement of the sinking of ALL the pirate vessels on sight.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Barry Nickerson",
        "2024-01-01 10:58:00",
        "I guess our military leaders read the comments on Investing.com, as they finally performed as I've been  writing and wishing them to do for the last 2 months.  Now all they have left is to finish sinking the rest of these pirate boats.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Kenn Liu",
        "2023-12-31 23:59:47",
        "gold to 2200",
        "https://www.investing.com/members/210348153"
      ],
      [
        "Casador Del Oso",
        "2023-12-31 18:36:25",
        "If the terrorists keep up the offensive long eventually, they will sink a ship. If this happens, all out war will result.",
        "https://www.investing.com/members/221023565"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/maersk-pauses-red-sea-sailings-after-houthi-attack-on-container-ship-3264982",
  "paragraph": "© Reuters. FILE PHOTO: CMA CGM Louis Bleriot and a Maersk Line container ship pass through the Suez Canal in Ismailia, Egypt July 7, 2021. Picture taken July 7, 2021. REUTERS/Amr Abdallah Dalsh\nBy Jacob Gronholt-Pedersen and Ahmed Elimam COPENHAGEN/DUBAI/CAIRO (Reuters) -U.S. helicopters repelled an attack by Iran-backed Houthi militants on a Maersk container vessel in the Red Sea, sinking three ships and killing 10 militants, according to accounts by American, Maersk, and Houthi officials on Sunday.  The naval battle occurred around 0330 GMT on Sunday as the attackers sought to board the Singapore-flagged Maersk Hangzhou, Maersk and U.S. Central Command (CENTCOM) said. Helicopters from the USS Eisenhower and USS Gravely joined the ship's security team in repelling the attackers after receiving a distress call, CENTCOM said. Maersk said it was pausing all sailing through the Red Sea for 48 hours after the attack.  A spokesman for the Houthis said the group carried out the attack because the ship's crew refused to heed warning calls. He said 10 Houthi naval personnel were \"dead and missing\" after their boats were attacked by U.S. forces in the Red Sea. The naval battle underlines the risk of a regional escalation in fighting as Israel continues with its relentless bombing campaign following a Hamas surprise cross-border attack on Israeli towns on Oct. 7 that left 1,200 dead, and took 240 hostages. Israel's air and artillery bombardment has killed more than 21,800 people, according to Gazan health authorities. Yemen's Houthis have been targeting vessels in the Red Sea since November to show their support for Hamas, prompting major shipping companies to take the longer and costlier route around the Africa's Cape of Good Hope rather than through the Suez Canal. The Red Sea is the entry point for ships using the Suez Canal, which handles about 12% of global trade and vital for the movement of goods between Asia and Europe.  The United States launched Operation Prosperity Guardian on Dec. 19, saying more than 20 countries had agreed to participate in the efforts to safeguard ships in Red Sea waters near Yemen. Maersk, one of the world's top cargo shippers, said on Dec. 24 it would resume sailing through the Red Sea. However, attacks have continued and U.S. allies have proven reluctant to commit to the coalition, with nearly half not declaring their presence publicly.  The botched Houthi boarding operation was the second attack on the Maersk Hangzhou in as many days. The ship, which is carrying 14,000 containers en route from Singapore, was on Saturday hit by a missile about 55 nautical miles southwest of Al Hodeidah, Yemen.  The shipping company added that the crew of the Maersk Hangzhou crew was safe and there was no indication of fire onboard the vessel, which continued its journey north toward the Suez Canal. White House national security spokesperson John Kirby (NYSE:KEX) declined to say what options the U.S. is considering when asked on ABC's \"Good Morning America\" if Washington would consider a preemptive strike on the Houthis.  \"We have made it clear publicly to the Houthis, we've made it clear privately to our allies and partners in the region, that we take these threats seriously.\" Writing in the Daily Telegraph newspaper, British Defence Secretary Grant Shapps said: \"We are willing to take direct action, and we won’t hesitate to take further action to deter threats to freedom of navigation in the Red Sea.\" \"The Houthis should be under no misunderstanding: we are committed to holding malign actors accountable for unlawful seizures and attacks,\" he said. Earlier on Sunday, British Foreign Secretary David Cameron said he had told Iranian Foreign Minister Hossein Amirabdollahian in a call that Iran should help stop the Houthi attacks in the Red Sea.  \nThe BIMCO shipping association condemned the attacks and thanked those states involved in repelling them. \"We are thankful to U.S., French, and UK efforts so far and hope even more states will support the coalition with naval assets or other impactful means including diplomatic pressure on the Houthis and their sponsors,\" Jakob Larsen, BIMCO's head of maritime safety and security, told Reuters."
}