{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0K016_L.jpg",
  "title": "Ayodhya: Religious spectacle to mark Modi's opening of Ram temple",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 20, 2024 09:33PM ET",
    "Updated Jan 21, 2024 06:08PM ET"
  ],
  "comments": [
    5,
    [
      [
        "siva balasub",
        "2024-01-21 13:20:13",
        "500 years of religious oppression, finally someone has the courage to deliver justice ",
        "https://www.investing.com/members/200909083"
      ],
      [
        "Wolf of Wall Street",
        "2024-01-21 14:10:40",
        "Heights of Fanaticism",
        "https://www.investing.com/members/205835037"
      ],
      [
        "Jake Vee",
        "2024-01-21 19:40:24",
        "Religious oppression against to the Muslim minority in your country? ",
        "https://www.investing.com/members/249287397"
      ],
      [
        "Dharmesh Hirani",
        "2024-01-21 13:16:46",
        "modi biggest feku Champak in the world ",
        "https://www.investing.com/members/223968722"
      ],
      [
        "Aashish Gulati",
        "2024-01-22 00:17:28",
        "Fatti. Boroline laga. G. U. C u I a",
        "https://www.investing.com/members/209102440"
      ],
      [
        "john wick",
        "2024-01-21 05:26:12",
        "Another hindus and modi propaganda, using it to suppress the minority. ",
        "https://www.investing.com/members/256103011"
      ],
      [
        "Aashish Gulati",
        "2024-01-22 00:15:11",
        "F u. U",
        "https://www.investing.com/members/209102440"
      ],
      [
        "john wick",
        "2024-01-21 05:25:20",
        "Another hindus and modi propaganda, using it to suppress the minority. ",
        "https://www.investing.com/members/256103011"
      ],
      [
        "john wick",
        "2024-01-21 05:21:56",
        "Another hindus and modi propaganda, using it to suppress the minority. ",
        "https://www.investing.com/members/256103011"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/religious-spectacle-to-mark-opening-of-ram-temple-by-indias-modi-3278917",
  "paragraph": "5/5\n© Reuters. Labourers stand on top of the illuminated grand temple of Lord Ram ahead of its opening in Ayodhya in India, January 19, 2024. REUTERS/Adnan Abidi\n2/5\nBy Saurabh Sharma and YP Rajesh AYODHYA, India (Reuters) - A grand temple to Hindu god Lord Ram opens on Monday on a site in India millions believe is his birthplace, in a religious spectacle led by Prime Minister Narendra Modi months before he seeks a rare third term in elections.   The construction of the temple is a 35-year-old, central promise of Modi’s Hindu nationalist Bharatiya Janata Party (BJP) and a contentious political issue that helped catapult the party to prominence and power.   Hindu groups are portraying the inauguration ceremony in the northern city of Ayodhya as the peak of Hindu awakening after centuries of subjugation by Muslim and colonial powers.   It is also being seen as the virtual launch of the deeply religious strongman Modi’s re-election campaign for general elections due by May.   The temple site was bitterly contested for decades with both Hindus and Muslims laying claim to it and was a flashpoint for violence after a Hindu mob in 1992 destroyed a 16th century mosque which stood there.   India's majority Hindus say the site is the birthplace of Lord Ram, and was holy to them long before Muslim Mughals razed a temple at the spot and built the Babri Masjid or mosque there in 1528. In 2019, the Supreme Court handed over the land to Hindus and ordered allotment of a separate plot to Muslims. On Monday, Modi will take part in the culmination of rituals to inaugurate the temple, for which thousands of members of BJP and its affiliates, religious leaders and devotees from across the country are expected to gather in Ayodhya.   Some of India’s top business leaders, movie actors and sportspersons have also been invited for the consecration, organisers said. RELIGIOUS OUTPOURING, POLITICAL CONTROVERSY “The Lord has made me an instrument to represent all the people of India during the consecration,” Modi said on X as he began 11 days of special rituals ahead of the inauguration. Calling it a “historic moment” when Lord Ram will take his place in his grand temple, Modi has urged Indians to light lamps in their homes and neighbourhood temples on Monday evening and once again celebrate Diwali, the Hindu festival of lights which usually falls in October-November.   “The consecration of the temple feels more like the launching of the general election campaign rather than a religious ritual,” said Prithvi Datta Chandra Shobhi, a political commentator who teaches at Krea University in southern India.   “The prime minister appears to inhabit the role of an emperor who is undertaking a major ritual sacrifice,” he said.   The temple has been built on a 2.67-acre (1.08 hectares) site inside a 70-acre (28.33 hectares) complex and only its first phase is ready. The second and final phase is expected to be completed in December 2025.   The project is estimated to cost 15 billion rupees ($181 million) and is entirely funded by donations from within the country.   India has witnessed an emotional outpouring among Hindus ahead of the consecration, with residential colonies and markets flying holy flags, organising special prayers and making plans to show the live telecast of Monday’s event on giant screens. The inauguration has also sparked a political controversy with major opposition parties, including the main opposition Congress, declining invitations to attend saying it had been converted into a political, Modi event. \nMuslim groups were not happy with the 2019 court verdict which gave the site to Hindus but said they would accept it “with humility”. Nearly five years on, they indicated they had moved on. “The construction of the temple is going on as per the direction of the Supreme Court, so we welcome it. I don't think there's any feeling of ill-will in the Muslim community,” said Zufar Ahmad Faruqi, head of the Indo-Islamic Cultural Foundation that is building a new mosque in Ayodhya about 25 km (15 miles) from the temple."
}