{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0F0QP_L.jpg",
  "title": "Blinken says Arab countries not keen to rebuild Gaza if it will be 'leveled' again",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 16, 2024 12:15PM ET",
    "Updated Jan 16, 2024 12:22PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/blinken-says-arab-countries-not-keen-to-rebuild-gaza-if-it-will-be-leveled-again-3275479",
  "paragraph": "© Reuters. U.S. Secretary of State Antony Blinken speaks to members of the media before boarding his plane to return to Washington, following his week-long trip aimed at calming tensions across the Middle East, in Cairo, Egypt, January 11, 2024. REUTERS/Evelyn Hocks\nBy Humeyra Pamuk (Reuters) - Arab countries are not keen to get involved in the rebuilding of Gaza if the Palestinian enclave will be \"leveled\" again in a few years and stress the importance of Palestinian statehood for any regional settlement, the U.S. Secretary of State Antony Blinken said on Tuesday. Speaking to CNBC in an interview in Davos, Switzerland, Blinken said there was a \"new equation\" in the Middle East in which Israel's Arab and Muslim neighbors were prepared to integrate Israel into the region but they were equally committed to a pathway to a Palestinian state. He said both the Arab states and Washington believe that until that issue is addressed, neither Israel nor the region will have peace, stability and security. \"You have to resolve the Palestinian question,\" Blinken said. \"Arab countries are saying this ... Look, we're not going to get into the business, for example, of rebuilding Gaza only to have it leveled again in a year or five years and then be asked to rebuild it again.\" \"You're in a place right now, where, again, Arab countries, including countries like Saudi Arabia, are prepared to do things in their relationship with Israel they were never prepared to do before. That opens up an entirely different future, a much more secure future.\" \"In terms of Israel's own security, the Arab piece of the equation and the Palestinian peace - that's the way to true lasting security,\" Blinken said. Speaking also in Davos, Saudi Arabia's foreign minister said the kingdom could recognise Israel if a comprehensive agreement were reached that included statehood for the Palestinians. Blinken in his latest trip to the Middle East just a week ago had brought a rough agreement to Israel that its predominately Muslim neighbors would help rehabilitate Gaza after the war and continue economic integration with Israel, but only if it committed to eventually allowing the creation of an independent Palestinian state. U.S.-brokered talks on a Palestinian state in territory now occupied by Israel collapsed almost a decade ago. Right-wing leaders in Israel's current ruling coalition oppose Palestinian statehood. \nThe war in Gaza started when Hamas militants stormed into southern Israel on Oct. 7, killing 1,200 people and taking 240 hostages. Israel says more than 130 remain in captivity. Israel responded to Hamas' assault with a siege, bombardment and ground invasion of Gaza that have devastated the tiny coastal territory and killed more than 24,000 people, according to Gaza health officials."
}