{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "Venezuela is prepared for US sanctions on oil, may reject migrant flights -officials",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 30, 2024 02:46PM ET",
    "Updated Jan 30, 2024 05:16PM ET"
  ],
  "comments": [
    2,
    [
      [
        "Barry Nickerson",
        "2024-01-31 12:13:25",
        "Even Venezuela  doesn't want these people....and this is their own citizens we're talking about.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Joe Blewit",
        "2024-01-30 22:36:36",
        "Should we sanction the US for doing the same thing?",
        "https://www.investing.com/members/256551012"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/venezuela-is-prepared-for-us-sanctions-on-oil-may-reject-migrant-flights-officials-3287389",
  "paragraph": "By Deisy Buitrago and Vivian Sequera CARACAS (Reuters) -Venezuela is prepared for the reimposition of U.S. sanctions on its oil and gas exports and will stop accepting repatriation flights from the U.S. if \"economic aggression\" intensifies, high-level officials said on Tuesday. The U.S. began reimposing sanctions on Caracas this week after the South American country's top court upheld a ban blocking the candidacy of the leading opposition hopeful in a presidential election later this year.  The Treasury Department on Monday gave U.S. entities until Feb. 13 to wind down transactions with Venezuelan state-owned miner Minerven.  The U.S., which first imposed oil sanctions on Venezuela in 2019, had granted sanctions relief for the OPEC member country in October in recognition of the Barbados deal, which included releasing political prisoners, allowing international observers and setting conditions for a fair presidential election.  The U.S. State Department separately said on Tuesday Washington does not plan to renew a wider license that has allowed Venezuela's oil to freely flow to its chosen destinations when it expires on April 18.  \"Actions by Nicolas Maduro and his representatives in Venezuela, including the arrest of members of the democratic opposition and the barring of candidates from competing in this year's presidential election, are inconsistent with the agreements signed in Barbados,\" the State Department said, referring to the deal on election conditions inked between Maduro's government and the opposition last year. \"Absent progress between Maduro and his representatives and the opposition Unitary Platform... the United States will not renew the license when it expires on April 18,\" the State Department added, referring to general license 44, which provides relief to Venezuela's oil and gas sector. \"Venezuela is prepared for any circumstance,\" Oil Minister Pedro Tellechea told reporters on the sidelines of a government event in Caracas. \"They will find a powerful industry ready to face any situation.\" Since October, Venezuela's oil exports have slightly increased, with more cargoes going to the U.S. and Europe, which used to be its preferred markets before sanctions. The U.S. would also feel the impact of any reimposing of energy sanctions on Venezuela, Tellechea told reporters, adding that the country will not \"kneel down\" just because somebody tries to impose which countries it can do business with. Venezuela will reject migrant repatriation flights from the U.S. from Feb. 13 and review other cooperation if \"economic aggression\" against it intensifies, Vice-President Delcy Rodriguez said on social media. \"If they carry out the false step of intensifying economic aggression against Venezuela, at the request of extremist lackeys in the country, from Feb. 13 the repatriation flights of Venezuelan migrants will be immediately revoked,\" Rodriguez said. Repatriation flights to Venezuela from the U.S. restarted in October under an agreement between the two countries. The U.S. Department of Homeland Security last conducted a removal flight which included Venezuelans in late December, the eleventh such transport last year. DHS has said it removed or returned over 460,000 individuals, between mid-May and late December 2023."
}