{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "Madrid museum may keep Pissarro painting looted by Nazis, US appeals court rules",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 09, 2024 05:56PM ET",
    "Updated Jan 10, 2024 12:23PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/madrid-museum-may-keep-pissarro-painting-looted-by-nazis-us-appeals-court-rules-3270778",
  "paragraph": "By Jonathan Stempel (Reuters) - A U.S. appeals court said on Tuesday that Madrid's Thyssen-Bornemisza museum may keep a painting by the French impressionist Camille Pissarro that the Nazis looted from a Jewish woman, rejecting an ownership claim that her heirs have pursued for more than two decades. The 3-0 decision by the 9th U.S. Circuit Court of Appeals in Pasadena, California, came in one of the oldest Nazi art theft cases, which began in 2005 and reached the U.S. Supreme Court two years ago. Pissarro's \"Rue Saint Honore, apres midi, effet de pluie\" (\"Rue Saint Honore, Afternoon, Rain Effect\"), depicting a Paris street scene, was stolen in 1939 from Lilly Neubauer, who was forced to sell it for 900 Reichsmarks ($360) to obtain a visa and flee Nazi Germany. She was never paid. Ownership passed through several hands until 1993, when the Thyssen bought the 1897 painting from Baron Hans Heinrich Thyssen-Bornemisza and put it on display, where it remains. After learning where the painting was, Neubauer's grandson, Claude Cassirer, petitioned for its return in 2001, and sued four years later. He died in 2010, and his son David, his daughter Ava's estate and the United Jewish Federation of San Diego County now handle the case. In Tuesday's decision, Circuit Judge Carlos Bea said Spain's interest in providing \"certainty of title\" to its museums outweighed California's interest in deterring theft and obtaining recoveries for victims of stolen art who live there. He said that justified applying Spanish law rather than California law, entitling the Thyssen to the painting because it had in good faith owned and displayed it for eight years before its ownership was questioned. In a concurrence, Circuit Judge Consuelo Callahan said Spain should have voluntarily relinquished the painting, reflecting its commitment to returning Nazi-looted art to victims, but the law compelled a different outcome. \"I wish that it were otherwise,\" she wrote. The decision came two years after the Supreme Court threw out an earlier 9th Circuit decision because it misapplied choice-of-law rules. Lawyers for the Cassirers in a joint statement said Tuesday's decision \"fails to explain how Spain has any interest in applying its laws to launder ownership of the spoils of war.\" They plan to seek review by an 11-judge 9th Circuit panel. \"The Cassirers believe that, especially in light of the explosion of antisemitism in this country and around the world today, they must challenge Spain's continuing insistence on harboring Nazi looted art,\" the lawyers said. \nThaddeus Stauber, a lawyer for the Thyssen, called the decision \"a welcome conclusion to this case.\" The case is Cassirer et al v Thyssen-Bornemisza Collection Foundation, 9th U.S. Circuit Court of Appeals, No. 19-55616."
}