{
  "image": "https://i-invdn-com.investing.com/news/LYNXMPEA7E034_L.jpg",
  "title": "Iran executes four accused of sabotage, links to Israel's Mossad",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Dec 29, 2023 03:19AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/iran-executes-four-accused-of-sabotage-links-to-israels-mossad-3264581",
  "paragraph": "(Reuters) -Iran executed on Friday four people, including a woman, whom it accused of being \"saboteurs\" with links to Israel's Mossad intelligence service, the Mizan news agency affiliated to the judiciary said. The executions took to five the number of people put to death this month in a decades-long shadow war that has seen Iran accuse Israel of attacks on its nuclear effort, charges the latter has never confirmed or denied. \"Four members of a sabotage team associated with the Zionist regime ... were executed this morning following legal procedures,\" the news agency said, accusing them of \"extensive\" actions, guided by Mossad officers, targeting Iran's security.  Friday's executions in West Azerbaijan province followed Iran's mid-December execution of a fifth accused Mossad agent in the southeastern province of Sistan-Baluchestan.  The semi-official Tasnim news agency identified the four executed on Friday as Vafa Hanareh, Aram Omari, and Rahman Parhazo, along with the woman, named Nasim Namazi.  They were the principal convicts in a case that involved 10 offenders, it added, but it was not immediately clear if the rest would also face execution. The official IRNA news agency posted a video clip nearly eight minutes in length, that showed the men confessing to their alleged co-operation with a Mossad officer in neighbouring Turkey, who used two names, Tony and Arash. It said their mission entailed kidnappings, threatening and setting fire to vehicles and homes of unnamed targets and stealing their mobile phones. Iranian intelligence put the group under close surveillance for at least four months, from around January 2022 until their arrest sometime that May, when they were \"transferred from a neighbouring country\" to Iran, the video clip showed. \"They were training us for bigger assignments,\" an unidentified young man in a blue striped shirt said in the clip. At the time of the arrests, Iranian media said the 10, who were in video communication with Mossad officers, \"set fire to cars and homes of people affiliated with the security apparatus and received cash for taking photos they sent to Mossad agents\". Iran has accused Israel of carrying out several attacks on facilities linked to its nuclear programme and of killing its nuclear scientists over the past years. Israel has neither denied nor confirmed the allegations. In August, Iran accused Israel of being behind \"one of the largest sabotage plots\" targeting its defence industry and the production of missiles. In July, its intelligence ministry said it had arrested a network of agents working for Israel before they were able to carry out sabotage in sensitive locations. In January last year, Israel said it had broken up an Iranian spy ring that recruited Israeli women via the social media platform Facebook (NASDAQ:META) to photograph sensitive sites. In April 2021, Tehran blamed an act of \"nuclear terrorism\" for a disruption of power at its Natanz uranium enrichment facility in the desert in the central province of Isfahan."
}