{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0O0OY_L.jpg",
  "title": "US, Israeli intelligence chiefs to discuss Gaza hostage deal -sources",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 25, 2024 12:15PM ET",
    "Updated Jan 25, 2024 03:57PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-cia-chief-to-help-broker-gaza-hostage-deal-source-3283340",
  "paragraph": "By Jonathan Landay and Andrew Mills WASHINGTON/DOHA (Reuters) - U.S. Central Intelligence Agency Director William Burns and his Israeli counterpart will meet with Qatari officials in coming days for talks on a second potential Gaza hostage deal, three sources familiar with the matter told Reuters on Thursday.  Burns and the head of Israel's Mossad intelligence service, David Barnea, will meet with Qatari Prime Minister and Foreign Minister Sheikh Mohammed bin Abdulrahman Al Thani in Europe this weekend, one official briefed on the meeting told Reuters. Egyptian intelligence chief Abbas Kamel will also participate, a second source said.  The administration of U.S. President Joe Biden has been trying to facilitate the release of the more than 100 remaining hostages taken during Hamas' Oct. 7 attack on Israel, which ignited the war in Gaza, although there remains a considerable distance between the two sides' demands. The U.S. and Israeli intelligence chiefs have previously met with Qatari and Egyptian officials, helping to broker a short-lived truce in November that saw more than 100 hostages freed.  Burns has been \"involved in helping us with the hostage deal that was in place and trying to help us pursue another one,\" White House national security spokesman John Kirby (NYSE:KEX) told reporters traveling with Biden aboard Air Force One, referring specific questions to the agency.  The CIA, which has a policy of not disclosing the director's travel, declined to comment on the meeting, first reported by the Washington Post.  U.S. ally Israel has vowed to eradicate Hamas, unleashing a torrent of strikes that have flattened most of Gaza and killed at least 25,700 people, Palestinian health officials say. A third source with knowledge of the talks said that Israel has proposed a 60-day pause in the fighting during which more than 100 hostages would be released in phases, beginning with civilian women and children. That would be followed by the release of civilian men, female soldiers and the remains of hostages who died after being abducted by Hamas, according to the source. That plan, however, is at sharp odds with Hamas' last proposal, raising a question of whether the gap could be bridged. According to the source, Hamas last week proposed an end to the war, international guarantees that it would not start anew and the release of all detainees held by Israel, including those who participated in its Oct. 7 onslaught.  \nIsrael has consistently opposed a permanent ceasefire, a position backed by Washington. Prime Minister Benjamin Netanyahu said on Sunday that Israel rejected Hamas' conditions. Following the planned weekend talks, Qatar's Al Thani is expected to be in Washington next week. On Monday, he is scheduled to speak at the Atlantic Council, according to the think tank's website."
}