{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK150XZ_L.jpg",
  "title": "Obama, Clinton to attend Biden campaign fundraiser in March",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Feb 06, 2024 05:53PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/obama-clinton-to-attend-biden-campaign-fundraiser-in-march-3294555",
  "paragraph": "© Reuters. FILE PHOTO: U.S. President Barack Obama (L) listens as former president Bill Clinton makes remarks during an event at the White House in Washington September 12, 2014. REUTERS/Kevin Lamarque\nBy Nandita Bose WASHINGTON (Reuters) - President Joe Biden will attend a reelection fundraiser in March with former Presidents Barack Obama and Bill Clinton, an event the Biden campaign hopes will energize Democrats and boost fundraising. \"Folks — I'll be in NYC on March 28th to support @JoeBiden. Who's coming with me?\" Obama said on social media platform X, formerly known as Twitter. \"Count me in,\" said Clinton. \"You guys know you can just call me next time, right?,\" Biden said in response to their posts. The fundraiser with the three Democratic presidents will be held in New York City on March 28. Both Clinton and Obama remain popular among Democrats and Biden's approval ratings after year three of his presidency is lower than Obama's and Clinton's at this same point in their presidencies.  Obama had also raised questions about the structure of Biden's reelection campaign, discussing the matter directly with him, according to news reports earlier this year. Biden's 2024 reelection team and his Democratic Party said in January they raised over $97 million in the last three months of 2023, amid opinion polls showing voter concerns over his age, high prices and handling of the Israel-Hamas war. In recent months, the Biden team has faced growing calls to become more active and aggressive in highlighting the contrast with Donald Trump, a pivot Biden has embraced. In January, Biden accused Trump, his likely 2024 election opponent, of instigating the Jan. 6 attacks and plotting revenge on those seeking to punish him. \nTrump is close to clinching the Republican presidential nomination after back-to-back wins in Iowa and New Hampshire, and he and Biden are setting their sights on each other ahead of a likely general election rematch in November. Biden, 81 and Trump, 77, started the election year in a dead heat as many Americans appear to be unenthusiastic about their choices, according to a Reuters/Ipsos poll released earlier this month."
}