{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK000AF_L.jpg",
  "title": "Zelenskiy speaks of war, Putin makes passing reference in contrasting New Year speeches",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 31, 2023 11:33PM ET",
    "Updated Jan 01, 2024 05:15AM ET"
  ],
  "comments": [
    7,
    [
      [
        "Barry Nickerson",
        "2024-01-02 11:21:55",
        "This war is ludicrous, street fighting with machine guns and tanks in towns, bombing one another's cities and towns, launching missiles at each other, and so on, and then complaining about non-military citizens being killed. Duh!  Zel  and Put should just have a duel between themselves and end this insanity.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Maximus Maximus",
        "2024-01-02 02:03:32",
        "russian defeat is inevitable in this pointless war.. even in the areas they try to hold, partisan war follows.. then they capture one village only to lose another.. losing a generation of their youth and stagnating their ecomomy in the process.. and for what? one evil little mans' ego...",
        "https://www.investing.com/members/204570756"
      ],
      [
        "Ac Tektrader",
        "2024-01-01 22:54:59",
        "Ukraine trying keep their country free from Russian brutality, rape murder and brutal dictatorship... 500k is pretty close to the actual number of dead and wounded Russins. let's hope Ukraine can eliminate another 500k.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Phil Ht",
        "2024-01-01 17:01:24",
        "Ukraine was never gonna win this. 500 plus thousand dead Ukrainian military. For what??",
        "https://www.investing.com/members/208823124"
      ],
      [
        "Otis Grant",
        "2024-01-01 11:01:36",
        "No way puketin would win a legitimate election. He probably doesn't even have an opponent ",
        "https://www.investing.com/members/251132356"
      ],
      [
        "Otis Grant",
        "2024-01-01 11:00:16",
        "Russia will be bled white",
        "https://www.investing.com/members/251132356"
      ],
      [
        "Ken Roth",
        "2024-01-01 04:47:40",
        "What he really mean is I am ready to sacrifice you all to ensure my power and could not care less if you die.",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Daimon van Buren",
        "2024-01-01 05:33:27",
        "Lil' pootler would gladly sacrifice 1 million of his filthy horde just to permanently grow 10cm so he can finally skip those stripper high heels he's wearing.",
        "https://www.investing.com/members/218952456"
      ],
      [
        "Jan Janssen",
        "2024-01-01 11:47:44",
        "Ken, why are you also spamming here?",
        "https://www.investing.com/members/254669944"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/zelenskiy-speaks-of-war-putin-makes-passing-reference-in-contrasting-new-year-speeches-3265022",
  "paragraph": "2/2\n© Reuters. Russian President Vladimir Putin makes his annual New Year address to the nation in Moscow, Russia, in this picture released on January 1, 2024. Sputnik/Gavriil Grigorov/Pool via REUTERS \n2/2\nBy Lidia Kelly (Reuters) - Ukraine President Volodymyr Zelenskiy honoured his people's resilience in times of bloodshed in a long and lyrical New Year speech, while Russian leader Vladimir Putin stressed his country's unity in a short and stern message that made only passing reference to the war. The speeches - traditional Dec. 31 messages in both Russia and Ukraine - came as both countries marked the end of the year with increased air attacks on each other's territories. But neither side can point to any major frontline achievements in 2023. \"The major result of the year, its main achievement: Ukraine has become stronger,\" Zelenskiy said in a televised address interspersed with footage of cities under attack and meetings with leaders of Ukraine's Western allies. Mentioning \"war\" 14 times in his 20-minute message, Zelenskiy also vowed, just like a year ago, that a free Ukraine would prevail. \"No matter how many rockets the enemy launches, no matter how many shellings and attacks - vile, merciless, massive - the enemy carries out in an attempt to break Ukrainians, intimidate, knock Ukraine down, drive it underground, we will still rise,\" he said, dressed in his trademark khaki outfit. Comments by Putin, who faces an election in March, provided a sharp contrast to those of Zelenskiy and also to his own speech last year, when he cast the war as a near-existential fight. This year, he called Russia's soldiers \"our heroes,\" but did not mention Ukraine by name and did not refer to the \"special military operation\" - his term for the war his invasion unleashed in February 2022. \"We have proven more than once that we can solve the most difficult problems and will never retreat, because there is no force that can divide us,\" Putin said in a four-minute speech, dressed in a suit and a red tie against a backdrop of the Kremlin walls. \"We are one country, one big family.\" The war - the deadliest conflict in Europe since World War II - is nearing its second anniversary, with no end in sight. Thousands have been killed, millions of Ukrainians displaced and countless cities turned to rubble. Neither Putin nor Zelenskiy referred to the 1,000-km (600-mile) front line where Kyiv's counteroffensive had little success and where Moscow has been pushing on with its most recent but slow offensive along the eastern flank aiming to take control of more Ukrainian territory. And while Zelenskiy spoke of 6,000 or so air raid alerts in Ukraine in the past year, Putin made no mention of any attacks - not even an attack Russia says Ukraine carried out on Belgorod in recent days killing at least 24 civilians. \nBoth spoke of the strength of their countries and their people, with Putin saying the future common effort will make Russia and its people stronger and Zelenskiy saying the war had already showed the strength of Ukrainians. \"And just like last December 31, today, we say: 'We don't know for sure what the New Year will bring us',\" Zelenskiy said. \"But this year we can add: 'No matter what it brought, we will be stronger'.\"  (Aditional reporting by Oleksandr Kozhukhar in Kyiv and Ronald Popeski in Winnipeg; Writing by Lidia Kelly in Melbourne: Editing by Neil Fullick)"
}