{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0U0J2_L.jpg",
  "title": "Gaza ambulances become mobile clinics as fighting blocks way to hospitals",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 31, 2024 08:38AM ET",
    "Updated Jan 31, 2024 03:42PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/gaza-ambulances-become-mobile-clinics-as-fighting-blocks-way-to-hospitals-3288390",
  "paragraph": "5/5\n© Reuters. Medics speak at a medical point, formed to get better access to frontlines, where they help Palestinian people, amid the ongoing conflict between Israel and Hamas, in Khan Younis in the southern Gaza Strip January 30, 2024. REUTERS/Ibraheem Abu Mustafa\n2/5\nBy Fadi Shana and Ibraheem Abu Mustafa KHAN YOUNIS, Gaza Strip (Reuters) - The ambulance left its usual home base at Nasser Hospital in Khan Younis six days ago with as many bandages, syringes and other basics as its crew could find, and has been operating as a mobile clinic ever since as there is no way back. The hospital, the largest still functioning in southern Gaza, is in an area of the city where intense fighting is taking place between Israeli forces and Hamas militants, making it too dangerous for patients or even ambulances to pass. \"We now function as an ambulance field point in central Khan Younis,\" said paramedic Nassim Hassan, who heads the emergency unit at Nasser Hospital. That means treating patients who arrive by their own means, or rushing to collect wounded people, including in locations very close to the frontlines, and taking them to tents with basic medical facilities. \"Since we left six days ago, we have been working. There's a lot of injuries among the displaced who were in the industrial quarter and some schools. Many of the injured left loaded on carts, tuk-tuks, cars or even on foot.\" Khan Younis saw a huge influx of displaced people during the first weeks of the war between Israel and Hamas, after the Israeli army told civilians to evacuate northern Gaza for their own safety. Since then, the fighting has moved south and into the heart of the city, causing new waves of displacement towards Rafah, on Gaza's southern boundary with Egypt, and making conditions ever harsher and more dangerous for those left behind in Khan Younis. With no immediate prospect of getting new supplies from any hospital storeroom, Hassan was concerned about running out of essentials. \"This is one of the items we are missing,\" he said, holding up a tourniquet during a sort-out of the supplies stored inside the ambulance. \"Maybe we have one or two left.\" In one of the medical tents where Hassan's ambulance has been depositing patients, paramedic Ibrahim Abu al-Kass was doing his best to deal with a wide variety of injuries and illnesses with only basic equipment. \"This medical point was created after the siege of hospitals, including Nasser Hospital and Al-Amal Hospital, and the hard access to them under the current events,\" said Abu al-Kass. \"We deal with cases under very critical conditions,\" he said, adding that some would be hard to handle even in a proper hospital. Hassan and his colleagues from ambulance crews acting as mobile clinics have carried patients into the tent, and dead bodies out. The war started when Hamas militants from Gaza invaded southern Israel on Oct. 7, killing 1,200 people and abducting 240, according to Israel, which responded with an all-out military assault on the densely populated strip. \nIsrael's bombardment and ground invasion have killed at least 26,900 Palestinians and injured more than 65,900, according to Gaza's health ministry. Most of the strip's population has been displaced and hunger and disease are rife. Most hospitals have ceased functioning altogether or are doing so under harrowing conditions, with insufficient medicines and equipment, incessant arrivals of badly wounded patients and large numbers of displaced people sheltering on their premises."
}