{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBP0AA_L.jpg",
  "title": "Sweden edges closer to NATO after vote in Turkish parliamentary commission",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 26, 2023 11:11AM ET",
    "Updated Dec 26, 2023 01:46PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Brad Albright",
        "2023-12-26 16:37:01",
        "Another Putin Strategic failure. 350,000 Russians sent to the meat grinder for Putin's folly.",
        "https://www.investing.com/members/236251128"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/sweden-edges-closer-to-nato-after-vote-in-turkish-parliamentary-commission-3263636",
  "paragraph": "© Reuters. Swedish and NATO flags are seen printed on paper this illustration taken April 13, 2022. REUTERS/Dado Ruvic/Illustration/File Photo\nBy Huseyin Hayatsever ANKARA (Reuters) - The Turkish parliament's foreign affairs commission approved Sweden's NATO membership bid on Tuesday in a key step towards enlarging the Western bloc after 19 months of delays in which Ankara demanded security-related concessions from Stockholm.  The commission, controlled by President Tayyip Erdogan's ruling AK Party, voted to back the bid - which Sweden made last year in the face of Russia's invasion of Ukraine - after some four hours of debate, including talks on other matters. It had postponed a vote on the bid after an earlier debate on Nov. 16.  The next step is a vote in the parliament general assembly, where Erdogan's party also holds a majority. It is also expected to pass there in a vote that could be held within weeks. Erdogan would then sign it into law, concluding a process that has frustrated some of Ankara's allies and tested its Western ties. Commission head Fuat Oktay played down expectations for a speedy vote in the general assembly, telling reporters in parliament that the parliament speaker would decide on timing. \"The decision to submit it to the general assembly has been made now, but this should not be interpreted as (a sign) that it will pass the general assembly with the same speed. There is no such thing,\" Oktay said. Parliament is set for a two-week recess in early January.  Erdogan's AK Party, its nationalist MHP allies, and the main opposition CHP voted in favour of ratification, while the small Islamist Felicity party and right nationalist Iyi party voted against it. In a statement following the commission's approval, Swedish Foreign Minister Tobias Billstrom said Sweden welcomed the move and looked forward to joining NATO.  Boris Ruge, NATO Assistant Secretary General for Political Affairs and Security Policy, said on social messaging platform X that the commission's approval was \"excellent news\". Oguz Kaan Salici, a lawmaker from the CHP and member of the commission, told Reuters that his party had asked for an explanation on what had changed since the Nov. 16 commission meeting, adding he expected all parties to take a similar stance in the general assembly. \"We questioned what changed from the last meeting to this meeting. As the main opposition party, we asked for this to be explained to us. They briefed us on the steps Sweden has taken, Turkey's foreign policy priorities, and openly referred to the talks between President Erdogan and (U.S. President Joe) Biden,\" Salici said. TURKISH OBJECTIONS Erdogan raised objections in May last year to both Swedish and Finnish requests to join the alliance over what he said was their protection of those Turkey deems terrorists and over their defence trade embargoes.  Turkey ratified Finland's bid in April, but kept Sweden waiting until it took more steps to crack down on local members of the Kurdistan Workers' Party (PKK), which the European Union and United States also list as a terrorist group.  In response, Stockholm introduced a new anti-terrorism bill that makes being a member of a terrorist organisation illegal, saying that it had upheld its part of a deal signed last year.  Sweden and NATO members Finland, Canada and the Netherlands also took steps to relax Turkey arms-export policies.  While NATO member Hungary has also not ratified Sweden's membership, Turkey is seen as the main roadblock to adding the Scandinavian nation to the military alliance and bolstering its defences in the Baltic Sea region.  Erdogan sent Sweden's bid to parliament in October, but has also linked its ultimate ratification with U.S. approval of sales of F-16 fighter jets to Turkey. After a call with Biden this month, he said Washington was eyeing the ratification to move on the request. \nThe White House backs the sale, though there is no clear timeframe for the U.S. Congress to approve it and Turkey faces some congressional opposition over delaying NATO enlargement and over its human rights record. Turkey's tough diplomacy over the last 18 months irked some alliance members amid the war in Ukraine. Unlike its allies, Ankara maintains good relations with Moscow as well as Kyiv, opposing Russia's invasion but also the Western sanctions on Russia."
}