{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0H0QL_L.jpg",
  "title": "Polish top court rejects government plan to overhaul public media",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 18, 2024 11:38AM ET",
    "Updated Jan 18, 2024 11:51AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/polish-top-court-rejects-government-plan-to-overhaul-public-media-3277586",
  "paragraph": "© Reuters. Police stand outside the Polish public television TVP building as protesters and Law and Justice politicians gather after Poland's new government took a public news channel off the air and dismissed executives from state media to restore \"impartiality,\" t\nBy Anna Wlodarczak-Semczuk WARSAW (Reuters) - A top Polish court rejected as illegal on Thursday plans to liquidate the country's state radio, television and news agency which the new pro-EU coalition government said had become propaganda outlets for the previous right-wing administration. The Constitutional Tribunal's ruling underlines the challenges Prime Minister Donald Tusk's coalition faces in rolling back reforms introduced by the previous Law and Justice (PiS) cabinet. Poland's culture ministry swiftly branded the ruling invalid due to what it said were irregularities in the hiring of the Tribunal's judges, all of them appointed under PiS, exacerbating a conflict between the Tusk government and supporters and allies of the former ruling party, who include President Andrzej Duda. The ministry also evoked past resolutions by the European Court of Human Rights saying that the Tribunal as currently set up was \"not an independent and impartial\" court and that its rulings therefore \"do not have universally binding force\". Its stance further fuels the legal confusion and it was not immediately clear how the situation might be resolved. In its ruling, the Tribunal said any decisions on public broadcasting companies should be based on the Broadcasting Act and not on the Code of Commercial Companies, thus making the minister's decisions invalid.  \"The right to dismiss members of the management (of state media outlets) lies solely with the National Media Council,\" it added, referring to an institution created under PiS and manned by several of its current or former lawmakers. ACCUSATIONS Tusk's government accuses PiS of packing courts, regulatory bodies and other institutions with its supporters during its eight-year rule, when it often drew criticism from the European Union over rule of law concerns. The EU froze billions of euros in funds earmarked for Poland and Tusk has vowed to reverse the PiS government's judicial reforms in order to unblock that cash. PiS argued at the time that it had the right to overhaul national institutions in line with its democratic mandate and it accused the EU of exceeding its powers. While many lawyers share doubts about the validity of verdicts issued by the Tribunal in its current lineup, however, some such as the Helsinki Foundation for Human Rights have also questioned the legality of the ministry's moves on public media.  Poland's culture minister announced in December he was moving to liquidate the state television, radio and news agency after President Duda vetoed the new government's spending plans for public media financing. Polish state TV, radio and the PAP news agency are still functioning but with new programmes and journalists. The government has signalled that after liquidation it wants to recreate them as new legal entities under fresh management. The clash over the government's right to liquidate the public media companies is just one of several between the current and previous administrations. \nTwo former PiS ministers went on hunger strike this month after being jailed for abuse of power in previous roles. Former interior minister Mariusz Kaminski described himself as a \"political prisoner\". Tusk's government and its supporters say this is nonsense and say they are determined to bring Poland back into line with EU democratic standards and unblock the frozen funds after years of conflict between Warsaw and Brussels."
}