{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBL0GY_L.jpg",
  "title": "UN Security Council acts to boost aid to Gaza after US abstains",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 22, 2023 12:10PM ET",
    "Updated Dec 22, 2023 04:28PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/un-security-council-acts-to-boost-aid-to-gaza-after-us-abstains-3262513",
  "paragraph": "© Reuters. Destroyed buildings lie in ruin in Gaza, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, as seen from Israel, December 22, 2023. REUTERS/Amir Cohen\nBy Michelle Nichols UNITED NATIONS (Reuters) - The United Nations Security Council on Friday adopted a resolution to boost humanitarian aid to the Gaza Strip that stopped short of a call for a ceasefire after a week of vote delays and intense negotiations to avoid a United States veto.  The resolution \"calls for urgent steps to immediately allow safe, unhindered, and expanded humanitarian access and to create the conditions for a sustainable cessation of hostilities.\" Amid global outrage over a rising Gaza death toll in 11 weeks of war between Israel and Hamas and a worsening humanitarian crisis in the Palestinian enclave, the U.S. abstained to allow the 15-member council to adopt a resolution drafted by the United Arab Emirates.  The remaining council members voted for the resolution except for Russia which also abstained, having favored an initial draft that called for \"an urgent and sustainable cessation of hostilities\" to allow aid access. The U.S. and Israel oppose a ceasefire, believing it would only benefit Hamas. Washington instead supports pauses in fighting to protect civilians and free hostages taken by Hamas. \"We believe that the resolution begins to unblock life saving aid, whose denial has condemned more than half a million people in Gaza to famine,\" UAE U.N. Ambassador Lana Nusseibeh told the council after the vote.  Following high-level negotiations to win over Washington, the resolution no longer dilutes Israel's control over all aid deliveries to 2.3 million people in Gaza. Israel monitors the limited aid deliveries to Gaza via the Rafah crossing from Egypt and the Israeli-controlled Kerem Shalom crossing.  But a weakening of language on a cessation of hostilities frustrated several council members - including veto power Russia - and Arab and Organisation of Islamic Cooperation states, some of which, diplomats said, view it as approval for Israel to further act against Hamas for a deadly Oct. 7 attack. 'GLIMMER OF HOPE'  U.S. Ambassador to the U.N. Linda Thomas-Greenfield described the resolution as \"a glimmer of hope amongst a sea of unimaginable suffering,\" noting that it was the first time the council had referenced a cessation of hostilities. \"We know so much, so much more needs to be done to address this humanitarian crisis and to lay the groundwork for a lasting peace.\" Russia proposed the draft be amended to revert to the initial text calling for \"an urgent and sustainable cessation of hostilities.\" The amendment was vetoed by the United States. It received 10 votes in favor, while four members abstained.  Addressing the council after the resolution vote, Russia's U.N. Ambassador Vassily Nebenzia accused the United States of \"forcing into the text an essential license for Israel to kill Palestinian civilians in Gaza under the pretext of 'creating conditions for a cessation of hostilities'.\" Earlier this month the 193-member U.N. General Assembly demanded a humanitarian ceasefire, with 153 states voting in favor of the move that had been vetoed by the United States in the Security Council days earlier. \"This resolution is a step in the right direction, it must be implemented, and must be accompanied by massive pressure for an immediate ceasefire,\" Palestinian U.N. envoy Riyad Mansour told the council.  Israel's deputy U.N. Ambassador Jonathan Miller told the council that any enhancement of U.N. aid monitoring \"cannot be done at the expense of Israel's security inspection.\" \"The only roadblock for aid entry is the U.N.'s ability to accept them,\" Miller told the council, adding that Israel's security inspections of aid would not change.  U.N. Secretary-General Antonio Guterres told reporters on Friday that the way Israel was conducting its military operation in the Gaza Strip was \"creating massive obstacles to the distribution of humanitarian aid\" inside the coastal enclave.  AID MONITORING  Last month the United States abstained to allow the Security Council to call for urgent and extended humanitarian pauses in fighting for a \"sufficient number of days\" to allow aid access. The move came after four unsuccessful attempts to take action. Washington traditionally shields its ally Israel from U.N. action and has already twice vetoed Security Council action since an Oct. 7 attack by Hamas militants in which Israel says 1,200 people were killed and 240 people taken hostage. Israel has retaliated against Hamas by bombarding Gaza from the air, imposing a siege and launching a ground offensive. Some 20,000 Palestinians have been killed, according to health officials in Hamas-ruled Gaza. Most people in Gaza have been driven from their homes and U.N. officials have warned of a humanitarian catastrophe. The World Food Programme says half of Gaza's population is starving and only 10% of the food required has entered Gaza since Oct. 7.  A key sticking point during negotiations on the resolution adopted on Friday had been an initial proposal for U.N. Secretary-General Antonio Guterres to establish a mechanism in Gaza to monitor aid from countries not party to the war. \nA toned-down compromise was reached to instead ask Guterres to appoint a senior humanitarian and reconstruction coordinator to establish a U.N. mechanism for accelerating aid to Gaza through states that are not party to the conflict. The coordinator would also have responsibility \"for facilitating, coordinating, monitoring, and verifying in Gaza, as appropriate, the humanitarian nature\" of all the aid."
}