{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "North Korea fires artillery at sea against South military 'gangsters'",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 05, 2024 02:15AM ET",
    "Updated Jan 05, 2024 08:58AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/north-korea-fires-200-rounds-at-sea-border-south-islanders-take-shelter-3267773",
  "paragraph": "By Ju-min Park and Soo-hyang Choi SEOUL (Reuters) - North Korea fired more than 200 artillery rounds on Friday near a disputed maritime border with South Korea in another escalation of tension between the rivals and prompting the South to take \"corresponding\" action with live fire drills. North Korea later said it conducted firing drills as a \"natural response\" to military actions by South Korea's \"military gangsters\" in recent days. It also threatened an \"unprecedented strong response\" if Seoul continued to make provocative moves. The exchange led residents of two remote South Korean islands on the western maritime frontier to evacuate to bomb shelters at the instruction of the South's military, before it fired live rounds towards the disputed Northern Limit Line (NLL) border. The firing by North Korea caused no civilian or military damage in the South, South Korea's military said. \"This is an act of provocation that escalates tension and threatens peace on the Korean peninsula,\" South Korea's Defence Minister Shin Won-sik said as he supervised the firing drills. The North Korean artillery shells all landed on the northern side of the sea border, a South Korean military spokesman Lee Sung-joon said in a news briefing, adding that the South Korean military has been monitoring the North's moves along its shores with the cooperation of the U.S. military. South Korea's Defence Ministry said Marine brigades based on the Yeonpyeong and Baengnyeong islands fired at sea to the south of the NLL border demonstrating \"overwhelming operational response.\" The South Korean drills involved mechanised artillery and tanks. North Korea's Army General Staff said its defensive coastal units fired 192 rounds as part of its drills \"as natural response by our military against military actions by South Korea's military gangsters\", the official KCNA news agency reported. The drills had no impact on South Korean islands near the maritime border as claimed by the South, the statement said, calling the assertion \"an attempt to mislead public opinion.\" DISPUTED WATERS China, which is North Korea's main political ally, urged restraint and called on the two sides to resume dialogue. Yeonpyeong is home to just over 2,000 residents and troops stationed there, about 120 km (75 miles) west of Seoul and accessed by ferries that take more than 2-1/2 hours. Leif-Eric Easley, professor of international studies at Ewha University in Seoul, said it was not unusual for North Korea to fire artillery in the area during winter drills.  \"What's different this year is ... Kim Jong Un has publicly disavowed reconciliation and unification with the South,\" he said. In remarks to a major party meeting last week, the North Korean leader said unification with the South was not possible and Pyongyang was fundamentally changing its policy towards the South, which it now sees as an enemy state. The waters near the disputed NLL have been the site of several deadly clashes between the North and South Korea including battles involving warships and the sinking of a South Korean corvette in 2010 by what is believed to be a North Korean torpedo, killing 46 sailors. In November 2010, North Korean artillery fired several dozen rounds at Yeonpyeong island, killing two soldiers and two civilians, in one of the heaviest attacks on its neighbour since the Korean War ended in 1953. North Korea said at the time it was provoked into taking action by South Korean live-fire drills that dropped shells into its territorial waters. Drawn up at the end of the Korean War as an unofficial border, Pyongyang did not dispute the NLL until in the 1970s, when it began violating the line and arguing for a border further to the south. Residents of Baengnyeong island which lies far to the west of Yeonpyeong and also near the sea border, were also told to seek shelter on Friday. Its population is about 4,900.  North Korea has warned in recent days that the situation on the Korean peninsula is spiralling towards war because of dangerous moves by the U.S. and South Korean militaries. Both Koreas have vowed crushing military responses if attacked. In November, the North declared an agreement signed in 2018 aimed at de-escalating tension and preventing accidental outbreak of fighting was no longer valid, after the South said it would resume drills near the border. The two sides had agreed to cease military drills near the border including the sea borders off the west and east coasts."
}