{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK030RE_L.jpg",
  "title": "Oscar Pistorius freed from jail 11 years after murdering girlfriend",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 05, 2024 01:49AM ET",
    "Updated Jan 05, 2024 10:21AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/blade-runner-pistorius-released-on-parole-11-years-after-murdering-girlfriend-3267771",
  "paragraph": "2/2\n© Reuters. FILE PHOTO: Oscar Pistorius enters the dock before court proceedings at the Pretoria Magistrates court June 4, 2013. REUTERS/Siphiwe Sibeko/File Photo\n2/2\nBy Bhargav Acharya and Siyabonga Sishi PRETORIA (Reuters) -South African former Paralympic star Oscar Pistorius was released on parole on Friday, nearly 11 years after murdering his girlfriend Reeva Steenkamp in a crime that shocked a nation inured to violence against women. Pistorius - dubbed \"Blade Runner\" for his carbon-fibre prosthetic legs - shot 29-year-old model Steenkamp dead through a locked bathroom door on Valentine's Day in 2013. He has repeatedly said he mistook Steenkamp for an intruder when he fired four shots into the bathroom at his Pretoria home, and he launched multiple appeals against his conviction on that basis. In a statement shared by the Steenkamp family lawyer on Friday, Reeva's mother June said: \"There can never be justice if your loved one is never coming back, and no amount of time served will bring Reeva back.\" \"We, who remain behind, are the ones serving a life sentence,\" June Steenkamp said, adding her only desire was to be allowed to live in peace after Pistorius' release on parole. Pistorius, now 37, spent about eight and a half years in jail as well as seven months under home arrest before he was sentenced for murder. A parole board in November decided he could be freed after completing more than half his sentence. South Africa's correctional services department said in a short statement that Pistorius had become a \"parolee, effectively from 5 January 2024\" and was now at home, without specifying where that was. A monitoring official will keep an eye on him until his sentence expires in December 2029, whom Pistorius will have to inform if he seeks job opportunities or moves to a new address. GENDER-BASED VIOLENCE Pistorius will also be required to continue therapy on anger management and attend sessions on gender-based violence as part of his parole conditions, the Steenkamp family has said. June Steenkamp said the conditions imposed by the parole board had affirmed her belief in the South African justice system as they send out a clear message that gender-based violence is taken seriously. But a local women's rights organisation said the Pistorius case showed there was a lack of accountability for perpetrators and inadequate justice for victims of violence in the country. \"We are talking about somebody's life that's been taken... The fact that someone can walk out free eight years later, it tells us that it's not that big of a deal,\" spokesperson for Women For Change, Bulelwa Adonis, told Reuters. Adonis said an average of 12 women are murdered in South Africa every day. While some South Africans see Pistorius' punishment as too lenient, others feel he has served his time. \"Let the man go home, he's done his time, and remember, it's also about being reintegrated back into society,\" 42-year-old Pretoria resident, Kefentse Botolo, told Reuters. Local media expect Pistorius to live at the home of his uncle Arnold in a wealthy Pretoria suburb, where a crowd of reporters gathered in front of the gate on Friday. A spokesperson for the department of correctional services said Pistorius had been dropped off in the morning \"at an entrance unfamiliar to everyone\" but did not confirm where. His lawyer did not immediately respond to messages or phone calls seeking comment. FROM PARALYMPIC STAR TO CONVICTED MURDERER Pistorius was once the darling of the sports world, and a pioneering voice for disabled athletes, for whom he campaigned to be allowed to compete with able-bodied participants at major sports events.  In August 2012, months before shooting his girlfriend, Pistorius became the first double amputee to compete at the London Olympics, where he made it to the 400 metres semi-finals. He won two gold medals at the Paralympics. He was first jailed for five years in October 2014 for culpable homicide by a high court. After his prosecutors appealed that ruling, the Supreme Court of Appeal found him guilty of murder in December 2015. But he only got six years when he was sentenced in July 2016, despite prosecutors arguing for a minimum sentence of 15 years. Then in November 2017 the Supreme Court of Appeal more than doubled his sentence to 13 years and five months, describing his earlier term as \"shockingly lenient\". \nPistorius met Reeva's father Barry Steenkamp in 2022 in a \"victim-offender dialogue\", an integral part of South Africa's restorative justice system.  Based partly on how indigenous cultures handled crime long before Europeans colonised South Africa, restorative justice aims to find closure for affected parties in a crime, instead of merely punishing perpetrators."
}