{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0200B_L.jpg",
  "title": "Record half-million migrants crossed Latin America's dangerous Darien Gap in 2023",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 02, 2024 07:31PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/record-halfmillion-migrants-crossed-latin-americas-dangerous-darien-gap-in-2023-3265811",
  "paragraph": "2/2\n© Reuters. FILE PHOTO: Migrants heading to the U.S. wait at the Migrants Reception Station in Lajas Blancas, Darien province, Panama, September 23, 2023. REUTERS/Aris Martinez/File Photo\n2/2\nPANAMA CITY (Reuters) - A record 520,000 migrants crossed the treacherous jungle between Colombia and Panama known as the Darien Gap in 2023, more than double the number reported the year before, according to government figures seen by Reuters on Tuesday. The migrants who made the journey that marks the start of the dangerous trek north from South America to the United States last year were mostly from Venezuela, Ecuador, Haiti and China, according to the numbers from Panama's migration agency. Around a quarter of the migrants were minors, said Samira Gozaine, who heads the agency. \"This is a national security problem,\" she told reporters at a government event. \"Unfortunately, we do not have a quick solution to solve it.\" Since Panamanian President Laurentino Cortizo took office in 2019, the number of migrants transiting the Darien has skyrocketed, leading authorities to call for international aid. The situation has been driven, in part, by a sharp increase in Venezuelans fleeing the protracted economic and social collapse of the once-prosperous oil nation. In recent years, more than seven million Venezuelans have fled their country, according to UN figures. \nThose who cross the Darien risk violence, sexual abuse, human trafficking and disease. In September, Reuters reported that African migrants heading to the United States are flying to Nicaragua to bypass the dangers of the Darien Gap. The number of migrants from China making the risky trek has jumped, partly as COVID lockdowns there slowed the economy and as it became more difficult for Chinese nationals to obtain U.S. visas."
}