{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBS05B_L.jpg",
  "title": "Russia's biggest air attack of war kills 31 in Ukraine, officials say",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 29, 2023 03:25AM ET",
    "Updated Dec 29, 2023 07:08PM ET"
  ],
  "comments": [
    5,
    [
      [
        "Ken Roth",
        "2023-12-30 08:28:23",
        "Republican party should be ashamed for stopping military assistance to our ally Ukraine….",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Mark Jannetty",
        "2023-12-30 11:44:59",
        "let the EU fund Bidens bank account ",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Brad Albright",
        "2023-12-30 15:35:27",
        "It is well known that America's adversaries attempt to sow discord among Americans with misinformation. They count on a large segment of the population being ignorant enough to be fooled.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Mantas Bepavardis",
        "2023-12-30 07:12:27",
        "russia is thevmost degenerated nation in the world",
        "https://www.investing.com/members/223155985"
      ],
      [
        "Maximus Maximus",
        "2023-12-30 00:30:09",
        "putin and netanyahoo = evil genocidal maniacs..",
        "https://www.investing.com/members/204570756"
      ],
      [
        "Barry Nickerson",
        "2023-12-30 11:28:27",
        "Please amuse us with a definition of Hamas.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Brad Albright",
        "2023-12-29 20:21:04",
        "Terrorism, plain and simple.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Barry Nickerson",
        "2023-12-29 12:17:22",
        "Approximately 110 missiles were fired, most of which were shot down,....Is this a war of attrition??",
        "https://www.investing.com/members/249373719"
      ],
      [
        "XAVIER ADOLF NORONHA",
        "2023-12-29 17:59:08",
        "Plenty of reporting lies in the offing..!",
        "https://www.investing.com/members/210191113"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/russia-launches-massive-air-attack-on-ukraine-at-least-10-dead--kyiv-3264585",
  "paragraph": "2/2\n© Reuters. A rescuer works at the site damaged by the debris of a downed drone, amid Russia's attack on Ukraine, in the location given as Odesa, Ukraine, released December 29, 2023. State Emergency Service Of Ukraine/Handout via REUTERS \n2/2\nBy Ivan Lyubsyh-Kirdey, Yuliia Dysa and Tom Balmforth KYIV (Reuters) -Russia unleashed its biggest air attack of the war on Ukraine on Friday, killing 31 civilians, wounding more than 160 others and hitting cities and infrastructure across the country, officials said. NATO member Poland said a Russian missile appeared to have flown into its airspace for some 40 km before returning to Ukraine under three minutes later.  But the Russian charge d'affaires, summoned to the Polish Foreign Ministry, said Warsaw had provided no evidence of a missile entering its airspace. The Ukrainian foreign ministry said the assault showed there should be \"no talk of a truce\" with the Kremlin at a time when uncertainty hangs over the future of Western support for Kyiv.  \"Today, millions of Ukrainians awoke to the loud sound of explosions. I wish those sounds of explosions in Ukraine could be heard all around the world,\" Foreign Minister Dmytro Kuleba said, urging allies to keep sending long-term aid.  At a hastily-convened U.N. Security Council session, most council members, including the United States, France and Britain, condemned the attacks. Russia's UN ambassador Vasily Nebenzya said Moscow had attacked only military infrastructure and that Ukraine's air defense systems were responsible for civilian casualties. In the capital Kyiv at least nine people were killed and 30 wounded after a warehouse, residential buildings and another uninhabited property were hit, officials said.  Kyiv resident Mariia told Reuters she had been awoken by a \"horrible sound\" and taken shelter in her bathroom. \"It was so frightening. A missile was flying and everything was buzzing, whirring. I didn't know what to do. I wanted to run down to the shelter,\" she said. \"As I went inside the bathroom, the mirror flew off (the wall).\"  The air force said it shot down 87 cruise missiles and 27 drones of a total 158 aerial \"targets\" fired by Russia. Defence Minister Rustem Umerov said it was the \"most massive air attack of this war\" and involved 18 strategic bombers.  Army chief General Valeriy Zaluzhnyi said infrastructure and industrial and military facilities had been targeted.  \"Russia attacked with everything it has in its arsenal... Approximately 110 missiles were fired, most of which were shot down,\" President Volodymyr Zelenskiy said on Telegram messenger.  ANTICIPATING MORE ATTACKS ON ENERGY SYSTEM Ukraine has been warning for weeks that Russia could be stockpiling missiles to launch major air attacks on the energy system like it did last winter.  \"It is obvious that with the stocks of missiles that the aggressor state has, it can and will continue such attacks,\" Umerov said.  In a roundup of military activities this week, the Russian defence ministry said its forces had performed one \"massive\" strike on Ukraine since Dec. 23, but provided no specifics.  The interior ministry put the death toll at 30, but statements from the regions indicated at least 31 people had been killed.  As rescuers picked through the rubble of a strike that hit a house in the southeastern city of Zaporizhzhia, Viktor Chuhunov, 73, told Reuters he had been at home when he heard an explosion.  \"A woman died here. I don't know whether her son was at home, maybe he was at work,\" he said of the ruined house.  Eight people were killed and 13 wounded in the southeastern Zaporizhzhia region, the governor said. Civilian infrastructure facilities were also struck, he said.  Six people were killed in the central region of Dnipropetrovsk where missiles struck a shopping centre, a house and a six-storey residential building, the governor said.  The attack also caused a fire in a maternity ward, he said.  Four people were killed in the Black Sea port of Odesa and at least 22 wounded, including two children, the regional governor said, reporting hits on residential buildings.  \nOne person was killed in a residential building in the city of Lviv and 30 were wounded, the regional governor said. Three schools and a kindergarten were damaged, the mayor said.  In the northeastern city of Kharkiv, a missile strike damaged a warehouse, an industrial facility, a medical facility and a transport depot, the regional governor said. Three people were killed and 13 wounded."
}