{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0I0G0_L.jpg",
  "title": "US launches disaster relief reforms as climate-driven events rise",
  "category": "General",
  "publisher": "Reuters",
  "date": "Published Jan 19, 2024 08:19AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/general/us-launches-disaster-relief-reforms-as-climatedriven-events-rise-3278300",
  "paragraph": "© Reuters. FILE PHOTO: U.S. President Joe Biden stands next to a fallen tree as he tours Hurricane Idalia storm destruction in a neighborhood of Live Oak, Florida, U.S., September 2, 2023. REUTERS/Evelyn Hockstein/File Photo\nWASHINGTON (Reuters) - U.S. President Joe Biden's administration on Friday said it was launching the most major reforms to disaster management relief in two decades as climate change-driven extreme weather events, such as floods and fires, increase. The Federal Emergency Management Agency (FEMA) reforms of its federal assistance policies and expanded benefits for disaster survivors aim to cut red tape that victims have said makes it difficult for them to access resources after a disaster. “We are on the verge of making the most significant update to survivor assistance in the last 20 years to reach more survivors and deliver assistance faster,” said FEMA Administrator Deanne Criswell in a statement. FEMA said the reforms follow feedback from disaster survivors. They are designed to make the agency better able to respond to the threats caused by climate change, which last year caused more \"billion-dollar\" floods, fires and other disasters than ever before. In 2023, the U.S. experienced a wildfire on Maui, the nation's deadliest in more than a century, severe floods in California, two tornado outbreaks in central states, a winter storm in the northeast, and Hurricane Idalia. Among the new measures FEMA announced are a change to its cash relief program that will provide a payment of $750 to households for all disasters for shelter and evacuation to supplement other disaster aid. Previously, the payment was assessed on a disaster-to-disaster basis. It also created a new \"displacement assistance\" benefit to give eligible survivors who cannot return to their homes up-front funds to help until they are able to secure housing. \nFEMA will also make changes to help survivors who are under-insured by removing a requirement that they apply for a U.S. Small Business Administration (SBA) loan before being considered for certain types of financial assistance, and make it easier to access repair loans for homes that were previously ineligible due to pre-existing leaks and damage.  FEMA said the changes will take effect for new disasters declared on, or after March 22, 2024."
}