{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0P0C5_L.jpg",
  "title": "Biden warns against rise of antisemitism, efforts to downplay Hamas attacks",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 26, 2024 06:08AM ET",
    "Updated Jan 26, 2024 12:52PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/biden-warns-against-rise-of-antisemitism-efforts-to-downplay-hamas-attacks-3283884",
  "paragraph": "© Reuters. U.S. President Joe Biden delivers remarks on his administration’s infrastructure strategy inside the Earth Rider Brewery in Superior, Wisconsin, U.S., January 25, 2024. REUTERS/Tom Brenner\nBy Andrea Shalal WASHINGTON (Reuters) - U.S. President Joe Biden on Friday marked International Holocaust Remembrance Day, warning against what he called an alarming rise in antisemitism after the Oct. 7 Hamas attacks on Israel and efforts to minimize what happened that day. Biden, who launched the first U.S. national strategy to counter antisemitism in May 2023, said the need to remember the Holocaust and the \"scourge of antisemitism\" was more pressing than ever after the Hamas attack that killed 1,200 people, the biggest loss of life on a single day since Israel's founding in 1948. \"In the aftermath of Hamas’s vicious massacre, we have witnessed an alarming rise of despicable antisemitism at home and abroad that has surfaced painful scars from millennia of hate and genocide of Jewish people. It is unacceptable,\" Biden said in a statement. \"We cannot remember all that Jewish survivors of the Holocaust experienced and then stand silently by when Jews are attacked and targeted again today,\" he said, calling for forceful pushback against Holocaust denialism and \"efforts to minimize the horrors that Hamas perpetrated on October 7, especially its appalling and unforgivable use of rape and sexual violence to terrorize victims.\" U.N. experts this month demanded accountability for sexual violence against Israeli civilians during the Oct. 7 attacks, including allegations of rape, mutilations and gunshots to genital areas. Hamas denies the abuses. U.S. Senate Majority Leader Chuck Schumer in November said the rise in antisemitism since the start of the Israel-Hamas war was a \"five-alarm fire\" that threatened the safety of Jews worldwide and the future of Israel. Biden said his administration was continuing to condemn and fight antisemitism, while working to ensure the release of the remaining hostages held by Hamas, which kidnapped about 240 people on Oct. 7. He urged Americans to do their part to combat hate in all its forms. \"It is our shared moral responsibility to stand up to antisemitism and hate-fueled violence at home and abroad and to make real the promise of 'Never Again,'\" Biden said. Biden, a devout Catholic who was born in the middle of World War Two, said he had taken his own children and grandchildren to a German concentration camp to show them \"the depth of this antisemitic evil and the complicity of silence or indifference.\" Rights groups have reported sharp increases in both antisemitic and anti-Arab and anti-Muslim incidents since Oct. 7.  The White House in November said it is also developing a national strategy to combat Islamophobia.  \nThe effort has faced skepticism from some Muslim-Americans who are furious about Biden's continued political and financial support for Israel's assault on Gaza, which has killed over 25,000 Palestinians, and his failure to call for a ceasefire. The Biden administration has rejected calls for a ceasefirebut is urging Israel and Hamas to pause the fighting to allow the release of hostages and humanitarian aid to enter Gaza."
}