{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "US aims at Iran links with sanctions on Hamas financial networks, Iraqi airline",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 22, 2024 12:40PM ET",
    "Updated Jan 22, 2024 03:36PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-puts-sanctions-on-hamaslinked-financial-networks-others-3279925",
  "paragraph": "By Arshad Mohammed, Simon Lewis and Timour Azhari WASHINGTON (Reuters) -The United States imposed sanctions on Monday on Hamas-affiliated financial exchanges in Gaza, an Iraqi airline and backers of Iranian-linked militias in Iraq, accusing all of working with Iran's elite military and intelligence unit. The U.S. Treasury said it had imposed sanctions on Hamas-linked financial networks in Gaza, particularly financial facilitators instrumental in transferring funds, including cryptocurrency, from Iran's Islamic Revolutionary Guard Corps Quds Force (IRGC-QF) to Hamas, which carried out the Oct. 7 attacks on Israel, and to Palestinian Islamic Jihad (PIJ), another Palestinian militant group. The sanctions were coordinated with Australia and Britain, the Treasury said. Britain and Washington both targeted Gaza-based money changer Zuheir Shamlakh, whom they accused of facilitating transfers worth tens of millions of dollars from Iran to Hamas. In sanctioning these and other targets, the U.S. government is trying to crack down on a host of Iranian-backed proxies that have used Gaza, Iraq, Lebanon, Syria and Yemen to carry out attacks on Israeli, U.S. and other interests. \"Sanctions are just one of the many levers at our disposal when it comes to holding Iran and some of its proxies accountable,\" State Department deputy spokesperson Vedant Patel told a news briefing.  The moves would have \"tangible impacts\" on groups Washington blames for destabilizing the Middle East, Patel said. For example, he said, the U.S. hoped blacklisting Iraq's Fly Baghdad airline and its chief executive would \"disrupt\" the airline's alleged role in carrying supplies and personnel into Syria for the Quds Force.  Fly Baghdad denounced the sanctions, saying they were \"not based on any material or moral evidence.\" \"It is clear that the decision was based on misleading and unreal information that cannot stand up to the law,\" the airline said in a statement. The Treasury also sanctioned three leaders and supporters of Kataeb Hezbollah, one of the Quds Force's main Iran-linked militias in Iraq. As a general rule, U.S. individuals or companies are banned from transactions involving the property of those designated. Those who carry out certain transactions with sanctioned entities risk being sanctioned themselves or facing other \"enforcement action,\" the Treasury said."
}