{
  "image": "https://i-invdn-com.investing.com/news/moved_LYNXMPEJ6D0MS_L.jpg",
  "title": "Ford, Snap report; ESPN, Fox, Warner's sports streaming JV - what's moving markets",
  "category": "Economy",
  "publisher": "Reuters",
  "date": "Published Feb 07, 2024 05:18AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/economy/ford-snap-report-espn-fox-warners-sports-streaming-jv--whats-moving-markets-3294960",
  "paragraph": "Investing.com -- Ford shares climb after the carmaker outlines plans to deliver a supplemental dividend to shareholders, while Snap's stock tumbles on weaker-than-anticipated fourth-quarter revenue at the social media firm. ESPN, Fox, and Warner Bros. Discovery unveil a sweeping joint venture to create a new sports streaming platform.  New York Community Bancorp  's overall credit rating is cut to \"junk\" status by Moody's, sending shares to their lowest point since 1997.\n1. Futures subdued\nU.S. stock futures were muted on Wednesday, as investors weighed an ongoing slew of corporate earnings and fresh interest rate commentary from Federal Reserve policymakers.\nBy 05:06 ET (10:06 GMT), the Dow futures contract and S&P 500 futures were mostly unchanged, while Nasdaq 100 futures had inched up by 13 points or 0.1%.\nThe main averages on Wall Street ended Tuesday slightly higher after spending much of the session in the red. The benchmark S&P 500 added 0.2% following a surge in shares in GE HealthCare Technology (NASDAQ:GEHC), which posted stronger-than-expected fourth-quarter earnings. The S&P 500 healthcare sector, an index tracking the industry, subsequently jumped to a new all-time high.\nDespite facing pressure from a dip in chip stocks -- particularly California-based Rambus (NASDAQ:RMBS) -- the tech-heavy Nasdaq Composite gained 0.1%. The Dow Jones Industrial Average advanced by 0.4%, with hopes for solid air travel demand lifting airlines.\nDampening sentiment were comments from Cleveland Fed President Loretta Mester and Minneapolis Fed President Neel Kashkari. Mester said an uncertain inflation outlook had clouded the timing for potential rate cuts, while Kashkari argued that the central bank's fight to tame elevated inflation is \"not done yet.\" Both echoed a similar recent stance taken by Fed Chair Jerome Powell that has all but dashed hopes for an imminent reduction in borrowing costs.\n2. Ford drives higher; Snap slumps\nShares in Ford Motor (NYSE:F) climbed in premarket U.S. trading on Wednesday after the automotive giant unveiled a revenue outlook that topped analysts' expectations and vowed to return more cash to its stakeholders.\nMichigan-based Ford guided for annual pre-tax income of $10 billion to $20 billion, above Bloomberg consensus estimates of $9.5 billion. The company added that it would deliver a supplemental dividend of $0.18 per share for the first quarter, along with a regular pay-out of $0.15.\nBut executives told analysts that they were slowing investments on next-generation electric vehicles due to price changes around non-combustion cars in the past year.\nElsewhere, Snap (NYSE:SNAP) shares plummeted by more than 30% after the social media group reported quarterly revenue of $1.36B, missing projections.\nUnlike bigger rivals such as Facebook-owner Meta Platforms (NASDAQ:META), the Santa Monica-headquartered business has struggled to overcome a downturn in digital advertising spending during a time of tighter financial conditions. Snap, which detailed plans to lay off 10% of its workforce earlier this week, flagged that its operating environment has been \"challenging.\"\nA parade of company results marches on later today, highlighted by big names like media titan Walt  Disney  (NYSE:DIS), ride-sharing firm Uber Technologies (NYSE:UBER), and chip designer  Arm  Holdings (NASDAQ:ARM).\n3. ESPN, Fox, Warner Bros. Discovery announce joint sports streaming venture\nWalt Disney's ESPN, Warner Bros Discovery (NASDAQ:WBD) and Fox have said they plan to team up to launch a new streaming service that will offer lucrative live sporting events.\nThe as-yet unnamed joint venture will bundle each group's sports networks, certain direct-to-consumer sports services and sports rights, according to a statement from the companies.\nThey said that the platform aims to provide a \"new and differentiated experience,\" particularly to sports fans who are ditching pay-television for streaming options. The businesses noted that each one would own an equal one-third share of the joint venture, adding that independent management would oversee the service. No pricing was unveiled.\nCord-cutting and weakness in pay-TV demand has increasingly persuaded media groups to consider moving their valuable sports portfolios away from traditional -- and expensive -- cable packages. \n\"This new product [...] will help prove out how many households that have cut the cord would like to subscribe to a sports-centric and lower priced bundle,\" analysts at Morgan Stanley said in a note.\n4. Moody's downgrades New York Community Bancorp\nNew York Community Bancorp's (NYSE:NYCB) long-term and some short-term issuer ratings have been downgraded to \"junk\" status by Moody's, sending shares in the regional bank tumbling premarket on Wednesday.\nThe stock, which has already fallen by more than 50% since it reported steep losses from real estate loans last week, touched its lowest level in over two decades following the announcement.\nMoody's said the decision stemmed from issues related to \"financial, management and risk management\" at NYCB, adding that the mid-sized lender did not have enough provisions on hand to cover possible loan losses. The bank has been under scrutiny as well in the wake of the recent departure of its chief risk officer.\nNYCB's troubles have threatened to reignite concerns over the exposure regional lenders have to a post-pandemic drop in commercial property values. For its part, NYCB has said it is taking \"decisive actions\" to fortify its balance sheet and strengthen risk management processes.\n5. Oil prices rise with Middle East conflict, U.S. production in focus\nOil prices rose slightly in European trade on Wednesday as investors sought more cues on U.S. production and inventories from official data due later in the day, while focus remained on ongoing ceasefire negotiations in the Israel-Hamas war.\nForecasts for a potential drop in U.S. output from record highs has spurred some strength this week in oil prices, which were otherwise reeling from steep losses fueled by speculation over an end to disruptions in the Middle East.\nA softer dollar also afforded some relief to crude prices, with the greenback retreating from almost three-month highs reached earlier in the week. The strength in the dollar was driven chiefly by expectations of higher-for-longer U.S. interest rates.\nBrent oil futures expiring in April gained 0.6% to $79.09 a barrel, while West Texas Intermediate crude futures edged up 0.7% to $73.86 per barrel by 05:07 ET (10:07 GMT). Both contracts slumped over 7% each last week."
}