{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "US offers $10 million for Hamas financial information",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 05, 2024 09:20AM ET",
    "Updated Jan 05, 2024 09:26AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-offers-10-million-for-hamas-financial-information-3268252",
  "paragraph": "WASHINGTON (Reuters) - The United States is offering up to $10 million for information on five Hamas financiers or anything leading to the disruption of the Palestinian militant group's financial mechanisms, the State Department said on Friday. The reward offering follows four rounds of U.S. sanctions on Hamas after the group's deadly incursion into Israel on Oct. 7, which Israel says killed 1,200 people. Israel's subsequent military retaliation in Gaza has killed 22,600 people, local health officials say, and left much of the enclave in ruins. The five are Abdelbasit Hamza Elhassan Khair, Amer Kamal Sharif Alshawa, Ahmed Sadu Jahleb, Walid Mohammed Mustafa Jadallah, and Muhammad Ahmad ‘Abd Al-Dayim Nasrallah, who have all been previously designated global terrorists by the United States, the department said in a statement. The first financier, known as Hamza, is based in Sudan, has managed numerous companies in Hamas’ investment portfolio and was involved in the transfer of almost $20 million to Hamas, the department said. He is tied to Sudanese President Omar Bashir and Islamist groups undermining stability in Sudan, according to the State Department. Three of the Hamas operatives cited - Amer Kamal Sharif Alshawa, Ahmed Sadu Jahleb, and Walid Mohammed Mustafa Jadallah - are part of the group's investment network in Turkey, the department said. Nasrallah has close ties to Iranian entities and has been involved in the transfer of tens of millions of dollars to Hamas, including its military wing, the agency said. The department said in October he was based in Qatar. The rewards would be provided for information on any source of revenue for Hamas, major donors, financial institutions that facilitate transactions for Hamas, front companies that procure dual-use technology for the group and criminal schemes that benefit Hamas, the State Department said."
}