{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBQ04W_L.jpg",
  "title": "South Korean capital drills to guard against surprise attack by North",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 27, 2023 03:53AM ET",
    "Updated Dec 27, 2023 09:17AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/south-korean-capital-drills-to-guard-against-surprise-attack-by-north-3263923",
  "paragraph": "5/5\n© Reuters. South Korean firefighters take part in an anti-terror drill against North Korea's possible provocations amid mounting tensions on the Korean peninsula, in Seoul, South Korea, December 27, 2023. REUTERS/Kim Hong-Ji\n2/5\nBy Daewoung Kim and Jimin Jung SEOUL (Reuters) - More than 1,000 South Korean military, police and emergency personnel joined rare defence drills on Wednesday that simulated an attack by North Korea on Seoul, to counter fears the city is in striking distance of Pyongyang's weapons and covert attack.  The exercise comes amid heightened tension after the North tested an intercontinental ballistic missile and launched its first military spy satellite, with the neighbours reinstating last month some military measures eased after a 2018 pact. \"There was a big lesson for us when Israel's world-class advanced defence system helplessly buckled under a surprise attack by Hamas armed with conventional artillery and primitive means,\" said Oh Se-hoon, the capital's mayor. He said the militant group's cross-border rampage on Oct. 7 through towns in Israel, which killed more than 1,200 people at the time, showed that superior military capabilities did not mean much if the enemy mounted a successful surprise attack. Wednesday's drills simulated attacks on a major water supply facility, telephone network stations, and an underground communications and power cable corridor. Seoul's distance of just 38 km (24 miles) from the military border with the North makes it particularly susceptible to an attack at any time, Oh added.  The densely populated centre of government, business and finance is home to 9.4 million people, with an additional 1.4 million who work and go to school there each day.  Oh has adopted a hardline position against North Korea, arguing that the South must possess its own nuclear weapons as the only way to neutralise the threat from Pyongyang. However, South Korean President Yoon Suk Yeol has ruled out owning nuclear weapons, making it a priority instead to bolster a military alliance with the United States and restore security ties with Japan.  The drills came on a day that South Korea imposed new sanctions on eight North Koreans linked to nuclear and missile programmes.  \nThe neighbours have clashed at sea and one of the South's islands was bombed by the North, killing scores on both sides, but there has been no direct attack on Seoul since the end of the Korean War in 1953. This month's test of the North's latest ballistic missile followed November's successful launch of its first military spy satellite, while a constitutional revision in September enshrined use of nuclear weapons as a national defence policy."
}