{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBQ04S_L.jpg",
  "title": "Factbox-What is Egypt's proposal for Gaza?",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Dec 27, 2023 03:41AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/factboxwhat-is-egypts-proposal-for-gaza-3263918",
  "paragraph": "© Reuters. FILE PHOTO: Hamas official Osama Hamdan speaks at a news conference in Beirut, Lebanon, November 12, 2023. REUTERS/Esa Alexander/FILE PHOTO\nBy Nidal al-Mughrabi, Dan Williams and and Ahmed Mohamed Hassan GAZA (Reuters) - Egypt has held talks between Hamas and its allied Islamic Jihad to try and broker a permanent ceasefire in Israel's war in the Gaza Strip, which has killed tens of thousands, laid waste to the Hamas-governed territory, and displaced the majority of the 2.3 million Palestinian residents. Here are the various proposals Egypt is presenting: RELINQUISH POWER Egypt is proposing that Hamas and Islamic Jihad relinquish power in the Gaza Strip in return for a permanent ceasefire, said two Egyptian security sources.  Hamas and Islamic Jihad officials have rejected such a proposal, the Egyptian sources said. Officials of the two groups denied publicly what the sources said. Leaders of the two groups have repeatedly insisted a post-Gaza war future should be decided by the Palestinians themselves and not according to foreign dictation. Israel has demanded the destruction of Hamas and Islamic Jihad, with aides to Prime Minister Benjamin Netanyahu saying this would entail the dismantling of all of their military and governance capabilities and a deradicalising of the Gaza population. It was not immediate clear if the proposed removal of the militant groups from power would satisfy those demands.  CEASEFIRE STAGES Egypt is suggesting a multi-stage ceasefire, with an initial temporary ceasefire lasting for a period of one or two weeks, said two Egyptian security sources.  The temporary ceasefire could be renewed.  According to Palestinian officials, who said it was a three-stage ceasefire, during the first 10-day humanitarian truce Hamas would release all women, children and old men held captive. In return, Israel would release an agreed number of Palestinian prisoners in the same categories, stop all fighting, relocate tanks to outside populated territory, and allow delivery of medical and food aid, fuel and cooking gas. It will also allow the movement of people back to northern Gaza. The second stage would see Hamas freeing all Israeli women soldiers. In return Israel would release another group of jailed Palestinians. The two parties would also swap bodies withheld since Oct 7. The third stage may last one month, and pending negotiations, see the release of all captives in Hamas custody in return for an agreed upon number of Palestinian prisoners. Israel will withdraw tanks from Gaza and both sides will halt all hostile activities. HAMAS REJECTS TEMPORARY CEASEFIRE Egyptian sources said that both Hamas and Islamic Jihad, which have been holding separate talks with Egyptian mediators in Cairo, will not stop fighting unless Israeli \"aggression\" ends. Osama Hamdan, senior Hamas official, told reporters in Lebanon during a news conference, when asked about initiatives presented to the movement on a ceasefire: \"There are many ideas, that are being presented, and we are dealing with those ideas on the basis that we want a comprehensive end of the aggression and not temporary truces. We are open to ideas that may lead to that,\" said Hamdan. Hamas and the Islamic Jihad insist a prisoner swap deal should see the release of all Palestinians in Israeli prisons. \"All for all\" said a senior Islamic Jihad official. Israel has been open to another limited ceasefire, but has rejected the Palestinian militants' demands for an end to the war and withdrawal of forces from Gaza. FINAL PHASE One Egyptian source said the idea of a post-war Gaza administration was raised. Palestinian officials said the issue wasn't part or a condition of a ceasefire proposal. \nEgypt has fostered talks to form a government of technocracts which would handle relief aid and reconstruction of Gaza and hold a legislative election.  The final phase of the proposal would see an Israeli withdrawal from Gaza and allow the displaced to return."
}