{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0U0KA_L.jpg",
  "title": "NATO chief plays down concerns a Trump re-election would weaken alliance",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 31, 2024 09:08AM ET",
    "Updated Jan 31, 2024 12:38PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Ken Roth",
        "2024-01-31 14:45:13",
        "Actually NATO oath was triggered when USA was attacked by al quida and afghan taleban where all members came to US aid. Many men among our NATO allies died in that war helping USA, so as usual Republicans spit their friends in the face",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Mark Jannetty",
        "2024-01-31 15:47:44",
        "just to bring you back to reality. Trump wanted every country in Nato to pay what they promised. America should not be the financial support for every Nato country ",
        "https://www.investing.com/members/241633026"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/nato-chief-plays-down-concerns-a-trump-reelection-would-weaken-alliance-3288423",
  "paragraph": "2/2\n© Reuters. NATO Secretary-General Jens Stoltenberg and U.S. Secretary of State Antony Blinken hold a press conference at the State Department in Washington, U.S., January 29, 2024. REUTERS/Evelyn Hockstein/File Photo\n2/2\nWASHINGTON (Reuters) -NATO Secretary General Jens Stoltenberg on Wednesday played down fears that a re-election of former U.S. President Donald Trump would weaken the defense alliance as it works to ensure robust support for Ukraine. Stoltenberg said he did not think a second Trump presidency would jeopardize U.S. membership in NATO. \"I believe that the United States will continue to be a staunch NATO ally, regardless of the outcome of the U.S. election, because it is in the U.S. interest,\" he said in an interview with CNN. Republican Trump, a fierce critic of NATO when he was president, repeatedly threatened to pull out of the alliance. He cut defense funding to NATO and frequently complained that the United States was paying more than its fair share. \"I worked with him for four years and I listened carefully, because the main criticism has been about the NATO allies spending too little on NATO,\" Stoltenberg said. Stoltenberg, who has been pushing member states to boost defense spending, said more of the allies are increasing their military contributions. \"So the message from the United States that European allies had to step up has been understood and they are really moving in the right direction,\" he said. Trump has continued to criticize the alliance, saying over the weekend while campaigning that he did not believe NATO countries would support the United States if it were attacked. NATO's treaty contains a provision that guarantees mutual defense of member states if one is attacked. On the war in Ukraine, Trump has called for de-escalation and has complained about the billions spent so far, although he has put forward few tangible policy proposals. U.S. Senate talks on a border security deal that some have set as a condition for additional Ukraine aid have encountered growing opposition among Republicans aligned with Trump. Later, Stoltenberg took his case for continued U.S. aid for Ukraine to a conservative think tank, the Heritage Foundation, whose political action arm has urged the House of Representatives to reject a new assistance package. Stoltenberg noted the United States' \"leading role in supporting Ukraine,\" but pushed back on conservatives' charges that other NATO members are not giving their share. \n\"What they provide in terms of military, financial and humanitarian aid actually exceeds what the U.S. is providing,\" he said. Since Russia's full-scale invasion of Ukraine in February 2022, U.S. aid to Ukraine has totaled around $75 billion, he said, while other NATO members and partner states combined have provided more than $100 billion."
}