{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0C055_L.jpg",
  "title": "UN says 2,000 peacekeepers to leave eastern Congo in withdrawal's first phase",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 13, 2024 01:18PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/un-says-2000-peacekeepers-to-leave-eastern-congo-in-withdrawals-first-phase-3273998",
  "paragraph": "© Reuters. FILE PHOTO: United Nations Organization Stabilization Mission in the Democratic Republic of the Congo (MONUSCO) peacekeepers patrol areas affected by the recent attacks by M23 rebels fighters near Rangira in North Kivu in the east of the Democratic Republ\nKINSHASA (Reuters) - About 2,000 U.N. troops will leave restive eastern areas of the Democratic Republic of Congo by the end of April in the first phase of the peacekeeping mission's planned withdrawal from the country, the head of mission said on Saturday. The U.N. Security Council approved the end of the mission in December following a request by Congolese President Felix Tshisekedi in September to fast-track the withdrawal of the peacekeepers. The currently 13,500-strong force, known as MONUSCO, took over from an earlier U.N. operation in 2010 to help quell insecurity in the east of the Central African country, where armed groups fight over territory and resources. But in recent years, its presence has become increasingly unpopular for what critics say is a failure to protect civilians against militia groups, sparking deadly protests. \"We have a ceiling of 13,500 troops authorised by the Security Council, as of April 30th, with the start of the withdrawal underway, we will reach 11,500,\" Bintou Keita, head of the mission, told a joint press conference with government officials.  The first of three withdrawal phases will begin in South Kivu province, she said, adding that 14 U.N. bases in the province will be taken over by Congolese security forces. U.N. peacekeeping forces will later withdraw from the North Kivu and Ituri provinces in the next phases.  Congolese Foreign Minister Christophe Lutundula told the press conference in the capital Kinshasa that the remaining U.N. forces are expected to be out of the country by Dec. 31.  \n\"The withdrawal of MONUSCO does not necessarily mean the end of the fight we are undertaking to protect the territorial interests of our country, we must continue to struggle,\" Lutundula said.  More than 7 million people have been displaced due to conflicts in Congo, mostly in the three eastern provinces where a myriad of armed groups continue to operate."
}