{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0R00R_L.jpg",
  "title": "North Korea fires cruise missiles off east coast",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 27, 2024 11:54PM ET",
    "Updated Jan 28, 2024 02:45AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Derick Lim",
        "2024-01-28 06:49:52",
        "Need to stir some 💩for attention since the Israel and Ukraine war stole Kim's limelight ",
        "https://www.investing.com/members/214364779"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/north-korea-fired-multiple-cruise-missiles-off-east-coast-3285027",
  "paragraph": "© Reuters. FILE PHOTO: A North Korean flag flutters at the propaganda village of Gijungdong in North Korea, in this picture taken near the truce village of Panmunjom inside the demilitarized zone (DMZ) separating the two Koreas, South Korea, July 19, 2022. REUTER\nBy Hyonhee Shin SEOUL (Reuters) -North Korea fired multiple cruise missiles off its east coast on Sunday, its second such launch in less than a week, South Korea's Joint Chiefs of Staff (JCS) said.  The missiles were launched at around 8 a.m. (2300 GMT on Saturday) and were being analysed by South Korean and U.S. intelligence authorities, the JCS said, without specifying how many missiles were fired or how far they travelled. \"While strengthening surveillance and vigilance, our military is cooperating closely with the United States and monitoring additional signs and activities from North Korea,\" it said in a statement.  The latest launches came days after North Korea fired what it called a new strategic cruise missile called \"Pulhwasal-3-31\", suggesting it is nuclear capable.  North Korea is stepping up confrontation with the United States and its allies, but officials in Washington and Seoul say they have spotted no signs Pyongyang intends to take imminent military action. Pyongyang is likely to continue or even increase provocative steps, officials and analysts say, after it made strides in ballistic missile development, bolstered cooperation with Russia and China, and scrapped its decades-long goal of peacefully reuniting with South Korea.  Earlier on Sunday, North Korea's state media KCNA denounced a series of military drills conducted in recent weeks by U.S. and South Korean troops, warning of \"merciless\" consequences.  \"The reality that nuclear war exercises against our republic have been going on like crazy since the beginning of the New Year demands that we be fully prepared for a deadly war,\" the dispatch said.  North Korea carried out its first test of a cruise missile with possible nuclear strike capabilities in September 2021. While U.N. Security Council sanctions do not bar the isolated country from testing conventional cruise missiles, South Korea's defence minister Shin Won-sik condemned the recent launches as a serious threat to his country and beyond.  \nThe latest launch came a day after a Chinese delegation led by Vice Foreign Minister Sun Weidong returned home following a three-day visit to Pyongyang, during which both sides vowed to boost tactical cooperation and defend common interests.  In a separate dispatch on Sunday, KCNA said a North Korean delegation headed by sports minister Kim Il Guk left on Saturday for China."
}