{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK00097_L.jpg",
  "title": "North Korea's Kim says armed conflict becoming reality because of US - KCNA",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 31, 2023 07:09PM ET",
    "Updated Dec 31, 2023 09:20PM ET"
  ],
  "comments": [
    3,
    [
      [
        "Ken Roth",
        "2024-01-02 00:23:58",
        "How can you enslave an entire population and at the same time make them think you are god. One word FEAR, thats how a dictator runs his country. ",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Gary Piccone",
        "2024-01-01 02:31:06",
        "Been saying this for 10 years. He's having too many cognacs for New Years, again ",
        "https://www.investing.com/members/239243214"
      ],
      [
        "Ac Tektrader",
        "2024-01-01 01:35:13",
        "armed conflict will eliminate North Korea.....and send it's leadership to trial for crimes against humanity..",
        "https://www.investing.com/members/224473057"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/north-koreas-kim-says-armed-conflict-becoming-reality-because-of-us--kcna-3264992",
  "paragraph": "2/2\n© Reuters. North Korean leader Kim Jong Un meets with commanders of the Korean People's Army, at the headquarters of the Central Committee of the Party, in Pyongyang, North Korea, in this picture released by the Korean Central News Agency on January 1, 2024. KCNA v\n2/2\nBy Jack Kim SEOUL (Reuters) - North Korean leader Kim Jong Un told the country's military commanders the most powerful means must be mobilized to destroy the United States and South Korea if they choose military confrontation, state media reported on Monday. Kim said the danger of an armed confrontation on the Korean peninsula is fast becoming a reality because of hostile maneuvers by the enemies including the United States, requiring the country to \"sharpen the treasured sword\" to protect itself. \"If the enemy opt for military confrontation ... our army should deal a deadly blow to thoroughly annihilate them by mobilizing all the toughest means and potentialities without moment's hesitation,\" KCNA news agency quoted Kim as saying. Kim made the comments as he hosted senior military leaders on Sunday at the ruling Workers' Party (WPK) headquarters to congratulate them on the accomplishments made in 2023, the state news agency said. North Korea in 2023 tested its largest ballistic missiles and launched its first military reconnaissance satellite, which Kim has called major advances in modernizing the country's military. The call to upgrade the country's military readiness follows the pledge made at the conclusion of a five-day WPK meeting that ended on Saturday to boost its nuclear arsenal, build military drones and launch three new spy satellites in 2024. The escalation of rhetoric from Kim comes as the United States increased drills with South Korea in the past year, deploying more strategic military assets, including a nuclear missile submarine, aircraft carriers and large bombers. It also comes ahead of a year that will see pivotal elections in both South Korea and the United States, which Pyongyang likely sees as an opportunity to increase its leverage by stepping up a campaign of military pressure.  On Monday, South Korean President Yoon Suk Yeol pledged to accelerate work to complete a missile defence system and a system using U.S. extended deterrence to \"fundamentally deter any North Korean nuclear and missile threat.\" Extended deterrence refers to the strategy of using U.S. military assets including nuclear weapons to deter and, in the event of an attack against an ally, respond.  \nIn separate reports, KCNA said Kim hosted a reception for senior members of the ruling party and attended a late night \"grand art performance\" celebrating the new year at the May Day stadium in Pyongyang, where senior party members, soldiers and members of the diplomatic corps were present.  The show featured ice skaters, acrobats and choirs, and fireworks lit up the sky at midnight, as the venue filled \"with great happiness and boundless excitement of seeing in the New Year with the benevolent father of the great socialist family.\""
}