{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBQ06W_L.jpg",
  "title": "Abortion battles shift to medical emergencies, travel",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 27, 2023 06:02AM ET",
    "Updated Dec 27, 2023 11:06AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/abortion-battles-shift-to-medical-emergencies-travel-3263945",
  "paragraph": "© Reuters. Abortion rights activists and counter protesters protest outside the U.S. Supreme Court on the first anniversary of the court ruling in the Dobbs v Women's Health Organization case, overturning the landmark Roe v Wade abortion decision, in Washington, U.S\nBy Brendan Pierson (Reuters) - The legal landscape surrounding abortion has been roiled by uncertainty since the U.S. Supreme Court last year overturned its landmark 1973 Roe v. Wade ruling, which had guaranteed abortion rights nationwide. Abortion providers and reproductive rights groups have brought a slew of lawsuits seeking to invalidate new bans and abortion restrictions that went into effect in many Republican-led states after Roe fell, invoking women's rights under state constitutions. The cases often resulted in preliminary victories followed by whiplash reversals on appeal, leaving providers and patients in limbo. Many of those frontal challenges have now been decided by state supreme courts, which have upheld abortion bans in South Carolina, Indiana, Georgia and elsewhere. Of course, the initial wave of litigation is not over. Some of the state challenges - like Florida's - are still awaiting rulings. In another notable case with nationwide implications filed by conservative activists in 2022, the U.S. Supreme Court is considering whether to roll back access to the abortion pill mifepristone. Nonetheless, there has been a shift in the litigation, away from the broad, head-on challenges and toward narrower issues arising from the bans. A newer wave of lawsuits has focused on when emergency medical exceptions to abortion bans apply and whether states can stop their citizens from traveling to states where abortion remains legal- a trend experts expect to continue in the new year. WHY IT MATTERS All of the 18 states that have banned or sharply restricted abortion allow exceptions for medical emergencies when continued pregnancy would endanger the mother's life, or, in some states, health. But in practice, according to allegations in multiple lawsuits and public testimony from women, those exceptions are often unavailable because the laws are so vague that physicians are not sure when they apply, and so are unwilling to perform abortions for fear of prosecution. The issue received widespread national attention in December when the Texas Supreme Court ruled against Kate Cox, a Dallas Fort-Worth area woman who had sought an emergency medical abortion of her nonviable pregnancy. While that decision only applied to Cox, the state court is still considering another case about the scope of the medical exception that will apply more broadly. \"Its becoming increasingly clear to the American public that there are a lot of scenarios in pregnancy where people need access to abortion\" but can't get one, said Elizabeth Sepper, a professor of health law at the University of Texas at Austin. Data suggests that many women seeking abortion in states where it is banned, for medical or other reasons, travel out of state, like Cox did while she was awaiting the Texas Supreme Court's ruling. According to the Guttmacher Institute, a research group that supports abortion rights, about 92,100 women crossed state lines for an abortion in the first half of 2023 - more than double the number in a six-month period in 2020. Some states, like Alabama, Texas, Oklahoma and Idaho, have sought to stop that by making it a crime to help, or pay for, such travel. Lawsuits over such measures are pending in Alabama and Idaho. WHAT IT MEANS FOR 2024 Sepper and others said they expect more litigation over travel and, especially, medical exceptions in the coming year. Greer Donley, a professor at Pittsburgh Law School who focuses on abortion, said most such cases will not be brought by plaintiffs like Cox in need of an immediate abortion, since many people in that position would not want to take on the burden of a lawsuit and being in the national spotlight. \"I think it's important to remember that what Kate Cox was willing to do was so extraordinary,\" Donley said. However, lawsuits over health exceptions could still be brought by physicians or women who have reason to believe they will face complicated pregnancies. One such case, brought by Planned Parenthood and others, is already pending in an Indiana state court. The case seeks to capitalize on a ruling by the Indiana Supreme Court that, while upholding the state's abortion ban, found that the state constitution allows abortion to preserve the mother's life or health. Two other pending cases center on a federal law, the Emergency Medical Treatment and Active Labor Act (EMTALA), requiring emergency rooms to stabilize patients with an emergency condition. The Biden administration said last year that, if EMTALA conflicts with a state abortion ban, the federal law takes precedence. The guidance prompted challenges from state governments in Texas, where the federal government is currently blocked from enforcing it, and Idaho, where a judge has sided with the administration. Both cases are being appealed. \nDavid Cohen, a professor at Drexel University Law School, said that while the issue of medical exceptions affects a relatively small share of people seeking abortions, they have provided an effective message for abortion rights advocates about harms caused by bans. That will be particularly important in the coming year's elections, where Democrats expect abortion to be a potent issue. \"Those stories seem to be resonating,\" Cohen said."
}