{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "Israel says five Gaza hostages found dead in tunnel, circumstances being probed",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 24, 2023 02:47PM ET",
    "Updated Dec 24, 2023 03:30PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/israel-says-five-gaza-hostages-died-in-tunnel-circumstances-being-probed-3263126",
  "paragraph": "By Dan Williams JERUSALEM (Reuters) - Five Israeli hostages killed in Hamas captivity were recovered from an underground tunnel network in the northern Gaza Strip, the military said on Sunday, showing footage of a white-tiled bathroom and work room linked by dark concrete-lined passages. The publication left open the question of how they had died, with chief military spokesperson Rear Admiral Daniel Hagari saying post-mortems were pending. \"We will brief the families and then, depending on what they approve, the public,\" he said. The three soldiers and two civilians were among 240 people dragged back to the Gaza Strip by Hamas gunmen during the cross-border rampage of Oct. 7 that sparked the war. The military announced the repatriation of their bodies earlier this month. Hamas last week published video showing three of the hostages alive in what appeared to be a narrow, white-tiled and windowless bedroom with an electric wall socket.  In a Hebrew chyron directed at Israel, the Iranian-backed Islamist group said: \"Your military weapons killed the three.\"  Hamas has previously said some hostages died in Israel's shelling of Gaza. It has also threatened to execute hostages. Sunday's military publication came as Prime Minister Benjamin Netanyahu said Israel would deepen operations in an almost 12-week-old war whose toll on Gaza civilians has alarmed Western powers also worried about the 129 remaining hostages. Video released by the military showed its engineers in a dark and dusty tunnel network which, it said, had two storeys - one 10 metres down and the other \"dozens of metres\" deeper. One tunnel ran to the home of Ahmad Al Ghandour, chief of Hamas' North Gaza brigade, the Israeli military said. Hamas declared him and several other commanders killed in action on Nov. 26. Israel said they were targets of one of its air strikes. The video showed a section of tunnel lined with white tiles, as well as a similarly designed bathroom with a basic shower, toilet and sink, and a work room with a corner table and bench. One tunnel had a drinking water dispenser and a pile of bullets. The military video did not include images corresponding to the hostages' bedroom shown in the Hamas video, whose ceiling appeared differently designed though also tiled in white.  (This story has been corrected to say 'found dead' instead of 'died' in the headline)"
}