{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0P00M_L.jpg",
  "title": "Belarus investigates some 20 analysts over 'harming national security'",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 25, 2024 07:33PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/belarus-investigates-some-20-analysts-over-harming-national-security-3283618",
  "paragraph": "© Reuters. Belarusian President Alexander Lukashenko gestures before a press conference in Minsk, Belarus July 6, 2023. REUTERS/Maxim Shemetov/ File photo\nBy Ronald Popeski and Kanishka Singh (Reuters) - Authorities in Belarus, Russia's closest ally, launched an investigation on Thursday into a group of 20 independent analysts and commentators now outside the country and accused of conspiring to seize power and promote extremism. The investigation follows a series of searches and detentions of people, many of who were once jailed for political dissent against Belarus's long-serving president Alexander Lukashenko. One human rights group said more than 150 people were affected by the police action. The United States, which has long imposed sanctions on Belarus alongside the European Union, denounced the latest punitive measures. Belarus's Investigative Committee said the analysts \"took an active part in the development and implementation of the concept of destructive activities aimed at harming national security\". The group includes political commentators and economists as well as officials linked to exiled opposition leader Svyatlana Tsikhanouskaya, beaten by Lukashenko in the 2020 election. \"The regime is trying to push the country into an information bubble,\" Tsikhanouskaya, who lives in neighbouring Lithuania, wrote on Telegram. \"The wave of repression against analysts and experts is simply revenge against those who honestly assess the situation in Belarus and propose real ways out of the crisis.\" The human rights group Viasna (Spring) said on its website that at least 157 people had been subject to detentions and questioning. Most, it said, had been released or charged with minor offences, but some faced charges of abetting extremism. The U.S. State Department said Washington \"condemns the Lukashenko regime's recent raids (and) detentions\" and vowed to hold the government responsible \"for its harsh internal repression as well as for its ongoing support for Russia's war of aggression against Ukraine.\" In power since 1994, Lukashenko staged a new crackdown on dissent after stamping out unprecedented demonstrations against what his opponents say was his rigged re-election in 2020. \nKremlin leader Vladimir Putin backed him in that confrontation and Lukashenko allowed Russia to use its territory as a staging post for its 2022 invasion of Ukraine. Lukashenko, dependent on Moscow for political and economic support, agreed last year to deploy Russian tactical nuclear weapons in his country on Russia's western border. But he has rejected any notion of committing troops to the war in Ukraine."
}