{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0M0OD_L.jpg",
  "title": "Morocco foils 75,184 illegal migration attempts to Europe in 2023",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 23, 2024 01:36PM ET",
    "Updated Jan 23, 2024 01:43PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/morocco-foils-75184-illegal-migration-attempts-to-europe-in-2023-3280948",
  "paragraph": "© Reuters. FILE PHOTO: A female migrant is led by a Spanish female soldier as she is deported to Morocco after she crossed the border swimming from Morocco to Spain, at El Tarajal beach, after thousands of migrants swam across this border during last days, in Ceuta,\nRABAT (Reuters) - Morocco stopped 75,184 people from illegally migrating to Europe in 2023, up 6% compared to a year earlier, the interior ministry said on Tuesday.  The figures reflected \"the resilience of border and coast surveillance apparatus,\" the ministry said in response to Reuters emailed questions. Morocco and Spain have strengthened their cooperation in addressing illegal migration, since they patched up a separate diplomatic feud in 2022. The North African country has for long been a major launch pad for African migrants aiming to reach Europe through the Mediterranean, the Atlantic or by jumping the fence surrounding the Spanish enclaves of Ceuta and Melilla.  Last year, there were six group attempts to cross into Ceuta and Melilla, involving more than 1,400 migrants, down 62% compared to 2022, the ministry said.  In 2022, Morocco said 23 migrants died during an attempted mass crossing into Melilla, in an incident that outraged rights groups.  \nTighter surveillance of Morocco's northern borders is prompting an increasing number of migrants to try the riskier and longer Atlantic route to the Canary Islands, said Ousman Ba, a Senegalese national who runs a migrant community charity in Nador, near Melilla. The Moroccan navy rescued 16,818 people at sea in 2023, up 35% compared to a year earlier, the interior ministry said.Morocco has also busted 419 migrant trafficking networks, up 44% from a year earlier, it said."
}