{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK020BW_L.jpg",
  "title": "Bangladesh deploys army to keep peace ahead of Sunday's election",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 03, 2024 07:28AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/bangladesh-deploys-army-to-keep-peace-ahead-of-sundays-election-3266331",
  "paragraph": "4/4\n© Reuters. Members of Bangladesh Army arrive at a temporary camp, after the army was deployed across the country, in order to help civil administration during general election in Dhaka, Bangladesh, January 3, 2024. REUTERS/Mohammad Ponir Hossain\n2/4\nBy Ruma Paul and Sudipto Ganguly DHAKA (Reuters) - Troops deployed across Bangladesh on Wednesday amid fears of violence ahead of a national election which the main opposition party is boycotting. Soldiers travelled in armoured vehicles to temporary camps set up across the capital Dhaka to help the civil administration maintain peace and security. The Bangladesh Nationalist Party (BNP) is boycotting the election, set to take place on Sunday, after Prime Minister Sheikh Hasina refused to agree to their demands that she resign and cedes power to a neutral authority to run the poll. Hasina has repeatedly blamed the BNP for instigating anti-government protests that have rocked Dhaka since late October and in which at least 10 people have been killed.  The troops will only act on request from polling officers, the military said in a statement. The navy was deployed in two coastal districts and the air force will provide helicopter assistance to polling stations in remote hilly areas, it added. People fear that the violence that has swept Bangladesh in the last two months could return after the poll. \"I don't care which party is in power. I just want some peace so that I can earn and feed my family,\" said Abdul Hamid, 48, a rickshaw puller in Dhaka.  \"I don't think after the election there will be peace. If there is political turmoil, it is difficult for us to survive. This is not a way of running a country. We are so confused about our future.\" Hasina, who has maintained tight control since coming to power in 2009, has been accused of authoritarianism, human rights violations, cracking down on free speech and suppressing dissent while jailing her critics. \nHer main rival and two-time premier, BNP leader Khaleda Zia, is effectively under house arrest for what her party calls trumped-up corruption charges. Her son and BNP's acting chairman, Tarique Rahman, is in exile after several charges were brought against him that he denies. Hasina's government is under pressure from Western countries to hold free and fair elections."
}