{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0B0TJ_L.jpg",
  "title": "Biden says Yemen's Houthis are a 'terrorist' group",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 12, 2024 04:26PM ET",
    "Updated Jan 12, 2024 06:31PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/biden-says-yemens-houthis-are-a-terrorist-group-3273841",
  "paragraph": "© Reuters. U.S. President Joe Biden answers questions from the press at Nowhere Coffee Co. in Emmaus, Pennsylvania, U.S., January 12, 2024. REUTERS/Leah Millis\nBy Nandita Bose and Kanishka Singh EMMAUS, Pennsylvania (Reuters) -U.S. President Joe Biden on Friday called Yemen's Houthi forces a \"terrorist\" group, after American and British warplanes, ships and submarines launched dozens of air strikes across Yemen overnight. Biden said Washington will respond to the Houthis if they continued behavior that he called \"outrageous.\" WHY IT IS IMPORTANT London and Washington say their strikes in Yemen were in retaliation for months of attacks by the movement on Red Sea shipping that the Iran-backed fighters cast as a response to the ongoing war in Gaza. The strikes represent one of the most dramatic demonstrations to date of the widening of the Gaza conflict. KEY QUOTES \"I think they are,\" Biden told reporters on Friday when he was asked if he was willing to call the Houthis a \"terrorist\" group. \"We will make sure that we respond to the Houthis if they continue this outrageous behavior along with our allies,\" he added. The White House said earlier on Friday the United States does not want war with Yemen but will not hesitate to take further action. \"It's irrelevant whether they're designated (as terrorists). We've put together a group of nations (that) are going to say that if they continue to act and behave as they do, we'll respond,\" Biden told reporters. CONTEXT The Houthis, an Iran-backed armed movement that took control of most of Yemen over the past decade, have been attacking shipping at the mouth of the Red Sea - one of the world's busiest trade lanes - since October. The attacks have forced shippers to change course and take longer routes. \nThe Houthis say their attacks have been a show of support for Palestinians under siege by Israel in Hamas-governed Gaza. The Gaza conflict followed an attack on Israel on Oct. 7 by the Palestinian Islamist group Hamas, which Israel said killed 1,200 people. Israel's subsequent assault on Gaza has killed more than 23,000 Palestinians, about 1% of the 2.3 million population there, according to Gaza's health ministry."
}