{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK090W5_L.jpg",
  "title": "Former US Cardinal McCarrick ruled not competent to face Wisconsin sex abuse trial",
  "category": "General",
  "publisher": "Reuters",
  "date": [
    "Published Jan 10, 2024 05:25PM ET",
    "Updated Jan 10, 2024 06:10PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/general/former-us-cardinal-mccarrick-ruled-not-competent-to-face-wisconsin-sex-abuse-trial-3271882",
  "paragraph": "© Reuters. Former Roman Catholic Cardinal Theodore McCarrick wears a mask during arraignment at Dedham District Court, facing charges that he sexually assaulted a 16-year-old boy during a wedding reception at Wellesley College in 1974, in Dedham, Massachusetts, U.S.\nBy Nate Raymond (Reuters) - A Wisconsin judge on Wednesday suspended a criminal case that alleged former Roman Catholic Cardinal Theodore McCarrick fondled an 18-year-old boy in 1977, finding the 93-year-old was not competent to stand trial after he was diagnosed with dementia. Judge David Reddy's decision came after a Massachusetts judge in August dismissed the only other sexual assault case nationally against McCarrick, a former archbishop of Washington, D.C., who was defrocked by Pope Francis in 2019. A defense lawyer asked the state court judge during a hearing in Elkhorn, Wisconsin, to similarly dismiss the case in that state against McCarrick, according to court records. But the Wisconsin judge said he did not have authority to do that. Mitchell Garabedian, a lawyer for the alleged victim in both cases, in a statement called his client \"a courageous and determined clergy sexual abuse survivor who will continue to seek justice\" through civil cases in New York and New Jersey. A lawyer for McCarrick declined to comment. Prosecutors did not respond to requests for comment. McCarrick in 2021 became the only current or former U.S. Catholic cardinal to ever face child sex abuse charges when Massachusetts prosecutors filed that initial case. The Wisconsin case was announced in April 2023. He was expelled from the Roman Catholic priesthood in 2019 after a Vatican investigation found him guilty of sexual crimes against minors and adults. A Vatican report in November 2020 found that McCarrick rose through the church's ranks despite rumors of sexual misconduct and that Pope John Paul II promoted him despite knowing the allegations. The Massachusetts and Wisconsin cases involved the same alleged victim, who called McCarrick a family friend who sexually abused him for years beginning in 1969, including during a wedding in Massachusetts in 1974 and a stay as a guest at a Wisconsin cabin on Geneva Lake in 1977. In August, though, a Massachusetts judge granted prosecutors' request to dismiss charges against McCarrick over the 1974 incident, after a psychologist retained by the prosecution concluded she believed McCarrick had dementia. \nThat expert, Kerry Nelligan, the psychologist, said McCarrick had \"significant deficits in his memory and ability to retain information\" and that his condition rendered him unable to meaningfully participate in his own defense. After the Massachusetts case was dismissed, Wisconsin judge Reddy appointed Nelligan to conduct a competency examination and apply Wisconsin law in doing so."
}