{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK020FW_L.jpg",
  "title": "Killing of Arouri sends menacing message to Hamas chiefs, may hamper truce effort",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 03, 2024 10:20AM ET",
    "Updated Jan 03, 2024 12:12PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/killing-of-arouri-sends-menacing-message-to-hamas-chiefs-may-hamper-truce-effort-3266542",
  "paragraph": "© Reuters. A person holds a placard displaying the photo of late Hamas deputy leader Saleh al-Arouri during the funeral of Ahmad Hammoud, who was killed along with al-Arouri of what security sources said was an Israeli drone strike in Beirut on Tuesday, in Burj al-S\nBy Nidal al-Mughrabi, Maya Gebeily and Parisa Hafezi CAIRO/BEIRUT/DUBAI (Reuters) -The killing of a Hamas chief in Lebanon removes a big name from Israel’s most-wanted list but could drive the Palestinian group's exiled leaders deeper into hiding, hampering efforts to negotiate further Gaza ceasefires and hostage releases. Hamas deputy leader Saleh al-Arouri was struck down by a drone in the southern suburbs of Beirut, the stronghold of Hamas' Iranian-backed Lebanese ally Hezbollah, in an attack widely attributed to Hamas' sworn foe Israel.  Israel has not confirmed or denied a role, but the attack came a month after Israeli broadcaster Kan aired a recording of the head of Israel's domestic security agency Shin Bet vowing to hunt down Hamas in Lebanon, Turkey and Qatar even if took years. On Wednesday, Israel's Mossad spy chief David Barnea said he was committed to \"settling the score\" with Hamas, adding: \"Let every Arab mother know that if her son took part, directly or indirectly, in the October 7 massacre, his blood is forfeit.\" Arouri's killing, said Ashraf Abouelhoul, managing editor of Egypt's Al-Ahram daily and an expert in Palestinian affairs, \"may push Hamas to harden its stance so it doesn’t look as if it is bowing under pressures or threats of more assassination.\"  The stakes are high both for the two million Palestinians trying to survive Israeli bombardment in Gaza and for Israeli hostages held there by Hamas, ruler of the coastal territory and like Hezbolah an ally of Iran.  Hamas negotiators including Arouri had been in Qatar-mediated talks with Israel over a possible further ceasefire in the war and prospects for further releases of Israeli hostages. As recently as the past week the two sides were having discussions with Qatari mediators on a truce and hostages, a source familiar with the talks said, indicating a period when the Arouri strike may have been in final stages of preparation. Security concerns may now complicate matters, analysts said. Mohanad Hage Ali, deputy director for research at the Malcolm H. Kerr Carnegie Middle East Center in Beirut, said that in recent years Palestinian groups operating in Lebanon, where Hezbollah is a powerful player, had become used to a measure of security. Hamas needed to be far more cautious now, he added. 'OPEN BATTLE' Such groups, he said, had been \"happy with the arrangements in place – some quiet and stability and some sort of deterrence by Hezbollah. This has flown out of the window, given Oct. 7 and the conflict in south Lebanon and how things are going forward.\" Arouri, 57, was the first senior Hamas political leader to be assassinated outside the Palestinian territories since Israel vowed to eliminate the group following its Oct.7 rampage, when it killed 1,200 people and took 240 hostages back to Gaza. The loss of a top figure could now prompt Hamas to take a tougher line against Israel, currently waging a shattering air and ground offensive against the group, analysts told Reuters. The extent of any change in Hamas' stance remains unclear. Hussam Badran, a Hamas political leader in exile, reacted defiantly to Arouri's death by saying: \"We tell the criminal occupation (Israel) that the battle between us and them is open.” However, Hamas official Sami Abu Zuhri said that while Arouri's death \"will have its consequences\", Hamas' position remained that provided Israel fully stopped its attacks then the group would be open to talks \"on all other issues\".    Arouri's assassination may also widen the Gaza war to new territory in Lebanon, marking the first strike on Beirut after nearly three months of cross-border shelling between Hezbollah and Israel that had been limited to southern Lebanon.  Hezbollah will come under pressure to exact revenge for its ally, especially since he was killed in the group's Beirut stronghold Dahiya, the analysts said. Three Iranian insiders closely connected to Tehran's hardline clerical establishment said the killing had raised concerns among the Islamic Republic's leaders that Israel could be trying to widen the conflict by dragging in Iran. \"His assassination shocked everyone in Tehran. However, it does not mean that Tehran will get involved in the conflict directly, though apparently this is the main goal of the Zionist regime's leaders,\" said one of the insiders. Within hours of the killing, however, an Israeli official signalled Israel wanted to avoid escalation, even as he insisted Israel had not taken responsibility for the attack. CAUTION IN LEBANON Speaking to MSNBC, the official, Mark Regev, an adviser to Israeli Prime minister Benjamin Netanyahu, described the attack as a \"surgical strike against the Hamas leadership\" and not an attack on the Lebanese state or Hezbollah. Whatever its eventual impact on regional stability, Arouri's death is highly likely to make other Hamas leaders more cautious about their whereabouts. In Gaza, no Hamas leader has been seen since the Oct. 7 killing spree. Many are believed to be hiding in deep underground tunnels. For decades, the long arm of Israel's Mossad intelligence service has encouraged Palestinian opponents to live in the shadows to avoid assassination. Israel's responded to the 1972 killing of 11 Israeli Olympic team members at the Munich games with an assassination campaign against operatives and organizers of the Black September Palestinian group over several years and in several countries.  Hamas leader Khaled Meshaal survived a 1997 assassination attempt by Israeli Mossad agents in Jordan. In 2010, suspected Israeli assassins killed Hamas commander Mahmoud al-Mabhouh in a Dubai hotel. Israel has not confirmed or denied involvement. In Lebanon, some Hamas officials have appeared regularly in recent months to deliver press statements. But Arouri and others more involved in strategic affairs have avoided the limelight. \nHamas leaders Ismail Haniyeh and Khaled Meshaal are expected to stay in Turkey, a heavyweight regional power, and Qatar, an active diplomatic player, two countries Israel will not want to antagonise. Turkey has repeatedly warned Israel to stay away from Hamas members on Turkish soil. On Tuesday, before Arouri's killing, Turkish authorities detained 34 people suspected of links to Mossad and of planning to attack Palestinians living in Turkey."
}