{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBT04E_L.jpg",
  "title": "Over 1,000 Burundian soldiers covertly deploy in eastern Congo - internal UN report",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 30, 2023 09:56AM ET",
    "Updated Dec 30, 2023 10:02AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/over-1000-burundian-soldiers-covertly-deploy-in-eastern-congo--internal-un-report-3264898",
  "paragraph": "© Reuters. FILE PHOTO: Congolese M23 rebels are seen as they withdraw from the 3 antennes location in Kibumba, near Goma, North Kivu province of the Democratic Republic of Congo, December 23, 2022. REUTERS/Arlette Bashizi/File Photo\nBy Sonia Rolley (Reuters) - Over 1,000 Burundian troops have been covertly deployed in eastern Democratic Republic of Congo since October, wearing the uniform of Congolese troops and working alongside them in the fight against M23 rebels, an unpublished U.N. report seen by Reuters showed. Citing security and intelligence sources and sources close to Congolese army command, the report by the U.N. Group of Experts in Congo said the troops were airlifted from Burundi to eastern Congo by Congolese army planes starting from Sept. 21. The Burundian and Congolese governments and Congolese army did not immediately reply to a request for comment from Reuters. The report was shared internally with U.N. Security Council members on Dec. 15 and seen by Reuters on Saturday. It is due to be published in January. It sheds light on Congo's security strategy in the east beyond the known deployment of U.N. peacekeepers and Congolese troops, who were backed up by an East African Community (EAC) regional force until earlier in December. The report said the Burundian government had denied to the U.N experts any Burundian troop deployment outside the EAC arrangement. It also said Congolese military authorities had told the group they were unaware of the cooperation with Burundian troops highlighted in the report. Citing its sources, the report said the Burundian troops were deployed outside the EAC arrangement and alongside Congolese troops and allied armed groups fighting M23 in North Kivu province.  \nSince 2022 the M23 offensive there has worsened the region's decades-long security and humanitarian crisis, forcing about one million people to flee their homes. Congo, Western powers and the U.N. expert group say the Tutsi-led rebel group is supported by neighbouring Rwanda. Rwanda denies all involvement, but the accusations have led to a major diplomatic crisis in the region."
}