{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0I0C2_L.jpg",
  "title": "Cuban soup kitchen sees soaring demand as economic crisis deepens",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 19, 2024 06:11AM ET",
    "Updated Jan 19, 2024 06:37AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/cuban-soup-kitchen-sees-soaring-demand-as-economic-crisis-deepens-3278088",
  "paragraph": "5/5\n© Reuters. A helper fills containers with food to distribute among people in need at a soup kitchen run by religious group Quisicuaba that is serving a growing number of Cubans struggling to make ends meet amid economic crisis, in Havana, Cuba January 15, 2024. REUT\n2/5\nBy Alien Fernandez and Dave Sherwood  HAVANA (Reuters) - Cuban Elda William, a 60-year old former psychologist, had been making ends meet selling cellphone plans - until a sewage pipe at her home office burst, putting off prospective clients.  No one has come to fix it and her income dried up, leaving her with little choice but to turn to Quisicuaba, a community-led soup kitchen for the hungry in central Havana.  \"Thanks to this place my family has well-prepared food,\" William said in an interview, adding that the free meal offered by the project reminded her of the 1980s, when the communist-run government itself provided free rations to the population.  Those benefits - including a monthly ration of basics such as rice, beans, sugar, cooking oil and coffee - have been scaled back over the years and particularly recently, as the economic crisis has resulted in shortages and high prices. That has forced citizens in need to look elsewhere for a meal. Enter Quisicuaba.  The decades-old project, funded by on-island cultural and community groups, donations from abroad, and private gifts - has recently become one of a handful of non-governmental projects to achieve scale in a nation that has since Fidel Castro's 1959 revolution largely depended on the state to support the needy. The project now provides breakfast, lunch and dinner to 4,000 people per day, from all walks of life and from various provinces, according to Quisicuaba logistics coordinator Octavio Dominguez, who said that number grows daily. Staff also provide a delivery service for those in need who can't reach the impeccably clean and brightly decorated soup kitchen in central Havana. \"Every day we may receive 30, 40, 50 new cases,\" said Dominguez. \"We feed anyone who arrives ... there are no conditions. We don't ask how much they make, and we charge nothing.\" Quisicuaba leader Enrique Aleman, a Cuban lawmaker who has received accolades from President Miguel Diaz-Canel for his work with the soup kitchen, said the island's ailing economy - made worse, he said, by severe U.S. sanctions - provides the backdrop for the group's work, but is not its principal driver. \"To say that this social project is primarily economic in nature is to stigmatize it,\" Aleman said in an interview. Many who appear on the doorstep of Quisicuaba, he said, suffer from a range of existing problems exacerbated by the recent economic crisis - often related to addiction, nutrition, health or family issues - and he said his fast-growing project aims to provide a holistic response, including counseling, shelter and food. The group has expanded recently, opening a shelter in San Antonio de los Baños, outside Havana, which takes aim at another problem increasingly apparent in Cuba as the economy slides: homelessness. The shelter, which also has an agricultural component to help grow food for the soup kitchen, currently cares for 53 people but aims to have as many as 570 at full capacity, staff said. Angela Figueroa, 66, was living on the streets when she heard of the Quisicuaba soup kitchen. From there she eventually made her way to the new center in San Antonio de los Baños. \"Now I have breakfast, lunch, and dinner,\" she said. \"Despite the economy, and the shortages, they treat us very well, they worry about our food, our medication.\" \nQuisicuaba's logistics manager Dominguez says the group stands ready to help more of those left destitute by the crisis. \"The more people we can help, the better,\" Dominguez said."
}