{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "Nearly all US Senate Democrats back two-state solution for Israel and Palestinians",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 24, 2024 06:13PM ET",
    "Updated Jan 24, 2024 08:26PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Mark Jannetty",
        "2024-01-25 10:33:17",
        "if the democrats are behind it, you know that it will surely fail.",
        "https://www.investing.com/members/241633026"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/nearly-all-us-senate-democrats-back-twostate-solution-for-israel-and-palestinians-3282354",
  "paragraph": "By Patricia Zengerle WASHINGTON (Reuters) - An overwhelming majority of President Joe Biden's fellow Democrats in the Senate on Wednesday backed a statement reiterating U.S. support of a two-state solution to the Israeli-Palestinian conflict. Forty-nine of the 51 members of the Senate Democratic caucus backed an amendment supporting a negotiated solution to the conflict that results in Israeli and Palestinian states living side by side, ensuring Israel's survival as a secure, democratic, Jewish state and fulfilling the Palestinians' \"legitimate aspirations\" for a state of their own. Senator Brian Schatz introduced the measure as an amendment to an upcoming bill that would provide national security aid to Ukraine, Israel and Taiwan. \"What will determine the future of Israel and Palestine is whether or not there's hope. And the two-state solution has to be that hope,\" Schatz told a news conference. With war raging in Gaza between Israel and Hamas, Israeli Prime Minister Benjamin Netanyahu said at a press conference this month that he objected to any Palestinian statehood that did not guarantee Israel's security.  The statement provoked international concern, including from Israel's biggest backer the United States. Washington maintains that the two-state solution is the only feasible way to bring lasting peace to the region. The only two Democratic senators who did not sign onto the amendment were John Fetterman and Joe Manchin. \nFetterman has long supported a two-state solution, but he believed the measure should include language stipulating the destruction of Hamas as a precondition to peace, an aide said. Manchin issued a statement, in which he said: \"Once a Palestinian government with its peoples’ best interests at heart agrees that Israel should be a state, I will be the first one to sign on to a bipartisan amendment supporting that Israel recognize a Palestinian state.\"Many of Biden's fellow Democrats in Congress have been pushing the administration to do more to address the steep toll on Palestinian civilians of Israel's campaign against Hamas since the militant group's deadly assault on Oct. 7."
}