{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0702X_L.jpg",
  "title": "Ignoring Taiwan's complaints, more Chinese balloons spotted over strait",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 07, 2024 09:44PM ET",
    "Updated Jan 07, 2024 10:30PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/ignoring-taiwans-complaints-more-chinese-balloons-spotted-over-strait-3268739",
  "paragraph": "© Reuters. FILE PHOTO: A person walks next to a fluttering Taiwanese flag outside the Sun Yat-Sen Memorial Hall in Taipei, Taiwan November 16, 2023. REUTERS/Carlos Garcia Rawlins/File Photo\nTAIPEI (Reuters) -Taiwan's defence ministry said it detected three more Chinese balloons flying over the Taiwan Strait on Sunday, one of which crossed the island, the latest in a spate of such balloons the ministry says it has spotted over the past month. The ministry on Saturday, in a strongly worded statement, accused China of threatening aviation safety and waging psychological warfare on the island's people with the balloons, days before key Taiwanese elections. China's defence ministry, which last month declined to comment on the balloons, did not immediately respond to a request for comment. The potential for China to use balloons for spying became a global issue last February when the United States shot down what it said was a Chinese surveillance balloon. China said the balloon was a civilian craft that accidentally drifted astray. Taiwan is on high alert for Chinese military and political activity ahead of this Saturday's presidential and parliamentary elections. It says China is exerting military and economic pressure in an attempt to interfere in the elections. China views the island as its own territory, a claim Taiwan's government rejects. Since last month Taiwan's defence ministry has reported several instances of Chinese balloons flying over the Taiwan Strait. It has said over the past week some balloons had flown over Taiwan island near major air bases. In the latest incident, revealed by the ministry on Monday in its daily report on Chinese military activities over the past 24 hours, it said three balloons had flown over the strait's sensitive median line on Sunday. However, only one crossed Taiwan island, right at its southern tip, according to a map the ministry provided. The balloons all headed east before vanishing, it added. On Monday, the ruling Democratic Progressive Party's (DPP) vice presidential candidate Hsiao Bi-khim said China should stop harassing Taiwan. \"We do not welcome the use of intimidation and threats to interfere with the lives of Taiwan's people at any time,\" she said. \"Not only this week, we hope peace and stability in the Taiwan Strait can continue for a long time.\" Speaking to reporters on Sunday, Jaw Shaw-kong, the vice presidential candidate for Taiwan's largest opposition party the Kuomintang (KMT), called for China to stop sending aircraft and warships in the strait with one week to go before the election.  \"Please allow the Taiwan Strait to remain peaceful and allow our election to be very gentle,\" Jaw said. \nThe Taiwan Strait's median line previously served as an unofficial barrier between Taiwan and China, but Chinese fighter jets, drones and now balloons regularly fly over it. China's Taiwan Affairs Office reiterated last week that the strait's median line \"does not exist\" and that Taiwan's ruling Democratic Progressive Party (DPP) is \"hyping up the threat from the mainland as the election approaches\" and inciting confrontation."
}