{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0B00M_L.jpg",
  "title": "Reactions to US, British strikes against Houthis in Yemen",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 11, 2024 07:47PM ET",
    "Updated Jan 12, 2024 11:18AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Ken Roth",
        "2024-01-12 06:30:35",
        "Since when do Iran care about international law.",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/reactions-to-us-british-strikes-against-houthis-in-yemen-3272947",
  "paragraph": "© Reuters. U.S. Representative Ro Khanna (D-CA) speaks during the Obama Foundation \"Democracy Forum\" in New York City, U.S., November 17, 2022. REUTERS/Brendan McDermid/File Photo\n(Reuters) - The United States and Britain launched a series of strikes on Yemen on Thursday aimed at the Iran-backed Houthi militia that started targeting international shipping in the Red Sea late last year.  Reactions included anger from Russia and Iran, support from U.S. allies and criticism from progressive Democrats in the U.S. Congress: RUSSIAN FOREIGN MINISTRY SPOKESWOMAN MARIA ZAKHAROVA \"The U.S. air strikes on Yemen are another example of the Anglo-Saxons' perversion of UN Security Council resolutions.\" Zakharova said the strikes showed a \"complete disregard for international law\" and were \"escalating the situation in the region\". Russia also called for an urgent meeting of the United Nations Security Council on Friday to discuss the issue. IRANIAN FOREIGN MINISTRY SPOKESMAN NASSER KANAANI: \"These attacks are a clear violation of Yemen's sovereignty and territorial integrity, and a breach of international laws. These attacks will only contribute to insecurity and instability in the region.” IRAN-BACKED HEZBOLLAH GROUP IN A STATEMENT: \"The American aggression confirms once again that the U.S. is a full partner in the tragedies and massacres committed by the Zionist enemy in Gaza and the region.\" SAUDI ARABIAN FOREIGN MINISTRY IN A STATEMENT: Called for restraint and \"avoiding escalation\" after the strikes and said it was monitoring the situation with \"great concern\". \"The kingdom emphasizes the importance of maintaining the security and stability of the Red Sea region, as the freedom of navigation in it is an international demand.\" DUTCH PRIME MINISTER MARK RUTTE \"The U.S.-British action is based on the right of self-defence, aims to protect free passage and is focused on de-escalation. The Netherlands, with its long history as a sea-faring country, places significant importance on the right of free passage and supports this targeted operation.\" U.S. HOUSE OF REPRESENTATIVES SPEAKER MIKE JOHNSON, REPUBLICAN “This action by U.S. and British forces is long overdue... (Iran and its proxies) must understand there is a serious price to pay for their global acts of terror and their attacks on U.S. personnel and commercial vessels. America must always project strength, especially in these dangerous times.\" U.S. SENATE FOREIGN RELATIONS COMMITTEE CHAIRPERSON BEN CARDIN, A DEMOCRAT \"I support President Biden’s decision to take precise action against these increasingly dangerous provocations that have threatened the interests of the U.S. and our allies, and welcome our coalition partners taking these actions with us. I look forward to continued consultation with the Administration on this decision, as required by law, and encourage the President to persist in his efforts to keep this conflict from spreading further in the region.\" DEMOCRATIC U.S. HOUSE PROGRESSIVE CAUCUS CHAIRPERSON REPRESENTATIVE PRAMILA JAYAPAL \n\"This is an unacceptable violation of the Constitution. Article 1 requires that military action be authorized by Congress.\"  (This story has been corrected to fix the spelling of Iran's foreign ministry spokesperson's name to Kanaani in paragraph 2)"
}