{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBR0DB_L.jpg",
  "title": "Congo rules out election re-run as observers flag irregularities",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Dec 28, 2023 08:34PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/congo-rules-out-election-rerun-as-observers-flag-irregularities-3264529",
  "paragraph": "© Reuters. Opposition supporters prepare to demonstrate, while riot police officers amass around Congolese opposition presidential candidate Martin Fayulu's headquarters to block a protest by the opposition who are calling for a re-run of last week's national electi\nBy Ange Kasongo KINSHASA (Reuters) -The government of the Democratic Republic of Congo (DRC) on Thursday refused opposition calls for a re-run of disputed elections, as the main observer mission reported \"numerous irregularities\" that could undermine some results.  Provisional results issued so far from the Dec. 20 general election show President Felix Tshisekedi with a commanding lead, but his opponents have demanded they be annulled, citing widespread issues with the roll-out and tabulation of the vote.  The dispute threatens to further destabilise Congo, which is already grappling with a security crisis in eastern areas. Congo is the world's top producer of cobalt and other industrial minerals and metals. In a new report on the presidential and legislative elections based on feedback from thousands of observers, the independent joint vote-monitoring mission of Congo's powerful Catholic Church and its Protestant Church said it had received 5,402 reports of incidents at polling stations, over 60% of which interrupted voting. The CENCO-ECC mission \"documented numerous irregularities likely to affect the integrity of the results,\" it said. In particular, it questioned the legality of the CENI election commission's decision to extend some voting beyond Dec. 20 and reported that voting was not wrapped up fully until Dec. 27.  The team of Moise Katumbi, one of Tshisekedi's main challengers, has ruled out using legal channels to contest results, asserting that state institutions were committed to tipping the vote in the president's favour. The CENI denies this.  He and other opposition heavyweights have called for a re-run, but government spokesperson Patrick Muyaya said on Thursday the opposition should wait until full results are published and challenge them in the courts if necessary. He said the government was committed to a fair and transparent election process and dismissed Katumbi's threat to hold further protests across the country, after police forcibly broke up a banned election march on Wednesday. \"The contesting of results does not take place in the streets. And we as a government will take steps to ensure that public order is maintained,\" Muyaya said. VOTE-COUNT OPACITY The CENI is due to release further provisional presidential results ahead of a Dec. 31 deadline. The latest showed Tshisekedi well-ahead of his 18 challengers, with just over 76% of around 12.5 million votes counted so far.  The CENI has not yet said how many of Congo's 44 million registered voters participated. It has so far processed the results of 46,422 polling stations out of 75,969, according to its latest tally. In addition to the election day issues, the opposition and independent observers say the CENI is failing to follow correct procedure for the tabulation and publishing of results. The CENI did not immediately reply to a request for comment. Symocel, a local civil society observer mission, wrote a letter to the CENI on Dec. 26 to flag reports from several provinces of CENI agents mishandling sensitive election materials and conducting election operations outside official centres. \"The rate of this phenomenon ... is so high and could irreversibly distort the results of the elections that your institution is gradually announcing,\" it said. \nSymocel's coordinator Luc Lutala confirmed the letter's authenticity on Wednesday and told Reuters \"there are as many problems with the election's roll-out as with the counting of the vote\". In its report, the CENCO-ECC mission urged the CENI only to publish results based on correctly consolidated tallies from local centres."
}