{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK130AI_L.jpg",
  "title": "Texas' Abbott, backed by fellow US Republican governors, remains defiant on border",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 04, 2024 06:08PM ET",
    "Updated Feb 04, 2024 06:40PM ET"
  ],
  "comments": [
    4,
    [
      [
        "Brad Albright",
        "2024-02-06 02:56:43",
        "Trump says presidents have immunity for actions undertaken in office, shouldn't Biden just have Abbot kidnapped?",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Mark Jannetty",
        "2024-02-06 10:21:07",
        "then he would be just like the Clintons",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Ken Roth",
        "2024-02-05 11:45:46",
        "Well it seems the republican will not even follow the rulings of their own supreme court.",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Mark Jannetty",
        "2024-02-05 15:41:34",
        "ruling states that the feds can remove the razor wire, not that Texas must remove it. It also does not prevent them from putting it back up. go gaslight on CNN",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Ken Roth",
        "2024-02-05 15:43:48",
        "Mark Jannetty",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Mark Jannetty",
        "2024-02-05 18:32:18",
        " they have the right. have you ever read the constitution?",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Barry Nickerson",
        "2024-02-05 23:55:19",
        "Old Joe certainly seems to continue doing things that the SCOTUS already ruled as unconstitutional.  Have any outstanding loans, Old Joe will buy your vote be making other taxpayers pay it off for you.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Brad Albright",
        "2024-02-06 02:59:43",
        "Mark Jannetty",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Mark Jannetty",
        "2024-02-05 10:59:48",
        "a governor following US constitution, Biden should try it for once",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Barry Nickerson",
        "2024-02-05 10:44:11",
        "Stand (Y)OUR Ground, Governor!",
        "https://www.investing.com/members/249373719"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/texas-abbott-backed-by-fellow-us-republican-governors-remains-defiant-on-border-3292118",
  "paragraph": "© Reuters. FILE PHOTO: Texas Governor Greg Abbott at a news conference. U.S. May 27, 2022. REUTERS/Marco Bello/File Photo\nBy Ted Hesson EAGLE PASS, Texas (Reuters) - Texas Governor Greg Abbott, joined by fellow Republican governors on Sunday, vowed to defy the Biden administration and maintain state control of a U.S. border hotspot \"as long as it takes.\" Abbott has clashed with Democratic President Joe Biden over the state's aggressive tactics to deter those crossing, including troops, concertina wire and a floating buoy barrier in the Rio Grande. The Biden administration has maintained that border control falls strictly under federal jurisdiction, but Abbott has deployed the Texas National Guard at Shelby Park in the border town of Eagle Pass, where he staged Sunday's news conference along with Republican governors from 13 other states. They stood in front of Texas state military vehicles, just paces away from shipping containers and concertina wire that block access to the park along the Rio Grande. Abbott said Shelby Park, which has been at the center of a standoff between state and federal officials, \"is going stay under control as long as it takes to maintain security and to eliminate crossings.\" \"We can relinquish control of it tomorrow if Joe Biden were to step up and do exactly what we're doing here and stop people from crossing the border illegally,\" Abbott told reporters. As he spoke, activists from opposite sites of the issue staged competing protests a short distance from the park. Several dozen immigrant rights activists and people opposed to illegal immigration demonstrated without incident. Four of the other governors spoke at the news conference: Bill Lee of Tennessee, Brian Kemp of Georgia, Greg Gianforte of Montana and Sarah Huckabee Sanders of Arkansas. They took turns accusing Biden of being weak on border security.  Immigration has become a potent political issue in the run-up to Nov. 5 elections that will likely pit Biden against former President Donald Trump. \nTrump has motivated his voting base with calls for more restrictive border policies. His critics say such policies and events such as a migrant convoy that preceded the rally could stoke tensions.  The governors gathered one day after hundreds of protesters from around the U.S. on Saturday flocked to the Texas border town of Quemado, about 20 miles (32 km) from Eagle Pass, to vent over illegal immigration and show support for Trump at a rally that blended border politics with religious rhetoric."
}