{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBS07H_L.jpg",
  "title": "Electricity in the air for one Cuban couple's two-wheeler wedding procession",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Dec 29, 2023 06:08AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/electricity-in-the-air-for-one-cuban-couples-twowheeler-wedding-procession-3264632",
  "paragraph": "5/5\n© Reuters. Daniley Aguiar, 21, and Reinier Lopez, 27, ride on an electric motorcycle after their marriage in Havana, Cuba, December 27, 2023. REUTERS/Alexandre Meneghini\n2/5\nBy Mario Fuentes and Alien Fernandez HAVANA (Reuters) - Wedding processions on wheels are nothing new along Havana’s famous seafront drive, the Malecon, but this week electric motorcycles and scooters joined a tradition that in the past has included horse-drawn carriages and vintage U.S. cars. The procession for one couple on Wednesday was a sign of the times in Communist-run Cuba as residents get resourceful amid an economic crisis that has all but paralyzed public transport, sent taxi prices through the roof and led to long lines to buy gasoline. The bride, 21-year-old Daniley Aguiar, said the couple were big fans of the electric vehicles, called “motos”, and so the unique procession was “something I always wanted to do.” Her groom, Reinier López, 27, said putting together a wedding on a budget was not easy given the daily challenges of shortages, inflation and deteriorating services. Electric two-wheelers have taken off with a buzz in recent years on the island, with help from the government. Imported vehicles are heavily taxed, with the exception of electric motorcycles, scooters, mopeds and bicycles and the government has a joint venture to assemble them in country with China’s Tianjin Motor Dies Co Ltd. The government reported around 100,000 electric two-wheelers were on the road at the start of 2023, compared to just a few five years ago. While a new car costs tens of thousands of dollars, a moto is a few thousand dollars. Most of Cuba’s 11 million residents make the equivalent of just a few thousand dollars per year, with some 40% supplementing that with remittances from abroad.  \nAlfredo Rodríguez, 50, and a member of the BigCuba Electric Motorcycle Association, said these days “it is sometimes impossible to find transportation.” Motos are big relief, he said, as the rider “simply charges it up at home and it takes you where you need to go.”"
}