{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK040K7_L.jpg",
  "title": "Factbox-What Israelis, Palestinians, US and others say about 'the day after' the Gaza war",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 05, 2024 12:57PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/factboxwhat-israelis-palestinians-us-and-others-say-about-the-day-after-the-gaza-war-3268385",
  "paragraph": "© Reuters. Smoke rises as Israeli military vehicles move inside central Gaza, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, January 5, 2024. REUTERS/Amir Cohen\n(Reuters) - As the conflict in Gaza nears a three-month milestone, Israelis, Palestinians, Americans and others have begun talking more openly about what comes next once the war is over. None of the plans being discussed will satisfy the desires of all of the parties but they do provide a framework for any negotiations that might emerge. Hamas killed 1,200 people and abducted 240 by Israel's count in a cross-border rampage from Gaza on Oct. 7. More than 22,000 Palestinians have died since in Israel's counterattack in Hamas-run Gaza, Palestinian health officials say. ISRAEL Israeli Defence Minister Yoav Gallant on Thursday became the latest participant in the conflict to lay out what he called a plan for the \"day after\".  It envisages Palestinian governance without Hamas, a multinational task force to rebuild the enclave, Egypt as a major player and Israel's army free to operate as needed to ensure Gaza no longer poses a security threat. \"Hamas will not govern Gaza, Israel will not govern Gaza's civilians. Gaza residents are Palestinian, therefore Palestinian bodies will be in charge, with the condition that there will be no hostile actions or threats against the State of Israel,\" he said in a statement. Prime Minister Benjamin Netanyahu has rejected a role for the Palestinian Authority, which exercises limited governance in the occupied West Bank, and Gallant offered few specifics on what Palestinian governance would look like. \"The entity controlling the territory will build on the capabilities of the existing administrative mechanism (civil committees) in Gaza – local non-hostile actors.\" Gallant said fighting would continue until the remaining 132 hostages return home, Israel dismantles Hamas' military and governing capabilities, and military threats are removed from the Gaza Strip. THE UNITED STATES Secretary of State Antony Blinken, who began a new Middle East diplomatic drive on Friday, will hold further discussions on how Gaza will be run if and when Israel achieves its goal of eradicating Hamas, which has run the Gaza Strip since 2007. \"What we have made clear that we want to see achieved long term is reunited West Bank and Gaza under Palestinian-led governance, and that is what we're working to achieve,\" State Department spokesperson Matthew Miller said on Thursday. \"We recognize that there will of course need to be some transition period, but that's the vision you will see the secretary advance in this trip over the coming week.” EGYPT Egypt, Israel's neighbour and partner to a 1979 peace treaty, has for years acted as go-between in Israeli negotiations with Hamas.  Its proposal that Hamas and the allied Islamic Jihad relinquish power for a permanent ceasefire was rejected by the two Palestinian militant groups, two Egyptian security sources said last month.  Egypt proposed elections while offering assurances to Hamas that its members would not be chased or prosecuted, but the Islamist group rejected any concessions other than hostage releases, the sources said. HAMAS In response to the Egyptian proposal, a Hamas official told Reuters that Gaza's future can only be determined by the Palestinians themselves, making any relinquishing of power under an Israeli threat unacceptable. \"Any arrangement in Gaza or in the Palestinian cause without Hamas or the resistance factions is a delusion,\" said Hamas chief Ismail Haniyeh in a televised speech last month. Hamas has said it would welcome a unity government with Fatah and other Palestinian factions, but its leaders have recently rejected it as a condition for a ceasefire and certainly not one dictated by Israel and the United States. PALESTINIAN AUTHORITY Palestinian President Mahmoud Abbas has called for an immediate end to the war in Gaza and an international peace conference to work out a lasting political solution leading to the establishment of a Palestinian state in the Gaza Strip, West Bank and East Jerusalem. In a Dec. 8 Reuters interview, he reiterated his longstanding position in favour of negotiation rather than armed resistance to end the longstanding occupation. A senior U.S. official said the idea of an international conference had been discussed among different partners but the proposal was still at a very preliminary stage. Abbas said that based on a binding international agreement, he would revive the weakened Palestinian Authority, implement long-awaited reforms and hold presidential and parliamentary elections, which were suspended after Hamas won in 2006 and later pushed the PA out of Gaza. \nAbbas did not give a concrete vision of a post-war plan discussed with U.S. officials under which the PA would take over control of the strip.  Netanyahu has said that Israel would not accept rule over Gaza by the Palestinian Authority as it stands."
}