{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0F046_L.jpg",
  "title": "US decries Nauru's 'unfortunate' ditching of Taiwan, warns on China's promises",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 15, 2024 11:18PM ET",
    "Updated Jan 16, 2024 04:46AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Ming Li",
        "2024-01-16 15:09:38",
        "The White Paper of the Government of the People's Republic of China states that on October 25, 1945, the Chinese government announced that it would \"resume the exercise of sovereignty over Taiwan\", and China therefore legally and de facto recovered Taiwan. After the Central People's Government of the People's Republic of China was established in 1949, it completed a regime change in the sense of international law. Therefore, as the only legal government of China, it has the right to exercise sovereignty over Taiwan.",
        "https://www.investing.com/members/250915125"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/us-decries-naurus-unfortunate-ditching-of-taiwan-warns-on-chinas-promises-3274549",
  "paragraph": "2/2\n© Reuters. Laura Rosenberger, chair at the Virginia headquartered American Institute in Taiwan (AIT), attends a press conference in Taipei, Taiwan January 16, 2024. REUTERS/Ben Blanchard\n2/2\nBy Ben Blanchard TAIPEI (Reuters) -The U.S. official who heads the body that handles unofficial ties with Taiwan on Tuesday decried Nauru's \"unfortunate\" decision to break ties with Taipei shortly after an election and warned that Beijing's promises often go unfulfilled. The Pacific, where tiny Nauru is located, has become a source of intense competition for influence between Washington which has traditionally viewed it as its backyard, and Beijing, which has targeted Taiwanese diplomatic allies there. China claims Taiwan as its own territory with no right to state-to-state ties, a position Taiwan strongly disputes. U.S. officials have previously expressed concern at China whittling away at Taiwan's allies, especially in Central America. After Nauru ended ties with Taiwan on Monday, just two days after a presidential election in Taiwan, the island is left with only 12 countries that formally recognise it.  Laura Rosenberger, chair of the Virginia-based American Institute in Taiwan (AIT), told reporters in Taipei that Nauru's move was \"unfortunate\" and the United States encourages all countries to expand engagement with Taiwan. \"While the government of Nauru's action is a sovereign decision, it is nonetheless a disappointing one,\" she said. \"The PRC often makes promises in exchange for diplomatic relations that ultimately remain unfulfilled,\" Rosenberger added, referring to the People's Republic of China.  The United States switched diplomatic recognition from Taipei to Beijing in 1979, but is Taiwan's most important international backer and a major arms supplier. Taiwan's government has said China specifically chose the timing just after Saturday's presidential election to move on Nauru. Taiwan's ruling Democratic Progressive Party's (DPP) Lai Ching-te won the election, as expected, and will take office on May 20. In the poll's run-up, China had repeatedly called him a dangerous separatist. Unusually, Nauru's statement mentioned United Nations Resolution 2758, passed in 1971 and which saw the Beijing government take Taipei's place at the U.N.'s China seat, as a reason for its decision.  Rosenberger said the resolution was being misinterpreted. \"UN Resolution 2758 did not make a determination on the status of Taiwan, does not preclude countries from having diplomatic relationships with Taiwan and does not preclude Taiwan's meaningful participation in the U.N. system,\" she said. \"It is disappointing to see distorted narratives about UN Resolution 2758 being used as a tool to pressure Taiwan, limit its voice on the international stage and limit its diplomatic relationships.\" Speaking in Beijing, Chinese foreign ministry spokesperson Mao Ning said the United States had \"slandered and discredited\" China's diplomatic system and \"openly criticised\" decisions made independently by a sovereign country. \"China is strongly dissatisfied with this,\" she told reporters. In the Pacific, only Palau, Tuvalu and the Marshall Islands now have official diplomatic relations with Taiwan. Rosenberger said she expected U.S. efforts to increase and expand engagement with Pacific Island nations to continue. Taiwan's government has accused China of offering large sums of money to Nauru. China's foreign ministry did not answer a question on that allegation on Monday, saying only that Nauru had made the \"right choice\". Nauru budget documents show two-thirds of government revenue last year came from fees paid by Australia to host a refugee processing centre, which began to be wound down in July.  Budget papers said funding from Australia for the centre was likely to end in 2026, having \"a significant impact on Nauru's economy.\" Australia said on Tuesday its funding for the refugee centre, which is a key part of its policy to deter asylum seekers arriving in Australian waters by boat, hasn't changed. \n\"Nauru remains an offshore processing facility. Funding arrangements for the management of that facility have not changed,\" a spokesperson for Home Affairs Minister Clare O'Neil said in a statement to Reuters. Australia's Pacific Minister Pat Conroy said Australia respects Nauru's decision and had been told in advance of the announcement, although there were no discussions about the decision."
}