{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK090PH_L.jpg",
  "title": "Vulcan rocket's debut brings long-awaited challenge to SpaceX dominance",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 26, 2024 01:58PM ET",
    "Updated Jan 26, 2024 04:00PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/vulcan-rockets-debut-brings-longawaited-challenge-to-spacex-dominance-3284537",
  "paragraph": "By Joey Roulette WASHINGTON (Reuters) - (This Jan. 10 story has been corrected to clarify the payload capacities of SpaceX's Falcon 9 and Falcon Heavy rockets in paragraph 12. A previous version erroneously stated that the two rockets have identical payload capacities)  A Boeing-Lockheed joint venture's launch of a new Vulcan rocket this week inaugurated a formidable rival to Elon Musk's SpaceX, a milestone long sought by the U.S. government as it seeks to build a list of launch suppliers for its satellites. Boeing (NYSE:BA) and  Lockheed Martin  (NYSE:LMT)'s United Launch Alliance sent Vulcan into space for the first time on Monday, a first step toward reclaiming market share from SpaceX, whose reusable Falcon 9 rocket for years has been the main option for countries to get their satellites into space. The payload, a privately funded moon lander, will not finish its mission because of tech problems, but the Vulcan launch in Florida was a success. \"This launch puts ULA in the front-runner position to challenge SpaceX's de facto monopoly over launch,\" said Caleb Henry, a space analyst at Quilty Analytics. \"If ULA can prove that Vulcan can scale up to a rapid launch cadence quickly, they will provide the market with another route to space.\" Dependence on SpaceX has been a concern for the Pentagon, which wants multiple vendors of rides to orbit. \"If SpaceX has a bad day in the future, we'd still have a pathway to space for our national security needs\" with Vulcan, said Michael Lembeck, a space consultant and director of University of Illinois Advanced Space Systems lab. Demand for launches has soared, driven mainly by plans from countries and companies like Amazon (NASDAQ:AMZN) to put thousands of internet satellites in space. But supply to the West has dropped, with Europe's sovereign space access held up by rocket development delays and Russia's rocket program being isolated by the West over the Ukraine war.  Bigger U.S. rockets, such as SpaceX's Starship and Blue Origin's New Glenn, are months or years from reaching orbit. \"It takes a long time to develop a new heavy-class launch vehicle, so the scarcity is going to be here for about 10 years,\" ULA CEO Tory Bruno said in an interview at Vulcan's launchpad before its launch. Vulcan's launch debut lets ULA start fulfilling a multibillion dollar backlog of some 70 missions, roughly split between government and commercial missions. Amazon's Kuiper satellite project occupies a majority of its commercial bookings. NATIONAL SECURITY MISSIONS The starting price for a Vulcan launch is roughly $110 million, half that of its predecessor Atlas (NYSE:ATCO) V, which anchored ULA's dominance for U.S. national security satellite launches since ULA's 2006 formation. SpaceX's reusable Falcon 9 is pegged at roughly $62 million per launch, but sometimes more for Pentagon missions. ULA and SpaceX vie head to head for national security missions. The Pentagon in 2020 picked ULA to launch 60% of its national security missions through 2027 and SpaceX to launch the rest. The Pentagon's next launch procurement will pick three core launchers, giving SpaceX and ULA a greater challenge. Vulcan can use up to six solid rocket motors for extra boost, allowing it to loft up to 60,000 pounds (27,000 kg) of satellites in a low orbit, or 32,000 pounds (14,500 kg) to further orbits. SpaceX's flagship Falcon 9 is slightly less powerful, but its more expensive Falcon Heavy - three Falcon boosters strapped together - can put up to 140,000 pounds (63,500 kg) to low Earth orbit, or 58,860 pounds (26,700 kg) to further orbits. ULA used the Russian-made RD-180 engines for its workhorse Atlas V, and that became a security concern in 2014 after Russia invaded Crimea. That, and the rise of SpaceX's cheaper Falcon 9, prompted Vulcan's development. Atlas V has 17 more booked missions left before retiring. ULA had bulk-ordered its RD-180 engines before American-Russian relations collapsed following Russia's large-scale February 2022 invasion of Ukraine. Jeff Bezos' space firm Blue Origin has effectively replaced Russia's RD-180, now supplying Vulcan's twin BE-4 engines, which roared to life on Monday and marked Blue Origin's first step into Earth's orbit. Blue Origin is building its own launcher - New Glenn - a more powerful rival to Vulcan that uses 7 BE-4 engines. ULA plans to increase production to 25 booster rockets annually by late 2025, Bruno said. And it has roughly 100 engineers designing future upgrades to cut production costs.  Those upgrades include a plan to recover and reuse Vulcan's BE-4 engines - about 65 percent of the booster cost - using a heat shield, parachutes and a helicopter to catch them out of the air. Smaller launcher Rocket Lab has adopted a similar strategy.  \nBruno said Vulcan upgrades will begin in 2025, and occur every two to three years after that. ULA will test and implement its reuse strategy for Vulcan in the midst of its Amazon Kuiper missions. \"It's is a little bit up to Amazon,\" Bruno said."
}