{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0T0NB_L.jpg",
  "title": "Explainer-What are US troops doing in the Middle East and where are they?",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 30, 2024 01:07PM ET",
    "Updated Jan 30, 2024 03:22PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/explainerwhat-are-us-troops-doing-in-the-middle-east-and-where-are-they-3287343",
  "paragraph": "2/2\n© Reuters. FILE PHOTO: Military vehicles with Jordanian and U.S. flags drive as part of the 'Eager Lion' military exercises, in Zarqa, Jordan September 14, 2022. REUTERS/Alaa Al Sukhni\n2/2\nWASHINGTON (Reuters) - Three U.S. soldiers were killed and dozens wounded after a drone hit a military outpost in Jordan, known as Tower 22, on Sunday. The location is just one of many bases the U.S. has in the Middle East. Here is what we know about the U.S. military presence in the Middle East: WHERE ARE US BASES IN THE MIDDLE EAST The U.S. has operated bases around the Middle East for decades. At its peak, there were more than 100,000 U.S. troops in Afghanistan in 2011 and over 160,000 personnel in Iraq in 2007.  While the number is far lower after withdrawal from Afghanistan in 2021, there are still about 30,000 U.S. troops scattered across the region. In addition, since the Israel-Gaza war began in October, the U.S. has temporarily sent thousands of additional troops in the region, including on warships.  The largest U.S. base in the Middle East is located in Qatar, known as Al Udeid Air Base and built in 1996. Other countries where the U.S. has a presence include Bahrain, Kuwait, Saudi Arabia and the United Arab Emirates (UAE). The U.S. has roughly 900 troops in Syria, in small bases like al Omar Oil field and al-Shaddadi mostly in the northeast of the country. There is a small outpost near the county's border with Iraq and Jordan, known as the Al Tanf garrison.  There are 2,500 personnel in Iraq, spread around facilities like Union III and Ain al-Asad air base, though talks are ongoing about the future of those troops.  WHY ARE US TROOPS STATIONED IN THE REGION? U.S. troops are stationed in the Middle East for different reasons and with the exception of Syria, they are there with the permission of each country's government.  In some countries like Iraq and Syria, U.S. troops are there to fight against Islamic State militants and are also helping advise local forces. But they have come under attack from Iran-backed forces over the past several years and have taken action against them.  Jordan, a key U.S. ally in the region, has hundreds of U.S. trainers and they hold extensive exercises throughout the year. In other cases, like in Qatar and the UAE, U.S. troops have a presence to reassure allies, carry out training and are used as needed in operations in the region. ARE THERE FOREIGN MILITARY BASES IN THE US? While Washington's allies sometimes send their troops to train or work with U.S. troops, there are no foreign military bases inside the U.S. TOWER 22 Tower 22, where Sunday's drone attack occurred, killing three Army Reserve soldiers, holds a strategically important location in Jordan, at the most northeastern point where the country's borders meet Syria and Iraq.  Specifically, Tower 22 is near Al Tanf garrison, which is located across the border in Syria, and which houses a small number of U.S. troops. Tanf had been key in the fight against Islamic State and has assumed a role as part of a U.S. strategy to contain Iran's military build-up in eastern Syria.  DO US BASES IN THE REGION GET ATTACKED OFTEN? U.S. bases are highly guarded facilities, including with air defense systems to protect against missiles or drones. Facilities in countries like Qatar, Bahrain, Saudi Arabia, Kuwait are not usually attacked.  \nBut U.S. troops in Iraq and Syria have come under frequent attack in recent years. Since Oct. 7, U.S. troops have been attacked more than 160 times by Iran-backed militia, injuring about 80 troops, even prior to Sunday's attack on Tower 22, which has injured around 40 more. A new wave of violence in the Middle East have erupted since Oct. 7 when Palestinian Islamist Hamas fighters burst into Israel and killed 1,200 Israelis and took 253 others hostage. In response, Israel unleashed a military campaign that left more than 26,000 dead and caused a severe humanitarian crisis in the densely populated Gaza Strip."
}