{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "US starts retaliatory strikes in Iraq and Syria against Iran-linked targets",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 02, 2024 04:23PM ET",
    "Updated Feb 03, 2024 05:45AM ET"
  ],
  "comments": [
    5,
    [
      [
        " ",
        "2024-02-03 11:56:56",
        "The reason why people don't make it in crypto is because they haven't made a good decision towards their investments, this man has been the only one that has helped me out in some of my trade which has really helped me alot I pray God bless him and your family write him in wAsPP +31612574318) 949494949494949494949494949494949494949494949464649494949494949494949494949494949494949494949494949494949494949",
        "https://www.investing.com/brokers/"
      ],
      [
        "santo rian",
        "2024-02-03 11:49:58",
        "Israhell and US are the main terrorist government in the world",
        "https://www.investing.com/members/238522390"
      ],
      [
        "Abe luber",
        "2024-02-03 10:00:51",
        "it's only to show you what to do about it and how you can make things easier and more difficult ",
        "https://www.investing.com/members/255731536"
      ],
      [
        "Japan Scenario",
        "2024-02-03 07:52:43",
        "All because the Saudis need to cut supply. Way to go Salman...",
        "https://www.investing.com/members/255574167"
      ],
      [
        "Midnight Trader",
        "2024-02-03 05:32:38",
        "Good job Biden. A calculated response not a knee jerk reaction from a hair on fire orange dictator!",
        "https://www.investing.com/members/131122"
      ],
      [
        "deeeeeez nuttttzzzzFJB",
        "2024-02-03 10:27:03",
        "You're lack of intelligence is astonishing. Everything is Donald's fault. NEVER the persons who's been president for almost 4 years now. LOL, you are part of the reason this country has gone down the toilet 🚻 ",
        "https://www.investing.com/members/242296557"
      ],
      [
        "Brad Albright",
        "2024-02-03 13:50:35",
        "He's not faulting Trump, he's crediting Biden. Another magabilly who cannot read for comprehension.",
        "https://www.investing.com/members/236251128"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/us-starts-retaliatory-strikes-in-iraq-syria-officials-3291791",
  "paragraph": "By Idrees Ali and Phil Stewart WASHINGTON (Reuters) -The U.S. military launched airstrikes on Friday in Iraq and Syria against more than 85 targets linked to Iran's Revolutionary Guard (IRGC) and the militias it backs, in retaliation for last weekend's attack in Jordan that killed three U.S. troops.  The strikes, which included the use of long-range B-1 bombers flown from the United States, were the first in a multi-tiered response by President Joe Biden's administration to the attack by Iran-backed militants, and more U.S. military operations were expected in the coming days.  While the strikes did not target sites inside Iran, they signaled a further escalation of conflict in the Middle East from Israel's nearly four-month-old war with Palestinian Hamas militants in Gaza. The strikes hit targets including command and control centers, rockets, missiles and drone storage facilities, as well as logistics and munition supply chain facilities, the U.S. military said in a statement. U.S forces hit more than 85 targets spanning seven locations, four in Syria and three in Iraq, said the military. The strikes targeted the Quds Force - the foreign espionage and paramilitary arm of the IRGC that heavily influences its allied militia across the Middle East, from Lebanon to Iraq and Yemen to Syria. U.S. Lieutenant General Douglas Sims, the director of the Joint Staff, said the attacks appeared to be successful, triggering large secondary explosions as the bombs hit militant weaponry, though it was not clear if any militants were killed. The Syrian Defense Ministry said that U.S. forces' \"blatant air aggression\" led to a number of civilians and soldiers being killed and others being wounded and some significant damage to public and private property. \"Occupying parts of Syrian lands by American forces cannot continue ... the Syrian army affirms continuing its war against terrorism until it is eliminated and is determined to liberate the entire Syrian territories from terrorism and occupation,\" the ministry said in a statement on Saturday. The Pentagon's Sims said the strikes were undertaken knowing that there would likely be casualties among those in the facilities. He added that the weather was a key factor in the timing of the operation.  The Iraqi military said the strikes were in the Iraqi border area and warned they could ignite instability in the region. \"These airstrikes constitute a violation of Iraqi sovereignty, undermine the efforts of the Iraqi government, and pose a threat that could lead Iraq and the region into dire consequences,\" Iraqi military spokesman Yahya Rasool said in a statement.  There was no public response yet from Iran. Iranian state television, in its report on the strikes, described the Americans as terrorist forces. MORE TO COME  Last weekend's Jordan attack was the first deadly strike against U.S. troops since the Israel-Hamas war erupted in October.  The United States has assessed that the drone that killed the three soldiers and wounded more than 40 other people was made by Iran, U.S. officials have told Reuters. \"Our response began today. It will continue at times and places of our choosing,\" Biden said in a statement. Earlier on Friday, Biden and Pentagon leaders attended the Dover (NYSE:DOV) Air Force Base in Delaware as the remains of the three soldiers were returned. U.S. Defense Secretary Lloyd Austin said Biden had directed additional action against the IRGC and those linked to it. \"This is the start of our response,\" Austin said. But the Pentagon has said it does not want war with Iran and does not believe Tehran wants war either, even as Republican pressure has increased on Biden to deal a blow directly. \"We do not seek conflict in the Middle East or anywhere else, but the president and I will not tolerate attacks on American forces,\" Austin said. The top Republican on the Senate Armed Services Committee, Roger Wicker, criticized Biden for failing to impose a high enough cost on Iran, and taking too long to respond.  Before the retaliatory strikes on Friday, Iranian President Ebrahim Raisi said that Iran would not start a war but would \"respond strongly\" to anyone who tried to bully it. White House national security spokesman John Kirby (NYSE:KEX) said the Biden administration had not communicated with Iran since the Jordan attack.  Iranian advisers assist armed groups in both Iraq, where the United States has around 2,500 troops, and Syria, where it has 900. U.S. troops have been attacked over 160 times in Iraq, Syria and Jordan since the deadly Hamas rampage in Israel that sparked the conflict on Oct. 7. In response to the Hamas attack, Israel has bombarded the Hamas-run Gaza Strip, leaving Palestinians in the enclave with few places to escape to. Houthi fighters in Yemen have been firing drones and missiles at ships in the Red Sea, which they say is intended to support Palestinians against Israel. Baghdad and Washington, meanwhile, have agreed to set up a committee to start talks on the future of the U.S.-led military coalition in Iraq, with the aim of setting a timetable for a phased withdrawal of troops and the end of the U.S.-led coalition against Islamic State. Kirby said the Iraqi government was notified about Friday's strikes ahead of time. \nIraq's shadowy Kataib Hezbollah, which is blamed by the U.S. for the Jordan attack, said on Tuesday it would pause attacks on U.S. forces.  But another Iran-backed Iraqi group, Nujaba, said it would continue launching attacks on U.S. forces in the region until the Gaza war ends and U.S. forces exit Iraq."
}