{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBQ01W_L.jpg",
  "title": "Whisky and the coal mining 'shack': Taiwan election is not only about China",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Dec 26, 2023 10:22PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/whisky-and-the-coal-mining-shack-taiwan-election-is-not-only-about-china-3263784",
  "paragraph": "By Ben Blanchard TAIPEI (Reuters) - As Taiwan's election approaches next month, it is not only fraught ties with China competing for electors' attention. The candidates are exchanging blows over everything from property disputes to whether drinking whisky is out of touch, in a raucous and freewheeling display of the island's democracy. Taiwan's Jan. 13 presidential and parliamentary election will define how the Chinese-claimed island deals with Beijing and the subject is indeed a major bone of contention.  But it is far from the sole issue debated at rallies, press conferences and on television talk shows where the uncensored exchanges are a major contrast to China, which says it is a socialist democracy but has been ruled only by the Communist Party since the founding of the People's Republic in 1949.  One subject taking much limelight in Taiwan is whether the childhood home of Lai Ching-te from the ruling Democratic Progressive Party (DPP) and currently frontrunner to be next president according to most polls, was illegally expanded by his family in an old coal mining area north of Taipei. Lai has denied anything untoward took place. But he has pledged to donate the tidy-looking house, which using Chinese-language wordplay on his name the opposition have called Lai's \"rascally shack\", so it can be turned into a miners' museum. \"I've seen that villagers in mining areas are worried the houses they've settled down in would be considered illegally built and be demolished. I'm very sorry about this. It is my responsibility to help everyone find a way to protect their housing rights,\" Lai said last week. The property ownership of the other two presidential candidates, Hou Yu-ih from the main opposition party the Kuomintang (KMT) and Ko Wen-je from the small Taiwan People's Party (TPP), have also garnered attention. The DPP has criticised Ko for co-owning farmland illegally turned into a parking lot, and Hou of profiting from renting out a large number of apartments his wife owns.  Ko has promised to tear up the parking lot. Hou has denied wrongdoing, and his wife said on Wednesday the apartments \"from beginning to end do not belong\" to him, denouncing \"political smears and suspicion\". Hou's running mate, the outspoken media personality Jaw Shaw-kong, said this week nobody was being forced to live in the apartments, many of which were rented to students. \"If people think they are too expensive then boycott them,\" Jaw told reporters. Illegally adding to buildings or putting farmland into other uses are not uncommon problems in Taiwan given the sometimes vague or unenforced regulations. JOHNNIE WALKER AND SARSAPARILLA  Lai has a lead of around 5 percentage points in most polls, though some have shown Hou only one or two points behind.  One focus for all three parties has been how to appeal to the young, with an estimated 1 million new voters eligible to cast ballots at this election. Ko has honed in on bread-and-butter issues like the high cost of housing, and young people have flocked to his rallies even if he has trailed in the polls. But the TPP has been attacked as out of touch with ordinary people for Ko's choice of running mate, Cynthia Wu, whose family is a major shareholder of conglomerate the Shin Kong Group. The TPP's opponents mocked Wu for comments at a vice presidential debate on Friday where she said \"when I was young, everyone loved to drink Johnnie Walker,\" referring to the popular Scotch whisky. Wang Ting-yu, a senior DPP lawmaker, shot back on his Facebook (NASDAQ:META) page that when he was young, \"we mostly drank plain water\". \nWu downplayed the furore.  \"Sarsaparilla, beer, guava juice and Johnnie Walker is for us Chinese what should be on the table to drink. OK? So there's no need to make a fuss about it,\" she told reporters."
}