{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0T0GU_L.jpg",
  "title": "Bolton says Trump 'unfit' to be President in new memoir intro",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 30, 2024 09:07AM ET",
    "Updated Jan 30, 2024 09:36AM ET"
  ],
  "comments": [
    11,
    [
      [
        "Trevor Roberts",
        "2024-02-01 07:53:41",
        "Deep deep state",
        "https://www.investing.com/members/208277112"
      ],
      [
        "Brad Albright",
        "2024-01-31 13:53:47",
        "\"I only hire the best people.\"",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Trevor Roberts",
        "2024-02-01 07:53:05",
        "Like desd Joe",
        "https://www.investing.com/members/208277112"
      ],
      [
        "Ken Roth",
        "2024-01-30 20:20:55",
        "Whats new the democrats have known this since Trump became president in 2016 and disgraced the office with his insane behaviour.",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Mark Jannetty",
        "2024-01-30 21:02:01",
        "and soon to be your president once again. Donald Trump 45 & 47🇺🇲",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Ken Roth",
        "2024-01-30 21:56:46",
        "Yes he will be president of D block prison area sharing soap with his proudboys maybe he can grab them by the P….",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Tom Shupper",
        "2024-01-30 17:21:06",
        "Bolton sounds like a typical Swamp spokesman, or Rino McConnell pal!",
        "https://www.investing.com/members/207777318"
      ],
      [
        "Tre Hsi",
        "2024-01-30 16:57:22",
        "\"Trump really cares only about retribution for himself....\"  - it's pretty funny even at this stage all the republicans still think Trump cares more about the country/GOP than himself.......",
        "https://www.investing.com/members/203741693"
      ],
      [
        "Steve Bojo",
        "2024-01-30 15:41:03",
        "The war monger prefers another war monger.",
        "https://www.investing.com/members/230737142"
      ],
      [
        "Frank Garner",
        "2024-01-30 15:26:30",
        "Disgruntled employee?",
        "https://www.investing.com/members/207392939"
      ],
      [
        "Tre Hsi",
        "2024-01-30 16:58:45",
        "yes, but is he wrong?",
        "https://www.investing.com/members/203741693"
      ],
      [
        "Mark Jannetty",
        "2024-01-30 17:03:35",
        " yes, since he was the best president in over 30 years ",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Tre Hsi",
        "2024-01-31 14:06:42",
        "Mark Jannetty",
        "https://www.investing.com/members/203741693"
      ],
      [
        "EL LA",
        "2024-01-30 15:19:46",
        "The rats on the ship are becoming agitated.",
        "https://www.investing.com/members/240182636"
      ],
      [
        "Dave Stewart",
        "2024-01-30 15:12:54",
        "John Bolton sounds scared. Trump has been the recipeint of politically motivated and targeted hate. I pray he wins in 2024.",
        "https://www.investing.com/members/227656672"
      ],
      [
        "Peng Zhong Wong",
        "2024-01-30 15:04:29",
        "just use bleach to kill any virus",
        "https://www.investing.com/members/236430529"
      ],
      [
        "Mark Jannetty",
        "2024-01-30 16:05:37",
        "find me the clip where he said that. Stop getting your information from the view. Total misquote ",
        "https://www.investing.com/members/241633026"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/bolton-excoriates-trump-in-fresh-introduction-to-his-memoir-3287080",
  "paragraph": "2/2\n© Reuters. John Bolton, a former White House national security adviser, speaks to journalists at a forum in Taipei, Taiwan April 29, 2023. REUTERS/Ben Blanchard/File Photo\n2/2\nBy Arshad Mohammed and Steve Holland WASHINGTON (Reuters) -Former U.S. National Security Adviser John Bolton excoriated former President Donald Trump as an utterly self-interested man who would punish personal enemies and appease adversaries Russia and China in a new edition of his memoir released on Tuesday. Bolton, who served in Trump's White House in 2018 and 2019, accused the Republican presidential frontrunner of having no political philosophy or coherent policy outlook. If re-elected, Trump could leave the NATO security alliance, curb support to Ukraine despite Russia's 2022 invasion, embolden China to blockade Taiwan and generally pursue isolationism, Bolton warned. \"Trump is unfit to be president,\" Bolton wrote in the new foreword to \"The Room Where it Happened,\" his account of the 17 months he spent as Trump's national security adviser. \"If his first four years were bad, a second four will be worse.\" While Trump casts himself as the underdog's champion, once saying \"for those who have been wronged and betrayed, I am your retribution,\" Bolton argues he is fundamentally self-regarding. \"Trump really cares only about retribution for himself, and it will consume much of a second term,\" he wrote in the forward to the paperback edition of his memoir, which painted a bleak picture of America during a second Trump term. Trump senior advisor Jason Miller said: “For someone who professes to have such great disdain for President Trump, ‘Book Deal Bolton’ sure has found a way to grift off the relationship\".  Bolton said before serving Trump he mistakenly believed the burdens of office would discipline the president. In the event, he found the former president consumed by self-interest. \"He cares almost exclusively about his own interests,\" Bolton writes, suggesting Trump would want to be surrounded by \"a White House of serfs\" to execute his orders unquestioningly. He also makes a case that Trump, revered by the right for appointing Supreme Court justices who overturned the 1973 Roe v. Wade ruling that recognized women's constitutional right to abortion, may not pursue conservative policies if re-elected. Bolton said Trump's inability to run for a third term under the U.S. Constitution means \"the political constraints around him are much looser, and the real 'guardrail' of voter opinion will be minimized.\" Bolton saves some of his harshest words for foreign policy, writing Trump sent an \"isolationist virus\" coursing through the Republican party and that \"in no arena ... has the Trump aberration been more destructive than in national security.\" He also argued Trump could withdraw from the North Atlantic Treaty Organization (NATO), a prospect likely to please Russian President Vladimir Putin, adding that \"it is almost inevitable that a second-term Trump policy on Ukraine will favor Moscow.\" \nTaiwan and others along China's periphery \"face real peril in a second Trump term,\" Bolton adds, suggesting that the risks of China under President Xi Jinping manufacturing a crisis over Taiwan - perhaps by blockading the island - would rise. \"It is a close contest between Putin and Xi Jinping who would be happiest to see Trump back in office,\" he writes."
}