{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK020J0_L.jpg",
  "title": "Russia and Ukraine stage major POW exchange after UAE mediation",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 03, 2024 12:26PM ET",
    "Updated Jan 03, 2024 10:56PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/russia-and-ukraine-stage-big-pow-exchange-after-uae-mediation-3266584",
  "paragraph": "5/5\n© Reuters. Ukrainian prisoners of war (POWs) pose after a swap, amid Russia's attack on Ukraine, at an unknown location in Ukraine, in this handout picture released January 3, 2024. Head of Ukraine's Presidential Office Andriy Yermak via Telegram/Handout via REUTERS\n2/5\nKYIV (Reuters) - Ukraine and Russia on Wednesday announced their first exchange of prisoners of war in nearly five months, with more than 200 freed by each side after what both said was a complex negotiation involving mediation by the United Arab Emirates. Russia's Defence Ministry said 248 military personnel had been handed over by Ukraine. Kyiv said it had brought home 230 people - 224 soldiers and six civilians - in what it said was the largest documented swap of troops so far. The UAE's foreign ministry acknowledged its role, saying in a statement that the swap was made possible by its \"strong friendly relations\" with both Moscow and Kyiv. It offered both further humanitarian efforts and to find a peaceful solution to the war. A video released by Ukrainian authorities showed returning prisoners draped in the country's blue and yellow flag filing off a bus, singing the national anthem and shouting the patriotic greeting \"Glory to Ukraine\". Most, but not all, appeared to be in good health. . One returnee shouted: \"We are home! You didn't forget us!\" The Russian Ministry of Defence released a similar video of returning uniformed prisoners arriving in Belgorod in buses. \"I'll be home in five hours, roughly speaking, that's going to be a joy,\" said one unnamed man. Despite a lack of talks on how to end the 22-month war, Kyiv and Moscow have held many prisoner swaps since the early months of Russia's invasion in February 2022.  But the rate of the exchanges dropped in 2023 and the last one until this week's was in August. Kyrylo Budanov, head of Ukraine's HUR Military Intelligence agency, singled out the UAE's \"direct role\", saying: \"After a significant amount of time, we managed to carry out a very difficult prisoner swap.\" President Volodymyr Zelenskiy said it was \"truly a great day for Ukraine\" and vowed to press on with further swaps facilitated by expanding what he called an \"exchange fund\" of captured Russian soldiers. \"The more Russians we capture, the more effective the negotiations regarding swaps will be,\" he said in his nightly video address. He said some of the returnees had been previously listed as missing. Ukraine's returnees came from various branches of its armed forces and included participants in the nearly three-month defence of the Azovstal steel plant in the port of Mariupol before it was captured by Russian forces in May 2022. \nOn the Russian side, a Defence Ministry statement said its released prisoners would undergo medical checks and treatment. Russia's Commissioner for Human Rights, Tatyana Moskalkova, thanked President Vladimir Putin and the military and intelligence services for their efforts in the exchange."
}