{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "Israeli hostage families gain clout as political landscape shifts",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 05, 2024 06:20AM ET",
    "Updated Feb 05, 2024 06:58AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/israeli-hostage-families-gain-clout-as-political-landscape-shifts-3292521",
  "paragraph": "By Emily Rose and Estelle Shirbon JERUSALEM/LONDON (Reuters) - When pollsters asked a representative sample of the Israeli public in January to name anyone they would like to see entering politics, relatives of hostages held by Hamas in Gaza were among the names that cropped up most often. The previously unreported survey, seen by Reuters, shows the families' appeal to Israelis who would like to see political change, at a time when Prime Minister Benjamin Netanyahu's popularity is at rock bottom. This is part of a wider transformation of Israel's political landscape precipitated by the Oct. 7 Hamas attack, and likely to accelerate when the most intense phase of the Gaza war ends and a reckoning for the security failures of that day begins. \"The hostage protests are a pivotal point for other types of protests against the government to emerge,\" said Nimrod Nir, political psychologist at the Truman Research Institute of the Hebrew University of Jerusalem, which conducted the survey. One of the names mentioned by respondents was Gil Dickmann, a cousin of hostage Carmel Gat and an active figure in the Hostages Families Forum campaign group. Another was Jonathan Shamriz, whose brother Alon was one of three hostages mistakenly shot dead by Israeli forces in Gaza on Dec. 15, and who has become an outspoken government critic. \"I will do what I need to in order to fix this country. If that means going into politics, then I'll have to see,\" he told Reuters. Some respondents did not mention names but wrote variants of \"hostage families\", reflecting the impact of the Forum itself and its \"Bring them home now\" campaign. Hamas militants killed 1,200 people in southern Israel and abducted 253 in their Oct. 7 incursion, according to Israeli tallies. Israel has responded with an all-out military assault on the Hamas-ruled Gaza Strip that has killed more than 27,000 Palestinians there, according to local health officials. LEFT-RIGHT DIVIDE The Forum and most individual relatives of hostages have been trying to avoid partisan politics or confrontation with the right-wing coalition government while the lives of their loved ones hang in the balance. \"Our struggle right now is not a political struggle,\" said Elad Or, whose brother Dror is in Hamas captivity. Dror's wife Yonat was killed. The couple's two teenage children were held hostage until Nov. 25 when they were freed during a brief truce. Mirroring the restraint of the families, who inspire huge public empathy, Netanyahu has mostly avoided overtly criticising them, although frustrations have mounted on both sides. Protests by relatives outside his house have irked Netanyahu. He lashed out during a Jan. 27 news conference that such actions \"only strengthen the demands of Hamas\".  During the week-long truce in late November, Hamas freed more than 100 Israeli and foreign hostages in exchange for Israel releasing about 240 Palestinian prisoners. Since then, the issue of what price Israel should pay to get the more than 100 remaining hostages back, and how to balance that goal against its other stated war objective, to destroy Hamas, has become increasingly polarising. Negotiations between Israel and Hamas on a ceasefire and hostage deal, mediated by Qatar and Egypt and backed by the United States, are ongoing but the outcome is uncertain. Netanyahu, who faces rifts within his fractious coalition over terms for a deal, said on Sunday Israel was not ready to accept any price for the hostages. Polls by the Truman Institute and the Israel Democracy Institute (IDI) show a sharp left-right split on the issue.  On the left, support for a deal with Hamas involving concessions such as a ceasefire or prisoner release in exchange for the hostages is much higher, while on the right opposition to such a deal and support for continuing the war are stronger. Political scientist Tamar Hermann of the IDI said solidarity with the hostage families was blending with broader anti-government sentiment, partly rooted in a huge pre-war protest movement against Netanyahu's plan to overhaul the judiciary. KIBBUTZ FACTOR A large proportion of the Gaza captives come from kibbutzim, communities that have deep historical links with the political left. New or existing left-wing parties could be a natural fit for any hostage relatives who did decide to go into politics. Asked whether his party wanted to recruit any of them, Tomer Reznik, secretary-general of left-wing Meretz, said it was reorganising itself for the next election and part of this would be finding new candidates \"relevant to the current situation\". Conversely, the hostage families are seen as opponents by some on the right, and especially on the ultra-nationalist far right, which has sway over Netanyahu because it is part of his fragile coalition. Two far-right ministers implacably opposed to a deal with Hamas could bring down his government at any moment. Some of Netanyahu's hard-right supporters in politics and media portray the hostage families as leftists abusing public sympathy to further their anti-government agenda, said political scientist Gideon Rahat of the Hebrew University. One tactic, he said, was to amplify the voices of a tiny number of far-right hostage relatives who oppose any deal with Hamas, such as Eliyahu Libman, a settler from Kiryat Arba in the Israeli-occupied West Bank, whose son Elyakim is held hostage.  \nLibman has argued that Israel must destroy Hamas, no matter the cost, so that no Israeli is harmed by it in future. \"My son is the most important thing in the world to me but the state of Israel is also the most important thing in the world to me,\" he said on Channel 13 TV."
}