{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "US military strikes two Houthi anti-ship missiles in Yemen",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 23, 2024 10:36PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-military-strikes-two-houthi-antiship-missiles-in-yemen-3281204",
  "paragraph": "By Phil Stewart WASHINGTON (Reuters) -The U.S. military carried out more strikes in Yemen early on Wednesday, destroying two Houthi anti-ship missiles that were aimed at the Red Sea and were preparing to launch, the U.S. military said in a statement. The U.S. strikes, which took place at roughly 2:30 a.m. (2330 GMT), are the latest against the Iran-backed group over its targeting of Red Sea shipping, and followed a larger round of strikes a day earlier. The Houthis, who control the most populous parts of Yemen, have said their attacks are in solidarity with Palestinians as Israel strikes Gaza. The attacks have disrupted global shipping and deepened concern that fallout from the Israel-Hamas war could destabilize the Middle East. \"U.S. forces identified the missiles in Houthi-controlled areas of Yemen and determined that they presented an imminent threat to merchant vessels and the U.S. Navy ships in the region,\" the U.S. military's Central Command said in a statement. \"U.S. forces subsequently struck and destroyed the missiles in self-defense.\" Since the United States started striking Houthi military sites in Yemen on Jan. 11, the Pentagon says it has destroyed or degraded over 25 missile launch and deployment facilities and more than 20 missiles. It says it has also struck drones, coastal radar and Houthi air surveillance capabilities as well as weapon storage areas. \"We have been very focused on targeting the kinds of things that they've been employing or using to conduct attacks against international shipping and mariners, and that will continue to be our focus,\" Pentagon spokesperson Major General Patrick Ryder told a news briefing on Tuesday. Ryder noted that the last Houthi attack was Jan. 18, suggesting the strikes were having an impact. \"Since that time we have taken several self-defense strikes, when there was an imminent threat or an anticipated launch,\" he said. Biden's emerging strategy on Yemen aims to weaken the Houthi militants but stops well short of trying to defeat the group or directly confront Iran, the Houthis' main sponsor, experts say. The strategy - a blend of limited military strikes and sanctions - appears aimed at punishing the Houthis while attempting to limit the danger of a wider Middle East conflict."
}