{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK101MS_L.jpg",
  "title": "Exclusive-US believes drone that killed soldiers was Iranian-made, sources say",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 01, 2024 09:17AM ET",
    "Updated Feb 01, 2024 12:26PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Mark Jannetty",
        "2024-02-01 14:56:37",
        "paid for by the Biden administration ",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Adrian White",
        "2024-02-02 08:13:16",
        "The Administration doesn't pay for anything. Congress does. ",
        "https://www.investing.com/members/202315569"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/exclusiveus-believes-drone-that-killed-soldiers-was-iranianmade--sources-3290093",
  "paragraph": "© Reuters. FILE PHOTO: Satellite view of the U.S. military outpost known as Tower 22, in Rukban, Rwaished District, Jordan October 12, 2023 in this handout image. Planet Labs PBC/Handout via REUTERS/File Photo\nBy Phil Stewart and Idrees Ali WASHINGTON (Reuters) -The United States has assessed that Iran manufactured the drone that slammed into a U.S. base in Jordan over the weekend, killing three American soldiers and wounding more than 40, four U.S. officials told Reuters. Washington has blamed the attack - the first to kill U.S. troops in the Middle East since the start of the Israel-Hamas war in October - on Iran-backed militants, and President Joe Biden's administration has promised a multi-tiered response that will include strikes. But it has stopped short of publicly saying where the actual weapon that killed the Americans came from, even as it acknowledged Iran's ultimate responsibility for funding and even in some cases training the militants responsible. The officials, who spoke to Reuters on condition of anonymity, did not provide the model of the drone and said analysis was still ongoing. While the initial indications were that the drone was likely Iranian, a formal assessment was made only recently after recovering fragments of the drone.  U.S. Defense Secretary Lloyd Austin, asked about the matter at a news briefing following the Reuters report, stopped short of confirming the drone's origin. \"We're still doing the forensics,\" Austin said. \"But most of the drones that are in the region have a connection with Iran. So ...\"  Austin said he didn't know whether Iran knew about the attack ahead of time, but added that, in his view, it didn't matter. \"How much Iran knew or didn't know, we don't know. But it really doesn't matter because Iran sponsors these groups, it funds these groups, and in some cases, it trains these groups on advanced, conventional weapons,\" he said. Kataib Hezbollah, a pro-Iranian militia based in Iraq, said on Tuesday it was suspending military actions against the United States to avoid embarrassing the Baghdad government. Biden's administration said it was not seeking a war with Iran, even as Republican pressure on him to respond forcefully has been rising.  Iranian officials have said Tehran will respond to any threat from the United States. Iran's envoy to the U.S. said Tehran would respond decisively to any attack on its territory, its interests, or Iranian nationals outside its borders.  U.S. troops have been attacked more than 160 times in Iraq, Syria and Jordan since the events of Oct. 7 that triggered the war in Gaza, and warships have seen attacks in the Red Sea as well. Houthi fighters in Yemen have fired drones and missiles at them on the Red Sea ins solidarity with the Palestinians. Amid expectations of multiday strikes, Austin suggested it would take a multitiered response to address threats by Iran-backed groups against U.S. forces. \"I don't think the adversaries are of a one-and-done mindset,\" Austin told reporters. \"And so, they have a lot of capability. I have a lot more. ... We're going to do what's necessary to protect our troops and our interests.\" The attack in Jordan, and any U.S. response, is likely to stoke fears of wider conflict in the Middle East following the Oct. 7 raid in southern Israel by the Palestinian Islamist group Hamas in which the Israeli authorities said 1,200 people were killed and 253 taken hostage. Israel's subsequent assault on Gaza has killed over 27,000 Palestinians, according to the local health ministry. \nThe United States has already retaliated in Iraq, Syria and Yemen in response to previous attacks by Iran-backed groups. Experts have cautioned that any strikes against Iranian forces inside Iran could force Tehran to respond, escalating the situation in a way that could drag the United States into a major Middle East war."
}