{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK07095_L.jpg",
  "title": "Japan quake survivors, without power or water, seek news on rebuild plans",
  "category": "Commodities news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 08, 2024 03:54AM ET",
    "Updated Jan 08, 2024 09:13AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/commodities-news/japan-quake-survivors-without-power-or-water-seek-news-on-rebuild-plans-3268909",
  "paragraph": "3/3\n© Reuters. Traffic cones are arranged along a road damaged by the January 1 earthquake in Nishiaraya, Ishikawa Prefecture, Japan January 8, 2024. REUTERS/ Joseph Campbell\n2/3\nBy Chris Gallagher and Joseph Campbell NISHIARAYA, Japan (Reuters) - A week after a major earthquake struck the west coast of Japan, thousands of people are still without water and electricity and have yet to be told when plans to rebuild can begin. The magnitude 7.6 quake killed at least 168 people on New Year's Day with 323 reported missing. Sub-zero temperatures and heavy snow and rain have hampered the delivery of aid, leaving thousands with diminishing supplies and little information. Mudslides, boulders and cracks in the road have buried homes and blocked access routes. Those living in areas that escaped the greatest damage, such as Nishiaraya, a village of 1,000 people on the outskirts of Kanazawa, brave the snow to collect drinking water. “When will reconstruction begin? When will temporary housing be built? We’re not getting any information,” said Nishiaraya resident Hiroe Kawabe. \"If we can’t live here we need to think about leaving. We want information on how long it will take.” Prime Minister Fumio Kishida said on Monday that 500 people could be temporarily housed in a sports centre in Kanazawa but said more evacuation centres were needed. He said the government was also working to find hotel rooms for evacuees. On Friday, Kishida said that the government would tap 4.74 billion yen ($32.77 million) of budget reserves for reconstruction efforts. But the weather makes reconstruction a dangerous task and more snow and rain are expected in coming days. Nishiaraya fire department chief Hisashi Ida said the biggest risk was not being able to plough the snow. “Machines won't be able to get in and walking on bumpy parts where snow has accumulated will cause injuries. I think this will be a 'secondary disaster' and I am worried.” \nJapan sits on the \"Ring of Fire\" arc of volcanoes and oceanic trenches that partly encircles the Pacific Basin. It accounts for about 20% of the world's earthquakes of magnitude 6 or greater. The New Year's Day quake was Japan's deadliest since 2016 when 276 people were killed in a quake that hit the southwestern region of Kumamoto."
}