{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0400B_L.jpg",
  "title": "Crews begin clearing plane wreckage from Japan runway collision",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 04, 2024 09:06PM ET",
    "Updated Jan 05, 2024 04:21AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/crews-begin-clearing-plane-wreckage-from-japan-runway-collision-3267746",
  "paragraph": "3/3\n© Reuters. Officials investigate a burnt Japan Coast Guard aircraft after a collision with Japan Airlines' (JAL) Airbus A350 plane at Haneda International Airport in Tokyo, Japan January 3, 2024. REUTERS/Issei Kato\n2/3\nBy Rocky Swift, Kaori Kaneko and Daniel Leussink TOKYO (Reuters) -Crews at Tokyo's Haneda Airport began clearing the charred wreck of a Japan Airlines plane from a runway on Friday, as investigators sought to retrieve its cockpit voice recorder to discover what caused its deadly collision with a Coast Guard aircraft. The Japan Airlines (JAL) widebody jet collided with a Coast Guard turboprop on the runway while landing in Tokyo on Tuesday. All 379 people on the JAL aircraft escaped before it was engulfed in flames, but five of the six crew on the Coast Guard craft died. Excavators equipped with cutting equipment ripped off the Airbus A350's wing, while another lifted debris from inside the burnt-out cabin into a large lorry as around a dozen personnel in white overalls and hard hats watched on. Officials have not yet retrieved the cockpit voice recorder from the JAL plane but have recovered the flight data recorder and both recorders from the Coast Guard wreck, said the Japan Transport Safety Board (JTSB), which is leading an investigation by transport agencies into the crash. Officials aim to complete the removal of the wreckage by Jan. 7 and it will be taken to its hangar for inspection, broadcaster TBS reported. Haneda, the world's third-busiest airport, has seen hundreds of flights cancelled or delayed since the crash. The runway where the accident happened is expected to reopen on Jan. 8 if clearance operations go as planned, the transport minister said on Friday.  Additional personnel tasked with monitoring radar systems will reinforce the airport from Saturday as an emergency precautionary measure, the minister added. As well as the investigation into the crash by transport authorities, Tokyo police are looking into possible professional negligence contributing to the accident, several local media outlets have reported.  The captain of the Coast Guard aircraft, the sole survivor, is under scrutiny after authorities released control tower transcripts appearing to show he was ordered to enter a holding area near the runway before the crash occurred. He said he had permission to enter the runway, the Coast Guard said on Wednesday, acknowledging there was no indication of that in the transcripts. The captain suffered severe burns as a result of the crash and could not be reached for comment. EMERGENCY TRIP The Coast Guard plane was making its third emergency trip to an earthquake zone within 24 hours when the collision occurred. On the day of the accident, Haneda was at full capacity, authorities have said. Authorities have only just begun their investigations and aviation experts say it usually takes the failure of multiple safety guardrails for an airplane accident to happen. The Coast Guard plane was on the runway for 40 seconds before the crash, local news outlets reported. A Civil Aviation Bureau official said they were aware of the reports but hadn't confirmed this. \"We are checking it currently,\" the official said. \nU.S. aviation safety officials will provide assistance to Japan in the reading of airplane recorders to get a clearer idea of what caused the deadly collision, according to the head of the main U.S. transport regulator. The collision marked the first time a modern lightweight airliner has burnt down and is being seen as a test case for how well a new generation of carbon-composite airplanes copes with a catastrophic fire."
}