{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0J01I_L.jpg",
  "title": "New mosque construction in India's Ayodhya to begin in May, Muslim group says",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 21, 2024 11:09PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/new-mosque-construction-in-indias-ayodhya-to-begin-in-may-muslim-group-says-3279075",
  "paragraph": "2/2\n© Reuters. FILE PHOTO: A view of a site that was allotted by authorities for a new mosque, about 15 miles from the Hindu Ram Temple, in Ayodhya in the northern state of Uttar Pradesh, India, November 23, 2023. REUTERS/Anushree Fadnavis/File Photo\n2/2\nBy Shivam Patel NEW DELHI (Reuters) -As Hindu devotees prepare to inaugurate a grand temple to one of their holiest deities, India's minority Muslims plan to begin building a new mosque in the same city later this year, hoping to make a fresh start after a bloody, decades-long dispute. Haji Arfat Shaikh, the head of the development committee of the Indo-Islamic Cultural Foundation (IICF) that is overseeing the mosque project, said this week that construction would begin in May, after the holy month of Ramadan, and the mosque would take three to four years to build. Hindu zealots razed a 16th century mosque in the northern Indian city of Ayodhya in 1992, saying that it was built over an ancient temple on the site that marked the birthplace of Hindu god-king Ram. The dispute had scarred relations between the communities for decades and the destruction of the mosque sparked nationwide riots that killed 2,000 people, mostly Muslims. India's top court said in 2019 that the razing of the mosque was unlawful, but ruled that evidence showed there was a non-Islamic structure beneath it. It ordered that the site be given to Hindu groups to build a temple and Muslim community leaders be given land elsewhere in the city for constructing a mosque. While construction of the $180 million temple began within months and the first phase is set to open on Monday, Muslim groups have struggled to raise funds and begin work at a desolate site about 25 km (15 miles) away. \"We hadn't approached anyone ... there was no public movement for it (funds),\" said Zufar Ahmad Faruqi, the president of the IICF. Hindu groups aligned with Prime Minister Narendra Modi's Bharatiya Janata Party (BJP) began seeking donations more than three decades back and have collected more than 30 billion rupees ($360 million) from 40 million people in India.  The mosque project was delayed also because it had to be redrawn to add more traditional elements in the structure, like minarets, said Athar Hussain, a secretary at the IICF. A 500-bed hospital has also been planned in the complex. A crowd-funding website is expected to be launched in the coming weeks, said Shaikh, who is also a BJP leader. The mosque has been named \"Masjid Muhammed bin Abdullah\" after Prophet Mohammad, moving away from \"Babri Masjid\" or mosque as the disputed structure was called, after the emperor Babur who established the Mughal empire. \n\"Our effort has been to end and convert enmity, hatred among people into love for each other...irrespective of whether or not you accept the Supreme Court judgement,\" said Shaikh. \"All this fighting will stop if we teach good things to our children and people\".  ($1 = 83.0550 Indian rupees)"
}