{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0I098_L.jpg",
  "title": "Gaza doctor amputates niece's leg at home, without anaesthesia",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 19, 2024 04:25AM ET",
    "Updated Jan 19, 2024 04:31AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/gaza-doctor-amputates-nieces-leg-at-home-without-anaesthesia-3277962",
  "paragraph": "3/3\n© Reuters. Hani Bseiso, a Palestinian doctor who performed a leg amputation on his niece, A'hed Bseiso, at home without anaesthesia, speaks during an interview with Reuters nearly a month after the procedure, in Gaza City, Gaza, January 17, 2024 in this screen grab \n2/3\nGAZA (Reuters) - Palestinian doctor Hani Bseiso faced an agonising decision when his teenage niece was wounded by Israeli shelling of her Gaza City home: amputate her leg or risk her bleeding to death. Unable to reach a nearby hospital, and using little more than a pair of scissors and some gauze he had in his medical bag, he removed the lower part of A'Hed Bseiso's right leg in an operation carried out on the kitchen table without anaesthetic.  Grainy video footage that went viral on Instagram shows him wiping the bloody stump of her right leg as she lies on the table. One of her brothers holds her steady, another holds up two mobile phones to provide better lighting. The house is only 1.1 miles (1.8 km) from Gaza's Al-Shifa hospital, usually a six-minute drive or a 25-minute walk away, but Bseiso said intense Israeli fire in the area made it too dangerous to try to get there. \"Unfortunately, I did not have any other choice. The choice was that I either let the girl die or I try to the best of my abilities,\" Bseiso told Reuters this week in an interview in the room where he amputated her leg on Dec. 19. Reuters was unable to confirm independently what struck her home, why it came under fire and what events preceded the attack.  \"Could I get her to the hospital? Of course not,\" Bseiso said, describing the area as \"under siege\". \"The tanks were at the entrance of the house.\" Israeli authorities say they work to minimise harm to civilians.  Asked for comment about the events of Dec. 19, the Israeli military did not specifically respond to questions about the incident at A'Hed Bseiso's home, but said Hamas used hospital complexes as cover, an allegation the militant group denies. \"A central feature of Hamas' strategy is the exploitation of civilian structures for terror purposes,\" the military told Reuters. \"Specifically, it has been well documented that Hamas uses hospitals and medical centers for its terror activities by building military networks within and beneath hospitals, launching attacks and storing weapons within the confines of hospitals, and using hospital infrastructure and staff for terror activities.\"  \"Regrettably, Hamas continues to put Gaza's most vulnerable citizens in serious danger by cynically using hospitals for terror,\" it said.  'THANKS TO GOD' A'hed Bseiso, 18, is part of a generation of young amputees emerging from the war being fought in Gaza since Hamas militants attacked Israel on Oct. 7, killing about 1,200 people and taking 253 hostage, according to Israeli tallies. Doctors say many of those killed in the Gaza Strip since then might have been saved if they had been able to reach hospital. Lying in bed several weeks after the amputation, A'hed Bseiso told Reuters she found an Israeli tank near her house when she went outside at about 10:30 a.m. to get a signal to call her father, who lives abroad. She and her sister went inside and closed the blinds of the house in case it was shelled. Shortly afterwards, the building came under fire and she was wounded, she said. She realised she had no feeling in her leg when family members tried to help her by pulling out shrapnel. \"They placed me on the dining table. There was no medical equipment. My uncle saw the sponge that we clean the dishes with, a wire, washing-up liquid and chlorine (disinfectant),\" she said. \"He took them and he started scrubbing my leg. He amputated my leg without anaesthetics and without anything at home.\" Asked how she withstood the pain, she said: \"I was just saying 'Thanks to God' and reading the Koran. Thanks to God, I did not feel much but of course there was pain, and the scene and the shock.\"  She has since undergone further operations in hospital to treat the injuries she received.  More than 24,000 Palestinians have been killed since Israel began its military campaign in Gaza in response to the Oct. 7 attack, Palestinian officials say.  Many others, including children, have had limbs amputated because of the severity of their wounds during the Israeli offensive, which Israel's military says is intended to eliminate Hamas and secure the release of the remaining hostages. \nMore than 1,000 children in Gaza had undergone leg amputations by the end of November, according to the U.N. children's agency UNICEF.  Poor hygiene and shortages of medicine further endanger lives, and doctors say supplies to hospitals are hindered by the lack of access to them."
}