{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0H0WF_L.jpg",
  "title": "US urges discussions with China on practical nuclear risk reduction steps",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 18, 2024 03:23PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-urges-discussions-with-china-on-practical-nuclear-risk-reduction-steps-3277678",
  "paragraph": "© Reuters. FILE PHOTO: The Center for Strategic and International Studies (CSIS) is seen through the rain in Washington, D.C., U.S., October 29, 2020. Picture taken October 29, 2020. REUTERS/Raphael Satter/File Photo\nWASHINGTON (Reuters) - The United States does not expect formal nuclear arms-control negotiations with China anytime soon, but does want to see a start of discussions on practical risk-reduction measures, a senior White House official said on Thursday. Pranay Vaddi, the senior White House official for arms control and non proliferation, told a Washington think tank it had been important to have initial arms-control talks in November with China, but stressed the need for them to involve key Chinese decision makers or influencers on the country's nuclear posture. \"We know that we are not going to leap into formal arms control negotiations anytime soon. We know that their arsenal is still being built up,\" Vaddi told the Center for Strategic and International Studies, while adding: \"On the arms-control front, we really want to see China respond to some of our more substantive ideas on risk-reduction, and we're still waiting to see if they will.\" The U.S. and China held their first talks on nuclear arms control in nearly five years on Nov. 6, amid growing U.S. concerns about China's nuclear build up, but the meeting produced no specific results. Those talks came ahead of a December summit between U.S. President Joe Biden and Chinese President Xi Jinping that announced a resumption of military-to-military dialogue. Vaddi said Washington wanted to maintain open lines of communication with China and that there was value in having the arms-control consultation in November, \"but for us, we want to be able to actually make progress on these issues.\" \"As it relates to arms control, we want to see some practical measures start to get discussed,\" he said, adding that such discussions could be bilateral, or in the context of the permanent five members of the U.N. Security Council - the U.S., China, Russia, Britain and France. \"It's not really in our interest to just have meetings,\" he said. \"For us to have an actual channel devoted to these issues, we want to use these channels for specific purposes and that's to solve some of these problems that we've identified.\" The U.S. and China held two days of military talks in Washington last week, their latest engagement since agreeing to resume military-to-military ties. \nIn its annual report on the Chinese military in October, the Pentagon said China has more than 500 operational nuclear warheads and will probably have over 1,000 warheads by 2030. The U.S. has a stockpile of about 3,700 nuclear warheads, of which roughly 1,419 strategic nuclear warheads were deployed."
}