{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0N0SK_L.jpg",
  "title": "Ghislaine Maxwell's appeal of sex trafficking conviction to be heard in March",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 24, 2024 03:21PM ET",
    "Updated Jan 24, 2024 03:33PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/ghislaine-maxwells-appeal-of-sex-trafficking-conviction-to-be-heard-in-march-3282126",
  "paragraph": "© Reuters. FILE PHOTO: Ghislaine Maxwell appears via video link during her arraignment hearing in Manhattan Federal Court, in the Manhattan borough of New York City, New York, U.S. July 14, 2020 in this courtroom sketch. REUTERS/Jane Rosenberg\nBy Jonathan Stempel NEW YORK (Reuters) - A U.S. appeals court will in March review Ghislaine Maxwell's conviction and 20-year prison sentence for helping the disgraced late financier Jeffrey Epstein sexually abuse teenage girls. The 2nd U.S. Circuit Court of Appeals in Manhattan on Wednesday scheduled oral arguments in Maxwell's appeal for March 12 before a three-judge panel. Jurors found Maxwell guilty in December 2021 of five charges for recruiting and grooming four underage girls for Epstein, her former boyfriend, to abuse between 1994 and 2004. Maxwell, 62, is housed at a low-security prison in Tallahassee, Florida. She is eligible for release in July 2037. In her appeal, the daughter of the late British media mogul Robert Maxwell said prosecutors scapegoated her because Epstein was dead and \"public outrage\" demanded that blame go somewhere. Her lawyers said the government waited too long to bring charges, and that Maxwell was immune under a 2007 non-prosecution agreement between Epstein and federal prosecutors in Florida. They also said the trial was tainted because one juror failed to disclose he had been sexually abused as a child. Prosecutors countered that Maxwell's appeal had no merit. They cited Circuit Judge Alison Nathan's findings that Maxwell had done \"incalculable\" damage to her victims, and that a substantial sentence would show people who sexually abuse and traffic underage victims that \"nobody is above the law.\" Epstein was in jail and awaiting trial for sex trafficking when he committed suicide in August 2019. He had earlier invoked his right against self-incrimination about 600 times in testimony for a now-settled civil lawsuit against Maxwell by Virginia Giuffre, one of their accusers. Britain's Prince Andrew and former Barclays CEO Jes Staley are among people who have seen their reputations suffer because of their once-close ties to Epstein. \nNathan was elevated to the 2nd Circuit from the U.S. District Court in Manhattan after being assigned Maxwell's criminal case. She will have no role in the appeal. The appeals court may take at least a few months to rule."
}