{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0105V_L.jpg",
  "title": "Israeli drone kills Hamas deputy leader in Beirut -Lebanese, Palestinian sources",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 02, 2024 04:31AM ET",
    "Updated Jan 02, 2024 11:56PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/fighting-between-hamas-and-israel-rages-on-despite-partial-troop-withdrawal-3265296",
  "paragraph": "5/5\n© Reuters. Israeli soldiers operate in the Gaza Strip amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, in this handout picture released on January 2, 2024. Israel Defense Forces/Handout via REUTERS\n2/5\nBy Laila Bassam, Nidal al-Mughrabi and Arafat Barbakh BEIRUT/CAIRO/GAZA (Reuters) - Israel killed Hamas deputy leader Saleh al-Arouri in a drone strike in Lebanon's capital Beirut on Tuesday, Lebanese and Palestinian security sources said, as its tanks and warplanes pummelled Gaza in further \"high-intensity\" warfare against the Islamist militant group in the enclave. Arouri, 57, was the first senior Hamas political leader to be assassinated since Israel launched a shattering air and ground offensive against Gaza's Hamas rulers almost three months ago after a shock Hamas militant rampage into Israeli towns. His killing could heighten the risk of the Israel-Hamas war spreading well beyond the Gaza Strip. Lebanon's heavily armed Hezbollah group, a Hamas ally, has been exchanging near-daily fire with Israel across Lebanon's southern border since the war in Gaza began.  Hamas radio and TV and Lebanon's pro-Iranian Mayadeen TV confirmed word from security sources that Arouri, a member of the Palestinian Islamist movement's politburo based abroad and a co-founder of Hamas' military wing, the Izz-el-Deen al-Qassam Brigades, had been killed when a drone struck a Hamas office in south Beirut. In all, the drone attack killed six people in the city's southern suburb of Dahiyeh, a Hezbollah redoubt, the Lebanese state news agency said. Two security sources said the drone targeted a meeting and Hamas' Al Aqsa TV said commanders of the group's armed wing in Lebanon - Samir Findi Abu Amer and Azzam Al-Aqraa Abu Ammar - were among the dead. Asked to confirm that Israel was behind Arouri's slaying, Israeli military spokesman Daniel Hagari told a media briefing: \"We are focused on killing Hamas.\"  He declined to elaborate. Mark Regev, an adviser to the Israeli Prime Minister Benjamin Netanyahu, said in an interview with MSNBC TV that Israel \"has not taken responsibility for this attack.\"  \"But whoever did it, it must be clear - this was not an attack on the Lebanese state,\" he said. \"Whoever did this did a surgical strike against the Hamas leadership\". Israel had accused Arouri of ordering and supervising Hamas attacks in the Israeli-occupied West Bank for years. \"I am waiting for martyrdom (death) and I think I have lived too long,\" Arouri said in August 2023, alluding to Israeli threats to eliminate Hamas leaders whether in Gaza or abroad.  Arouri had spent time recently in both Lebanon and Qatar, where a Hamas official said he was at \"the heart of negotiations\" conducted by Cairo and Doha over ways of resolving the Gaza conflict, and the release of hostages Hamas took in its Oct. 7 incursion into Israel. Lebanese caretaker premier Najib Mikati condemned the attack as a \"new Israeli crime\" and an attempt to pull Lebanon into war. His office said he asked his foreign minister to file a complaint to the U.N. Security Council over all \"new Israeli violations of Lebanese sovereignty\". Nasser Kanaani, spokesperson for the foreign ministry of Iran, a major supporter of Hamas and Hezbollah, said Arouri's killing would \"undoubtedly ignite another surge in the veins of resistance and the motivation to fight against the Zionist occupiers, not only in Palestine but also in the region and among all freedom-seekers worldwide\". In a televised speech in August, Hezbollah leader Hassan Nasrallah had warned Israel against carrying out any assassinations on Lebanese soil, vowing a \"severe reaction\". Hundreds of Palestinians took to the streets of Ramallah and other towns in the West Bank to condemn Arouri's killing, chanting, \"Revenge, revenge, Qassam!\" The Gaza war was triggered by a shock cross-border Hamas assault on Israeli towns on Oct. 7 that Israel says killed 1,200 people with some 240 hostages spirited back to Gaza - the bloodiest single day in the Jewish state's 75-year history. The Gaza health ministry said 207 people had been killed in the past 24 hours, bringing the total recorded Palestinian death toll to 22,185 in nearly three months of war in Gaza, the most lethal chapter of the decades-long Israel-Palestinian conflict. Israeli Defence Minister Yoav Gallant said operations around Khan Younis, southern Gaza's main city, concentrated on areas above the tunnel network where Hamas leaders were believed to be hiding. \"We are reaching them all ways. There already is engagement and there are (Israeli) hostages there too, sadly,\" he told troops in Gaza in footage shown on Israeli television. Civilian casualties have mounted in south Gaza as the brunt of Israel's offensive has shifted there from the north. Israel says it tries to avoid harm to civilians and blames Hamas for embedding fighters among them, an accusation Hamas denies. The United States, Israel's main supporter, has been urging it to rein in its air and ground blitz, which has demolished vast tracts of densely populated Gaza, in favour of more targeted strikes focusing on Hamas leaders. Israel has announced plans to pull back some troops, hinting at a new phase in the war amid a rising global outcry over the plight of Gaza civilians, although also warned its offensive has many months to run. Israeli bombardments have engulfed Gaza's 2.3 million residents in a humanitarian disaster in which thousands have been left destitute and threatened by famine due to a lack of food supplies.  HAMAS RESPONSE TO CEASEFIRE PROPOSAL Shortly before Arouri's killing, Hamas' paramount leader Ismail Haniyeh, who is also based outside Gaza, said the movement had delivered its response to an Egyptian-Qatari ceasefire proposal.  He reiterated that Hamas' conditions entailed \"a complete cessation\" of Israel's offensive in exchange for further releases of hostages. Israel believes 129 hostages remain in Gaza after some were released during a brief truce in late November and others were killed during air strikes and rescue or escape attempts.  Israel has vowed to keep fighting until it has wiped out Hamas but it is unclear what it plans to do with the enclave should it succeed, and where that leaves the prospect of an independent Palestinian state. Gaza residents said Israeli warplanes and tanks stepped up bombardments of eastern and northern districts of Khan Younis, where tens of thousands of displaced Palestinians have sought refuge after being forced to flee their homes elsewhere. \nIn the Gaza Strip's north, Gallant said, Israel had destroyed 12 Hamas regiments and only a few thousand militants remained out of 15,000-18,000 that had been based in the area. Others had fled to the south, he said.  (This story has been corrected to fix the name of a suburb to say 'Dahiyeh', not 'Daliyeh', in paragraph 5)"
}