{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0F0CP_L.jpg",
  "title": "Global tobacco use tumbles despite industry lobbying: WHO",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 16, 2024 12:06PM ET",
    "Updated Jan 16, 2024 12:12PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/global-tobacco-use-tumbles-despite-industry-lobbying-who-3275475",
  "paragraph": "© Reuters. A \"no smoking\" sign is placed on the office building window in the centre of Warsaw, Poland May 12, 2017. REUTERS/Kacper Pempel/File Photo\nBy Emma Farge GENEVA (Reuters) - Global tobacco use has tumbled in a generation with one in five people smoking versus one in three in 2000, the World Health Organization said on Tuesday. The drop comes despite what the U.N. global health agency said were ongoing efforts by Big Tobacco to seek to influence global health policies to its own advantage.  \"Good progress has been made in tobacco control in recent years, but there is no time for complacency,\" said Dr Ruediger Krech, Director of WHO Department of Health Promotion. \"I'm astounded at the depths the tobacco industry will go to pursue profits at the expense of countless lives.\" The global report said 1.25 billion people aged 15 or over used tobacco in 2022 versus 1.36 billion in 2000. Tobacco use is set to fall further by 2030 to around 1.2 billion people even as the world's population grows, the study said. One example of tobacco companies' efforts to win influence cited by the WHO was their offers of technical and financial support to countries ahead of a major WHO meeting on tobacco control in Panama in February. The regions with the biggest portion of smokers are Southeast Asia and Europe, the WHO said, with roughly a quarter of the population. In a handful of countries, tobacco use is still rising, including in Egypt, Jordan and Indonesia, according to the study.  \nThe report published every two years gave some preliminary data on the prevalence of vaping on which the WHO is urging governments to apply tobacco-style control measures. It said there were at least 362 million adult users of smokeless tobacco products globally but admitted this might be an underestimate due to missing data."
}