{
  "image": "https://i-invdn-com.investing.com/news/LYNXNPEB6T05K_L.jpg",
  "title": "Russia detains U.S. citizen on drugs charges",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 09, 2024 03:50AM ET",
    "Updated Jan 09, 2024 10:56AM ET"
  ],
  "comments": [
    2,
    [
      [
        "Carl Tom",
        "2024-01-10 01:41:31",
        "go to Russia plan on staying. Case closed",
        "https://www.investing.com/members/248294422"
      ],
      [
        "Ken Roth",
        "2024-01-09 17:56:17",
        "Now it begins. Russia has begun arresting US citizens still in russia while Trump is praising Putin….",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/russia-detains-us-citizen-on-drugs-charges-3269986",
  "paragraph": "By Guy Faulconbridge MOSCOW (Reuters) -A U.S. citizen has been detained in Russia on drugs charges which can carry up to 20 years in prison, a Moscow court said on Tuesday.  Moscow's Ostankino District Court said that on Jan. 6 Robert Romanov Woodland had been remanded in custody until March 5 on charges relating to the illegal acquisition or possession of drugs.  Russian internet news site Mash said that Woodland, 32, was charged with attempted large-scale production and sale of illegal drugs. He was detained on Jan. 5, Mash said.  A Facebook (NASDAQ:META) account in the name of Robert Woodland indicated that he had been working as an English teacher in Russia, and lived outside Moscow. It was not immediately possible to contact Woodland in Russian custody.  \"We are aware of reports of the recent detention of a U.S. citizen in Russia,\" the U.S. embassy in Moscow said. \"The U.S. Department of State has no greater priority than the safety and security of U.S. citizens overseas.\"  \"Whenever a U.S. citizen is detained overseas, our embassies and consulates stand ready to provide all appropriate consular assistance. Due to privacy considerations, we have no further comment at this time.\" In 2020, Woodland, who was known to friends as \"Rob\", told a Russian newspaper that he was adopted in 1993 by U.S. citizens from an orphanage in Perm, in the Urals, and taken to live in the United States. He later returned to Russia.  He appears to have both Russian and American passports.  The U.S. says that several of its citizens are wrongfully imprisoned in Russia, including Marine Corps veteran Paul Whelan and Wall Street Journal reporter Evan Gershkovich. The State Department has repeatedly warned all Americans to leave Russia immediately, citing the risk of wrongful detentions and harassment from Russian security services. In his 2020 interview with the Komsomolskaya Pravda newspaper, Woodland said he had wonderful adopted parents in the United States but wanted to find his genetic mother in Russia. They were eventually reunited on Russian state television.  \n\"Mama was crying and begging for forgiveness. But I forgave her before this meeting. I've never been angry at her. I simply always missed her very much,\" he said in the interview. \"I was drawn to Russia with a tremendous force. And here I am. I have decided to stay in my motherland forever.\""
}