{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK080GM_L.jpg",
  "title": "Polish ex-ministers head for jail as police swoop on presidential palace",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 09, 2024 03:27PM ET",
    "Updated Jan 09, 2024 05:07PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/polish-exministers-head-for-jail-as-police-swoop-on-presidential-palace-3270629",
  "paragraph": "2/2\n© Reuters. Polish Minister of Interior Mariusz Kaminski meets his counterparts German Nancy Faeser and French Gerald Darmanin, at a temporary accommodation centre for people fleeing Russia's invasion of Ukraine, in Korczowa, Poland, March 10, 2022. REUTERS/Fabrizio \n2/2\nBy Karol Badohal WARSAW (Reuters) -Police entered Poland's presidential palace to detain two of their former bosses on Tuesday, executing a court order to take the ex-interior minister and his deputy to prison and escalating a row between the head of state and the new government. Prime Minister Donald Tusk had earlier accused President Andrzej Duda of obstructing justice after the two lawmakers appeared at the palace, prompting police to search for them in cars leaving the building. The accusations over the two lawmakers - Mariusz Kaminski and Maciej Wasik - were the latest salvo in a row that is likely to be one of many during a period of cohabitation in which the government and president are from different political camps. After winning power in an October election, Tusk, a former top European Union official, has vowed to undo policies by his predecessors, the nationalist Law and Justice (PiS), who had faced accusations of subverting democracy during their eight-year rule.  New Interior Minister Marcin Kierwinski said \"everyone is equal before the law\". Grazyna Ignaczak-Bandych, the head of the president's chancellery, told private broadcaster TV Republika that police entered the palace while Duda was at his other official residence in Warsaw, Belweder, meeting exiled Belarusian opposition leader Sviatlana Tsikhanouskaya. \"We believe that they entered illegally, the chancellery employees did not resist, the police were rude, they did not want to talk to me and they did not provide me with any document that would authorise their actions,\" she said. \"When (Duda) was informed, he wanted to come immediately, but the exit from the Belweder Palace was blocked by a city bus.\" Hundreds of protesters gathered in front of the presidential palace at the behest of the PiS party, of which Kaminski and Wasik are members, and in front of a police station where the two were being held. The crowd chanted \"Free political prisoners\" and \"Shame!\" In a post on X, PiS spokesperson Rafał Bochenek called the police's actions earlier in the day \"an illegal kidnapping and a violation of all democratic rules\". PARDON In 2015, weeks following PiS' assumption of power, Duda, a PiS ally, issued a pardon to Kaminski after he was convicted of abuse of power in a previous role as head of Poland's Central Anti-Corruption Bureau.  The pardon allowed him to become interior minister. Kaminski had been accused of allowing agents under his command to use entrapment in an investigation. He denied wrongdoing. Lawyers questioned whether Duda could pardon Kaminski before an appeals court had issued a final ruling. The Supreme Court said last year the case should be reopened and Kaminski and Wasik, his deputy in the interior ministry, were sentenced last month to two years in prison for abuse of power.  On Tuesday, the president's office posted a picture of Kaminski and Wasik with Duda at an official event at the palace.  \"A sombre dictatorship is being formed. We cannot allow for Poland to hold political prisoners,\" Kaminski said after the event, before re-entering the building. According to Szymon Holownia, speaker of the lower house of parliament, or Sejm, the December verdict meant Kaminski and Wasik lost their parliamentary mandates. But both denied that and said they planned to attend the next session of the Sejm.  Duda met Holownia on Monday to try to convince him that his pardon was valid and the court had no right to issue a second verdict, but they did not come to an agreement.  \n\"The sitting planned this week will be moved to next week... There is one reason for this decision - my task is to ensure the dignity of the Sejm and social calm,\" said Holownia, a member of one of the parties in Tusk's centrist coalition. Parliament had been due to vote on the 2024 budget at this week's sitting. It has until the end of January to send the budget to Duda for him to sign. If it does not do so, the president is empowered to dissolve parliament."
}