{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBS0FN_L.jpg",
  "title": "Poland says Russian rocket entered its airspace, summons diplomat",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 29, 2023 02:59PM ET",
    "Updated Dec 29, 2023 05:27PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/poland-says-russian-rocket-likely-to-have-entered-its-airspace-3264803",
  "paragraph": "4/4\n© Reuters. Polish Defence Minister and deputy Prime Minister Wladyslaw Kosiniak-Kamysz speaks during a news conference after National Security Council meeting in Warsaw after an unidentified aerial object entered Polish airspace, Poland, December 29, 2023. Dawid Zuc\n2/4\nWARSAW (Reuters) -Poland summoned the Russian charge d'affaires and demanded an explanation for the violation of Poland's airspace by a missile and an immediate halt to such activities, Poland's foreign ministry said in a statement on Friday evening. According to the General Staff of the Polish Armed Forces, a Russian missile entered the airspace of the NATO member on Friday morning. Ukrainian authorities had reported a mass attack on various cities throughout Ukraine overnight. \"On Friday at 7.12 local time (0612 GMT), from the direction of the border with Ukraine, there was a violation of Polish airspace by an object that left Poland's territory after less than three minutes,\" Poland's General Staff wrote on X social media. \"We identify it as a Russian guided missile. During the whole time the missile's trajectory was tracked by radar systems, both Polish and allied. Air defense systems were on alert.\" RIA Novosti News agency quoted Russia's charge d'affaires in Warsaw Andrei Ordash as saying Poland had provided no proof of a border violation. Earlier on Friday morning F-16 fighter jets, two Polish and two American, were scrambled from bases in Poland, as well as an allied air tanker, due to activity of long-range Russian aircraft, Poland's Armed Forces Operational Command wrote on X. According to RIA, Ordash said: \"I was handed a note which contained an unsubstantiated claim that allegedly on the morning of 29th December, an airborne object violated Polish airspace, which Polish specialists identified as a Russian guided missile.\" \"No proof was presented. My request for documented proof of what was in the note was refused.\" Poland would react swiftly if such an incident were to repeat, Poland's deputy foreign minister Wladyslaw Teofil Bartoszewski was quoted as saying by PAP news agency. \"I told the chargé d'affaires clearly that the repeating of such attempts will be met with a stronger reaction from the Republic of Poland, because it is testing our effectiveness and our approach to defense,\" Bartoszewski said according to PAP. \"If (a missile) had flown a bit deeper into Polish territory, it would have been shot down,\" Bartoszewski was also quoted as saying by PAP. Russia attacked Ukraine with 158 drones and missiles overnight, aiming for critical infrastructure, industry and military facilities, the Ukrainian military said. In November 2022, a stray Ukrainian missile struck the Polish village of Przewodow in southern Poland killing two people and raising fears at the time of the war in Ukraine spilling over the border. In April, a military object was found in a forest close to the village of Zamosc near the northern city of Bydgoszcz. It was later reported to be a Russian missile. Earlier on Friday private broadcaster TV Republika had reported that a search for the object was happening near the town of Hrubieszow in southern Poland. \"We received information that an object appeared on the radar near Hrubieszow,\" Krzysztof Komorski, governor of the Lublin region, said on X. \"We have no confirmation that it fell within our region.\" Earlier, Polish officials said emergency services, including police and volunteer army units, were scouring the area but it was unclear whether the object had landed on Polish territory and there were no reports of casualties. \nGeneral Maciej Klisz, operational commander of the Polish armed forces said the missile had flown 40 kilometres (25 miles) into Poland and that no action was taken against it. Prime Minister Donald Tusk met army and security services chiefs around midday local time (1100 GMT) to discuss the incident."
}