{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "Taiwan's de facto ambassador to US meets US House speaker, China angered",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 09, 2024 09:53PM ET",
    "Updated Jan 10, 2024 12:31PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/taiwans-de-facto-ambassador-to-us-meets-us-house-speaker-3270829",
  "paragraph": "TAIPEI/BEIJING (Reuters) -Taiwan's de facto ambassador to the United States met on Tuesday with U.S. House of Representatives Speaker Mike Johnson, Taiwan's foreign ministry said on Wednesday, drawing a stern rebuke from Beijing. The United States is Taiwan's most important international backer and arms supplier despite the lack of formal diplomatic ties with the island, which China views as its own territory. Alexander Yui took up his new post last month, replacing Hsiao Bi-khim, who is now running to be vice president in Taiwan's elections on Saturday. Taiwan's foreign ministry said Yui thanked the U.S. Congress for its long-term, cross-party support for Taiwan and commitment to strengthening the island's defences.  It said this was the first time the two men had met. China staged war games around Taiwan in August of 2022 after then-House speaker Nancy Pelosi visited Taipei, and in Beijing the Chinese Foreign Ministry expressed anger at the Johnson-Yui meeting. U.S. lawmakers should \"stop sending wrong signals to Taiwan independence separatist forces and must not intervene in the Taiwan region's elections in any form\", spokesperson Mao Ning told reporters. \nChina routinely objects to any form of what it views as official contacts between Taiwanese and U.S. officials, saying it is an interference in internal Chinese affairs. Beijing says Taiwan is the most sensitive and important issue in Sino-U.S. relations. Taiwan's government opposes China's sovereignty claims, saying the People's Republic of China has never ruled the island and has no right to speak for it or control it as only Taiwan's people can do that."
}