{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBR02W_L.jpg",
  "title": "US allies reluctant on Red Sea task force",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 28, 2023 01:05AM ET",
    "Updated Dec 28, 2023 10:46AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-allies-reluctant-on-red-sea-task-force-3264223",
  "paragraph": "2/2\n© Reuters. FILE PHOTO: A Houthi fighter stands on the Galaxy Leader cargo ship in the Red Sea in this photo released November 20, 2023. Houthi Military Media/Handout via REUTERS \n2/2\nBy Phil Stewart, David Latona and Angelo Amante WASHINGTON/MADRID/ROME (Reuters) -U.S. President Joe Biden hoped to present a firm international response to Yemen's Houthi attacks on Red Sea shipping by launching a new maritime force, but a week after its launch many allies don't want to be associated with it, publicly, or at all. Two of America's European allies who were listed as contributors to Operation Prosperity Guardian - Italy and Spain - issued statements appearing to distance themselves from the maritime force. The Pentagon says the force is a defensive coalition of more than 20 nations to ensure billions of dollars' worth of commerce can flow freely through a vital shipping chokepoint in Red Sea waters off Yemen. But nearly half of those countries have so far not come forward to acknowledge their contributions or allowed the U.S. to do so. Those contributions can range from dispatching warships to merely sending a staff officer.     The reluctance of some U.S. allies to link themselves to the effort partly reflects the fissures created by the conflict in Gaza, which has seen Biden maintain firm support for Israel even as international criticism rises over its offensive, which Gaza's health ministry says has killed more than 21,000 Palestinians.      \"European governments are very worried that part of their potential electorate will turn against them,\" said David Hernandez, a professor of international relations at the Complutense University of Madrid, noting that the European public is increasingly critical of Israel and wary of being drawn into a conflict.      The Iran-backed Houthis have attacked or seized a dozen ships with missiles and drones since Nov. 19, trying to inflict an international cost over Israel's campaign, which followed the Oct. 7 rampage in southern Israel by Hamas militants that killed 1,200 people and took 240 hostage.      The navies of the United States, Britain and France have each shot down Houthi-launched drones or missiles.      A person familiar with Biden administration thinking said the U.S. believes escalating Houthi attacks call for an international response separate from the conflict raging in Gaza.     The Rea Sea is the entry point for ships using the Suez Canal, which handles about 12% of worldwide trade and is vital for the movement of goods between Asia and Europe. Houthi attacks have seen some ships rerouted around Africa's Cape of Good Hope, substantially increasing sailing time and costs. Denmark's giant container firm Maersk said on Saturday it would resume shipping operations in the Red Sea and the Gulf of Aden. But Germany's Hapag Lloyd said on Wednesday it still believes the Red Sea is too dangerous and will continue to send ships around the Cape of Good Hope. DISCORD OVER GAZA While the U.S. says 20 countries have signed up for its maritime task force, it has announced the names of only 12.  \"We'll allow other countries, defer to them to talk about their participation,\" U.S. Major General Patrick Ryder told reporters last week. The EU has signaled its support of the maritime task force with a joint statement condemning the Houthi attacks. Although Britain, Greece and others have publicly embraced the U.S. operation, several mentioned in the U.S. announcement were quick to say they are not directly involved.  Italy's defense ministry said that it would send a ship to the Red Sea following requests from Italian ship owners and not as part of the U.S. operation. France said it supports efforts to secure freedom of navigation in the Red Sea but that its ships would remain under French command. Spain has said it will not join Operation Prosperity Guardian and opposes using an existing EU anti-piracy mission, Atalanta, to protect Red Sea shipping. But on Wednesday, Prime Minister Pedro Sanchez said he was willing to consider the creation of a different mission to tackle the problem. Saudi Arabia and United Arab Emirates earlier proclaimed no interest in the venture. Public anger over Israel's Gaza offensive helps explain some of the reluctance of political leaders. A recent Yougov poll found that strong majorities of Western Europeans - particularly Spain and Italy - think Israel should stop military action in Gaza.  There is also the risk that participating countries become subject to Houthi retaliation. The person familiar with the U.S. administration's thinking says that it is this risk - rather disagreements over Gaza - driving some countries to steer clear of the effort.      That appears to be the case for India, which is unlikely to join the U.S. operation, according to a senior Indian military official. An Indian government official said the government worries that aligning itself with the U.S. could make it more of a target. One European diplomatic source downplayed concerns about cohesion in the coalition and said the effort was still taking shape and not in jeopardy of falling apart. The source added that Washington's allies understood the challenges confronting Biden at home with regard to the Israel-Gaza war.  INTERNATIONAL SUPPORT NEEDED In reality, many European and Gulf countries already participate in one of several U.S.-led military groups in the Middle East, including the 39-nation Combined Maritime Forces (CMF). The EU's Atalanta operation already cooperates in a \"reciprocal relationship\" with CMF, according to a spokesperson for the group.  That means that some countries not formally joining the Red Sea maritime task force could still coordinate patrols with the U.S. Navy.  For example, while Italy - a member of Atalanta - has not said it will join Operation Prosperity Guardian, an Italian government source told Reuters that the U.S.-led coalition is satisfied with Italy's contribution. The source added that the decision to send a naval frigate as part of existing operations was a way to speed the deployment and did not require a new parliamentary authorization. The U.S. effort to draw international support for its Red Sea security push comes as the United States faces pressure on multiple fronts from Iran's military proxies in the region. Beyond the Houthis in Yemen, Iran-backed militia have been attacking U.S. troops in Syria and Iraq.  So far, the United States has carried out limited retaliatory air strikes against the militia in Iraq and Syria, but it has refrained from doing so in Yemen. \nMichael Mulroy, a former deputy assistant secretary of defense for the Middle East under the Trump administration, said the Pentagon's goal with the new maritime coalition appeared to be to make any future Houthi attacks an international issue in order to divorce it from the Israel-Hamas war. \"Once the military vessels in Operation Prosperity Guardian start protecting commercial shipping and come under a direct attack, (the Houthis) will be attacking the coalition, not just the U.S.,\" Mulroy said."
}