{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0O06T_L.jpg",
  "title": "Asian FX bears gain momentum as hopes of early US rate cuts wane: Reuters poll",
  "category": "Economy",
  "publisher": "Reuters",
  "date": [
    "Published Jan 25, 2024 02:16AM ET",
    "Updated Jan 25, 2024 02:27AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/economy/asian-fx-bears-gain-momentum-as-hopes-of-early-us-rate-cuts-wane-reuters-poll-3282450",
  "paragraph": "By Archishma Iyer (Reuters) - Bearish bets on multiple emerging Asian currencies gained momentum as traders adjusted their bets on early rate cuts by the U.S. Federal Reserve, driving investors to the safe-haven dollar, according to a Reuters poll.  Most Asian currencies have been thrown off course from a U.S. dollar short squeeze since the beginning of the year after market participants scaled back expectations of aggressive interest rate cuts in 2024 by the Fed.  The odds of policymakers cutting rates in March have fallen to 41.5% from just over 75% a month ago, according to CME Group's (NASDAQ:CME) FedWatch Tool.  The poll was conducted ahead of the release of the initial reading of fourth-quarter U.S. GDP later on Thursday, which is estimated to have increased at a 2% annualized rate.  The Malaysian ringgit was the most shorted currency as investor confidence remained weak for almost a year. Traders strengthened their bearish bets on the South Korean won, Thai baht and Taiwan dollar, according to the fortnightly poll of 10 analysts.  \"It still remains a U.S. dollar and a negative yield differential story (for the ringgit),\" OCBC's currency strategist Christopher Wong said.  \"Softer economic growth, inflation print and little that the Malaysian central bank can do to policy was also another consideration,\" Wong added.  Bank Negara Malaysia stood pat on its interest rates on Wednesday in line with market expectations that it will hold rates steady until at least the end of 2025. Additionally, geopolitical tensions coupled with subdued growth in Asia's largest economy China have resulted in currencies like the ringgit, Korean won and the Taiwan dollar being battered since the start of 2024, according to Wong.  Short positions on the Chinese yuan persisted since May 2023, ever since the COVID-19 beleaguered economy attempted to recover on the back of stimulus measures, albeit without much success.  \"Firing off a bazooka-sized stimulus isn't going to solve China's economic ails, which are more structural in nature,\" David Chao, global market strategist, Asia Pacific (ex-Japan) at Invesco said in a client note.  Short bets on the Philippines peso and the Singapore dollar reached their highest level since November 2023, the poll showed.  Investors now look forward to the Fed's policy meeting next week, where any comments from Chair Jerome Powell will be scrutinised for cues on the trajectory of rate hikes.  The Indian rupee emerged as the only currency where investors have remained positive, with bullish bets rising to their highest since mid-June 2023. Investor sentiment improved from the inclusion of Indian government bonds in the two global fixed income-benchmarks from mid-2024, which could lead to multi-billion dollar inflows. [INR/]  The Asian currency positioning poll is focused on what analysts and fund managers believe are the current market positions in nine Asian emerging market currencies: the Chinese yuan, South Korean won, Singapore dollar, Indonesian rupiah, Taiwan dollar, Indian rupee, Philippine peso, Malaysian ringgit and the Thai baht. The poll uses estimates of net long or short positions on a scale of minus 3 to plus 3. A score of plus 3 indicates the market is significantly long U.S. dollars. The figures include positions held through non-deliverable forwards (NDFs). The survey findings ASIAPOSN are provided below (positions in U.S. dollar versus each currency): DATE USD/CNY USD/KRW USD/SGD USD/IDR USD/TWD USD/INR USD/MYR USD/PHP USD/THB  25-Jan-24 0.37 0.9 0.28 0.51 0.49 -0.18 1.07 0.5 0.9  11-Jan-24 0.18 0.3 0.02 0.19 0.05 -0.15 0.72 0.09 0.03  14-Dec-23 0.02 -0.09 -0.22 -0.05 -0.33 0.34 0.58 -0.22 0.16  30-Nov-23 0.12 -0.05 -0.07 -0.05 -0.13 0.63 0.73 -0.1 -0.1  16-Nov-23 0.77 0.49 0.38 0.77 0.63 0.82 1.14 0.38 0.28  2-Nov-23 1.32 1.18 0.74 1.44 1.31 1.35 1.33 0.96 0.85  19-Oct-23 1.02 1.16 0.84 1.06 1.06 1.21 0.78 0.89 0.67  5-Oct-23 1.17 1.25 0.81 1 1.25 0.92 1.08 0.75 1.03  \n21-Sep-23 1.29 0.94 0.61 0.84 0.98 1 1.03 0.64 0.83  7-Sep-23 1.28 1.01 0.3 0.65 0.95 0.79 0.86 0.55 0.57"
}