{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK1206C_L.jpg",
  "title": "Around 200,000 gather across Germany in latest protests against far-right",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 03, 2024 10:31AM ET",
    "Updated Feb 03, 2024 11:24AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/around-150000-gather-in-berlin-for-latest-round-of-protests-against-farright-3291917",
  "paragraph": "8/8\n© Reuters. Children play with soap bubbles as people gather outside the Reichstag building, during a rally of the broad alliance \"Hand in Hand\" under the slogan \"Wir sind die Brandmauer\" (\"We are the Firewall\") to protest against right-wing extremism and for the pro\n2/8\nBy Andreas Rinke and Christoph Steitz BERLIN/FRANKFURT (Reuters) -Around 200,000 people took to the streets in Germany on Saturday, most of them in the capital Berlin, as nationwide protests against the far-right Alternative for Germany (AfD) party entered their fourth week. Protests were also taking place in cities such as Mainz, Dresden and Hanover, in a sign of growing alarm at strong public support for the AfD. Roughly 150,000 people flocked to the Reichstag parliament building in Berlin, where protesters gathered under the slogan \"We are the Firewall\" to protest against right-wing extremism and to show support for democracy. \"Whether in Eisenach, Homburg or Berlin: in small and large cities across the country, many citizens are coming together to demonstrate against forgetting, against hatred and hate speech,\" Chancellor Olaf Scholz wrote on X. He said the protests were \"a strong sign in favour of democracy and our constitution\". The AfD's success has stoked concern among Germany's mainstream parties, who fear it could sweep three state elections in eastern Germany in September, even though recent polls have shown a slight decline in AfD support. Jakob Springfeld, who speaks for the NGO Solidarity Network Saxony, said he was shocked that it had taken such a long time for mass demonstrations against the far-right, given the AfD had been successful in many smaller communities already. \"But there's a jolt now. And the fact that the jolt is coming provides hope I believe.\" Earlier this week, a Forsa poll showed that backing for the AfD dropped below 20% for the first time since July, with voters citing nationwide demonstrations against the far-right as the most important issue. According to the poll, the AfD remains in second place behind the main opposition conservatives on 32%, while Scholz's centre-left Social Democrats polled third at 15%. The protests followed a report last month that two senior AfD members had attended a meeting to discuss plans for the mass deportation of citizens of foreign origin. The AfD has denied that the proposal represented party policy. \nAfD co-leader Tino Chrupalla told broadcaster Deutschlanfunk that while it was \"legitimate to take to the streets with the government\" protesters should not allow themselves to be used to distract parties from the country's actual problems. Chrupalla said Germany included Germans with a migrant background and that his party was not planning to expel them."
}