{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0R05V_L.jpg",
  "title": "US Muslim group condemns Pelosi for saying Gaza ceasefire protests have Russia link",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 28, 2024 11:17AM ET",
    "Updated Jan 28, 2024 03:45PM ET"
  ],
  "comments": [
    1,
    [
      [
        "First Last",
        "2024-01-28 18:57:55",
        "Palestinians have been carrying water for Russia.  They fight for Russia in Ukraine and don't condemn Russia's invasion nor war crimes.  Hamas gets Russia funding.  Some pro-Hamas groups outside Gaza get Hamas/Iranian/Russia fundings.",
        "https://www.investing.com/members/200601457"
      ],
      [
        "Stoxer One",
        "2024-01-29 16:32:20",
        "💯 ",
        "https://www.investing.com/members/200770726"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/pelosi-urges-fbi-probe-of-gaza-ceasefire-protests-in-us-suggests-russia-links-3285339",
  "paragraph": "© Reuters. A pro-Palestinian demonstrator tries to stop a NYPD car, as others take part in a protest, outside Jamaica Station to JFK via AirTrain in New York City, U.S., January 27, 2024. REUTERS/Eduardo Munoz/File Photo\nBy Kanishka Singh WASHINGTON (Reuters) -A U.S. Muslim group criticized former House of Representatives Speaker Nancy Pelosi on Sunday after she suggested, without offering evidence, that some protesters demanding a ceasefire in Gaza could be linked to Russia and urged the FBI to investigate. Her comments were dismissed as \"unsubstantiated smears\" by the Council on American-Islamic Relations (CAIR), who said such remarks amounted to dehumanization of the Palestinian people. Pelosi made the remarks in a CNN interview after she was asked whether opposition to President Joe Biden's policy in the war in Gaza could hurt the Democrat in November's presidential election.  \"For them to call for a ceasefire is Mr. Putin's message, Mr. Putin's message. Make no mistake, this is directly connected to what he (Russian President Vladimir Putin) would like to see,\" Pelosi told CNN. \"I think some of these protesters are spontaneous, and organic, and sincere. Some I think are connected to Russia,\" she said. \"Some financing should be investigated and I want to ask the FBI to investigate that.\"  Pelosi's comments marked the first time a prominent U.S. lawmaker has accused Russia's leader of backing U.S. protesters calling for a ceasefire. The Russian embassy in Washington was not immediately available to comment. Protests demanding a ceasefire in Gaza have recently occurred across the U.S., including near airports and bridges in New York City and Los Angeles, vigils outside the White House and marches in Washington. Demonstrators have also interrupted Biden speeches and events.  The protests have been organized by a range of human rights, Jewish and anti-war activist groups. \"It is unconscionable that an individual with such influence in this nation would spread unsubstantiated smears targeting those who seek an end to the slaughter of civilians in Gaza and a just resolution to that conflict,\" said Ibrahim Hooper, a spokesperson for CAIR. Pelosi's comments \"echo a time in our nation when opponents of the Vietnam War were accused of being communist sympathizers and subjected to FBI harassment,\" CAIR National Executive Director Nihad Awad added. When asked about the protests against Biden's policy in Gaza, Democratic U.S. Representative Alexandria Ocasio-Cortez told NBC News on Sunday that opposition by many to the war was based on \"the indiscriminate loss of life\" in the region. The U.N. has demanded an immediate humanitarian ceasefire in Gaza, but Washington has vetoed resolutions for such calls in the United Nations Security Council, saying it would let Palestinian Islamist group Hamas, which governs Gaza, regroup and rebuild. \nHamas' Oct. 7 attack on Israel killed 1,200 people, according to Israeli tallies. Israel's subsequent assault on Gaza has killed more than 26,000 Palestinians, over 1% of the 2.3 million population there, according to Gaza's health ministry. Many are feared buried in rubble. Israeli bombardments have flattened much of the densely populated enclave, leaving most Gazans homeless, sparking food shortages that threaten famine and incapacitating most hospitals."
}