{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK000AL_L.jpg",
  "title": "Thousands gather in Times Square for New Year ball drop",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 01, 2024 12:09AM ET",
    "Updated Jan 01, 2024 12:16AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/thousands-gather-in-times-square-for-new-year-ball-drop-3265023",
  "paragraph": "5/5\n© Reuters. Revellers hold balloons during the New Year's Eve celebrations at Times Square, in New York City, New York, U.S., December 31, 2023. REUTERS/Andrew Kelly\n2/5\nBy Andrew Kelly NEW YORK (Reuters) - After standing in New York City's Times Square for more than a dozen hours, thousands of revelers cheered in the New Year on Sunday night with the annual ceremony of a descending crystal-clad ball. Many had arrived early in the morning for a spot in one of the barricaded pens set up by the New York Police Department, ahead of musical performances by Megan Thee Stallion and LL Cool J before the final countdown to midnight. \"This is my first time to celebrate the New Year in Times Square,\" said Nadja Sjostrom, 44, who had traveled from Stockholm, Sweden, a few days earlier for the occasion and had been standing amid the giant illuminated billboards of Times Square since about 8 a.m.. It was a shorter commute for Markus Washington, a 49-year-old resident of Brooklyn, but also his first time at the Times Square celebration. \"It's a very good feeling,\" he said. \"Awesome. Cold, but awesome.\" \nAntonio Ruz, 51, had booked a flight from Granada, Spain, in order to make a lifelong dream come true, joining the crowds to get into the barricaded area at about 8.15 a.m.. \"Since I was a kid, I saw on TV this is spectacular show, so I had to live it,\" he said. He called it a \"once in a lifetime\" moment, emphasizing that he did not plan to return. \"I love New York, but 15 hours is too long to wait for a moment.\""
}