{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0P0T2_L.jpg",
  "title": "US Justice Department finds that ex-New York Governor Cuomo sexually harassed employees",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 26, 2024 05:36PM ET",
    "Updated Jan 26, 2024 05:50PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-justice-department-finds-that-exnew-york-governor-cuomo-sexually-harassed-employees-3284631",
  "paragraph": "© Reuters. FILE PHOTO: New York Governor Andrew Cuomo shortly before departing in his helicopter after announcing his resignation in Manhattan, New York City, U.S., August 10, 2021. REUTERS/Caitlin Ochs\nNEW YORK (Reuters) - The U.S. Justice Department on Friday agreed with a finding by the New York attorney general that the state's former governor, Andrew Cuomo, violated federal law by sexually harassing female employees and retaliating against those who spoke out. As a result of its findings, the federal agency signed a settlement with the New York Executive Chamber approving reforms that Cuomo's successor, Kathy Hochul, had passed to prevent and address misconduct, and also added several more.  Hochul's reforms included firing employees who facilitated or helped retaliate against Cuomo's accusers, opening a human resources department and creating new means for employees to report instances of sexual harassment. The Justice Department settlement announced on Friday calls for the state's executive chamber to expand the human resources department, add new avenues for reporting and resolving complaints involving high-level officials, and implementing new training and anti-retaliation programs. In response to Friday's announcement, an attorney for Cuomo, Rita Glavin, said the former governor \"did not sexually harass anyone.\"  Glavin, in a statement, accused the Justice Department's probe of being entirely based on the state attorney general's report, which she characterized as \"deeply flawed, inaccurate, biased, and misleading.\" Friday's announcement concluded a probe launched in August 2021 after New York's Democratic attorney general found that Cuomo, who is also a Democrat, had illegally groped, kissed or made suggestive comments to 11 women, and that his office had retaliated against the first accuser to go public.  Cuomo, who had served since 2011 as governor of New York, the fourth-largest U.S. state, resigned a week later after pressure from President Joe Biden and others. \nIn 2023, one of Cuomo's aides filed a civil lawsuit against the former governor, saying she was \"continuously subjected\" to sexual harassment while working for Cuomo, beginning in December 2019, including sexual comments and unwanted touching. She previously filed a criminal complaint against Cuomo, the only one brought over the allegations against him, but it was dropped by a local prosecutor who said he could not prove a crime beyond reasonable doubt."
}