{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK080BH_L.jpg",
  "title": "South Korean opposition leader to be discharged from hospital",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 09, 2024 05:39AM ET",
    "Updated Jan 09, 2024 05:46AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/south-korean-opposition-leader-to-be-discharged-from-hospital-3270025",
  "paragraph": "2/2\n© Reuters. FILE PHOTO: Lee Jae-myung, the presidential candidate of South Korea's ruling Democratic Party, speaks during his election campaign rally in Seoul, South Korea March 8, 2022. REUTERS/Kim Hong-Ji/File Photo\n2/2\nBy Hyunsu Yim SEOUL (Reuters) - The leader of South Korea's main opposition party, Lee Jae-myung, will be discharged on Wednesday from the hospital where he has been recovering since an attacker stabbed him in the neck last week at a public event, his party said on Tuesday. Lee's condition has improved and he will continue to receive treatment at home, although it is not known when he might resume his duties, Democratic Party official Kwon Hyuk-ki told reporters. Lee, a former presidential candidate who narrowly lost the 2022 election to conservative President Yoon Suk Yeol, was attacked in the southern port city of Busan last Tuesday by a man who lunged at him with a camping knife after asking for his autograph. Surgeons operated on Lee for more than two hours to repair a jugular vein in his neck. Police have revealed few details about the suspect, a 67-year-old man who was disguised as a supporter, and an official at Busan Metropolitan Police Agency told Reuters that they decided on Tuesday not to disclose his identity to the public. The Democratic Party has called on police to reveal the identity and party affiliation of the suspect in the attack, which shocked the nation and renewed questions about high-profile politicians' safety. In South Korea, police or prosecutors disclose the identity of the suspect in a violent crime if they believe it is in the public interest and there is sufficient evidence for the crime. \nPolice said they will announce the final result of their investigation into the attack on Wednesday. President Yoon and politicians from both the ruling and opposition parties have called the attack on Lee an \"act of terror\" and a challenge to democracy."
}