{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0K08I_L.jpg",
  "title": "Bereaved family members plant trees in Israeli memorial for festival dead",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 21, 2024 11:36AM ET",
    "Updated Jan 21, 2024 11:42AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/bereaved-family-members-plant-trees-in-israeli-memorial-for-festival-dead-3279000",
  "paragraph": "5/5\n© Reuters. The family of Liraz Assulin, 38, who fled from the Nova festival and was killed during the deadly October 7 attack by gunmen from Palestinian Islamist group Hamas, creates a memorial for her, near Kibbutz Kfar Aza in southern Israel, January 21, 2024. REU\n2/5\nBy Leonardo Benassatto JERUSALEM (Reuters) - Some of the bereaved families whose loved ones were killed in a Hamas rampage at the Nova music festival joined an Israeli Jewish nature project group on Sunday for a special tree-planting event at the site. Around 1,000 people planted about 200 seedlings in the scorched earth of the Re'im parking lot where thousands of young people were partying in the dawn hours of Oct. 7 when armed Palestinian infiltrators swept in. According to police, 364 people were shot, bludgeoned or burned to death at the Nova festival in a stretch of tree-dotted brush near Kibbutz Reim. Another 40 people were taken hostage by Hamas back to the Gaza Strip, 5 km (2 miles) away, police said. It was the bloodiest incident in the shock cross-border assault by the Palestinian Islamist faction, and triggered a devastating Israeli counter-offensive in Gaza. “I still can’t believe that we are planting a tree instead of hugging our child,” Ela Bahat, whose son Dror was killed at the festival, told Reuters. \nFamily members wept while planting trees with the Israeli Jewish National Fund, hoping to bring new life to the scene of death and desecration.  \"We buried him four days after on October 11, and this was the first day of the rest of our lives,\" Bahat's father Idan said. \"I really hope that in any way, that from upstairs they will bring some peace to earth.\""
}