{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0808U_L.jpg",
  "title": "China satellite launch prompts Taiwan attack alert ahead of pivotal vote",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 09, 2024 08:21AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/china-satellite-launch-prompts-taiwan-attack-alert-ahead-of-pivotal-vote-3270222",
  "paragraph": "© Reuters. A person attending a Foreign Ministry's news conference holds a phone showing air raid alert about a Chinese satellite that had flown over south Taiwan airspace in Taipei, Taiwan January 9, 2024. REUTERS/Ann Wang\nBy Ben Blanchard and Ryan Woo TAIPEI/BEIJING (Reuters) -Taiwan's government issued an air raid alert on Tuesday, saying a Chinese rocket carrying a satellite had flown over its southern airspace, which Taiwan's foreign minister described as part of a pattern of harassment days before a pivotal election. The island-wide security alert was sent by the defence ministry to mobile phone users in Taiwan after 3 p.m. (0700 GMT), around the same time Chinese state media confirmed the launch of a science satellite. The \"presidential alert\" used the words \"satellite launch by China\" in Chinese, and \"missile\" in English. The defence ministry later blamed \"negligence\" for the mistaken reference to a missile.  Taiwan holds presidential and parliamentary elections on Saturday. Beijing claims Taiwan as its own territory and has cast the elections as a choice between peace and war across the Taiwan Strait. Taiwan's government rejects China's sovereignty assertions. Chinese state news agency Xinhua said China had launched \"a new astronomical satellite\" called the Einstein Probe from the southwestern province of Sichuan.  China had not previously announced the satellite launch and did not offer any details on its flight plan. China made two satellite launches on consecutive days in early December from a launch site in Inner Mongolia. Neither of those had flown over Taiwan or triggered an alert. China's state media described the probe as a small satellite dedicated to high-energy astrophysics and astronomy. Taiwanese Foreign Minister Joseph Wu, who was giving a press conference to dozens of foreign reporters as the shrill alert sounded on mobile phones in the room, described the launch as part of a pattern of harassment towards Taiwan, like the recent cases of Chinese balloons spotted over the island. \"All these kinds of tactics are classified as grey-zone activities, (and) continue to remind the people here in Taiwan that there is a danger of war between Taiwan and China,\" he told reporters. \"With these kinds of threats against Taiwan I think we should be clear eyed, we should not be provoked.\" China's defence ministry did not immediately respond to a request for comment. Taiwan's defence ministry said later on Tuesday the rocket had flown more than 500 km (310 miles) above the southern part of the island, and that debris had fallen only on China. It noted the flight path was \"abnormal\" which \"may have posed a risk on the ground\", and so the alert was issued. The ministry said it will conduct an in-depth review as to the incorrect usage in English of the word \"missile\". Taiwan President Tsai Ing-wen, who was at a campaign event in the southern city of Kaohsiung, looked at a mobile phone and said \"this is a satellite, not a missile - don't worry,\" the official Central News Agency reported. But Taiwan's main opposition Kuomintang Party criticised the alert, saying it had misled the public.  \nTaiwan accused China on Saturday of threatening aviation safety and waging psychological warfare on its people with the recent spate of balloons. Taiwan has complained for four years of stepped-up Chinese military action such as fighter jets regularly flying over the strait as part of a \"grey zone\" strategy attempting to wear down Taiwan with offensive actions that stop short of full-blown conflict."
}