{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBM06K_L.jpg",
  "title": "Sombre Bethlehem marks Christmas with vigil as bombs rain on Gaza",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 23, 2023 01:01PM ET",
    "Updated Dec 25, 2023 07:22AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/sombre-bethlehem-marks-christmas-with-vigil-as-bombs-rain-on-gaza-3262863",
  "paragraph": "5/5\n© Reuters. A person lights a candle at a Christmas installation of a grotto with figures standing amid rubble surrounded by a razor wire, outside the Church of the Nativity, in support of Gaza, on Manger Square in Bethlehem, in the Israeli-occupied West Bank, Decemb\n2/5\nBETHLEHEM, Occupied West Bank (Reuters) - Palestinian Christians held a sombre Christmas vigil in Bethlehem on Saturday, with candle-lit hymns and prayers for peace in Gaza instead of the usual festive celebrations at the spot where they believe Jesus Christ was born. Most years Bethlehem basks in the central place it holds in the Christian story of Jesus' life, born there in a stable because there was no room for his parents at the inn, and placed in an animal's manger, the humblest of all possible beds.  Some 2,000 years later, pilgrims usually flock to the reputed location of that stable in Bethlehem's Byzantine-era Church of the Nativity, where most Christmases there are joyful displays of lights and trees in Manger Square.  But with Israel's campaign in Gaza having killed more than 20,000 people according to health authorities in the Hamas-run enclave, the mostly Palestinian population of Bethlehem in the Occupied West Bank are in mourning too.  This year they decided to have no large tree, the usual centrepiece of Bethlehem's Christmas celebrations because of the carnage taking place only 50km (30 miles) away.  And in place of the usual nativity scene, as Christians call the traditional display of figurines representing the holy family, Bethlehem churches this year placed the models amid rubble and barbed wire in solidarity with the people of Gaza.  \"Bethlehem is a message. It is not a city, it is a message of peace to the whole world. From this sacred place we convey a message of peace ... stop the war, stop the blood, the killing and the revenge,\" said Father Ibrahim Faltas, a friar at the vigil. Christians make up around 2% of the population across Israel and the Occupied Palestinian territories, according to Protecting Holy Land Christians, a campaign organised by the Heads of Churches in Jerusalem, with a smaller proportion in Gaza. Meanwhile, the war, triggered by a Hamas attack on Israeli towns on Oct. 7 that Israel says killed 1,200 people, mostly civilians, has kept away the majority of expected foreign tourists hoping to celebrate Christmas in Bethlehem.  \nWhen church leaders convened at Bethlehem in early December to mark the start of Advent, as Christians call the weeks before Christmas, there were few people in the usually crowded streets and squares to watch the pared-down display.  \"This Christmas comes to Bethlehem in a different shape. Nowadays Bethlehem, as any other Palestinian city, is in mourning. We feel sad,\" said the town mayor Hanna Hanania, lighting a candle in Manger Square."
}