{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0U0WE_L.jpg",
  "title": "State Dept says US actively pursuing the creation of a Palestinian state",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 31, 2024 04:39PM ET",
    "Updated Jan 31, 2024 04:46PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/state-dept-says-us-actively-pursuing-the-creation-of-a-palestinian-state-3289021",
  "paragraph": "© Reuters. FILE PHOTO: An Israeli tank manoeuvres along the border with northern Gaza, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, in Israel, January 30, 2024. REUTERS/Amir Cohen\nBy Simon Lewis and Humeyra Pamuk WASHINGTON (Reuters) - The United States is actively pursuing the establishment of an independent Palestinian state with security guarantees for Israel and exploring options with partners in the region, the State Department spokesperson said on Wednesday. Matthew Miller declined to give details on the department's internal work on the issue, but told a news briefing the effort has been an objective of President Joe Biden's administration. \"We are actively pursuing the establishment as an independent Palestinian state, with real security guarantees for Israel, because we do believe that is the best way to bring about lasting peace and security for Israel, for Palestinians and for the region,\" Miller said. \"There are any number of ways that you could go about accomplishing that. There are a number of sequencing of events that you can carry out to accomplish that objective. And we look at a wide range of options and we discuss those with partners in the region as well as other partners inside the United States government,\" Miller said. Axios reported earlier on Wednesday that U.S. Secretary of State Antony Blinken had asked the State Department to conduct a review and present policy options on possible U.S. and international recognition of a Palestinian state after the war in Gaza. British Foreign Secretary David Cameron also told a group of UK lawmakers that the UK government and its allies \"will look at the issue of recognizing a Palestinian state, including at the United Nations,\" the BBC reported on Tuesday.  Washington has been linking the creation of a Palestinian state with the effort to get Saudi Arabia to normalise its ties with Israel -- a push that was largely frozen after the Oct. 7 Hamas attack that killed 1,200 Israelis and saw more than 250 taken hostage. But over the past few months, the conversations have resumed. U.S. officials now also see a possible hostage deal that would free all the remaining captives in return for a sustained ceasefire as instrumental and linked to making progress in the Saudi-Israel normalisation effort. \nSpeaking in Davos earlier this month, Blinken said there was a \"new equation\" in the Middle East in which Israel's Arab and Muslim neighbors were prepared to integrate Israel into the region but were equally committed to a pathway to a Palestinian state. Israeli Prime Minister Benjamin Netanyahu is at odds with the Biden administration over the creation of an independent Palestinian state, saying at the weekend that he would not compromise on \"full Israeli security control of all territory west of the Jordan River\"."
}