{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK080AC_L.jpg",
  "title": "North Korea stokes fear, uncertainty for migrant workers on S.Korean island",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 09, 2024 04:57AM ET",
    "Updated Jan 09, 2024 07:38AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/north-korea-stokes-fear-uncertainty-for-migrant-workers-on-skorean-island-3269999",
  "paragraph": "2/2\n© Reuters. A Sri Lankan worker Siyam Mohamed, 25, cooks lunch on Yeonpyeong Island, South Korea, January 9, 2024. REUTERS/Kim Hong-Ji\n2/2\nBy Ju-min Park and Minwoo Park YEONPYEONG ISLAND, South Korea (Reuters) - Sri Lankans Siyam Mohamed and MJ Nimshan Dananjaya hadn't realised how close South Korea's Yeonpyeong Island is to North Korea when they arrived in November to work catching crabs. They had a rude awakening on Friday, however, when alerts sounded on their phones - indecipherable as they don't read Korean - followed by the boom of artillery fire. The scare came after North Korea fired off more than 200 shells a few miles from the island, and still more over the weekend, in what it described as military drills. The South responded on Friday with its own live-fire exercises. For residents on the island, the rising tensions bring memories of 2010, when a North Korean bombardment killed two soldiers and two civilians there, and left an unconfirmed number of North Korean casualties after South Korea fired back. That history was news to Mohamed and Dananjaya. \"I was panicked by the sound,\" Mohamed, 25, told Reuters on Tuesday in his dormitory on the island. \"Is there going to be a war? I came here for my family, my parents and siblings, but I am getting scared. I am worried that they worry about me.\" He said the fears raised memories of their own harsh situation back when Sri Lanka was torn by civil war. Mohamed, a former soccer player who left the sport for crab fishing to save for a house said he is paid 2 million won ($1,500) per month and remits most of it back home, except a little he keeps to buy snacks.  Until the crab season begins in March, he carries some frozen crab boxes around for delivery while eating fish potato rice for lunch at a company cafeteria. Dananjaya, 23, who shares the dorm with Mohamed and four other workers from Sri Lanka and Vietnam, was married shortly before he moved to South Korea for work in November. He too hopes to use his crab fishing earning to build a house back in Sri Lanka. He echoed the concern that any armed clashes might dash their Korean dreams. The pair are among the roughly 10% of the island's residents who are migrant workers, a key workforce for the crab fishing business, said their employer, Kim Jeoung-hee. \"Without those folks, nothing can work out,\" he said. \"Koreans are old here so barely no one is riding on ships. Without foreigners, we can’t keep up with our fisheries. I want them to like this place and settle in, but current (geopolitical) circumstances aren’t helping at all.\" Kim said while he was born and raised on the island and can hope that heightened tensions might simmer down eventually, migrant workers new to the island would understandably fear any potential conflict, going through evacuations and firing sounds surrounding them.  \n“My boss and his wife, they are treating us very well, and Korean people are nice,\" Mohamed said. \"Yeonpyeong island is beautiful with trees. Everything except the South Korea-North Korea situation.” (This story has been corrected to fix the spelling of Mohamed's name throughout the story)"
}