{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK160B7_L.jpg",
  "title": "Exclusive-UAE wealth fund plans $4-5 billion in investments via India's new finance hub - sources",
  "category": "Economy",
  "publisher": "Reuters",
  "date": [
    "Published Feb 07, 2024 04:30AM ET",
    "Updated Feb 07, 2024 04:35AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/economy/exclusiveuae-wealth-fund-plans-45-billion-in-investments-via-indias-new-finance-hub--sources-3294891",
  "paragraph": "© Reuters. FILE PHOTO: A general view of office buildings at the Gujarat International Finance Tec-City (GIFT) at Gandhinagar, India, December 8, 2023.REUTERS/Amit Dave/File Photo\nBy Jayshree P Upadhyay (Reuters) - Abu Dhabi Investment Authority (ADIA), the largest sovereign wealth fund in the United Arab Emirates (UAE), is setting up a $4-5 billion fund to invest in India through a tax-neutral finance hub in Prime Minister Narendra Modi's home state of Gujarat, according to two sources with direct knowledge of the matter. The regulatory authority for financial services at Gujarat International Finance Tec-City, or GIFT City, has granted in-principle approval to ADIA to set up the fund, sources said, declining to be identified as they are not authorised to speak to media. ADIA's intention to establish a presence in the hub was first announced last July in a joint statement by India and UAE. The amount of investment planned and the approval from the regulatory authority has not been previously reported. A spokesperson for ADIA declined comment. An email to the International Financial Services Authority (IFSCA), which regulates financial services in the hub, was not answered. With the approval, ADIA will become the first sovereign wealth fund to begin investing in India via GIFT City. The greenlight comes days before Modi is set to visit Abu Dhabi to inaugurate a large temple. Since becoming prime minister a decade ago, Modi has visited UAE six times, strengthening ties with India's third-largest trading partner. Trade between India and the UAE totalled $85 billion for the financial year ending March 2023, according to Indian government data.  The Arab nation is host to one of the largest Indian diaspora populations in the world at 3.5 million, which constitute almost 35% of UAE’s total population. \"By the middle of this year, ADIA could start investing through this fund. The allocated funds would be invested in India over a period of time,\" said the first of the two sources, without elaborating.  Funds which set up at GIFT City can invest in Indian and foreign equities and debt securities, among other assets. Modi's government has in recent months tried to boost activity at the GIFT City, including by allowing firms which are unlisted in India to list shares directly at exchanges there. Finance Minister Nirmala Sitharam, while announcing the federal budget this month, said the government aims to build up GIFT City as a \"gateway for global capital and financial services for the economy’. The zone offers a 10-year tax holiday for companies setting up there, no taxes on the transfer of funds from overseas jurisdictions and closeness to Indian markets. ADIA and its wholly-owned subsidiaries has specifically been exempt from long-term capital gains taxes from Indian investments via a special provision introduced in 2020 and applicable till March 2025. \nFund management activities via the hub have picked up after a slow start. As December 2023, it had 95 local and global funds with commitments of $30 billion and investments of over $2.93 billion. \"IFSCA is in early stages of discussions with other sovereign wealth funds to set up operations in GIFT City,\" said the second of the two sources cited earlier in the story."
}