{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0E042_L.jpg",
  "title": "Explainer-Why is North Korea testing hypersonic missiles and how do they work?",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 15, 2024 12:31AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/explainerwhy-is-north-korea-testing-hypersonic-missiles-and-how-do-they-work-3274198",
  "paragraph": "© Reuters. Ballistic missile, said to be solid-fuel and hypersonic, launches during a test at an unspecified location in North Korea in this picture released by the Korean Central News Agency on January 14, 2024. KCNA via REUTERS \nBy Hyonhee Shin SEOUL (Reuters) - North Korea said on Monday it had tested a new solid-fuel hypersonic missile with intermediate range, amid an intensifying race for the next generation of long-range rockets that are difficult to detect and intercept. The United States, China, Russia and other countries have also been developing hypersonic weapons in recent years.  HOW THE MISSILES WORK Hypersonic missiles typically launch a warhead that travels at more than five times the speed of sound or about 6,200 km per hour (3,850 mph), often manoeuvring at relatively low altitudes. Despite their name, analysts say the main feature of hypersonic weapons is not speed - which can sometimes be matched or exceeded by traditional ballistic missile warheads - but manoeuvrability. North Korea's first hypersonic missile test in 2021 featured a glider-shaped warhead, while a 2022 launch used what South Korean military officials and analysts said was actually a conical manoeuvrable reentry vehicle (MaRV), or a ballistic missile warhead capable of manoeuvring to hit a target. North Korean state media said Sunday's test was aimed at checking the reliability of new multi-stage, high-thrust solid-fuel engines and an intermediate-range hypersonic manoeuvrable controlled warhead. Combining a glide vehicle with a missile that can launch it partially into orbit - a so-called fractional orbital bombardment system (FOBS) - could strip adversaries of reaction time and traditional defence mechanisms. Intercontinental ballistic missiles (ICBMs), by contrast, carry nuclear warheads on ballistic trajectories that travel into space but never reach orbit. WHO LEADS THE RACE? China launched a rocket carrying a hypersonic glide vehicle that flew through space in 2021, circling the globe before cruising down toward its target, which it missed by about two dozen miles.  Earlier that year, Russia successfully tested a Tsirkon (Zircon) hypersonic cruise missile, which President Vladimir Putin touted as part of a new generation of missile systems. Moscow also tested the weapon from a submarine and a frigate for the first time. The United States said in September 2021 that it had tested an air-breathing hypersonic weapon - meaning it sustains flight on its own through the atmosphere like a cruise missile - marking the first successful test of that class of weapon since 2013.  NORTH KOREA'S HYPERSONIC GOAL At a key ruling Workers' Party meeting in January 2021, North Korean leader Kim Jong Un singled out securing hypersonic weapons as one of five main tasks under a five-year plan to boost military power, alongside developing solid-fuel ICBMs and a nuclear submarine.  North Korea fired its first hypersonic missile in September 2021, calling it a \"strategic weapon\" designed to bolster its defence capabilities, though some South Korean analysts described the test as a failure. In January 2022, Seoul officials reported that North Korea tested another potentially hypersonic missile that flew at relatively low altitudes at up to 10 times the speed of sound (12,348 kmh/7,673 mph). Sunday's launch involved what would be Pyongyang's first such missile powered by solid fuel that would facilitate a quicker launch with little preparation. During a rare trip to Russia last September, Kim inspected Moscow's hypersonic missiles, among other weapons. WHY IT MATTERS The global push for hypersonic weapons is part of an arms race in which smaller Asian nations are striving to develop advanced long-range missiles alongside major military powers. Hypersonic weapons and FOBS could be a concern as they can potentially evade missile shields and early warning systems. \n\"North Korea appears to be trying to develop hypersonic missiles and intermediate range ballistic missiles based on solid propellant rocket boosters,\" said Chang Young-keun, a professor at Korea Aerospace University.  \"In particular, mid- to long-range hypersonic missiles would be useful for striking Guam while evading the U.S. missile defence system.\""
}