{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0C00C_L.jpg",
  "title": "US, UK defend strikes on Yemen's Houthis as legal under international law",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 12, 2024 07:45PM ET",
    "Updated Jan 12, 2024 07:50PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Leila Graf",
        "2024-01-13 01:39:35",
        "As a newbie about to invest, you must have a long term mindset. Be careful on money usage, if you're not spending to earn back, then stop spending. Never claim to know Ask questions and it's best you work with a financial advisor. I want to thank you PATRICIA For being my source of crypto education Get involve For more WHASPP +🄅🄅7,4,6,🄃2,1,2,3,4,0,",
        "https://www.investing.com/members/256262069"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/us-uk-defend-strikes-on-yemens-houthis-as-legal-under-international-law-3273885",
  "paragraph": "By Jonathan Landay and Daphne Psaledakis (Reuters) - The United States and Britain on Friday defended to the U.N. Security Council the legality of strikes they launched against Yemen's Houthis for attacking Red Sea shipping while Russia and China accused the Western allies of raising regional tensions. Russia called the U.S. and British operation disproportionate and illegal. Other countries expressed concerns that the U.S. and British strikes against 28 locations would stoke regional tensions, already high over Israel's offensive against Gaza's ruling Hamas Islamists. The exchanges came during a Security Council debate on the U.S. and British operation carried out after months of drone and missile attacks by the Iran-aligned Houthis on ships in the Red Sea and Gulf of Aden. The Houthis, who seized much of Yemen in a civil war, say their attacks are in support of Hamas. U.S. Ambassador Linda Thomas-Greenfield said the strikes by the U.S. and Britain, part of a U.S.-led multinational naval coalition, were consistent with international law and the U.N. Charter. The operation was designed \"to disrupt and degrade the Houthis' ability to continue the reckless attacks against vessels and commercial shipping,\" she said. The United States, she continued, would continue pursuing a diplomatic response while seeking to defend commercial shipping. More than 2,000 ships have been forced by the Houthi attacks to divert from the Red Sea since November. \"We took limited, necessary and proportionate action in self-defense alongside the United States with the non-operational support of the Netherlands, Canada, Bahrain and Australia,\" said British Ambassador Susan  Woodward  (NASDAQ:WWD). Russian Ambassador Vassily Nebenzia charged that the U.S and British strikes violated international law and raised regional tensions.  \"It's one thing defending commercial shipping, attacks on which are unacceptable, but another when you're disproportionately and illegally bombing another state,\" he said. \nZhang Jun, China's U.N. envoy, said the Security Council had not authorized the use of force against Yemen. The U.S. and British operation \"not only caused infrastructure destruction and civilian casualties, but have also resulted in heightened security risks in the Red Sea,\" he said."
}