{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0H04H_L.jpg",
  "title": "Hezbollah rejected US overtures, still open to diplomacy to avoid wider war",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 18, 2024 12:03AM ET",
    "Updated Jan 18, 2024 01:43PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/hezbollah-rejected-us-overtures-still-open-to-diplomacy-to-avoid-wider-war-3276849",
  "paragraph": "© Reuters. FILE PHOTO: Lebanon's Hezbollah leader Sayyed Hassan Nasrallah gives a televised address at a memorial ceremony to mark one week since the killing of Wissam Tawil, a commander of Hezbollah's elite Radwan forces, in Khirbet Silem, southern Lebanon, January\nBy Laila Bassam and Maya Gebeily BEIRUT (Reuters) -Iran-backed Hezbollah has rebuffed Washington's initial ideas for cooling tit-for-tat fighting with neighbouring Israel, such as pulling its fighters further from the border, but remains open to U.S. diplomacy to avoid a ruinous war, Lebanese officials said. U.S. envoy Amos Hochstein has been leading a diplomatic outreach to restore security at the Israel-Lebanon frontier as the wider region teeters dangerously towards a major escalation of the conflict ignited by the Gaza war. Attacks by Yemen's Iran-aligned Houthis on shipping in the Red Sea, U.S. strikes in response and fighting elsewhere in the Middle East have added urgency to the efforts. \"Hezbollah is ready to listen,\" a senior Lebanese official familiar with the group's thinking said, while emphasising that the group saw the ideas presented by veteran negotiator Hochstein on a visit to Beirut last week as unrealistic. Hezbollah's position is that it will fire rockets at Israel until there is a full ceasefire in Gaza. Hezbollah's rejection of the proposals presented by Hochstein has not been previously reported.  Despite the rejection and Hezbollah's volleys of rockets in support of Gaza, the group's openness to diplomatic contacts signals an aversion to a wider war, one of the Lebanese officials and a security source said, even after an Israeli strike reached Beirut on Jan. 2, killing a Hamas leader. Israel has also said it wants to avoid war, but both sides say they are ready to fight if necessary. Israel warns it will respond more aggressively if a deal to make the border area safe is not reached. Such an escalation would open a major new phase in the regional conflict.  Branded a terrorist organisation by Washington, Hezbollah has not been directly involved in talks, three Lebanese officials and a European diplomat said. Instead, Hochstein's ideas were passed on by Lebanese mediators, they said. Reuters consulted eleven Lebanese, U.S., Israeli and European officials for this story. One suggestion floated last week was that border hostilities be scaled back in tandem with Israeli moves towards lower intensity operations in Gaza, the three Lebanese sources and a U.S. official said. Another suggestion is that Hezbollah keep its fighters at least 7 km (4 miles) from the border, two of the three Lebanese officials and an Israeli official said. The proposal was communicated to Hezbollah, the Lebanese officials said.  That could leave fighters much closer than Israel's public demand of a 30 km (19 mile) withdrawal to Lebanon's Litani River, as stipulated in a 2006 U.N. resolution.  However, Israel believes most anti-tank missiles fired from further than 7 km would not land on northern Israeli communities, according to the Israeli official, who was briefed on war cabinet discussions, but requested anonymity due to the sensitivity of the conversations.  Hezbollah has dismissed both ideas as unrealistic, the Lebanese officials and the diplomat said. The group has long ruled out giving up weapons or withdrawing fighters, many of whom hail from the border region and melt into society at times of peace.  Israel would also want to see Hezbollah's elite Radwan force kept north of the Litani and a United Nations peacekeeper force \"beefed up,\" the Israeli official said.  Israel's Prime Minister's office declined to comment on \"reports of diplomatic discussions\" in response to questions from Reuters for this story.  Spokespeople for Hezbollah and the Lebanon government did not immediately respond to detailed requests for comment. The White House declined to comment on Reuters' reporting.  Hezbollah has, however, signalled that once the Gaza war is over it could be open to Lebanon negotiating a mediated deal over disputed areas at the border, the three Lebanese officials said, a possibility alluded to by Hezbollah's leader in a speech this month. \"After the war in Gaza, we are ready to support Lebanese negotiators to turn the threat into opportunity,\" one senior Hezbollah official told Reuters, speaking on the condition of anonymity. He did not address specific proposals.  Hezbollah previously held fire during a 7-day Gaza truce in late November. Israeli government spokesperson Eylon Levy, in response to a Reuters question at a media briefing on Wednesday, said there was \"still a diplomatic window of opportunity,\" to push Hezbollah away from the border. Hochstein has a track record of successful mediation between Lebanon and Israel. In 2022, he brokered a deal delineating the countries' disputed maritime boundary - an agreement sealed with Hezbollah's behind-the-scenes approval.  Lebanese Prime Minister Najib Mikati, in whose cabinet Hezbollah has ministers, has said Beirut was ready for talks on long-term border stability. During his Jan. 11 visit to Beirut, Hochstein met Mikati, the parliament speaker and army commander. He said publicly at the time that the United States, Israel and Lebanon all preferred a diplomatic solution. Hochstein was hopeful \"all of us on both sides of the border\" could reach a solution to allow Lebanon and Israel to live with guaranteed security, he told reporters. IRAN The spearhead of the Iran-aligned \"Axis of Resistance\", Hezbollah was drawn into a battle it has said it did not expect when Palestinian ally Hamas stormed Israel on Oct. 7, triggering a conflict that has also spilled into the Red Sea, where U.S. strikes have targeted Yemen's Houthis over their attacks on shipping. Hezbollah has said its campaign has aided Palestinians by stretching Israeli forces and driving tens of thousands of Israelis from their homes.  It has come at a cost, with around 140 Hezbollah fighters and at least 25 Lebanese civilians killed, as well as at least nine Israeli soldiers and a civilian. The intensity has been growing in recent weeks. Hezbollah, founded by Iran's Revolutionary Guards in 1982, is the most powerful and influential of the groups Iran backs. It has played a big part in Tehran's wider foreign policies. Sources familiar with Hezbollah thinking have said it knows all-out war would be ruinous for Lebanon, a country already destabilised by years of financial and political crises, and where Hezbollah's vast arsenal has long been a point of contention. Experts say the cache includes more than 100,000 rockets. Even as Iran-aligned fighters draw U.S. fire elsewhere in the region and Iran launches strikes in Syria and Iraq, Tehran would be loathe to see Hezbollah and Lebanon subjected to massive destruction, not least because it has previously had to foot the bill of reconstruction, said Mohanad Hage Ali, deputy director of the Carnegie Middle East Center, a think-tank based in Beirut. Iran's foreign minister on Wednesday said attacks against Israel and its interests by the \"Axis of Resistance\" will stop if the Gaza war ends. Hage Ali said Hezbollah clearly wanted to avoid full-scale conflict. It did not want to be left in a situation where Israeli strikes continue or intensify in Lebanon after the Gaza war ends or is significantly scaled back, he said. \"A process in which it can engage, or support, the Lebanese state as it negotiates would provide the benefits of de-escalation,\" he said. 'THREATS AND INDUCEMENTS'  The diplomacy faces significant complications, and many observers see a serious risk of an escalation in fighting. Israel has said its army will act if diplomacy cannot restore security to northern Israel. Hezbollah leader Sayyed Hassan Nasrallah said the group had heard \"threats and inducements\".  The threat, Nasrallah said in a Jan. 15 speech, was the warning that Israel would move forces to its northern border as it shifts to the next phase of the Gaza war. Hezbollah was ready for war and would fight without \"any limits, rules or boundaries\", he said. But he has also alluded to diplomatic possibilities, saying in a Jan. 5 speech that once the Gaza war was over Lebanon had \"a historic opportunity\" to liberate land. Those comments were widely interpreted as reflecting the possibility of a negotiated deal settling the status of disputed border areas.  Four Lebanese officials briefed on the matter said Hochstein has discussed ideas aimed at advancing such a deal, but he had not presented any draft proposals. The officials did not provide details of the ideas. An Israeli official told Reuters Israel's government has \"relayed lots of demands,\" without giving details. \"One way or another, our 80,000 northern residents will be returning home,\" the official said.  \nFrance has also been involved in de-escalation efforts. A source familiar with French thinking said Nasrallah's public comments alluding to a possible border deal were \"direct messages to the Americans and to the French\".  \"He's telling us: 'the door is open'\"."
}