{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "Powerful quake rocks Japan, nearly 100,000 residents ordered to evacuate",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 01, 2024 02:52AM ET",
    "Updated Jan 01, 2024 01:19PM ET"
  ],
  "comments": [
    3,
    [
      [
        "Scott Miller",
        "2024-01-01 19:22:50",
        "When you consistently apply the right strategies in your trading operations, you are guaranteed to succeed consistently. Trading with the use of cutting edge Artificial intelligence powered trading systems is the way to earn passively from the market.....Luisa GallardoFX that you'll find on the social media platform ([NST'GARM]) Is an expert that will introduce you to this cutting edge systems. Many investors used this systems to achieve success last year and now is your chance to take advantage of this opportunity ",
        "https://www.investing.com/members/255959173"
      ],
      [
        "Ken Chao",
        "2024-01-01 18:34:58",
        "happen sooner and probably japan will cease dumping nuclear water into the sea, fumio regard himself as emperor 2.0 and most likely would not reverse dumping decision, well thirty years can become hundred years dumping, not so scientific anyway about harmless, we all vanish in one hundred years, radiation cancer or other illness",
        "https://www.investing.com/members/206314812"
      ],
      [
        "Ken Chao",
        "2024-01-01 14:48:31",
        "it comes too late to deter fumio release nuclear water into the sea! afterall fumio is the new King and almighty God to the japanese people",
        "https://www.investing.com/members/206314812"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/magnitude-76-earthquake-strikes-japan-tsunami-warning-issued-3265030",
  "paragraph": "By Tim Kelly, Satoshi Sugiyama and Sakura Murakami TOKYO (Reuters) -A powerful earthquake struck central Japan on Monday, killing at least one person, destroying buildings, knocking out power to tens of thousands of homes and prompting residents in some coastal areas to flee to higher ground. The quake with a preliminary magnitude of 7.6 triggered waves of about 1 metre along Japan's west coast and neighbouring South Korea. The Japan Meteorological Agency (JMA) initially issued a major tsunami warning - its first since the March 2011 earthquake and tsunami that struck northeast Japan killing nearly 20,000 people - for Ishikawa prefecture. It later downgraded that and eventually cut it to an advisory. It was the strongest quake in the region in more than four decades, according to the U.S. Geological Survey. Houses were destroyed, fires broke out and army personnel were dispatched to help with rescue operations, government spokesperson Yoshimasa Hayashi told reporters. An elderly man was pronounced dead after a building fell down in Shika Town in Ishikawa, broadcaster NTV reported citing local police. Local media footage from the prefecture showed a building collapsing in a plume of dust in the city of Suzu and a huge crack in a road in Wajima where panicked-looking parents clutched their children. One witness on social media platform X posted footage of the Keta Grand Shrine near the coast in Hakui rocking in the quake as a crowd of visitors watched. \"It's swaying,\" she exclaims. \"This is scary!\" Millions of Japanese traditionally visit shrines and temples on Jan. 1 to mark the start of the new year. In nearby Kanazawa, a popular tourist destination, images showed the remnants of a shattered stone gate strewn at the entrance of another shrine as anxious worshippers looked on. The tremor was also felt in the mountains of neighbouring Nagano prefecture. \"The snow from the electric wire (came) down, and also from the roof it fell down and all the cars are shaking, and so everybody was panicked,\" Jonny Wu, a Taiwanese tourist visiting Nagano for a skiing holiday, told Reuters. More strong quakes in the region, where seismic activity has been simmering for more than three years, could occur over coming days, JMA official Toshihiro Shimoyama said. Russia and North Korea also issued tsunami warnings for some areas. The Japanese government said that as of Monday night it had ordered more than 97,000 people in nine prefectures on the western coast of Japan's main island Honshu to evacuate. They were set to spend the night in sports halls and school gymnasiums, commonly used as evacuation centres in emergencies. Kanazawa resident Ayako Daikai said she had evacuated to a nearby elementary school with her husband and two children soon after the earthquake hit. Classrooms, stairwells, hallways and the gymnasium were all packed with evacuees, she said. \"We haven't decided when to return home yet,\" she told Reuters when contacted by telephone. NUCLEAR PLANTS Japanese Prime Minister Fumio Kishida told reporters late on Monday that he had instructed search and rescue teams to do everything possible to save lives, even though access to quake-hit areas was difficult due to blocked roads. The Imperial Household Agency said that following the disaster it would cancel Emperor Naruhito and Empress Masako's slated New Year appearance on Tuesday. The quake comes at a sensitive time for Japan's nuclear industry, which has faced fierce opposition from some locals since the 2011 earthquake and tsunami that triggered nuclear meltdowns in Fukushima. Whole towns were devastated in the disaster.  Japan last week lifted an operational ban imposed on the world's biggest nuclear plant, Kashiwazaki-Kariwa, which has been offline since the 2011 tsunami. The Nuclear Regulation Authority said no irregularities have been confirmed at nuclear plants along the Sea of Japan, including five active reactors at Kansai Electric Power’s Ohi and Takahama plants in Fukui Prefecture. Hokuriku's Shika plant in Ishikawa, the closest nuclear power station to the epicentre, had already halted its two reactors before the quake for regular inspections and saw no impact from the quake, the agency said.  'TSUNAMI! EVACUATE!' Following the quake, a bright yellow message reading \"Tsunami! Evacuate!\" flashed across television screens advising residents in specific areas of the coast to immediately evacuate. There were reports of at least 30 collapsed buildings in Wajima, a town of around 30,000 known for its lacquerware, and fire engulfed several buildings. The quake also jolted buildings in the capital Tokyo, some 500 km from Wajima on the opposite coast. Almost 32,000 households were still without power in Ishikawa prefecture late on Monday, according to utilities provider Hokuriku Electric Power, with temperatures set to drop to near freezing overnight in some areas.  Tohoku Electric Power said 700 households remained without power in neighbouring Niigata prefecture.  West Japan Railway reported late on Monday that a combined 1,400 passengers remained stuck on four halted bullet train services between Kanazawa and Toyama cities.  \nOne of Ishikawa's airports was forced to shut due to cracks that had opened up in the runway, transport authorities said. Japanese airline ANA turned back planes headed to airports in Toyama and Ishikawa, while Japan Airlines cancelled most services to the Niigata and Ishikawa regions."
}