{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK110N0_L.jpg",
  "title": "Doctor who prescribed more than 500,000 opioid doses has conviction tossed",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 02, 2024 01:13PM ET",
    "Updated Feb 02, 2024 04:36PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/doctor-who-prescribed-more-than-500000-opioid-doses-has-conviction-tossed-3291625",
  "paragraph": "© Reuters. FILE PHOTO: Tablets of Hydrocodone at a pharmacy in Portsmouth, Ohio, June 21, 2017. REUTERS/Bryan Woolston\nBy Jonathan Stempel (Reuters) - A Virginia doctor who prescribed more than 500,000 opioid doses in less than two years had his conviction and 40-year prison sentence thrown out by a federal appeals court on Friday, because the jury instructions misstated the law. The 4th U.S. Circuit Court of Appeals in Richmond, Virginia also ordered a new trial for Joel Smithers, 41, who has been serving his sentence in an Atlanta prison. Overprescription of painkillers is one of the main causes of the nation's opioid crisis. Nearly 645,000 people died in the United States from overdoses involving opioids from 1999 to 2021, including 80,411 in 2021 alone, according to the U.S. Centers for Disease Control and Prevention. Prosecutors said Smithers prescribed controlled substances including fentanyl, hydromorphone, oxycodone and oxymorphone to every patient he saw at the Martinsville, Virginia office he opened in August 2015. A majority of patients traveled hundreds of miles each way to see Smithers, who did not accept insurance and collected more than $700,000 in cash and credit card payments before law enforcement raided his office in March 2017, prosecutors said. Jurors convicted Smithers on 861 counts in May 2019, after being instructed that the government needed to prove he acted \"without a legitimate medical purpose or beyond the bounds of medical practice.\" The appeals court found this instruction defective in light of a 2022 U.S. Supreme Court decision that said the crime of prescribing controlled substances required a defendant to \"knowingly or intentionally\" act in an unauthorized manner. Writing for a three-judge panel, Circuit Judge Roger Gregory said Smithers' jury instructions were defective because jurors could have convicted him solely for acting outside the bounds of medical practice, regardless of his knowledge or intent. He also said such an error was not harmless, even in cases with \"copious evidence of a defendant's guilt.\" The office of U.S. Attorney Christopher Kavanaugh in the Western District of Virginia did not immediately respond to a request for comment. \n\"A doctor's guilt depends purely on his subjective beliefs,\" said Beau Brindley, a lawyer for Smithers. \"Any attempt by the government to pretend otherwise was resoundingly rejected.\" The case is U.S. v. Smithers, 4th U.S. Circuit Court of Appeals, No. 19-4761."
}