{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0H0B5_L.jpg",
  "title": "US strikes Houthi anti-ship missiles, shipping disruptions grow",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 18, 2024 05:10AM ET",
    "Updated Jan 19, 2024 01:21AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/indian-navy-rescues-crew-after-attack-on-ship-off-coast-of-yemen-3277025",
  "paragraph": "© Reuters. FILE PHOTO: A cargo ship boat model is seen in front of \"Red Sea\" words in this illustration taken January 9, 2024. REUTERS/Dado Ruvic/Illustration/File Photo\nBy Trevor Hunnicutt, Steve Holland and Krishn Kaushik ABOARD AIR FORCE ONE/WASHINGTON/NEW DELHI (Reuters) -The U.S. launched new strikes against Houthi anti-ship missiles aimed at the Red Sea on Thursday, as growing tensions in the region's sea lanes disrupted global trade and raised fears of supply bottlenecks that could reignite inflation. The two anti-ship missiles targeted in the strikes were being prepared by Yemen's Houthis for firing into the Red Sea and deemed \"an imminent threat\" to shipping and U.S. Navy vessels in the region, the U.S. military said. Attacks by the Iran-allied Houthi militia on ships in and around the Red Sea since November have slowed trade between Asia and Europe and alarmed major powers in an escalation of the war between Israel and Palestinian Hamas militants in Gaza. In the second attack this week on a U.S.-operated vessel in the region, the Genco Picardy came under attack in the Gulf of Aden late on Wednesday, sparking a fire onboard and prompting the Indian Navy to rescue the crew. India diverted a warship deployed in the region to rescue the 22 crew on board the Genco Picardy, including nine Indians. The crew were all safe and the fire was extinguished. The Houthis say they are acting in solidarity with Palestinians and have threatened to target U.S. ships in response to American and British strikes on the group's positions. The strategy pursued by U.S. President Joe Biden - a blend of limited military strikes and sanctions - appears aimed at preventing a wider Middle East conflict even as Washington seeks to punish the Houthis, security and military experts say. Biden on Thursday acknowledged that the strikes had not halted attacks by the militants but said the U.S. military response would continue.  \"Are they stopping the Houthis? No. Are they gonna continue? Yes,\" Biden told reporters aboard Air Force One. The Pentagon sought to portray the U.S. strikes as a defensive act designed to protect the seas. \"We are not at war with the Houthis,\" said Pentagon spokesperson Sabrina Singh. \"The Houthis are the ones that continue to launch cruise missiles, anti-ship missiles at innocent mariners...What we are doing, with our partners, is self-defense.\"  In the latest sign that Houthi attempts to attack ships continue unabated, British maritime security firm Ambrey said a Marshall Islands-flagged chemical products tanker reported the suspicious approach of drones 103 miles southeast of Aden. The Houthis claimed responsibility, saying they targeted the American ship Chem Ranger with naval missiles, resulting in \"direct hits.\" \"The Yemeni Armed Forces confirm that a retaliation to the American and British attacks is inevitable, and that any new aggression will not go unpunished,\" a statement from the group said. In another incident, Ambrey said a U.S.-owned tanker reported four unmanned aerial vehicles approached and circled the vessel, approximately 87 miles southeast of Yemen's Mukalla. Following the attack on the Genco Picardy, the U.S. military said its forces had conducted strikes on 14 Houthi missiles on Wednesday that \"presented an imminent threat to merchant vessels and U.S. Navy ships in the region\". Thursday's strikes were similar to those on Wednesday, White House national security spokesperson John Kirby (NYSE:KEX) told reporters aboard Air Force One.  SUEZ CANAL SUFFERS The attacks target a route that accounts for about 15% of the world's shipping traffic and acts as a vital conduit between Europe and Asia.  The alternative shipping route around South Africa's Cape of Good Hope can add 10-14 days to a journey compared to passage via the Red Sea and Suez Canal. A sharp downturn in revenue from the Suez Canal has struck a painful new blow to Egypt's already deteriorating economy. The chairman of the Suez Canal Authority said last week that revenue had fallen by 40% in the first 11 days of January. Wheat shipments via the Suez Canal tumbled almost 40% in the first half of January to 0.5 million metric tons, the World Trade Organization said on Thursday.  The Red Sea crisis was rippling through the business world and reviving concerns about stretched supply chains that emerged when activity picked up after the COVID-19 pandemic. The re-routing of a growing number of vessels is altering refuelling patterns and boosting demand for bunker fuel used by ships at far-flung ports, from Mauritius to South Africa to the Canary Islands. Denmark's Maersk and other large shipping lines have instructed hundreds of commercial vessels to stay clear of the Red Sea. The attacks, as well as weather-related closures and stoppages in Europe, risked causing congestion at several container terminals, Maersk told its customers on Thursday. Officials at Rotterdam Port, Europe's largest, expect traffic to become busier from the end of January as delayed ships start to arrive but they do not expect any serious logistical issues. Ports in Italy and France are worried about being bypassed as ships steer away from the main Mediterranean route. \n\"We are not observing a significant impact as of today but it's a concern,\" Christophe Castaner, chairman of Marseille port, told a press conference. If the crisis persists, one scenario could be that vessels travelling around Africa call in at Morocco and transfer goods to other ships to serve the Mediterranean, he added."
}