{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBS0EM_L.jpg",
  "title": "Ohio governor vetos ban on transgender care, sports participation",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 29, 2023 01:08PM ET",
    "Updated Dec 29, 2023 03:25PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/ohio-governor-vetos-ban-on-transgender-care-sports-participation-3264784",
  "paragraph": "© Reuters. Ohio Governor Mike DeWine speaks during an event to tout the new Brent Spence Bridge over the Ohio River between Covington, Kentucky and Cincinnati, in Covington, Kentucky, U.S., January 4, 2023. REUTERS/Kevin Lamarque\nBy Gabriella Borter (Reuters) - Ohio Governor Mike DeWine on Friday vetoed a bill that sought to ban gender-affirming care for transgender youth and stop trans athletes from competing on their gender identity's sports teams in the midwestern state. The bill, which passed the Republican-dominated state legislature this month, would prohibit physicians from performing gender reassignment surgery or prescribing puberty-blocking drugs to assist a minor with gender transition. It also would prohibit school districts, public universities and private colleges that participate in national athletics conferences from allowing trans women to participate in women's sports. DeWine, a Republican, announced his veto at a news conference on Friday morning. He said he visited several children's hospitals and spoke with parents and transgender children to help inform his decision. \"Parents have looked me in the eye and have told me, that but for this treatment, their child would be dead,\" DeWine told reporters. \"Ultimately I think this is about protecting human life.\" Republicans hold a supermajority in the state legislature and could override the governor's veto. \nThe divisive issue of gender-affirming care for trans youth has become a mainstay of the Republican Party's platform. Lawmakers in the majority of U.S. states have introduced bills to block children from receiving gender-affirming care in recent years, and 22 states have passed such bans.  Courts have been divided on legal challenges to the bans. Most lower level courts to consider the bans have blocked them so far, but appeals courts have sided with states. Last month, three Tennessee families of transgender children asked the U.S. Supreme Court to hear their case against that state's ban."
}