{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0M0MQ_L.jpg",
  "title": "Heavy rains tarnish San Diego's reputation for ideal weather",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 23, 2024 12:32PM ET",
    "Updated Jan 24, 2024 04:22AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/heavy-rains-tarnish-san-diegos-reputation-for-ideal-weather-3280917",
  "paragraph": "© Reuters. FILE PHOTO: Damage is shown after a heavy rain storm causes a small river to overflow into a neighborhood in San Diego, California, U.S. January 22, 2024. REUTERS/Mike Blake\nBy Rich McKay and Julia Harte (Reuters) - San Diego, renowned for its mild, sunny weather, was mopping up on Tuesday after the heaviest rainfall ever recorded in the city in the month of January, a deluge that washed away parked cars, flooded homes and closed a stretch of highway. Rain pounded San Diego at half an inch (1.3 cm) per hour on Monday as firefighters and lifeguards worked to rescue dozens of people from flash floods in a city often touted as having the most pleasant weather in the United States. Daniel Campos, the supervisor of Spill the Beans Coffee and Bagels in San Diego, said on Tuesday that the sky \"just dumped rain\" starting at midday on Monday, flooding the parking lot and forcing the shop to close early. \"Water was bubbling up from manhole covers; it was crazy,\" he said. In a city where it is common to see Frisbees tossed for fun, the San Diego Fire-Rescue Department posted a video on the X social media platform of a rescue team captain hurling a disc on a rope to a man clinging to a raft in a powerful current. The man was saved by the \"solid throw of the save-a-life disc,\" the post said. \"Nice work gentlemen!\" Terrified homeowners waded through waist-deep water to escape their homes in some parts of San Diego, California's second-largest city by population, according to Fox Weather. The channel posted a video taken by resident Hugo Pacheco of himself and a woman struggling to reach higher ground. \"The house I've lived in all my life just flooded,\" Pacheco said. \"Scariest moment of my life.\" One elementary school reported that 3 inches (7.6 cm) of floodwater had accumulated in its classrooms.  San Diego's mayor declared a state of emergency around 5 p.m. PST on Monday, urging residents to stay home and never travel on flooded roads. The storm drew moisture from the Pacific Ocean and dumped 2.73 inches (6.93 cm) of rain at San Diego's airport, cutting off traffic to the facility, before heading to Northern California, said David Roth, a meteorologist with the National Weather Service's Weather Prediction Center in College Park, Maryland. Roth said the rainfall, which produced the city's fourth wettest day on record - not far behind the all-time record of 3.34 inches (8.48 cm) in 1854 - was \"very unique.\" \"They should be getting some rain this time of year, but not like this,\" he said. \nDaily rainfall during the city's wet season from December through March averages just .03 inch (.08 cm), and average annual rainfall is about 10 inches (25.4 cm), according to Roth. San Diego residents can start drying out on Tuesday, as no more rain is in sight, he said."
}