{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK020KV_L.jpg",
  "title": "Hoax bomb threats force evacuations of some US statehouses",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 03, 2024 02:06PM ET",
    "Updated Jan 03, 2024 04:55PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/multiple-us-statehouses-evacuated-after-apparent-hoax-threats-3266606",
  "paragraph": "© Reuters. Law enforcement vehicles are deployed at the Mississippi State Capitol after a bomb threat was received in Jackson, Mississippi, U.S. January 3, 2024. Lauren Witte/USA Today Network via REUTERS\n(Reuters) -A spate of bomb threats on Wednesday morning forced the brief evacuations of U.S. statehouses across the country, according to the FBI and state officials, but they were later determined to be hoaxes. Local officials reported that threats were made to the state capitols in Connecticut, Georgia, Kentucky, Michigan, Mississippi and Montana. Police swept the buildings but there were no reports of any explosives or suspicious equipment found by Wednesday afternoon. Even though there was no indication of a \"credible threat,\" the FBI said in a statement that it \"takes hoax threats very seriously because it puts innocent people at risk.\"  The Mississippi Department of Public Safety earlier on Wednesday said the \"threat has now been cleared.\" Montana's Department of Administration General Services said \"the threat was found to not be credible\" and that the statehouse had reopened to the public. Connecticut's statehouse was briefly closed before reopening after police determined the threat to be a hoax, the Middletown Press reported. Kentucky Governor Andy Beshear said in a statement that \"everyone was safe\" and that the state Capitol had been evacuated while police investigated. \"We are aware of similar threats made to other offices across the country,\" his statement said. Police said it was safe for people to return to the capitol, Kentucky Secretary of State Michael Adams said. \nThe Lexington Herald-Leader newspaper said an email containing a bomb threat was sent to multiple secretaries of state, including Adams. Michigan State Police said the statehouse in Lansing would remain closed for the rest of the day out of \"an abundance of caution\" after an emailed bomb threat was received at about 7:45 a.m."
}