{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0T0P1_L.jpg",
  "title": "Google parent Alphabet ad revenue disappoints, CapEx up; shares sink 6%",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 01, 2024 03:00PM ET",
    "Updated Feb 01, 2024 03:09PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/google-parent-alphabet-ad-revenue-disappoints-capex-up-shares-sink-6-3290406",
  "paragraph": "By Jeffrey Dastin and Akash Sriram (Reuters) -Alphabet disappointed Wall Street on Tuesday as holiday-season advertising sales came in below expectations and the company said its spending on items such as servers to power artificial intelligence would jump this year. Alphabet (NASDAQ:GOOGL) shares fell 6% in after-hours trade. Against a backdrop of mixed U.S. economic signals, Alphabet's powerhouse units Google and YouTube have faced competition for ad budgets from other online platforms, including Facebook (NASDAQ:META), Instagram, TikTok and Amazon.com (NASDAQ:AMZN). With retail sales a bright spot, the company's fourth-quarter ad revenue rose to $65.5 billion from $59.0 billion a year prior. That was short of analysts' average expectation for $66.02 billion according to LSEG data. \"Alphabet's disappointing ad revenue numbers suggest that corporations worldwide are still uncertain about the pace of interest rate cuts from global central banks,\" said Thomas Monteiro, an analyst at Investing.com.  Google, inventor of foundational technology for today's AI boom, is also locked in battle with two industry players that have captured the business world's attention, ChatGPT's creator OpenAI and its backer Microsoft (NASDAQ:MSFT). While Google Cloud's revenue topped Wall Street targets and growth rebounded with a boost from AI, Microsoft's Azure grew faster in the same period. Powering such AI requires heavy investment in servers, data centers and research. Alphabet's capital expenditure shot up 45% to $11 billion, the highest in years, and Chief Financial Officer Ruth Porat told analysts on a conference call that capital expenditures would be notably larger this year than in 2023. To restrain costs, technology giants have been winding down non-priority projects and cutting jobs. Alphabet expects $700 million in severance-related expenses in the first quarter, Porat said. Google is bringing a powerful suite of models called Gemini to its ChatGPT rival Bard. It also struck a deal to invest up to $2 billion in high-profile AI startup Anthropic as it courts customers from larger cloud rivals Microsoft and Amazon. And it is putting Gemini into advertisers' hands to keep their dollars flowing to Google's search business. Still, AI's advertising boost may remain far off as geopolitical and economic uncertainty could discourage ad buyers. The U.S. has started probing AI investments including Alphabet's, and Google is gearing up to appeal a major antitrust case it lost. Alphabet posted fourth-quarter profit of $20.7 billion.  'MORE LIKE AN AGENT' In the call with analysts, CEO Sundar Pichai touted progress with AI across Alphabet's business, for instance opening up new questions Google can deftly answer. Frenzy has gripped the technology sector since OpenAI's November 2022 launch of ChatGPT, which showed the public how so-called generative AI can conjure new text and images on a simple command. Advances have also raised the prospect of AI \"agents\" handling humans' requests with greater autonomy. Asked about the company's digital aide known as Google Assistant, Pichai said AI \"allows us to act more like an agent over time\" and \"go beyond answers and follow through for users even more.\" As Alphabet focuses on AI, investors have grown increasingly interested in Google Cloud. Last year the division earned its first-ever quarterly profit, but revenue growth had slowed as customers streamlined cloud spending. Microsoft has been a fierce competitor, adding AI to its cloud and productivity suite long embraced by enterprises, while Google has marketed rival tools. Pichai told analysts that generative AI was boosting cloud growth. Google Cloud revenue in the latest quarter of $9.2 billion beat expectations for $8.9 billion. That marked a re-acceleration of cloud revenue growth from the previous quarter to 25.7% but was slower than 32% growth in the year-ago quarter. \nMicrosoft on Tuesday reported that sales of its cloud platform, Azure, grew 30%. Overall Alphabet's revenue for the quarter ended Dec. 31 stood at $86.3 billion, compared with estimates of $85.3 billion according to LSEG data."
}