{
  "image": "https://i-invdn-com.investing.com/news/LYNXMPEA74100_L.jpg",
  "title": "Bitcoin's Big Move Might Trigger $1 Billion Liquidations, Analyst Warns BTC Bears",
  "category": "Cryptocurrency news",
  "publisher": "U.Today",
  "date": "Published Feb 03, 2024 03:27PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/cryptocurrency-news/bitcoins-big-move-might-trigger-1-billion-liquidations-analyst-warns-btc-bears-3291948",
  "paragraph": "U.Today - The Glassnode cofounder, who goes by the handle \"Negentropic\" on X, is discussing the Bitcoin price.\nThe Glassnode cofounder shares his thoughts in a new tweet, highlighting that liquidity remains key for the BTC price. He offers his analysis, stating that Bitcoin's recent surge above $42,200 provided liquidity for long positions with a neutral impulse.\nAt the moment, he says the Bitcoin price is moving to fill the liquidity gap above $42,000, indicating potential volatility and about $659 million in liquidations have occurred.\nBased on this, Negentropic offers his outlook that bullish momentum could trigger $1 billion in short position liquidations, potentially propelling the market upward. This scenario might trigger a \"short squeeze,\" which happens when the price of an asset sharply increases as a large number of short sellers are compelled to exit their positions.\nThis bullish outlook is consistent with a drop in selling pressure from investors taking profits in Grayscale Bitcoin Trust (GBTC).\nGBTC outflows appear to be slowing in recent days, and China's central bank has announced a $140 billion injection into the financial system.\nThe Glassnode cofounder stated in an earlier tweet that the liquidity surge has begun as China attempts to prop up its markets with enormous liquidity. He believes this might be the catalyst that propels the cryptocurrency and equity markets into the first half of 2024.\nBitcoin might reach $50,000 in Q1, 2024BTC rose to a high of $42,839 on Jan. 28 before falling to roughly $42,000 at press time. The latest Bitcoin price action is part of a recovery rally that began last week following a pullback to $38,500.Markus Thielen of 10x Research forecasts that Bitcoin prices could reach $50,000 by the end of the first quarter.\n\"Bitcoin rallied just shy of the 42,800 short-term resistance level implied by the November to January trend channel. While the 43,000–44,000 area probably turns into a minor resistance area, we expect Bitcoin to pierce through and reclaim the 50,000+ level by the end of this quarter,\" Thielen wrote in a tweet on Monday. \nThis article was originally published on U.Today"
}