{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0108N_L.jpg",
  "title": "Factbox-Who is Vivek Ramaswamy, 2024 US presidential candidate?",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 11, 2024 11:52AM ET",
  "comments": [
    1,
    [
      [
        "Ken Roth",
        "2024-01-11 17:51:16",
        "He is a US traitor of our democratic values that all we need to know and he belongs in india not in USA",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/factboxwho-is-vivek-ramaswamy-2024-us-presidential-candidate-3272730",
  "paragraph": "By Tim Reid (Reuters) -Vivek Ramaswamy, a multimillionaire former biotech executive, hopes to jump-start his ebbing 2024 Republican presidential bid with a stronger-than-expected showing on Monday in the Iowa caucus, the first state Republican nominating contest. Here are some facts about Ramaswamy's life and career: A HINDU RAISED IN THE AMERICAN MIDWEST Ramaswamy, 38, was born in Ohio to immigrant parents from southern India. He was raised in the Hindu faith of his parents, but went to a Roman Catholic high school. He earned a biology degree at Harvard University before attending Yale Law School. Ramaswamy worked as a hedge fund investor and says he had already made several million dollars before graduating from Yale. In 2014, he founded his own biotech company, Roivant Sciences (NASDAQ:ROIV), which bought patents from larger companies for drugs that had yet to be fully developed and marketed. He resigned as CEO in 2021. In 2023, the business magazine Forbes estimated Ramaswamy's wealth at $630 million. A FORMER LIBERTARIAN RAPPER WITH A PATCHY VOTING RECORD Ramaswamy says he was a libertarian during college. While at Harvard, he would perform libertarian-themed rap songs under the stage name Da Vek. He has reprised some of his rap skills on the campaign trail this year. His performance of Eminem's \"Lose Yourself\" at the Iowa State Fair in August went viral on social media. Ramaswamy says he voted for a libertarian in the 2004 presidential election, but did not vote in 2008, 2012 or 2016. He has contributed to Republican and Democratic candidates. He says he voted in 2020 for then-President Donald Trump, the overwhelming frontrunner for the Republican Party nomination in 2024.   AN 'ANTI-WOKE' CRUSADER In recent years Ramaswamy has become a fierce conservative. In his 2021 bestseller \"Woke, Inc.,\" Ramaswamy decries decisions by some big companies to base business strategy around social justice and climate change concerns and assails \"wokeism\" as an insidious influence on hard work, capitalism, religious faith and patriotism. The book raised his profile among conservatives, and he began his rapid ascent as a right-wing star. REPUBLICAN PRESIDENTIAL CAMPAIGN Ramaswamy was a long shot when he declared for president last February. He enjoyed a small boom before settling into a distant fourth place, as Florida Governor Ron DeSantis and former South Carolina Governor Nikki Haley battle for second place. Ramaswamy's aggressive performances in the last debates, when he laid out an agenda even further to the right of Trump on some issues and repeatedly clashed with Haley, earned him both attention and criticism. He has been a fierce defender of Trump while seeking to appeal to Christian evangelicals, an important part of the Republican primary electorate. Although a Hindu, Ramaswamy has been telling voters that the U.S. is based on \"Christian values\" and \"Judeo-Christian values\" and has described himself as an American nationalist. His policy positions are mostly deeply conservative. He opposes affirmative action and supports state-level bans on abortion after six weeks, with exceptions for rape and incest and to save a mother's life. Ramaswamy wants to greatly expand the powers of the presidency and dismantle much of the federal government, including the FBI, the Department of Education and the tax-collecting Internal Revenue Service. \nHe opposes NATO membership for Ukraine and has said Kyiv should make concessions to Russia to end the war, including allowing it to retain parts of Ukraine it already occupies. While Ramaswamy has faded from the presidential race, his high profile and strong media presence have sparked speculation of him landing a cabinet office in a potential Trump administration or having a successful career in conservative media."
}