{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "Israeli drone kills deputy Hamas chief in Beirut",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 02, 2024 12:18PM ET",
    "Updated Jan 03, 2024 02:47AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Bolivar Altamirano",
        "2024-01-02 17:41:36",
        "good",
        "https://www.investing.com/members/240569393"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/israeli-drone-kills-senior-hamas-official-in-beirut-suburb-3265705",
  "paragraph": "BEIRUT (Reuters) -Deputy Hamas chief Saleh al-Arouri was killed on Tuesday night in an Israeli drone strike on Beirut's southern suburbs of Dahiyeh, a stronghold of the allied Lebanese militant group Hezbollah, signalling the conflict between Hamas and Israel could be expanding to engulf more of the region.  In response to questions from Reuters, the Israeli military said it does not respond to reports in the foreign media.  Lebanon's national news agency said the drone struck a Hamas office. Two security sources said the strike had targeted a meeting between Hamas officials and Lebanon's Sunni Islamist Jama'a Islamiya faction and left a total of four Palestinians and three Lebanese dead.  The strike marks the first targeted assassination of a Hamas official outside Palestinian Territories since the Palestinian group's deadly assault on Israeli territory on Oct. 7.  Mark Regev, an adviser to Israeli Prime Minister Benjamin Netanyahu, told MSNBC that Israel had not taken responsibility for this attack, but \"whoever did it, it must be clear: That this was not an attack on the Lebanese state.\"  \"Whoever did this did a surgical strike against the Hamas leadership,\" Regev said in the interview. Arouri was deputy head of Hamas's politburo and a founder of its military wing, the Qassam Brigades. He had spent time recently in both Lebanon and Qatar, which has mediated talks between Hamas and Israel including on hostages Hamas took in its Oct. 7 assault. The U.S., which brands Hamas a terrorist group, had last year offered $5 million for information on Arouri.  Hamas confirmed Arouri's killing and said Qassam Brigade officials Samir Findi Abu Amer and Azzam Al-Aqraa Abu Ammar were also killed.  Hamas chief Ismail Haniyeh on Tuesday said Arouri's killing is \"terrorist act,\" a violation of Lebanon's sovereignty and an expansion of Israel's hostility against Palestinians. Islamic Jihad vowed revenge in a statement, saying: \"This crime will not go unpunished and the resistance will continue until the occupation is removed.\" Iran said the killing would further galvanize the fight against Israel, while Yemen's Houthi movement expressed condolences.  In Ramallah in the Israeli-occupied West Bank, hundreds took to the streets to urge retaliation, shouting \"Revenge, revenge, Qassam.\"  'NEW CRIME'  A Reuters witness in Dahiyeh saw firefighters and paramedics gathered around a multi-storey building with a gaping hole in what appeared to be the third floor. Limbs and other pieces of flesh could be seen on the roadside.  Lebanon's caretaker prime minister Najib Mikati called the strike a \"new Israeli crime\" and said it was an attempt to pull Lebanon into war. His office said he asked Lebanon's foreign minister to file a complaint to the United Nations Security Council.  In a written statement, Hezbollah said the attack \"will not go without a response or punishment,\" adding that the resistance has \"its finger on the trigger.\" It announced an attack on Israeli forces across the border but did not specify whether it was in response to Arouri's killing.  Hezbollah chief Sayyed Hassan Nasrallah plans an address on Wednesday to commemorate the fourth anniversary of the killing of Iranian Quds Force chief Qassem Suleimani in a U.S. drone strike on Baghdad.  In a televised speech in August, Nasrallah had cautioned Israel against carrying out any assassinations on Lebanese soil, vowing a \"severe reaction.\"  Hezbollah controls security in the southern suburb of Dahiyeh. In 2019, two Israeli drones crashed in the district. Hezbollah has been exchanging near-daily fire with Israel since Hamas carried out the Oct. 7 attack, but the violence has mostly been limited to the border region between Lebanon and Israel. \nIsraeli air strikes and shelling have killed more than 100 Hezbollah fighters and nearly two dozen civilians since then, including children, elderly people and several journalists. Israel says 1,200 people were killed and 240 were taken hostage on Oct. 7. Israel has responded with a nearly three-month-old offensive in Hamas-run Gaza where Palestinian health officials say the death toll has surpassed 22,000."
}