{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK030D1_L.jpg",
  "title": "In the ruins of a historic market, a Japanese artisan looks for his cats",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 04, 2024 07:10AM ET",
    "Updated Jan 04, 2024 08:18AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/in-the-ruins-of-a-historic-market-a-japanese-artisan-looks-for-his-cats-3267182",
  "paragraph": "5/5\n© Reuters. Japanese lacquer artist Kohei Kirimoto takes photos, while searching for his cats, next to an \"Asaichi\" morning market which burnt down in a quake-triggered fire, in Wajima, Japan, January 4, 2024. REUTERS/Kim Kyung-Hoon\n2/5\nBy Kiyoshi Takenaka WAJIMA, Japan (Reuters) - Kohei Kirimoto, an 8th-generation lacquerware artisan, walked through the ruins of his century-old workshop in the Japanese coastal town of Wajima on Thursday, concerned only for his missing cats. The workshop, renowned worldwide for its traditional lacquerware, lay in a smouldering heap following the New Year's Day earthquake and subsequent fire that engulfed it. Kirimoto put out food and water not just for the three cats that lived in what had been his home and workspace, but also for the dozens of community felines that lived in Wajima's \"Asaichi\" morning market, famed for its winding rows of stalls of seafood, snacks and craftworks. \"The warmth of the people in this area and in the land was reflected in the everyday lives of the cats,\" said Kirimoto, 31. \"I want to help those cats that are hiding somewhere to get back to their daily existence.\" Wajima was one of the hardest-hit communities when a 7.6 magnitude earthquake struck central Japan on the afternoon of New Year's Day, in what was the strongest temblor the country has seen since the 2011 Fukushima disaster. Nearly 100 people have been confirmed dead and the search for survivors continues. The quake hit the highest reading on Japan's intensity scale, buckling roads and knocking down hundreds of buildings. But perhaps the biggest cultural loss was a massive fire that consumed most of the Asaichi market that dates back 1,000 years. The Kirimoto family have been a mainstay in Wajima for more than 200 years, producing the finely polished \"urushi\" wooden bowls and furniture that is a cultural heritage of the country. Kirimoto himself has gained international acclaim melding that art with jewellery and designer bags. Poking around in the rubble, he said this ancient legacy and its fame were far from his mind. \"I'm not worried about the tools and the art,\" he said. \"I can re-create those works as many times as I want. I am only concerned about life, only about the cats' lives.\" As Kirimoto walked around putting out rations for the cats, some friends and acquaintances stopped to chat. Soaking in the scene of destruction together, they were reminded of the work that lay ahead after the initial shock of the disaster. \"Right now, our minds are blank,\" he said. \"But we need to burn this image in our minds, record it with snapshots, and then eventually start the recovery process. That's all there is to do.\" Wajima was only recently bouncing back from the COVID-19 crisis that starved the city of tourists and trade. The outbreak brought with it a personal toll as well, which the cats had helped ease, Kirimoto said. Two of them he adopted recently from a nearby shrine. Another three-year-old was his constant companion through the pandemic. \n\"I'm thankful for all the happiness they gave me,\" he said, breaking into sobs. \"I'm grateful.\" (This story has been refiled to correct the spelling to 'workshop' from 'workship', in paragraph 2)"
}