{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0E00G_L.jpg",
  "title": "China urges larger-scale Gaza peace conference as conflict escalates",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 14, 2024 07:26PM ET",
    "Updated Jan 15, 2024 03:27AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/china-calls-for-largerscale-peace-conference-on-gaza-crisis-wang-yi-3274174",
  "paragraph": "5/5\n© Reuters. Chinese Foreign Minister Wang Yi holds a press conference, in Cairo, Egypt January 14, 2024. REUTERS/Mohamed Abd El Ghany\n2/5\nBEIJING (Reuters) - China's Foreign Minister Wang Yi called for a larger, more authoritative Israeli-Palestinian peace conference and a timetable to implement a two-state solution as the Gaza conflict escalated and the Red Sea became a new flash point. Speaking to reporters after talks with Egyptian Foreign Minister Sameh Shoukry in Cairo on Sunday, Wang said the international community should \"listen\" carefully to the legitimate concerns in the Middle East.  \"China calls for the convening of a larger-scale, more authoritative and more effective international peace conference, the formulation of a specific timetable and road map for the implementation of the 'two-state solution', and support for the prompt resumption of Israel-Palestinian peace talks,\" Wang said. A Chinese foreign ministry spokesperson said on Monday that the road map needed to be \"binding\".  \"As for the timing and venue of the conference and where it will be hosted, I think it needs to be determined by all parties through consultation,\" Mao Ning said at a regular news conference in Beijing.  \"China also welcomes the active role of the United Nations in this regard,\" she said.  Last week, the United States and Britain launched strikes against Houthi targets in Yemen after the group attacked ships in the Red Sea. The Houthis said their attacks are a show of support for Palestinians and Hamas, the Islamist group that controls Gaza. The Red Sea attacks have forced commercial ships to take a longer, costlier route around Africa, stoking concern about inflation and supply chain disruptions. They are also bringing the Gaza crisis much closer to China's investments in the Suez Canal east of Cairo. China avoids being a direct party in any military conflicts, but says it is keen to raise its \"international influence, appeal and power\" to shape events through diplomacy. Last week, Wang said President Xi Jinping had \"in-depth communication\" with the leaders of Saudi Arabia and Iran to persuade the Middle East powers to let go of past grievances, and their restoration of ties in 2023 had set off a \"wave of reconciliation\" across the Middle East.  Wang is currently travelling through Egypt, Tunisia, Togo and the Ivory Coast until Thursday.  \nChina's top diplomat also held talks on Sunday with the Secretary-General of the Arab League on the Gaza conflict and expressed concerns over the Red Sea. \"Influential countries, in particular, need to play an objective, impartial and constructive role in this regard,\" the two diplomats said in a joint statement released on Monday by the Chinese foreign ministry."
}