{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK030FJ_L.jpg",
  "title": "'Second half of the year', UK PM fires starting gun on election",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 04, 2024 08:01AM ET",
    "Updated Jan 04, 2024 09:01AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/uks-sunak-expect-to-hold-election-in-second-half-of-year-3267310",
  "paragraph": "© Reuters. British Prime Minister Rishi Sunak speaks during a visit to the MyPlace Youth Centre, in Mansfield, in the East Midlands, Britain January 4, 2024. Jacob King/Pool via REUTERS\nBy Muvija M and Elizabeth Piper LONDON (Reuters) -Prime Minister Rishi Sunak fired the starting gun on Britain's next election on Thursday, saying his \"working assumption\" was it would take place in the second half of the year, all but ruling out an earlier vote opposition parties had called for. With his governing Conservatives heavily trailing Labour in the polls, Sunak moved swiftly to end calls for an early election by saying he had work to do, including cutting taxes - a major demand from some in his party. \"My working assumption is we will have a general election in the second half of this year, because in the meantime I have lots I want to get on with,\" Sunak told reporters during a visit to central England. \"I want to keep going, managing the economy well and cutting people's taxes ... I've got lots to get on with.\" Few had believed the British leader would call an early election with his Conservatives so far behind in the polls, but opposition parties had hoped to bounce him into it by saying he was running scared of voters. Pat McFadden, Labour's national campaign coordinator, accused Sunak of \"bottling\" holding the election. \"He needs to stop hiding, stop being so weak, stop squatting in Number 10 without a mandate and simply come clean with the public: when will the British people get their say on 14 years of Tory (Conservative) failure?,\" he asked in a statement. \"Even now Rishi Sunak is still leaving himself as much wiggle room as possible. But the reality is clear: the only thing worse than five more months of this Tory government would be five more years.\" PLEDGES Sunak has struggled to make progress on his main pledges, including stopping migrants arriving in small boats, growing the economy and cutting hospital waiting lists. He has hit one target of halving inflation by the end of 2023, but economists say that has little to do with government policy. He faces threats from all sides. Labour leader Keir Starmer has vowed to fight the Conservatives on the economy, traditionally seen as one of their strengths, while the right-wing Reform UK party has refused to renew its pact with the governing party to help protect its parliamentary seats. He also must try to quell a growing rebellion inside his own party, with some lawmakers threatening to try to oust him if he refuses to cut taxes, something they believe could help win back traditional Conservative supporters. Sunak will be hoping a so-called spring budget on March 6 can deliver such party-pleasing announcements. \nOn his visit to a community centre in the town of Mansfield, Sunak was asked by a supporter how he could better get his message across to voters, saying his sister, a once loyal Conservative voter, would not back the party this year. \"I'm going to be out and about myself talking about it,\" Sunak said. \"And you will see that from me every single week between now and the next election, out and about talking to people up and down the country about what we are doing to make their lives better.\""
}