{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0J09U_L.jpg",
  "title": "Zelenskiy counts on more Western defence aid for Ukraine in next two months",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 20, 2024 06:24PM ET",
  "comments": [
    5,
    [
      [
        "Mark Jannetty",
        "2024-01-21 11:35:38",
        "send them white tee shirts and sticks",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Ac Tektrader",
        "2024-01-21 08:47:33",
        "time to step up and and finish of the the Russian invaders.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "john wick",
        "2024-01-21 05:24:14",
        "Zelenskiy - putting on another drama again? An actor will forever an actor. The world loves to see acting in actions. ",
        "https://www.investing.com/members/256103011"
      ],
      [
        "Ac Tektrader",
        "2024-01-21 08:40:03",
        "John wick still pushing the Russian propaganda....",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ac Tektrader",
        "2024-01-21 08:42:16",
        "are you still in st Petersburg John, or have they moved you to the New unit in Moscow...",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Brad Albright",
        "2024-01-21 15:52:42",
        "Trying to decide weather to pay for eggs or firewood.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "David JC",
        "2024-01-20 23:54:28",
        "Perhaps he should just call for peace with Russia. Because I'm not sure more the US taxpayer can send, when we are dead broke.",
        "https://www.investing.com/members/204737048"
      ],
      [
        "David JC",
        "2024-01-21 11:35:55",
        "Ac Tektrader",
        "https://www.investing.com/members/204737048"
      ],
      [
        "David JC",
        "2024-01-21 11:37:44",
        "Ac Tektrader",
        "https://www.investing.com/members/204737048"
      ],
      [
        "David JC",
        "2024-01-21 11:39:12",
        "Ac Tektrader",
        "https://www.investing.com/members/204737048"
      ],
      [
        "Brad Albright",
        "2024-01-21 15:54:37",
        "Peace? Then you'll agree Russia should leave the sovereign country it invaded. That will bring peace in a minute.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "David JC",
        "2024-01-23 01:30:19",
        "Brad Albright",
        "https://www.investing.com/members/204737048"
      ],
      [
        "Barry Nickerson",
        "2024-01-20 23:46:44",
        "Has our Congress decided on a top dollar line on when this aid to Ukraine stops?  You all know, just like our deficit laden budget.  Maybe they'll have a fundraising concert for these other countries- War-Aid.  Bring in all the latest and greatest rappers.  Hold the concert in Gaza.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Ac Tektrader",
        "2024-01-21 08:52:33",
        "deficits caused Trump's and the Republicans massive tax giveaway....",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ac Tektrader",
        "2024-01-21 08:55:42",
        "deficits caused by Trump's and the Republican's massive tax giveaways.",
        "https://www.investing.com/members/224473057"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/zelenskiy-counts-on-more-western-defence-aid-for-ukraine-in-next-two-months-3278911",
  "paragraph": "© Reuters. FILE PHOTO: Ukraine's President Volodymyr Zelenskiy speaks during the 54th annual meeting of the World Economic Forum in Davos, Switzerland, January 16, 2024. REUTERS/Denis Balibouse/File Photo\nBy Nick Starkov KYIV (Reuters) - President Volodymyr Zelenskiy said on Saturday that he expected a number of new Western defence packages for Ukraine to be signed this and next month.  \"We are preparing new agreements with partners - strong bilateral agreements,\" Zelenskiy said in his nightly video address.  \"January and February should bring corresponding results. There are already specific dates when new and strong documents can be expected.\" After Russia launched its full-scale invasion of Ukraine in February 2022, Kyiv's Western allies united in providing unprecedented military and other aid to help Zelenskiy defend his country. But with the war now dragging on towards its third year, little change along the front line in the past 12 months and growing opposition to more aid in the United States, funds and equipment in recent months have been slow coming in.  Zelenskiy did not name the countries with which he hoped to finalise agreements. The Ukrainian president has spent weeks on an international diplomatic frenzy trying to secure more political and military support. He has often repeated that Russia's increased winter air strikes and Moscow's slow but gruelling offensive in Ukraine's east have underlined the need for more reinforcement of Kyiv's air and ground defences.  \nEarlier this month, Britain, one of Kyiv's staunchest supporters, said it will increase its support for Ukraine in the next financial year to 2.5 billion pounds ($3.19 billion). French President Emmanuel Macron said on Tuesday he would head to Ukraine in February to finalise a bilateral security guarantee deal under which Paris would deliver more sophisticated weaponry, including long-range cruise missiles."
}