{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0L0MY_L.jpg",
  "title": "Why is Canada capping foreign students and who will be impacted?",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 22, 2024 01:04PM ET",
    "Updated Jan 23, 2024 12:25PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/explainerwhy-is-canada-capping-foreign-students-and-who-will-be-impacted-3279932",
  "paragraph": "© Reuters. FILE PHOTO: A student walks in front of the University of Toronto, St. George campus, in Toronto, Ontario, Canada September 26, 2023. REUTERS/Wa Lone\n(This Jan. 22 story has been refiled to fix tense to say students are now required to have GICs of above C$20,000, in paragraph 12) By Wa Lone TORONTO (Reuters) - Canada on Monday announced a two-year cap on the intake of foreign students after explosive growth in recent years aggravated the country's housing shortage. Last year Canada issued nearly 1 million study permits, about three times that of a decade ago, according to government data. The new proposal will cut the intake by nearly a third. Here is how the new plans will work and what is at stake. WHAT ARE THE DETAILS? Canada's immigration minister, Marc Miller, said the Liberal government will introduce a temporary, two-year cap on student visas, which will result in the issue of about 364,000 visas in 2024. The new proposals will also set limits on post-graduate work permits issued to foreign students, which will likely encourage them to return to their home countries. The permits were previously seen as an easy path to securing permanent residency. People pursuing master's or post-doctorate programs will be eligible for a three-year work permit. Spouses of international students enrolled in other levels of study, including undergraduate and college programs, will no longer be eligible, Miller said. The acceptance of new study permit applications in 2025 will be subject to reassessment at the end of the current year, he said. WHY IS GOVERNMENT CRACKING DOWN? Canada has emerged as a popular destination for international students since it is relatively easy to obtain work permits after finishing courses. But the surge in international students led to an acute shortage in rental apartments, which pushed up rents. In December, rents nationwide rose 7.7% from a year earlier, according to Statscan. Prime Minister Justin Trudeau's popularity has been dented mainly due to the affordability crisis, and opposition Conservative Party leader Pierre Poilievre has taken a commanding lead over Trudeau in opinion polls ahead of an election next year. Apart from the rental crisis, the government has also been concerned about the quality of education provided by some of the institutions. WHOM WILL THIS IMPACT? International students contribute about C$22 billion ($16.4 billion) annually to the Canadian economy. The move will hurt many educational institutions that had expanded their campuses in the hope of a continued inflow of students. Ontario, the most populous province, received the biggest share of international students. Some businesses, including restaurants and retail sectors, have warned that a cap on foreign students will create a shortage of temporary workers. Restaurants across Canada are grappling with labour shortages with nearly 100,000 vacancies, and international students made up 4.6% of 1.1 million workers in the food service industry in 2023, a lobby group told Reuters last week. Canadian banks had benefited from the influx of new students, as each student is now required to have a Guaranteed Investment Certificates (GIC) of more than C$20,000, a prerequisite for international students to cover living expenses. \nThe vast majority, about 40%, of foreign students come from India, with China coming in second with about 12%, according to official data from 2022. The University of Toronto said in a statement that it looks forward to working with all levels of government to ensure that the allocation of study permits recognizes institutions like U of T and addresses the problem where the challenges lie."
}