{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBQ0AM_L.jpg",
  "title": "Two U.S. senators call for Tesla recalls after Reuters investigation",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 27, 2023 08:43AM ET",
    "Updated Dec 28, 2023 07:50AM ET"
  ],
  "comments": [
    9,
    [
      [
        "Lemon Lime",
        "2023-12-29 01:58:26",
        "Tesla rode the Obama environmentalist policies to billions. Just fix the stupid cars.",
        "https://www.investing.com/members/221420177"
      ],
      [
        "jimmi james",
        "2023-12-28 07:21:18",
        "so 2 but hurt libs crying...im shocked.",
        "https://www.investing.com/members/213034035"
      ],
      [
        "Lemon Lime",
        "2023-12-27 23:31:36",
        "Many Tesla fanboys on this site. ",
        "https://www.investing.com/members/221420177"
      ],
      [
        "jimmi james",
        "2023-12-28 07:21:52",
        "not about tesla...its about abuse of power. get a clue.",
        "https://www.investing.com/members/213034035"
      ],
      [
        "Donald Ye",
        "2023-12-27 18:40:50",
        "Shutup Reuters, a frequent rumor source",
        "https://www.investing.com/members/209312328"
      ],
      [
        "P Lance Sheldon",
        "2023-12-27 17:41:31",
        "Reuters didn't do their journalistic due diligence on the Tesla hit piece. A few anecdotal failures does not a news story make. All cars, including those with the very lowest failure rates still have failures. A serious non-gossip journalist would check statistical failure rates of other manufacturers as well as statistical rates of the manufacturer in question. Otherwise, the story is a conspiracy theory at best. Basically worthless gossip worthy only of gossip publishers.",
        "https://www.investing.com/members/255854011"
      ],
      [
        "François Delepine",
        "2023-12-27 16:44:21",
        "Is it possible to remove Reuters spam?",
        "https://www.investing.com/members/211114428"
      ],
      [
        "michael lambiase",
        "2023-12-27 16:32:18",
        "Another BS story from Reuters. ",
        "https://www.investing.com/members/228309000"
      ],
      [
        "John Lynch",
        "2023-12-27 15:14:37",
        "Are you sure this is not about President Biden's attack on Elon Musk that has spread across government agencies like wildfire?  What are we up to, 8 agencies and now the Senate?",
        "https://www.investing.com/members/238560921"
      ],
      [
        "Cristiano Dangelo",
        "2023-12-27 13:52:16",
        "BS! ",
        "https://www.investing.com/members/215428483"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/exclusivetwo-us-senators-call-for-tesla-recalls-after-reuters-investigation-3264021",
  "paragraph": "By Steve Stecklow (Reuters) -Two U.S. senators have written to Elon Musk, Tesla’s top executive, calling on him to “swiftly” recall any steering and suspension parts that pose a safety risk. The letter cites “an alarming” Reuters investigation published on December 20 that exposed how Tesla (NASDAQ:TSLA) has blamed drivers for frequent failures of components it has long known were defective. “We write with extreme concern following recent reporting about Tesla’s knowledge of safety flaws in its vehicles and concealment of the causes of these flaws from the National Highway Traffic Safety Administration,” states the letter, which is signed by Senators Richard Blumenthal, of Connecticut, and Edward J. Markey, of Massachusetts. The senators call on Musk to correct “apparent false and misleading representations” made to the safety agency. The Reuters report found that Tesla told NHTSA and customers that the frequent failures of defective parts in its electric vehicles were caused by driver “abuse,” such as hitting a curb. In 2020, Tesla gave that explanation in a letter to the safety agency explaining why it would not recall a suspension part called the aft link in the United States, despite having just recalled it in China. Tesla documents reviewed by Reuters show the automaker’s engineers for years tracked frequent failures of aft links and other suspension, steering and axle parts, often on relatively new cars. The company instructed its service managers to tell customers that the parts were not faulty as it struggled to contain soaring warranty costs, the records reviewed by Reuters show. “We are disturbed that you would blame your customers for these failures,” stated the letter from Blumenthal and Markey, both Democrats. “It is unacceptable that Tesla would not only attempt to shift the responsibility for the substandard quality of its vehicles to the people purchasing them, but also make that same flawed argument to NHTSA.” Musk and Tesla did not immediately respond to requests for comment on the senators’ letter.  After this article was published, Tesla posted a response to the Reuters investigation on Musk’s social media platform, X, formerly known as Twitter. The automaker said the article’s headline – “Tesla blamed drivers for failures of parts it long knew were defective” – was “wildly misleading\" and said the story “is riddled with incomplete and demonstrably incorrect information.” Tesla said its “customer retention is among the best and highest in the industry” and the company “is truthful and transparent with our safety regulators around the globe and any insinuation otherwise is plain wrong.” The automaker also challenged one customer's account that the suspension on his 2023 Model Y collapsed one day after he bought the car. Tesla said its \"telemetry\" data showed there was a prior \"crash that resulted in this repair not being covered by warranty.\" The owner told Reuters he was the only person who drove the car before the suspension failure and hadn't had an accident. Sweden's Transport Agency said on Friday that it’s investigating suspension failures in Tesla cars. The inquiry is similar to one being carried out in neighboring Norway, where the Norwegian Public Roads Administration said last week it was looking into consumer complaints about lower rear control arms breaking on its Model S and X vehicles. \nMarkey and Blumenthal have previously raised concerns about Tesla's marketing practices and the safety of its automated driving technology. In April, the senators wrote to Musk questioning him about another Reuters investigation, which reported that groups of Tesla employees had circulated, via an internal messaging system, private and sometimes highly invasive recordings from customers' car cameras."
}