{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK040P4_L.jpg",
  "title": "Colorado officer sentenced to 14 months in jail in killing of Elijah McClain",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 05, 2024 06:04PM ET",
    "Updated Jan 05, 2024 06:50PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/colorado-officer-sentenced-to-jail-in-killing-of-elijah-mcclain-3268495",
  "paragraph": "© Reuters. FILE PHOTO: Randy Roedema, one of three Aurora police officers in addition to two paramedics criminally charged in the death of Elijah McClain, a Black man who died in 2019 after being subdued and injected with a sedative, approaches the Adams County Just\nBy Brad Brooks LONGMONT, COLORADO (Reuters) -A former Colorado police officer was sentenced to 14 months in jail for his role in the 2019 killing of Elijah McClain, a young Black man who was not suspected of any crime when police roughly restrained him and paramedics injected him with a powerful sedative. Former Aurora police officer Randy Roedema, 41, who faced up to three years in prison, was found guilty by a jury in October of criminally negligent homicide and third-degree assault. The same jury found fellow police officer Jason Rosenblatt, 35, not guilty in a joint trial.  Judge Mark Warner sentenced Roedema to 14 months in jail for the third-degree assault conviction. He also ordered four years probation and 90 days incarceration, to be served concurrently with the assault sentence, for criminally negligent homicide.  Roedema was not immediately taken into custody. He has until March 22 to turn himself in to the Adams County jail.  \"The court was shocked by what appeared to be really indifference to Elijah McClain's suffering,\" Warner said before issuing the sentence.  Sheneen McClain, mother of the 23-year-old, addressed the judge before the sentence was announced, saying that she searched for any hint of remorse as sat through the trials of those who killed her son. \"I have found none,\" she said. \"I have listened to the trials to see if I could hear it in their voices, but instead I only heard lies and blaming others for their trained cruelty.\"  Roedema expressed his condolences to the McClain family in court on Friday. He did not apologize for Elijah McClain's death and said he took the actions he did because he was following his training.  \"I cannot help but contemplate all the different scenarios that could have taken place that evening that may have resulted in a different outcome,\" Roedema told the court. \"For example, I wish that a bystander would not have made that (911) call.\"  Prosecutor Jason Slothouber told the judge that Roedema's statement showed \"no acknowledgement of his intent to harm Mr. McClain through pain, no acknowledgement of his gross deviations from his training - in fact, quite the opposite.\"  There were three trials in total involving McClain's death.  In a second trial, Aurora police officer Nathan Woodyard, 34, was found not guilty of manslaughter in November.  The third trial saw paramedics Jeremy Cooper, 49, and Peter Cichuniec, 51, found guilty of criminally negligent homicide in a trial last month. They will be sentenced on March 1.  BRUTAL CONFRONTATION Police confronted McClain as he walked home from a convenience store after a bystander called 911 to report a man dressed in a winter coat and ski mask on a warm night was acting suspiciously. Police laid hands on the young man within seconds of stopping him and put him in a carotid chokehold at least twice. He vomited into his ski mask and repeatedly told officers he could not breathe.  During Roedema and Rosenblatt's trial, defense attorneys played body camera audio in which Roedema can be heard yelling that McClain tried to grab Rosenblatt's gun. The police actions escalated sharply after that. Prosecutors noted that there was no video showing any grab for a gun and suggested during the trial that Roedema was lying or mistaken.  The original autopsy conducted in 2019 found the cause of death to be \"undetermined.\" A revised autopsy report in 2021 concluded McClain died from \"complications of ketamine administration following forcible restraint.\" \nLocal prosecutors initially declined to file charges. That changed following the May 2020 killing of George Floyd, a Black man who died at the hands of Minneapolis police. Colorado Governor Jared Polis in June 2020 asked the state attorney general's office to investigate McClain's case. A state grand jury indicted the officers and paramedics in 2021."
}