{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK12034_L.jpg",
  "title": "Israel pressures Gaza cities, health officials say 18 die in airstrikes",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 03, 2024 08:09AM ET",
    "Updated Feb 03, 2024 09:13AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/israel-keeps-pressure-on-last-two-refugee-cities-kills-18-health-officials-say-3291890",
  "paragraph": "2/2\n© Reuters. View of Rafah, southern Gaza Strip November 6, 2023 in this handout satellite image. Maxar Technologies/Handout via REUTERS \n2/2\nBy Nidal al-Mughrabi and Ibraheem Abu Mustafa DOHA/GAZA (Reuters) - Israeli airstrikes killed 18 Palestinians in the Gaza cities of Rafah and Deir Al-Balah, Gaza health officials said on Saturday, as residents of the enclave feared Israel would expand its ground offensive into those last remaining areas where people have sought shelter. Rafah is on Gaza's southern border with Egypt and more than half the enclave's 2.3 million population have fled there as the Israel Defense Forces press their nearly four-month-old war against the militant Hamas group. Health officials in Gaza said an Israeli airstrike on a house in Rafah killed 14 people including women and children, Gaza health officials said.  There was no confirmation from the Israeli military that it carried out the strike. A military spokesperson said: \"In stark contrast to Hamas' intentional attacks on Israeli men, women and children, the IDF follows international law and takes feasible precautions to mitigate civilian harm.\" The months of intense Israeli bombardment, triggered by Hamas' deadly attack on Israel on Oct. 7, has laid waste to Gaza and set off wider conflict in the region. The United States launched airstrikes on Friday in Iraq and Syria against targets linked to Iran's Revolutionary Guard and the militias it backs, in retaliation for a deadly attack on U.S. troops. Gaza health authorities, who do not differentiate between militants and civilians in their tallies, say more than 27,000 Palestinians have been confirmed killed since the start of the war, 107 of them in the past 24 hours, with thousands more feared lost amid the ruins. Israel launched its war on Hamas after the Oct. 7 onslaught by Hamas militants who killed 1,200 people and took 253 people hostage into Gaza, more than 100 of whom are still captive, according to Israeli tallies. Israeli officials say they aim to eliminate Hamas, which has vowed to repeat its October attacks, and repatriate the hostages, many of whom are women and children. TAKING REFUGE IN RAFAH Tens of thousands of people have arrived in Rafah in recent days carrying belongings in their arms and pulling children on carts, since Israeli forces last week launched one of their biggest assaults of the war to capture nearby Khan Younis, the main southern city. Israeli Defence Minister Yoav Gallant said on Thursday forces would now press on to Rafah. \"The place turned black, I couldn't see what's in front of me. It was all dust and dirt. I was touching my surroundings, I was looking for my mobile to use the flashlight to look for my children, where are they? I found them under the rubble,\" said Ahmed Bassam Al-Jamal, whose son was killed in Rafah. \"I cried for help and people came. I got out Yamen, the first one, he was the only one I can see, the rest were still under the rubble. They pulled out Yamen, Eileen and Sila and they pulled out their mother (all alive). We could not find Bassam, we were looking for him, but he was buried, we could not save them, I swear we couldn't,\" Jamal said, as he bade farewell to his dead son at the hospital. In Khan Younis, residents said the army blew up a residential district near the city centre. In the nearby city of Deir Al-Balah, the second major concentration of displaced people, medics said four people were killed in an airstrike on a house earlier on Saturday. FIGHTING CONTINUES IN GAZA CITY Although Israel is focusing its push in the south, residents and militants said fighting continued in Gaza City. Gaza health officials said two people were killed by sniper fire. Israeli forces carried out arrests in the southern suburb of Tel Al-Hawa. The Israeli military said its forces killed dozens of Palestinian gunmen in northern Gaza. \"During targeted raids in the northern and central Gaza Strip over the last day, IDF troops killed dozens of terrorists and destroyed numerous anti-tank missile launchers,\" the Israel Defense Forces said. Hamas, Islamic Jihad, and other smaller militant groups said in a separate statement their fighters engaged in fierce battles with the army in the north and the south of the enclave. \"The more the occupation forces remain on the ground, the more we will get to them,\" one Palestinian militant official said. \"A martyr falls, another rises and takes the rifle, and we are ready to fight for many more months,\" he told Reuters. \nMediators are awaiting a response from Hamas to a proposal for the war's first extended ceasefire, drafted last week with Israeli and U.S. spy chiefs and communicated by Egypt and Qatar. It was unclear when Hamas leaders would visit Cairo to respond. A brief November truce lasted just one week, when militants freed 110 women, children and foreign hostages in exchange for Palestinians held in Israeli jails.  (Reporting and writing by Nidal al-Mughrabi in Doha; Additional reporting by Emily Rose in Jerusalem, Ibraheem Abu Mustafa in Gaza; Editing by Giles Elgood and Frances Kerry)"
}