{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK000A6_L.jpg",
  "title": "China's Xi, US President Biden exchange congratulations on 45 years of diplomatic ties",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 31, 2023 10:24PM ET",
    "Updated Jan 01, 2024 12:12AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Tom Saltzman",
        "2024-01-01 14:06:48",
        "Xi's puppet.",
        "https://www.investing.com/members/200520915"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/chinas-xi-us-president-biden-exchange-congratulations-on-45th-year-of-diplomatic-ties-3265020",
  "paragraph": "© Reuters. U.S. President Joe Biden meets with Chinese President Xi Jinping on the sidelines of the G20 leaders' summit in Bali, Indonesia, November 14, 2022. REUTERS/Kevin Lamarque\nBy Liz Lee BEIJING (Reuters) -China's President Xi Jinping exchanged congratulations with U.S. President Joe Biden on the 45th anniversary of diplomatic ties between the two countries, the Chinese foreign ministry said on Monday. Xi, in his message, said both countries have \"weathered the storms and moved forward in general\", which has enhanced the well-being of their peoples and contributed to world peace, stability and prosperity, according to the ministry statement. Xi called China and U.S. forming ties \"a major event\" in the history of bilateral relations and in international relations. China-U.S. ties have been frosty but Biden administration officials have visited Beijing and met with their counterparts to rebuild communications and trust in the months leading up to a high-stakes summit between Xi and Biden in San Francisco in November, deemed an opportunity to cool tensions between the world's two largest economies. Xi said the summit has pointed out the direction for both nations' ties, under a future-oriented vision. \"I am willing to work with President Biden to continue to steer and navigate the China-U.S. relationship for the benefit of China and the U.S. and the two peoples, and to promote the cause of world peace and development,\" Xi said. The U.S. is due its presidential election in November, in which former president and outspoken critic of China Donald Trump is campaigning against Biden to come back for a second term. NEW YEAR'S WISHES Xi also exchanged New Year's messages with North Korea leader Kim Jong Un, and both announced 2024 to be a \"friendship year\" for both countries, launching a series of activities for that, the Chinese foreign ministry said separately. Xi said China is willing to work with North Korea to deepen strategic mutual trust, enhance exchanges and cooperation, promote greater bilateral ties and make new contributions to the maintenance of peace and stability in the region. On New Year's Eve, the Chinese leader exchanged greetings with Russian President Vladimir Putin as well. This year is the 75th anniversary of China and Russia establishing diplomatic relations. Russia's economic reliance on China has grown as the country becomes increasingly isolated, hit by sanctions especially from Western countries since its invasion of Ukraine, a war which will enter its third year come February. Xi said China and Russia should \"continuously consolidate\" and develop ties \"featuring permanent good-neighbourly friendship\", along with comprehensive strategic coordination and mutually beneficial cooperation that would serve both countries' interests. This year marks the 75th anniversary of the founding of the People's Republic of China by Mao Zedong, who defeated Republic of China forces led by Chiang Kai-shek in a bloody civil war. \nMao declared the People's Republic of China on Oct. 1, 1949, while Chiang's government fled into exile in Taiwan in December of that year. No peace treaty has ever been signed to end the war and the Republic of China remains Taiwan's formal name. Xi said in his New Year's address on Sunday that China's \"reunification\" with Taiwan is inevitable, striking a stronger tone than he did a year earlier with less than two weeks to go before the democratically governed island elects a new leader."
}