{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0F0UU_L.jpg",
  "title": "Another Trump presidency will not be easy for Canada -PM Trudeau",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 16, 2024 02:57PM ET",
  "comments": [
    1,
    [
      [
        "Ken Roth",
        "2024-01-17 10:22:14",
        "If Trump wins it means that all current criminal charges are deleted which is only possible if a president has immunity and can never be tried for criminal acts against american people. Then not only Canada will suffer but all US allies will lose when a large democracy in the world will turn into an authoritarian regime with an immune King that can hire seal team six to ki.l all political opponents in the future. Guess we would be in for a Trump regime for centuries like North korea where his children and grandchildren are sun gods of USA.",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/another-trump-presidency-will-not-be-easy-for-canada-pm-trudeau-3275527",
  "paragraph": "© Reuters. U.S. President Donald Trump talks with Canada's Prime Minister Justin Trudeau during a North Atlantic Treaty Organization Plenary Session at the NATO summit in Watford, Britain, December 4, 2019. REUTERS/Kevin Lamarque/File Photo\nBy David Ljunggren OTTAWA (Reuters) - If Republican frontrunner Donald Trump wins the U.S. presidential election in November, it will be \"a step back\" that makes life tough for Canada, Prime Minister Justin Trudeau said on Tuesday. Trudeau, whose center-left Liberals came to power in November 2015, had rocky relations with Trump during his first four-year White House term. In 2018, Trump accused Trudeau of being weak and dishonest. \"It wasn't easy the first time and if there is a second time, it won't be easy either,\" Trudeau said in French during a discussion hosted by the Montreal chamber of commerce. He added: \"But we can't imagine a day when it will ever be easy with the Americans. The main responsibility for any prime minister is to represent and defend Canada's interests ... we've been able to do this very well these past few years.\" Canada sends 75% of its goods and services exports to the United States and is particularly vulnerable to any U.S. shift toward protectionism. When Trump came to power he vowed to renegotiate the free trade treaty that bound the United States. Canada and Mexico. Ottawa spent almost two years locked in talks to produce a trilateral pact that largely protected Canadian interests.  About two-thirds of Canadians surveyed this month said U.S. democracy cannot survive another four years of Trump in power, and about half said the United States is on the way to becoming an authoritarian state, a poll released on Monday said. A Trump win would be \"a step back\" and a victory for \"a populism that reflects a lot of anguish and fury ... without necessarily providing solutions\", Trudeau said. The Liberals have made fighting climate change a priority and Trudeau said Trump showed little interest in the environment during \"the lost four years\" of his first term. \n\"There are clearly issues where I do not agree at all with Mr. Trump,\" Trudeau said, citing the climate question. The next Canadian election has to be held by September 2025 and the Liberals are trailing their right-of-center Conservative rivals. Trudeau repeated criticism that the party had taken its inspiration from the Trump movement."
}