{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK070FV_L.jpg",
  "title": "UN experts demand accountability for sexual torture during Hamas attacks",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 08, 2024 08:09AM ET",
    "Updated Jan 08, 2024 09:46AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/un-experts-demand-accountability-for-sexual-torture-during-hamas-attacks-3269470",
  "paragraph": "© Reuters. Signs against what protesters describe as international silence over sexual violence perpetrated against Israeli women during the attack by Palestinian Islamist group Hamas on southern Israel on October 7, are displayed on a bench at a protest in Jerusale\nGENEVA (Reuters) -U.N. experts on Monday demanded accountability for sexual violence against Israeli civilians during the Oct. 7 Hamas attacks, saying that mounting evidence of rapes and genital mutilation point to possible crimes against humanity. Israeli authorities have opened an investigation into possible sexual crimes during the most deadly attack on Israel in its history. Hamas denies the abuses. \"The growing body of evidence about reported sexual violence is particularly harrowing,\" two U.N.-appointed independent experts said in a statement on Monday. The statement referred to allegations of sexual torture including rape and gang rape as well as mutilations and gunshots to genital areas. \"These acts constitute gross violations of international law, amounting to war crimes which, given the number of victims and the extensive premeditation and planning of the attacks, may also qualify as crimes against humanity,\" the experts said. \"Each and every victim deserves to be recognised, regardless of their ethnicity, religion or sex, and our role is to be their voice,\" they added. Israel's diplomatic mission in Geneva welcomed the statement. \"The whole international community must fully recognise the brutal and terrorist nature of Hamas, and the responsibility of those who have been shielding them for years, including the Palestinian Authority,\" it said.  Israel has previously criticised the global body for not doing enough to address the issue as part of a bid to get greater recognition for the alleged crimes. \nThe two experts on torture and on executions - Alice Jill Edwards and Morris Tidball-Binz - have raised the issue with Hamas authorities, they said.  They have also written to Israel's government and called for cooperation with their investigators."
}