{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBQ074_L.jpg",
  "title": "Anti-war candidate says top Russian court backs barring her from challenging Putin",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Dec 27, 2023 07:01AM ET",
  "comments": [
    1,
    [
      [
        "Ken Roth",
        "2023-12-27 18:14:36",
        "Big surprise, that Putin will not have any opponents in the upcomming presidential election..its much easier like this for the votes they dont even have to show up in the voting center and stand in freezing cold, they can stay home and at the same time vote for putin. Thats russian democracy",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/antiwar-candidate-says-top-russian-court-backs-barring-her-from-challenging-putin-3263974",
  "paragraph": "© Reuters. Yekaterina Duntsova, a former regional journalist who was disqualified as a candidate for Russia's 2024 presidential election, attends an interview with Reuters in Moscow, Russia December 25, 2023. REUTERS/Maxim Shemetov\nMOSCOW (Reuters) -Russia's Supreme Court has upheld a decision to bar a former TV journalist who opposes the war in Ukraine from taking part in a presidential election in March, Yekaterina Duntsova, the would-be candidate, said on Wednesday. Members of the central electoral commission voted unanimously to reject the candidacy of Duntsova, citing \"numerous violations\" in the papers she had submitted in support of her bid. Duntsova, in a post on her Telegram channel, confirmed that her appeal against the decision had been rejected by the Supreme Court. She said she now planned to try to set up a new political party for people who wanted \"peace, freedom and democracy\" - ideas Duntsova said were attractive to tens of millions of Russians whose voices she said were not being represented.  Duntsova - who is not well known in Russia and, by her own admission, commands a core support base of only thousands in a country of over 140 million people - had previously told Reuters she felt she had been unfairly disqualified. The central election commission says its decisions are purely rules-based and that its job is to make sure that would-be candidates follow the right procedures. \nIncumbent Vladimir Putin, who has been in power as either president or prime minister for more than 20 years and faces no serious competition, is expected to comfortably win another six-year term in March. The Kremlin points to opinion polls which give Putin, 71, an approval rating of around 80% and says most Russians support what it calls Moscow's \"special military operation\" in Ukraine."
}