{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0R096_L.jpg",
  "title": "Seeking Western support, Zelenskiy voices world war risk",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 28, 2024 04:04PM ET",
    "Updated Jan 28, 2024 04:30PM ET"
  ],
  "comments": [
    6,
    [
      [
        "dylan mulvaney",
        "2024-01-28 23:21:57",
        "Zelensky running low on his cr.ack money.",
        "https://www.investing.com/members/250212425"
      ],
      [
        "dylan mulvaney",
        "2024-01-28 23:21:22",
        "Leftists stopped pretending to care about Ukraine now that they are out in the streets supporting Hamas instead.",
        "https://www.investing.com/members/250212425"
      ],
      [
        "dylan mulvaney",
        "2024-01-28 23:20:07",
        "Leftists stopped pretending to care about Ukraine now that they are out in the streets supporting Hamas instead.",
        "https://www.investing.com/members/250212425"
      ],
      [
        "dylan mulvaney",
        "2024-01-28 23:19:04",
        "Sorry democrats already stopped to pretend carding about Ukraine since they were now told to support Hamas.",
        "https://www.investing.com/members/250212425"
      ],
      [
        "Patrick Fuchs",
        "2024-01-28 22:22:43",
        "Considering how the GOP is becoming a fascist party and how it courts fascist like Orban and Putin, Ukraine shouldn't rely on the GOP to slow fascism's spread.",
        "https://www.investing.com/members/237490549"
      ],
      [
        "Mark Jannetty",
        "2024-01-28 22:41:10",
        "wow, someone went down the rabbit hole 🤣",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Mark Jannetty",
        "2024-01-28 22:16:01",
        "your on your own ",
        "https://www.investing.com/members/241633026"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/seeking-western-support-zelenskiy-voices-world-war-risk-3285376",
  "paragraph": "© Reuters. FILE PHOTO: Ukrainian President Volodymyr Zelenskiy speaks at a press conference after bilateral talks with the Swiss delegation, on Monday, January 15, 2024, in Kehrsatz near Bern, Switzerland. Keystone/Alessandro Della Valle/Pool via REUTERS//File Photo\nBERLIN (Reuters) - President Volodymyr Zelenskiy voiced the danger of the Ukraine conflict escalating into World War Three, as he pressed his case for support from nations from Germany to the United States in an interview with German state broadcaster ARD on Sunday. \"It seems to me that the Chancellor (Olaf Scholz) is aware of this risk,\" Zelenskiy said, adding that if Russia hit a NATO country, it would be \"the beginning of the Third World War.\" Asked whether he was disappointed that Germany did not plan to supply Ukraine with Taurus cruise missiles, Zelenskiy said he was only disappointed Germany had not played \"the role it should have played in the first occupation of Ukraine\". Referring to the weakness of the West's response to Russia's invasion of Crimea in 2014 that was a precursor for Moscow's invasion in February 2022, he said it wasn't just about the German response.  \"It's not just about Olaf Scholz,\" he said. \"It concerns European leaders and the U.S.\" \nIn the U.S., Zelenskiy said Ukraine has support from across the political divide. \"There are individual Republicans who do not support Ukraine, but the vast majority of Democrats and Republicans support Ukraine,\" he said.  On whether a second term of Donald Trump in the White House would affect support for his country, he said U.S. policy does not depend on a single person."
}