{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0S0EV_L.jpg",
  "title": "White House calls talks on Hamas hostage deal constructive, promising",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 29, 2024 08:44AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/white-house-calls-talks-on-hamas-hostage-deal-constructive-promising-3285986",
  "paragraph": "WASHINGTON (Reuters) - The White House said on Monday that talks to secure a new release of hostages held by Palestinian Islamist group Hamas in Gaza were constructive and promising but there was still a lot of work to be done. A series of negotiations in recent days involving CIA Director William Burns and U.S. Middle East envoy Brett McGurk focused on securing the release of hostages as well as a humanitarian pause in the Israel-Hamas war in Gaza. \"I think it's fair to describe them as constructive,\" White House national security spokesman John Kirby (NYSE:KEX) said on CNN.  \"We think there's a framework here for another hostage deal. That could really make a difference in terms of getting more hostages out, getting more aid in and actually getting the violence to come down.\" U.S. President Joe Biden has been trying to facilitate the release of the more than 100 hostages who remain captive after the deadly Oct. 7 attack on Israel by militants from Hamas, which rules Gaza. Burns met with the head of Israel's Mossad intelligence service and Qatar's prime minister along with the head of Egyptian intelligence on Sunday in talks described as constructive by Israel, but with significant gaps in positions. Kirby said there have been very good discussions with the Qataris, the Egyptians and the Israelis. \"We're not over the finish line right yet,\" he said on CNN. \"But we feel pretty good about the discussions and where they're going and the promise of something potentially pretty significant.\"Some 1,200 people were killed and 253 abducted in Hamas' cross-border rampage on Oct. 7, according to Israeli officials. The attack ignited Israel's war to eliminate Hamas, unleashing a torrent of strikes on Gaza that have flattened most of the Palestinian enclave and killed more than 26,000 people, Palestinian health officials say. \nTensions have surged around the Middle East since Israel began its aerial and ground offensive, with Yemen's Iran-backed Houthi forces striking U.S. and other targets in the Red Sea in attacks that have disrupted global shipping. In a major escalation, three U.S. service members were killed and at least 34 wounded in a drone attack by Iran-backed militants on U.S. troops in northeastern Jordan near the Syrian border, U.S. officials said on Sunday."
}