{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0P003_L.jpg",
  "title": "National Security Agency buys web browsing data without warrant, letter shows",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 25, 2024 07:07PM ET",
    "Updated Jan 26, 2024 03:50PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/national-security-agency-buys-web-browsing-data-without-warrant-letter-shows-3283611",
  "paragraph": "© Reuters. An illustration picture shows the logo of the U.S. National Security Agency on the display of an iPhone in Berlin, June 7, 2013. REUTERS/Pawel Kopczynski/FILE PHOTO\nBy Zeba Siddiqui SAN FRANCISCO (Reuters) - The U.S. National Security Agency buys Americans' internet browsing information from commercial brokers without a warrant, the agency's director told Democratic Senator Ron Wyden in a letter made public on Thursday. Wyden, who released the Dec. 11 letter, called upon U.S. intelligence officials to stop using Americans' personal data without their express knowledge and consent, saying it was unlawful. \"Such records can identify Americans who are seeking help from a suicide hotline or a hotline for survivors of sexual assault or domestic abuse,\" Wyden said in a statement. The NSA responded that the information has significant value for national security and cybersecurity missions and is used sparingly. \"At all stages, NSA takes steps to minimize the collection of U.S. person information, to include application of technical filters,\" a spokesperson for the agency said in an email. Wyden, a privacy and internet freedom advocate, had blocked the appointment of incoming NSA Director Timothy Haugh until the agency responded to his questions about collecting Americans' internet and location data. NSA Director Paul Nakasone confirmed such purchases in his letter to Wyden, saying the data collected \"may include information associated with electronic devices being used outside - and, in certain cases, inside - the United States.\" \nSuch records, Wyden said, can reveal which websites Americans' visit and what apps they use, and are in violation of U.S. Federal Trade Commission standards. An FTC order earlier this month barred Virginia-based data broker Outlogic, formerly called X-Mode Social, from selling sensitive location data that helps track people's whereabouts. Wyden said he had written to the Director of National Intelligence Avril Haines asking that the U.S. intelligence community build an inventory of all the personal data of Americans that the NSA has so far, and purge any of it that does not comply with the FTC's standards."
}