{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBN01C_L.jpg",
  "title": "Pope laments war in Holy Land on solemn Christmas Eve",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 24, 2023 12:59AM ET",
    "Updated Dec 24, 2023 04:47PM ET"
  ],
  "comments": [
    5,
    [
      [
        "American Truth",
        "2023-12-24 13:41:07",
        "FAFO",
        "https://www.investing.com/members/218062379"
      ],
      [
        "Maximus Maximus",
        "2023-12-24 12:33:14",
        "effing nazis.. stop the genocide now!",
        "https://www.investing.com/members/204570756"
      ],
      [
        "American Truth",
        "2023-12-24 13:42:02",
        "Must finish the job , no more half measures.",
        "https://www.investing.com/members/218062379"
      ],
      [
        "chess reed",
        "2023-12-24 14:44:39",
        "You mean palestinians surely?",
        "https://www.investing.com/members/207347322"
      ],
      [
        "haitharu Ss",
        "2023-12-24 17:36:55",
        "chess reed",
        "https://www.investing.com/members/233405603"
      ],
      [
        "Bill Small",
        "2023-12-24 19:47:07",
        "Sooo. Jews are Nazis? Well that’s a interesting (dumb) thing to say.\nIm saddened that 10 Israelis died in the fighting though. ",
        "https://www.investing.com/members/255071214"
      ],
      [
        "Brad Albright",
        "2023-12-24 23:50:29",
        "Invaded? Ignorant.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Barry Nickerson",
        "2023-12-24 11:30:58",
        "I'm pretty sure that if the military told me to get out because the area was about to be bombed, I'd be moving along fairly quickly.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "GodddLikeee GodddLikeee",
        "2023-12-24 12:04:38",
        "Where would you quickly move to for years with no income? ",
        "https://www.investing.com/members/245325734"
      ],
      [
        "Rob Roy",
        "2023-12-24 17:51:30",
        "GodddLikeee GodddLikeee",
        "https://www.investing.com/members/250189184"
      ],
      [
        "Brad Albright",
        "2023-12-24 23:52:12",
        "So you think Egypt might have some say? Ignorant.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Barry Nickerson",
        "2023-12-25 10:17:02",
        "GodddLikeee GodddLikeee",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Fred Johnson",
        "2023-12-24 10:52:25",
        "Wipe Hamas out.",
        "https://www.investing.com/members/246856018"
      ],
      [
        "GodddLikeee GodddLikeee",
        "2023-12-24 12:05:37",
        "It will just be another group. Cant wipe out an ideology ",
        "https://www.investing.com/members/245325734"
      ],
      [
        "Precious Ebuka",
        "2023-12-24 10:04:15",
        "Fear God and make peace Israel...make money ",
        "https://www.investing.com/members/242697330"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/israel-pushes-for-control-in-northern-gaza-biden-netanyahu-discuss-outlook-3262882",
  "paragraph": "© Reuters. Israeli flags fly next to the rubble of destroyed buildings in Gaza, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, as seen from southern Israel, December 23, 2023. REUTERS/Violeta Santos Moura \nBy Nidal al-Mughrabi, Bassam Masoud and Dan Williams CAIRO/GAZA/JERUSALEM (Reuters) -Pope Francis lamented war in the land of the birth of Jesus on Sunday, where Christmas Eve brought only fresh bloodshed and an intensification of fighting across the length of the Gaza Strip. Hours before midnight tolled for Christmas in the Holy Land, Palestinian health officials reported at least 70 dead in an Israeli airstrike on central Gaza. The Israeli military spokesperson's office said it was looking into the report. Israel reported the highest two-day death toll for its troops in more than a month. The head of the Islamic Jihad militant group joined talks in Cairo, one small sign at least that diplomacy remained alive. But in Bethlehem, the Israeli-occupied Palestinian West Bank city where Jesus Christ is believed to have been born in a stable 2,000 years ago, clergy cancelled traditional celebrations for the first time in memory. \"Tonight, our hearts are in Bethlehem, where the Prince of Peace is once more rejected by the futile logic of war, by the clash of arms that even today prevents him from finding room in the world,\" Pope Francis said, presiding at Christmas Eve Mass in St. Peter's Basilica in Rome. Palestinian Christians earlier held a Christmas vigil in Bethlehem with candle-lit hymns and prayers for peace in Gaza instead of the usual celebrations. There was no large tree, the usual centrepiece of Bethlehem's Christmas celebrations. Nativity figurines in churches were placed amid rubble and barbed wire in solidarity with the people of Gaza. In the latest massive airstrike, health ministry spokesperson Ashraf Al-Qidra said at least 70 Palestinians were killed and several houses damaged in central Gaza's Maghazi area on Sunday night. He said many were women and children. Since a week-long truce collapsed at the start of the month, fighting has only intensified on the ground, with war spreading from the north of the Gaza Strip to the full length of the enclave. 'DIFFICULT DAY' The Israeli military said 10 of its soldiers had been killed in the past day, following five killed the previous day, its worst two-day losses since early November.  \"This is a difficult morning, after a very difficult day of fighting in Gaza,\" Prime Minister Benjamin Netanyahu said at a cabinet meeting on Sunday. \"The war is exacting a very heavy cost from us; however we have no choice (but) to continue to fight.\" In a later video message he said troops would fight on deeper into Gaza until \"total victory\" over Hamas, adding: \"We are doing everything to safeguard the lives of our warriors.\" Israel has been under intensifying pressure in recent weeks from its closest ally the United States to scale down its military campaign and reduce civilian deaths. The Israeli military has expressed regret for civilian deaths but blames Hamas for operating in densely populated areas or using civilians as human shields, a charge the group denies. On Friday, Washington withheld its veto from a U.N. Security Council resolution on the war, allowing the measure to pass after language calling for an immediate halt to hostilities was watered down. Separate diplomatic efforts, mediated by Egypt and Qatar, on a new truce to free remaining hostages held by militants in Gaza have yielded little public progress, although Washington described the talks last week as \"very serious\". Islamic Jihad, a smaller militant group allied to Hamas, said a delegation led by its exiled leader Ziad al-Nakhlala was in Cairo on Sunday. His arrival followed talks attended by Hamas chief Ismail Haniyeh in recent days. The militant groups have so far said they will not discuss any release of hostages unless Israel ends its war in Gaza, while the Israelis say they are willing to discuss only a temporary pause in fighting. The Cairo talks would centre on \"ways to end the Israeli aggression on our people\", said an Islamic Jihad official.  The delegation would reaffirm the group's position that any exchange of hostages will have to secure the release of all Palestinians jailed in Israel, \"after a ceasefire is achieved\", the official said. Hamas and Islamic Jihad, both sworn to Israel's destruction, are still believed to be holding more than 100 hostages from among 240 they captured during their Oct. 7 rampage through Israeli towns, when they killed 1,200 people. Since then, Israel has besieged the Gaza Strip and laid much of it to waste, with more than 20,400 people confirmed killed, according to authorities in Hamas-ruled Gaza, and thousands more are believed dead under the rubble. The vast majority of the 2.3 million Gazans have been driven from their homes and the United Nations says conditions are catastrophic. On Saturday, Israel's military chief of staff said his forces had largely achieved operational control in the north of Gaza and would expand operations further in the south. But residents say fighting has only intensified in northern districts, notably Jabalia which Israeli forces were pounding with air strikes overnight and into Sunday. Tanks had moved further into the town on Saturday. In the central part of the Gaza Strip, medics said six Palestinians were killed in an Israeli air strike on a house in Bureij, where the Israeli army ordered people to evacuate and head west towards Deir Al-Balah city. \nJoudat Imad, 55, a father-of-six, had to leave an area in Nusseirat in central Gaza after a map published by the army marked it as a place people had to evacuate. \"I was lucky to get a tent in Rafah,\" he told Reuters by phone. \"From an owner of two buildings to a refugee in a tent awaiting aid - that is what this brutal war has turned us to. The world is sick and inhumane that it can't see Israel's brutality and it is helpless to stop this war of destruction and starvation.\""
}