{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0A0J3_L.jpg",
  "title": "Dangerous stasis on Israel's northern border leaves evacuees in limbo",
  "category": "World news",
  "publisher": "Investing.com",
  "date": [
    "Published Jan 11, 2024 07:51AM ET",
    "Updated Jan 11, 2024 09:41PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/dangerous-stasis-on-israels-northern-border-leaves-evacuees-in-limbo-3272438",
  "paragraph": "5/5\n© Reuters. Dekel, Almog, Hadar and their mother, Riki Shusterman, pose for a picture in their temporary accommodation, after being evacuated from their home near the Lebanese border due to the ongoing cross-border hostilities between Hezbollah and Israeli forces, in\n2/5\nBy Estelle Shirbon REGBA/LIMAN, Israel (Reuters) - Stuck in a hotel with little to distract her from dark thoughts, teenager Hadar Shusterman longs to return home to her northern Israeli village close to the Lebanese border, but she fears being killed there by Hezbollah attackers. She is one of more than 96,000 Israelis from a fringe of land along the border who have fled since Oct. 7, when Hamas militants from Gaza killed 1,200 Israelis in the south, triggering fears Hezbollah could do the same in the north. \"These guys are stronger than Hamas. Can you imagine the things they can do to us?\" said Shusterman, 17, who like many Israelis has been closely following accounts of killings, rapes and mutilations by Hamas that have emerged since Oct. 7. From her coastal village, Liman, the Lebanon border fence is visible at the top of a hill about 3 km (1.9 miles) to the north. She has imagined Hezbollah militants coming in cars or boats to kill her and her family. Returning home is unthinkable while that risk remains, but no one knows if, when or how the risk will be eliminated. Shusterman described herself as \"a train wreck of emotions\", too agitated to settle down with a book or homework or a drawing. \"It feels like a long day that never stops and you're just waiting for this day to end,\" she said.  Israeli forces and Hezbollah, the Iran-backed Lebanese Islamist group sworn to Israel's destruction, have been exchanging fire daily across the border since the Oct. 7 attack. The clashes have killed at least one civilian and nine troops on the Israeli side, and at least 23 civilians in Lebanon, where many people have also fled their homes near the border. Hezbollah says its attacks aim to draw Israeli forces north and lighten the assault on Gaza, not to \"initiate total war\". It has cast its actions as a way to deter Israel from carrying out a broader assault on Lebanon, nearly two decades after an Israel-Hezbollah war in 2006. Despite warlike rhetoric on both sides, recent skirmishes have not escalated into an all-out war like the one Israel is waging against Hamas in Gaza, where its forces have killed more than 23,000 Palestinians, according to Gaza's health ministry. FACE DOWN ON THE GROUND With more than 117,000 Israelis displaced from southern areas close to Gaza, the combined threat of Hamas and Hezbollah has effectively made parts of Israel's territory unliveable, which it says it cannot tolerate indefinitely. Added to the trauma of the Oct. 7 killings and the plight of 240 hostages who were kidnapped that day, of whom over 130 are still in Gaza, the mass displacement is contributing to Israel's sense of being engaged in an existential struggle. For now, Shusterman and her parents and her two younger brothers, one of whom is disabled and wheelchair-bound, are living in two rooms at the Aqueduct Hotel in Regba, a village just south of the evacuated zone. It is close enough to Liman that Ran Shusterman, Hadar's father, can return most mornings to work on the family farm, where he grows avocados, mangos, lychees and bananas. The houses in Liman are shuttered and the entrance gate is guarded by soldiers who patrol the deserted streets. Ran Shusterman, 50, said that after Oct. 7 the workers all left and some fruit rotted in the fields, but soon volunteer workers came from all over Israel. When they hear sirens or shelling, the workers run to the nearest bomb shelter, or if they are out in the fields they lie face down on the ground with their hands on their heads and hope for the best, he said. It was important to keep the farm going despite the risks, he said, and not just because it was his family's livelihood. \"I believe the border of Israel will stand on the shoulders of the farmers,\" he said. \"Wherever we plant bananas and avocados, the border will stay. If we leave, it will leave.\" LAUNDRY IN A BOMB SHELTER Orel Nimron, 21, came to work on Shusterman's farm as a volunteer and is now a paid worker. He loves the work, but the uncertainty is nerve-wracking. \"Every day I come to work and I really am stressed, asking myself if this is the day when it's going to explode,\" he said. \"People really don't know if today we're going to have 50 or 1,000 missiles shooting at us or nothing.\" Back in Regba, the Shustermans are among 260 displaced people, including 40 children and 70 aged over 60, as well as 62 pet dogs, staying at the Aqueduct Hotel. The government is footing the bill. Hadar Shusterman's school is closed, but she and other evacuee children have been enrolled in other schools. Meital Beham, who is displaced with her husband and three sons from Matzuva, a kibbutz near the border, said Israel should tackle Hezbollah the way it was dealing with Hamas in Gaza. \"How long is it going to take until they do something?\" she said. Ruthie Shein, 71, a retired English teacher from Liman, said she would prefer a negotiated solution under which Hezbollah forces withdrew to a certain distance from the border. Displaced with her adult son, who is disabled, and his Filipino caregiver, Shein said she was very grateful for how well the evacuees were being treated, but she missed home. \nShe said she went to Liman often to do laundry. Her washing machine is inside a bomb shelter. \"When they start bombing I close the iron door of the shelter and I feel very safe. I sit on the floor, I look at the washing machine and the washing machine looks at me, and everything is OK,\" she said with a resigned smile."
}