{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK1101Y_L.jpg",
  "title": "Kenya gas truck explosion torches Nairobi cylinder depot, kills 3",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 02, 2024 04:43AM ET",
    "Updated Feb 02, 2024 11:13AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/fire-from-gas-explosion-in-kenyan-capital-kills-2-injures-hundreds-3290892",
  "paragraph": "4/4\n© Reuters. Residents gather at the scene of an explosion at a makeshift gas cylinder refilling depot in Mradi estate, Embakasi district, in Nairobi, Kenya, February 2, 2024. REUTERS/Thomas Mukoya\n2/4\nBy Humphrey Malalo and Thomas Mukoya NAIROBI (Reuters) -A gas truck exploded in Kenya's capital Nairobi, sending a huge fireball into the night sky and causing a blaze that killed at least three people and injured 300, authorities and first responders said on Friday. Residents in a nearby building screamed as a column of flame shot hundreds of feet into the air just before midnight, briefly forming a mushroom cloud, video posted on social media and verified by Reuters showed. The government said three people had died in the explosion at a gas refilling plant and 280 more were being treated at hospitals around Nairobi. The Kenyan Red Cross said others were being treated at a triage point.  The fire engulfed a nearby textile and garment warehouse, while damaging several vehicles and commercial and residential properties, the government said.  \"The fire caught up with me from almost one kilometre away as I was escaping,\" survivor Edwin Machio told Reuters. \"The flames from the explosion knocked me down and burnt me on my neck,\" he added, taking off his shirt to show burnt flesh on his shoulders and upper arms.  A Reuters picture from the scene of the fire showed one body lying on the ground, covered with a blanket, while smoke billowed from several burning houses nearby. Kenya's Energy and Petroleum Regulatory Authority (EPRA) said last year it had rejected three applications for construction permits for a Liquefied Petroleum Gas (LPG) storage and refilling plant at the site of the explosion because of the high population density around it. \nEPRA said it had asked the applicant to submit a risk assessment \"indicating the radiation blast profiles in the unfortunate case of an explosion\" but that this was never done.  It was not immediately clear who owned the site."
}