{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBQ01J_L.jpg",
  "title": "Actor Lee of Oscar-winning 'Parasite' found dead amid drugs probe",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 26, 2023 11:43PM ET",
    "Updated Dec 27, 2023 02:59AM ET"
  ],
  "comments": [
    1,
    [
      [
        "dasdqwqe asda",
        "2023-12-28 10:29:56",
        "what a crazy country.",
        "https://www.investing.com/members/255259480"
      ],
      [
        "John Maynard",
        "2023-12-29 11:27:33",
        "ij",
        "https://www.investing.com/members/255899835"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/parasite-actor-lee-found-dead-amid-drug-accusations-3263793",
  "paragraph": "By Hyonhee Shin and Soo-hyang Choi SEOUL (Reuters) -Lee Sun-kyun, a South Korean actor who drew global attention with his performance as the wealthy patriarch in the Oscar-winning film \"Parasite\", was found dead on Wednesday in an apparent suicide in a Seoul park, officials in the capital said. Lee, 48, who met a gory end in the 2019 film, South Korea's first to win any Oscar, had faced police questioning three times over accusations of illegal drug use amid a government crackdown, with one session running 19 hours over the weekend. The actor had said he was tricked into taking drugs by a bar hostess trying to blackmail him, the Yonhap news agency reported. Authorities found Lee in a search triggered by a missing person report, a fire official told Reuters on condition of anonymity, as the matter is a sensitive one. Lee was found in a car at a park in Seoul, after his manager told police the actor had left home, leaving behind an apparent suicide note, a police official said, speaking on condition of anonymity. Lee's agency, HODU&U Entertainment, did not respond to calls. However, domestic media cited a statement by the agency that expressed sadness at the death, while urging restraint regarding false information, speculation, or malicious reports. Infringements of South Korea's tough drug laws can lead to six months in jail, or up to 14 years for repeat offenders and dealers. A dark-comedy thriller directed by Bong Joon-ho, “Parasite” won the Academy Award in 2020 in the four categories of best picture, best director, best original screenplay and best international feature film, off six Oscar nominations.  The film became the first non-English language movie to win the best picture award. Bong hailed its popularity as a sign that the \"one-inch-tall barrier of subtitles\" was no longer a stumbling block to global success. In the film, Lee played the character of Mr Park, whose affluent home is infiltrated by members of a lower-class family posing as highly qualified domestic workers in a tangled scheme that ends in violence. Lee, born in 1975, had leading roles in South Korean films such as the 2012 thriller \"Helpless\" and 2014's \"All About My Wife\", as well as the acclaimed 2018 TV series \"My Mister\". He played the lead in Apple (NASDAQ:AAPL) TV+'s first Korean-language original series, rolled out in 2021. \nA six-episode sci-fi thriller, \"Dr. Brain\" featured a cold-hearted neurologist hunting for clues to a mysterious family accident through brain experiments.  Lee's wife is award-winning actress Jeon Hye-jin, and the couple had two children."
}