{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0G0XI_L.jpg",
  "title": "China, Philippines seek better communication, management of conflicts in South China Sea",
  "category": "Economy",
  "publisher": "Reuters",
  "date": [
    "Published Jan 17, 2024 07:52PM ET",
    "Updated Jan 17, 2024 11:10PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/economy/china-philippines-seek-better-communication-management-of-conflicts-in-south-china-sea-3276778",
  "paragraph": "© Reuters. FILE PHOTO: National flags are placed outside a room where Philippine Finance Secretary Carlos Dominguez and China's Commerce Minister Gao Hucheng address reporters after their meeting in Beijing, China, January 23, 2017. REUTERS/Damir Sagolj/File Photo\nBEIJING/MANILA (Reuters) -China and the Philippines agreed to improve maritime communication and to properly manage conflicts and differences through friendly talks in regards to issues around the South China Sea, their foreign ministries said in a statement. China Assistant Foreign Minister Nong Rong and Philippines Foreign Ministry undersecretary Theresa Lazaro held a frank and in-depth exchange of views on the situation while co-chairing the eighth meeting of the China-Philippines Bilateral Consultation Mechanism on the South China Sea in Shanghai, according to statements released by the Chinese and Philippine foreign ministries. In the talks, the two sides reaffirmed that the South China Sea dispute is \"not the whole story of bilateral relations,\" the Chinese foreign ministry said in a statement released late on Wednesday. The two countries have had numerous confrontations recently in certain disputed waters in the South China Sea, with both trading accusations of provoking conflict in the economically strategic waterway, including charges that China rammed a ship last month carrying the Philippine armed forces chief of staff. China said its operation was \"professional, reasonable and legal\". Beijing claims sovereignty over almost the entire South China Sea, including parts of the exclusive economic zones of Brunei, Indonesia, Malaysia, the Philippines and Vietnam. Both officials believe \"maintaining communication and dialogue is essential to maintaining maritime peace and stability\", the Chinese foreign ministry said.  In the Jan. 17 statement released by the Philippine Department of Foreign Affairs (DFA) on Thursday, it said both sides \"agreed to calmly deal with incidents, if any, through diplomacy\". The two sides agreed to properly manage maritime conflicts and differences through friendly consultations, as well as properly handle maritime emergencies, especially the situation around the Second Thomas Shoal, known as Renai Reef in China, and Ayungin in Manila. \"Both sides presented their respective positions on the Ayungin Shoal and assured each other of their mutual commitment to avoid escalation of tensions,\" the DFA said.  Chinese coast guard and maritime militia vessels have had heated and dangerous run-ins in that area, as China becomes more assertive in pressing its maritime claims there.  Relations have been strained for months, but both have reiterated a commitment to dialogue. Both said in the meeting they would advance practical maritime cooperation, \"so as to create favorable conditions for the sound and stable development of China-Philippines relations,\" according to the Chinese foreign ministry. On Tuesday, China summoned the ambassador from the Philippines and warned the country \"not to play with fire\" after President Ferdinand Marcos Jr congratulated Taiwan's president-elect Lai Ching-te on his election victory on Saturday. The remarks made by Chinese foreign ministry spokesperson Mao Ning did not sit well with the Philippines' defense secretary who on Wednesday accused the official of insulting Marcos, stooping to what he called \"low and gutter-level talk.\" \nChina demanded that the Philippine side earnestly abide by the one-China principle. The Philippine side reiterated that it adheres to the one-China policy and will continue to implement it, according to the Chinese foreign ministry statement."
}