{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "Dexter King, younger son of Martin Luther King Jr., dies at 62",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 22, 2024 03:15PM ET",
    "Updated Jan 22, 2024 03:40PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/dexter-king-younger-son-of-martin-luther-king-jr-dies-at-62-3279983",
  "paragraph": "(Reuters) - Dexter Scott King, the younger son of the late civil rights leader Dr. Martin Luther King Jr. and Coretta Scott King, died on Monday of prostate cancer, the King Center in Atlanta announced. His wife, Leah Weber King, said he died in his sleep at his Malibu, California, home. He was 62. “He gave it everything and battled this terrible disease until the end. As with all the challenges in his life, he faced this hurdle with bravery and might,” she said. Dexter King was born in Atlanta on Jan. 30, 1961, and was named after Dexter Avenue Baptist Church in Montgomery, Alabama, where his father served his first pastorate.  He was seven years old when his father was assassinated in Memphis, Tennessee, in 1968. \"Words cannot express the heartbreak I feel from losing another sibling,\" said Reverend Dr. Bernice A. King, CEO of the King Center, in a statement.“I’m praying for strength to get through this very difficult time.” Dexter King followed in his father’s footsteps to attend Morehouse College in Atlanta. At the time of his death, he served as both chairman of the King Center and president of the King Estate.  He also was an actor and portrayed his father in the 2002 television movie \"The Rosa Parks Story.\" Reverend Al Sharpton, founder and president of civil rights organization the National Action Network, said he was \"heartbroken\" to hear of King's passing. \n\"Dexter was only seven when his hero, his role model, and, most importantly, his father was taken from us,\" Sharpton said in a statement. \"He turned that pain into activism, however, and dedicated his life to advancing the dream Martin and Coretta Scott King had for their children, their grandchildren, and all the generations to come after.\"  He was preceded in death by his father and his mother, who died in 2006, and sister Yolanda, who died in 2007. He is survived by his wife of 11 years Leah Weber King, his sister Bernice King, his brother Martin Luther King III, his niece, Yolanda Renee King, and other family members."
}