{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0F002_L.jpg",
  "title": "UK PM Sunak loses two vocal supporters to asylum rebellion",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 15, 2024 07:01PM ET",
    "Updated Jan 16, 2024 02:24PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/british-pm-sunak-faces-parliamentary-showdown-over-rwanda-legislation-3274527",
  "paragraph": "© Reuters. British Prime Minister Rishi Sunak attends a security accord signing ceremony, during a visit to Presidential Palace, in Kyiv, Ukraine, January 12, 2024. REUTERS/Thomas Peter\nBy Andrew MacAskill, Elizabeth Piper and Alistair Smout LONDON (Reuters) -British Prime Minister Rishi Sunak defeated an initial right-wing rebellion in his party on Tuesday over legislation to deport asylum seekers to Rwanda, refusing to cede ground in a battle that prompted two of his vocal supporters to resign. The resignations of two Conservative vice-chairmen underlined the deep divisions in Sunak's governing party over legislation he believes is crucial in turning round his party's popularity before an election this year. Some Conservative lawmakers say the Rwanda plan, which aims to block asylum seekers bringing further court challenges against their deportations, does not go far enough, while others fear any further toughening would breach international law and Kigali could pull the plug on the deal. The government comfortably defeated the rebels' bid to make two changes to strengthen the law late on Tuesday as expected. But Sunak only won because most opposition parties also voted against the rebels, and the dozens who voted for the changes might fuel a wider rebellion that could see the government defeated in the final vote in the lower house of parliament on the legislation on Wednesday. One senior lawmaker said the rebels had the numbers to defeat Sunak in that final vote, also called a third reading. \"This shows the extent of dissatisfaction in the parliamentary party. There were more than enough rebelling to defeat the bill on third reading,\" the lawmaker said on condition of anonymity.  \"The government should listen and agree amendments.\" Sunak has made stopping arrivals of migrants crossing over from France on small boats a central aim of his government.  Most of them say they are fleeing wars and abuse in the Middle East, Africa and South Asia and the majority of arrivals in the last five years whose cases have been completed have been given refugee status.  But the British government says about 90% making the journey are men, and many of them economic migrants rather than genuine refugees. 'DIVIDED PARTIES FAIL'  Sunak faced the most serious threat to his leadership last month when he saw off a potential revolt by dozens of his lawmakers at the first parliamentary vote on the legislation. The government comfortably won that vote after some lawmakers decided to abstain rather than oppose it, but some warned then they could vote down the legislation at these later stages. Almost 60 Conservative members of parliament supported an amendment that would have prevented international law from blocking deportations, with some on the right of the party saying this should persuade Sunak to toughen the legislation. Conservative Party Deputy Chairmen Lee Anderson and Brendan Clarke-Smith said they had resigned over the government's lack of willingness to toughen the legislation. \"Whilst our main wish is to strengthen the legislation, this means that in order to vote for amendments we will therefore need to offer you our resignations,\" Anderson and Clarke-Smith said in a joint letter. But other more centrist Conservative lawmakers say they do not believe many of those would want a government defeat before an election due later this year. The Conservatives are badly trailing the opposition Labour Party in opinion polls. \nIsaac Levido, the Conservative Party's election strategist, told lawmakers at a closed-doors meeting late on Monday the party faced defeat at this year's national election unless they ended their infighting.  \"Let me be clear. Divided parties fail,\" Levido said, according to a Conservative official."
}