{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0403K_L.jpg",
  "title": "Analysis-Taiwan election poses early 2024 test of U.S. aim to steady China ties",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 05, 2024 12:05AM ET",
    "Updated Jan 05, 2024 01:41AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/analysistaiwan-election-poses-early-2024-test-of-us-aim-to-steady-china-ties-3267762",
  "paragraph": "2/2\n© Reuters. Supporters of Hou Yu-ih, a candidate for Taiwan's presidency from the main opposition party Kuomintang (KMT) attend a campaign event in Keelung, Taiwan January 4, 2024. REUTERS/Ann Wang\n2/2\nBy Michael Martina and David Brunnstrom WASHINGTON (Reuters) - Taiwan's election next week poses challenges for Washington no matter who wins, with a victory for the ruling party sure to exacerbate tensions with China while an opposition triumph may raise awkward questions about the island's defense policies. The Jan. 13 presidential and parliamentary contests represent the first real wild card in 2024 for the Biden administration's goal of stabilizing ties with China. Beijing claims Taiwan as its own territory and has gone as far as to cast the island's elections as a choice between war and peace across the Taiwan Strait, warning that any attempt to push for Taiwan's formal independence means conflict. Taiwan's government rejects China's sovereignty assertion. U.S. officials have been careful to avoid appearing to steer or to interfere with the island's democratic process. \"Our strong expectation and hope is that those elections be free of intimidation or coercion, or interference from all sides. The United States is not involved and will not be involved in these elections,\" U.S. ambassador to China Nicholas Burns said in December. Such detachment has proved tricky in the past. The Obama administration raised eyebrows before Taiwan's 2012 election when a senior U.S. official aired doubts about whether then-presidential candidate Tsai Ing-wen could maintain a stable relationship with China. Tsai, of the Democratic Progressive Party (DPP), lost that year but won the presidency in 2016 and reelection in 2020 and tensions with China soared, raising fears Beijing might act on its vow to bring Taiwan under its control by force if necessary. Term limits bar Tsai from running again, but China has branded this year's DPP candidate and current Taiwan Vice President Lai Ching-te as a separatist, and analysts expect Beijing to ramp up military pressure should he prevail. Both the DPP and Taiwan's largest opposition party, the Kuomintang (KMT), say only they can preserve the peace and have committed to bolstering Taiwan's defenses. Both say only Taiwan's 23 million people can decide their future, although the KMT says it strongly opposes independence.  Washington also says it does not support independence, but there is some concern in the U.S. capital that a victory by the KMT's Hou Yu-ih could undermine U.S. efforts to beef up Taiwan's military deterrence. The party traditionally favors closer ties to China, though denies being pro-Beijing. \"Administration officials' lips say they are neutral, but their body language, reflected in overall policy statements about China, say they support the DPP they know rather than the KMT they are unsure about,\" said Douglas Paal, a former unofficial U.S. ambassador to Taiwan. Paal said there is ambivalence in Taiwan about heavier investment in defense, and that the KMT sees better ways to maintain peace than military spending, which would mean higher taxes with no prospect of matching China's capabilities.  \"With wars in Gaza and Ukraine, American capacity stretched, and its future direction debated at home, the status quo has to look preferable to many in Washington,\" he said. Laura Rosenberger, chair of the American Institute in Taiwan, a Virginia-based office that manages unofficial U.S. ties with Taiwan, met both Lai and Hou on their U.S. visits last year. \"U.S. policy on Taiwan will remain the same regardless of which party is in power. We look forward to working with whomever Taiwan voters elect,\" a State Department spokesperson said.  Some U.S. officials are bracing for China to increase pressure on Taiwan militarily, economically and diplomatically regardless of who is elected. \"This will likely be a period of heightened tensions that requires diplomacy, clear channels of communication, and reiteration of the importance of peace, stability, and the status quo,\" a senior U.S. administration official told Reuters. \"We've been pretty clear in the meetings (with China), expressing our concern about military, economic and other coercion across the board,\" the official said.  BUY TIME FOR DEFENSE? One person familiar with U.S. policy said U.S. officials had \"developed deep relations\" with each candidate and had stressed the \"importance of continuity in key policy areas,\" including on defense and maintaining the cross-Strait status quo.  Over the years, Washington has stressed that it cannot take the issue of Taiwan's defense more seriously than the island itself, and has pushed Taipei hard to make itself a \"porcupine\" against possible Chinese military action by investing in cost-effective, mobile and harder-to-destroy military assets.  U.S. congressional support for Taiwan is strong, but one of the few things that could erode this would be any move by the wealthy island to pause or reverse commitments to improve its own self-defense capabilities, analysts say.  Any defense policy paralysis in Taiwan should the elections yield a split between a new Taiwan administration and majority control over its parliament would likely cause consternation in Washington.  While some question whether the KMT would be as committed to defense reforms and spending as the DPP, a KMT win could let some steam out of cross-Strait dynamics, which China says is the most dangerous issue in U.S.-China relations. \nKharis Templeman of Stanford University's Hoover Institution said questions about the KMT's commitment to defense cooperation were valid, but there were genuine differences of opinion in Washington about which candidate would be best for U.S. interests. \"A Hou presidency could help stabilize cross-Strait relations, lower the near-term threat level, and buy more time for Taiwan's defense reforms to be implemented,\" Templeman said."
}