{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK040C8_L.jpg",
  "title": "India Navy rescues bulk carrier crew after Arabian Sea hijack attempt",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 05, 2024 09:02AM ET",
    "Updated Jan 05, 2024 04:36PM ET"
  ],
  "comments": [
    3,
    [
      [
        "Barry Nickerson",
        "2024-01-06 12:18:24",
        "Sink any and all pirate boats on sight.  The only way to end this insanity.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Ge K",
        "2024-01-06 08:23:52",
        "The ship owner should put armed guards onboard. ",
        "https://www.investing.com/members/249403043"
      ],
      [
        "Ge K",
        "2024-01-06 08:22:47",
        "The ships should be armed to destroy anything that comes within 100 yards of the ship.This can all be done by remote control and video footage to deter other scum from trying anything.",
        "https://www.investing.com/members/249403043"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/india-intercepts-hijacked-liberianflagged-vessel-in-arabian-sea-navy-says-3268237",
  "paragraph": "© Reuters. FILE PHOTO: A bird flies past the newly built INS Chennai, India’s third indigenously designed guided missile destroyer, ahead of its commissioning into the Navy in Mumbai, India November 18, 2016. REUTERS/Shailesh Andrade\nBy Krishn Kaushik NEW DELHI (Reuters) -The Indian Navy on Friday rescued the crew of a merchant vessel after its attempted hijack in the Arabian Sea and said it had not found any pirates on board. An Indian Navy warship intercepted the Liberian-flagged MV Lila Norfolk bulk carrier less than a day after it had received a report that the vessel had been hijacked about 460 nautical miles off Somalia. About five to six armed people boarded the vessel on Thursday, according to a report received by the UK Maritime Trade Operations (UKMTO) agency, which said the ship's crew had gathered in the ship's citadel. The navy said all 21 crew on board, including 15 Indians, had been evacuated. The vessel, which was chartered by miner Anglo-American, left the Acu port in Rio de Janeiro, Brazil, on Dec. 6 carrying iron ore, the company said in a statement. \"The entire crew is safe and the ship is on its way to its destination, scheduled to arrive on Jan. 12,\" it said, without detailing the volume of iron ore the ship was carrying. The vessel was destined for Khalifa bin Salman in Bahrain, according to British maritime security firm Ambrey.  \"The attempt of hijacking by the pirates was probably abandoned with the forceful warning by the Indian Navy,\" the navy said in a statement.  The Indian Navy has increased its surveillance of the Arabian Sea after recent attacks in the region. The hijacking and attempted hijacking of commercial ships in the Gulf of Aden and Arabian Sea resumed in December after a six-year lull. Experts believe pirates have been encouraged by U.S.-led anti-piracy naval forces diverting their attention to the neighbouring Red Sea to thwart attacks there by Houthi rebels. Data from the Indian Navy's Information Fusion Centre - Indian Ocean Region show at least three hijackings in December. The previous such incident was reported in 2017. \n\"The sudden revival in ship hijacking and attacks can only be attributed to the pirates' willingness to take advantage of the fact that the focus of anti-piracy maritime forces has largely shifted from the Gulf of Aden to the Red Sea,\" Abhijit Singh, head of the Maritime Policy Initiative at the Observer Research Foundation think tank in New Delhi, said. India is not part of the U.S.-led Red Sea task force."
}