{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0B0FY_L.jpg",
  "title": "Israeli air strike kills 11 in Gaza; UN says Israel blocks aid to north",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 12, 2024 07:23AM ET",
    "Updated Jan 12, 2024 01:07PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Reda Bennani",
        "2024-01-12 21:51:05",
        "Title is misleading! Should say kills 30,000 civilians including 11,000 children! ",
        "https://www.investing.com/members/225364405"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/israeli-air-strike-kills-11-in-gaza-un-says-israel-blocks-aid-to-north-3273470",
  "paragraph": "3/3\n© Reuters. A view shows damaged buildings in Gaza, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, as seen from Israel, January 12, 2024. REUTERS/Tyrone Siu\n2/3\nBy Arafat Barbakh and Nidal al-Mughrabi GAZA/DOHA (Reuters) - Israel's latest attacks on Gaza have killed at least 151 people, including 11 in a single house, Palestinian health officials said on Friday, while the U.N. humanitarian office accused Israel of blocking its efforts to send aid to the north. Residents reported continued aerial and ground fire across the territory from Israel, which has come under growing pressure to limit the number of civilian casualties from its war against the Hamas militants who attacked southern Israel on Oct. 7. The Israeli government says it goes to great lengths to protect civilians, accusing Hamas of deliberately using them as human shields and diverting aid, allegations which the militants deny. Gaza health officials said the 11 people had been killed by a single air strike around dawn in a house in Deir Al-Balah belonging to the Fayad family, a prominent name in the city. Israel said it could not comment without more specifics. It said earlier that its forces had killed dozens of militants in nearby Maghazi and in the southern city of Khan Younis. The armed wings of Hamas and fellow Islamists Islamic Jihad each said their fighters had hit Israeli tanks and bulldozers with anti-tank rockets in several areas where Israel was operating. Palestinian medics said another Palestinian had been killed and several others wounded in an Israeli strike that targeted a group of people on a main road between the central and the southern areas of Gaza.  Residents and the telecommunications company said Friday's fighting cut communications across Gaza. Since the New Year, Israel has announced a new phase in the war, saying it will begin withdrawing its forces from the northern half of the Gaza Strip where they deployed three weeks after the militants rampaged through southern Israel. Sporadic fighting has continued in the north and intensified in southern areas, where Israel extended its ground campaign to wipe out the militants last month and where the vast majority of Gazans have sought shelter on Israeli advice. 'BEYOND COMPREHENSION' The U.N. humanitarian office said Israeli authorities were blocking its efforts to help people who had stayed in the north for fear the militants would seize supplies. \"We have systematic refusal from the Israeli side of our effort to get there,\" said Andrea De Domenico, Head of Office for the United Nations Office for the Coordination of Humanitarian Affairs in the Occupied Palestinian Territories. \"In particular, they have been very systematic to not allowing us to support hospitals, which is something that is reaching a level of inhumanity that, for me, is beyond comprehension,\" he said. Israel says it does not block aid and blames holdups on what it says are poor logistics by the U.N. and other aid agencies. Aid officials say Gazans are on the verge of starvation and suffering from diseases brought on by a lack of fresh water and sanitation due to widespread bombing. As Israeli tanks redeploy in some areas, residents reveal the aftermath. In Al-Bureij - focus of Israeli ground operations in the central Gaza Strip - images posted by a local journalist showed the destruction of the main stadium. Health officials said earlier that an overnight Israeli air strike in the Sabra suburb of Gaza City in the north had killed three people and wounded dozens. Civil emergency said intense Israeli fire had hampered efforts to reach them. Gaza health officials said on Friday Israel's offensive had killed 23,708 people and wounded more than 60,000, mostly civilians.  \"Many victims are still under the rubble and on the roads. Rescue teams and civil emergency crews are unable to reach them,\" Gaza health ministry spokesman, Ashraf Al-Qidra said, adding that the 151 reported dead were those brought to hospital. Israel says it has no choice but to end Hamas rule in Gaza after the militants, who are sworn to Israel's destruction, killed 1,200 people, mainly civilians, and took 240 hostages back to the territory. More than 100 hostages remain in Gaza and Israel said on Friday it had made an arrangement with Qatar that will allow the delivery of medications to those hostages who need them. At the International Court of Justice, a second day of hearings was held into a case brought by South Africa in which it accuses Israel of committing genocide in Gaza, which Israel has rejected as 'baseless'. Hamas said that given Israel's insistence that it was not starving the Palestinians of aid, it should flow freely in. At Gaza's European hospital in Khan Younis, members of the Shaat family and others gathered to mourn the death of their loved ones who were killed in an Israeli strike further south in the narrow coastal strip. \n\"The day before yesterday we were targeted by a rocket, so we were displaced near the sea. They went back (home) to take the rest of the stuff that we needed for the house,\" said Samir Shaat, a relative of some of the victims. \"A first rocket targeted my brother and son. My nephews came to help them, but a second rocket hit them,\" he said."
}