{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0U0EA_L.jpg",
  "title": "California faces drenching rains from back-to-back atmospheric rivers",
  "category": "General",
  "publisher": "Reuters",
  "date": [
    "Published Jan 31, 2024 06:13AM ET",
    "Updated Feb 02, 2024 12:01AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Barry Nickerson",
        "2024-02-01 11:27:15",
        "Show me that the El Nino water temperature is warmer than previous El Nino's.  Otherwise, the words \"climate change\" in the article are unwarranted.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Mark Jannetty",
        "2024-02-01 12:40:05",
        "it's called weather. sometimes better sometimes worse. otherwise reporters wouldn't be able to worse storm since 1955. oh, so it has happened before without being caused by my car",
        "https://www.investing.com/members/241633026"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/general/california-braces-for-backtoback-atmospheric-river-storms-3288054",
  "paragraph": "© Reuters. City workers begin clearing debris along a drainage canal that overflowed causing flooding in adjacent neighborhoods after a heavy rain storm in San Diego, California, U.S. January 26, 2024. REUTERS/Mike Blake/File Photo\nBy Steve Gorman LOS ANGELES (Reuters) -California on Wednesday faced two back-to-back Pacific storms expected to drench much of the state in heavy rains and possibly trigger widespread flooding, while snow at higher elevations could help rebuild fresh water supplies. The first of the storms - both products of vast airborne currents of dense moisture called atmospheric rivers - hit the West Coast on Wednesday, bringing showers and gusty winds from Oregon south into Northern California and the San Francisco Bay area. The two systems also fit the definition of a \"Pineapple Express,\" or Pacific storms originating from the warm, subtropical waters around Hawaii, according to Daniel Swain, a climate scientist and meteorologist for the University of California, Los Angeles. The initial storm was expected on Thursday to sweep into Southern California, where residents - still shaken by flooding in recent weeks - hurried to stack up sandbags and clear storm drains in anticipation of another onslaught. \"We're going to be filling 40 tons of sandbags at this recreation center,\" said Scott Webber, 27, a construction contractor helping with storm preparations in a San Diego County neighborhood where scores of homes were flooded on Jan. 22. \"We did 25 tons this morning\" at another volunteer sandbagging site, he added. \"People need to have each other's backs.\" The winter storms - the first of the season - mark an abrupt change for California, which like much of the West had been basking in record, late-January warmth since the weekend. The initial storm was expected to intensify in the Bay area on Wednesday evening. The precipitation will fall mostly as rain, with 2 to 5 inches possible in San Francisco through Thursday, while snow was forecast for nearby mountains. The National Weather Service posted a flood watch for the Bay area and California's Central Coast, along with high-wind warning for much of the region.  Road and stream flooding was possible in Southern California on Thursday, though major bouts of inundation were considered less likely, according to Swain. Heavy to locally very heavy rains from the system could linger over parts of Northern California for six to 12 hours, he added. SECOND, STRONGER PUNCH FORECAST FOR SUNDAY A second, potentially more powerful storm is forecast to hit California on Sunday, bringing strong, gusty winds to the north and much heavier downpours in the south, while dumping yet more snow in the mountains. Although much about the second storm's trajectory remains uncertain, Swain said it appeared to be packing a denser plume of moisture capable of unleashing heavier, more sustained rainfall. \"Suffice it to say there will be some flooding in Southern California,\" Swain said. \"The question is whether it is the unremarkable street flooding we see in any big rainstorm or something considerably more significant than that.\" San Diego County endured record-breaking rains and severe flash flooding from a localized storm last week, and parts of Ventura County were evacuated after a month's worth of rain fell in just one hour in December. Still, precipitation forecast for California pales in comparison to Anchorage, Alaska, where a storm this week pushed the seasonal snowfall total for that state's largest city past the 100-inch mark earlier in winter than ever before. A series of about a dozen atmospheric river storms lashed California in rapid succession last winter, causing mass evacuations, power outages, levee breaches and road closures in a state long preoccupied with drought and wildfires. At least 20 people perished in those storms, which nevertheless helped break the grip of a years-long drought in California. The latest storms are likewise expected to help improve the state's water supply picture by bolstering mountain snowpacks, currently lagging at below-average levels. \nWhile the U.S. West Coast has averaged 10 or 11 atmospheric river storms a year since 1980, they are projected to become more frequent and more extreme over the next century if planetary warming from human-induced climate change continues at current rates, according to scientists. The two latest storms are also typical of the prevailing El Nino weather pattern, a naturally occurring deviation in the Pacific jet stream that causes warmer-than-usual ocean temperatures along the west coasts of North and South America, Swain said."
}