{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBT03V_L.jpg",
  "title": "Russia says 20 dead after 'indiscriminate' Ukrainian strikes on Belgorod",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 30, 2023 10:00AM ET",
    "Updated Dec 30, 2023 05:44PM ET"
  ],
  "comments": [
    6,
    [
      [
        "Charles Manson",
        "2023-12-31 02:53:54",
        "Quit.",
        "https://www.investing.com/members/249519852"
      ],
      [
        "Lars He",
        "2023-12-30 22:44:44",
        "The Ukraine fa-ists need to be fired.",
        "https://www.investing.com/members/239262837"
      ],
      [
        "Gary Piccone",
        "2023-12-30 21:59:09",
        "war is war! ",
        "https://www.investing.com/members/239243214"
      ],
      [
        "Frank Taylor",
        "2023-12-30 19:56:58",
        "Russia, go home and take your war machine with you! ",
        "https://www.investing.com/members/205051582"
      ],
      [
        "Ken Roth",
        "2023-12-30 19:34:14",
        "What a joke russia intends to complain in UN security council about ukraine definding themselves against russian invasion and daily bombings of civilians in ukraine….",
        "https://www.investing.com/members/213081368"
      ],
      [
        "László Tuba",
        "2023-12-30 18:57:22",
        "Both of this side have its own liar propaganda campain. Both of them grazy,! ",
        "https://www.investing.com/members/203956243"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/russia-says-ten-dead-after-ukrainian-attack-on-city-of-belgorod-3264900",
  "paragraph": "3/3\n© Reuters. A view shows a damaged house following what was said to be Ukrainian forces' shelling in the course of Russia-Ukraine conflict, in the settlement of Urazovo in the Belgorod Region, Russia December 30, 2023. Governor of Russia's Belgorod Region Vyacheslav \n2/3\n(Reuters) -Russia said 20 people including two children had been killed and 111 injured in \"indiscriminate\" Ukrainian strikes allegedly including cluster bombs on the Russian provincial capital of Belgorod on Saturday, and vowed to retaliate. The Belgorod region, which adjoins northern Ukraine, has like other Russian border zones suffered shelling and drone attacks all year that authorities have blamed on Ukraine, although none have previously been on such a scale. Newspaper Kommersant cited a source close to the Russian Investigative Committee as saying missiles fired from a multiple rocket launcher in Ukraine's Kharkiv region had hit a skating rink on the central Cathedral Square, a shopping centre and residential buildings. No official comment was immediately available from Kyiv, but the Ukrainian news outlet RBC-Ukraine quoted unnamed sources as saying Ukrainian forces had directed fire at military targets in Belgorod in response to the massive Russian bombardment of Ukrainian cities the previous day. News website Ukrainska Pravda quoted an unnamed security service source as blaming the destruction of civilian infrastructure on \"unprofessional actions by Russian air defence, as well as deliberate and planned provocations\". Russia's mission to the United Nations in New York said it had requested a meeting of the Security Council, which began at 4 p.m. ET (2100 GMT).  Within hours of the attack on Belgorod, Ukrainian authorities said two Russian S-300 missiles hit the centre of Kharkiv, Ukraine's second city, injuring 21 people including two boys aged 16 and 14.  One missile hit the Kharkiv Palace Hotel and another an apartment building. Officials said a medical institution and other civilian infrastructure were also damaged. Air raid sirens had earlier sounded all over Belgorod as regional Governor Vyacheslav Gladkov urged all residents to move to shelters. \"Today, the Kyiv regime attempted an indiscriminate combined strike on the city of Belgorod with two 'Olkha' missiles in a banned cluster configuration, as well as Czech-made Vampire rockets,\" the Defence Ministry said in a Telegram posting. \"This crime will not go unpunished.\" 'APARTMENTS AND SHOPS HIT' It said most of the rockets, including both the \"Olkha\" missiles, had been shot down, averting far greater casualties, although fragments had fallen on the city.  Governor Gladkov said 22 apartment buildings had been damaged along with a large number of commercial properties, shopping centres and shops, and that more than 100 cars had been damaged, most of them burned out. Images posted by the Emergencies Ministry showed at least three burned out cars, and a commercial building with some broken windows. Other images posted online showed black smoke rising from the city. Two residents told Reuters they had seen air defence missiles rising into the sky followed by explosions in the air and then louder blasts. Russian state-run news agency RIA quoted the Kremlin as saying President Vladimir Putin had sent a team of health and emergency workers to Belgorod. Russia, which invaded Ukraine in February 2022 in what it calls a \"special military operation\", unleashed its biggest air attack of the war on Friday.  Ukrainian officials said 39 civilians had been killed and 159 wounded as Russia launched 158 missiles and drones at more than 120 cities and towns across Ukraine. On Saturday, the toll climbed to 41, after one person found dead in Kyiv and another succumbed to injuries in Odesa. \nRussia said its anti-aircraft units had destroyed 13 Ukrainian rockets over the Belgorod region on Friday, as well as 32 drones overnight over the nearby Bryansk, Oryol and Kursk regions and the Moscow region. Foreign Ministry spokeswoman Maria Zakharova told RIA that Britain and the U.S. had incited Ukraine to carry out \"terrorist acts\", and said European Union countries must also bear blame for supplying it with weapons."
}