{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0U0E1_L.jpg",
  "title": "Trump meets with Teamsters in fight with Biden over union support",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 31, 2024 06:07AM ET",
    "Updated Feb 01, 2024 02:11AM ET"
  ],
  "comments": [
    5,
    [
      [
        "Barry Nickerson",
        "2024-02-01 23:47:30",
        "I'm reading a lot of b.s and hurt feelings over monikers I've been using.  But, I don't see anybody refuting my statements as to letting others tell you who to vote for, (union leaders or employers).  Is anyone influenced by someone else's endorsement?  Not one of you have said that they are not. (I'm not.)",
        "https://www.investing.com/members/249373719"
      ],
      [
        "First Last",
        "2024-02-02 02:16:57",
        "No one actually argued for \"letting others tell you who to vote for\".  For myself, I don't need any  union to tell me to not vote for trump; I've been telling people that since before Nov 2016..",
        "https://www.investing.com/members/200601457"
      ],
      [
        "First Last",
        "2024-02-02 08:09:00",
        "Taylor Swift hasn't endorsed anyone for the 2024 election, and retrumplicans have already been attacking her.  These attacks might drive her to endorse when she might otherwise not.  Don't blame her if she tells us who to vote for; blame the retrumplicans haters who politicize everything mindlessly.",
        "https://www.investing.com/members/200601457"
      ],
      [
        "Barry Nickerson",
        "2024-02-02 11:05:24",
        "First Last",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Barry Nickerson",
        "2024-02-02 11:06:42",
        "First Last",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Brad Albright",
        "2024-02-03 01:22:31",
        "You are making a mountain out of a molehill. An endorsement is not someone telling you who to vote for. People aren't rising to meet your indignation because they understand that a recommendation is not an order.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Barry Nickerson",
        "2024-02-01 10:46:59",
        "I received a lot of flak down below to my comment on not being influenced by others.  Your replies make me think that when your boss or union leader tells you who to vote for, you do as your told.  Feeling sheepish?",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Brad Albright",
        "2024-02-01 13:00:22",
        "Paranoia will destroy ya.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Tre Hsi",
        "2024-02-01 16:18:35",
        "MAGA nutjobs calling other people sheepish, reminds me all those white karens calling black people protesting for civil rights racists.....",
        "https://www.investing.com/members/203741693"
      ],
      [
        "Benjamin USA",
        "2024-02-01 03:40:11",
        "Lmao this has to be a joke",
        "https://www.investing.com/members/200821892"
      ],
      [
        "First Last",
        "2024-01-31 18:09:12",
        "\"Trump will meet with bosses and members of the Teamsters at their Washington headquarters\"  --  Not gonna choose a non-union shop again  ;-)",
        "https://www.investing.com/members/200601457"
      ],
      [
        "First Last",
        "2024-01-31 21:32:23",
        "Please remember that Trump stiffs ALL his contractors, whether or not they're blue-collar or union members, or if they're white collar or non-union like Rudy is.",
        "https://www.investing.com/members/200601457"
      ],
      [
        "Barry Nickerson",
        "2024-01-31 23:30:21",
        "First Last",
        "https://www.investing.com/members/249373719"
      ],
      [
        "First Last",
        "2024-02-01 03:55:16",
        "Barry Nickerson",
        "https://www.investing.com/members/200601457"
      ],
      [
        "Barry Nickerson",
        "2024-01-31 11:58:47",
        "It doesn't matter who I work for, or what groups I belong to....They are NOT telling me who I will vote for.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Ac Tektrader",
        "2024-02-01 02:24:20",
        " mark, trump left Biden an economy that was in shambles.2.9 million jobs were lost. more people were working at the end of the Obama. under the Biden administration the unemployment rate has almost dropped by 50%. with higher wages. I doubt very much you were better off.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ac Tektrader",
        "2024-02-01 02:26:24",
        "tantrum, because that is what it is subbulider.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ac Tektrader",
        "2024-02-01 02:27:31",
        "because mark, we know your lying..",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ac Tektrader",
        "2024-02-01 05:16:10",
        "subbulider more. name calling throwing your tissy fit.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ken Roth",
        "2024-02-01 05:24:49",
        "Mark Jannetty",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/trump-to-meet-with-teamsters-in-fight-with-biden-over-union-support-3288041",
  "paragraph": "2/2\n© Reuters. FILE PHOTO: Sean O'Brien, President of the International Brotherhood of Teamsters, speaks to UPS Teamsters during a picket ahead of an upcoming possible strike, outside of a UPS Distribution Center in Brooklyn, New York, U.S., July 14, 2023. REUTERS/Brend\n2/2\nBy David Shepardson and Tim Reid WASHINGTON (Reuters) -Donald Trump met with one of America's biggest unions on Wednesday as he competes for the support of labor groups ahead of a likely general election rematch with Democratic President Joe Biden in November. Trump sat down with the leadership and some rank-and-file members of the 1.3-million member International Brotherhood of Teamsters, just days after the Republican former president reacted angrily to losing out on the endorsement from another major union, the United Auto Workers. Trump said if elected he would block Japan's Nippon Steel's planned $14.9 billion acquisition of U.S. Steel. \"I would block it instantaneously. Absolutely,\" he said in response to a question from Reuters.  Nippon Steel said the deal would provide great benefit to U.S. Steel as well as the U.S. steel industry, its customers, employees, local communities and the United States, following Trump's comment. Trump's meeting with the Teamsters that represent truck drivers, dockworkers, airline pilots, government employees and many other sectors came during a 2024 presidential campaign in which the economy is front and center, and unions have seen a resurgence in the United States with many, including the Teamsters, winning new significant contracts. Trump and Biden will likely target union votes in general election battleground states, including Michigan and Pennsylvania. Trump's grip on the Republican presidential nomination has tightened after back-to-back nominating wins in Iowa and New Hampshire this month. After the meeting, Trump was skeptical about whether Teamsters leadership would endorse him - they endorsed Biden before the 2020 election - but he claimed to have strong support among the union's rank-and-file members. Trump said his pledge to impose tariffs on Chinese goods, and to reduce the flow of illegal immigrants across the U.S.-Mexico border, is supported by many union members. \"I've dealt with unions my whole life, I have a great relationship with unions,\" Trump said. \"We had a very good discussion.\" Teamsters President Sean O'Brien said the union had a pleasant, direct and engaging meeting with Trump and said it might be several months before it makes an endorsement. O'Brien said Biden \"has done a lot of good work for union members\" but added \"what you've done in the past doesn't guarantee future events. We want to know what you're going to do for our members moving forward.\" The union is mulling which presidential candidate it will endorse ahead of November's election. Two hours before the scheduled meeting, the Trump campaign released a list of pledges by Trump, claiming that U.S. workers will benefit from his policies. They include tariffs on Chinese imports - a move many economists say will hurt U.S. workers and consumers - and closing the U.S.-Mexico border, another pledge that economists warn will adversely affect American manufacturers. The Biden campaign said \"the President looks forward to meeting with the Teamsters and earning their endorsement.\" Union endorsements could be crucial in a presidential race among a closely divided electorate where just a few thousand votes in several key states could decide the 2024 election. Since he first ran for president in 2016, Trump has increased support among blue-collar workers and is again telling them this year that he - and not Biden - will improve their lives economically. Biden calls himself the most pro-union president in history and has taken many pro-labor actions, and the Teamsters endorsed him in 2020. Biden received a coveted endorsement last week, from the leadership of the almost 380,000-strong United Auto Workers (UAW), another key labor group in the Midwest, an important election battleground. Separately, Biden will be in Michigan on Thursday for a visit to a Detroit-area union hall to meet with UAW members. \nUAW President Shawn Fain said that Biden had a history of serving the working class, while Trump \"stands against everything we stand for,\" citing among other things Trump's appearance at a non-union hall during last year's auto workers strike. He called Trump an anti-union \"scab.\" Trump reacted furiously on his Truth Social platform on Sunday, calling Fain a \"stiff\" and a \"dope,\" and urging auto workers to vote for him and not Biden in November."
}