{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK1020M_L.jpg",
  "title": "Gazans fear Israeli attack on their last refuge; US launches retaliatory strikes",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 01, 2024 06:54PM ET",
    "Updated Feb 02, 2024 05:17PM ET"
  ],
  "comments": [
    5,
    [
      [
        "David Weaver",
        "2024-02-05 00:53:26",
        "There will be peace only when terrorist savages, who will never seek lasting peace with their sovereign neighbor , are totally eradicated ",
        "https://www.investing.com/members/202855420"
      ],
      [
        "Guess TheFuture",
        "2024-02-04 23:37:28",
        "Pelestinians should collectively erradicaye the terrorists among themselves to save themselves. Sort of a civil war.",
        "https://www.investing.com/members/117090"
      ],
      [
        "Gabbar Singh",
        "2024-02-03 18:04:28",
        "thousands of people killed, There heavy Air Strikes, as seen in image, RIP to all those, they are fighting back...",
        "https://www.investing.com/members/208158626"
      ],
      [
        "zhongmin du",
        "2024-02-03 14:38:27",
        "no cease fire?",
        "https://www.investing.com/members/213264820"
      ],
      [
        "donald terry",
        "2024-02-02 21:21:32",
        "good deal Israel is taking out the trash",
        "https://www.investing.com/members/216164869"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/israel-turns-focus-of-gaza-attack-to-rafah-as-hamas-weighs-ceasefire-proposal-3290609",
  "paragraph": "By Nidal al-Mughrabi and Mohammed Salem GAZA (Reuters) -Israeli forces shelled the outskirts of Rafah on Friday, the last refuge on the southern edge of the Gaza Strip where hundreds of thousands displaced people, penned against the border fence, feared a new assault with nowhere left to flee. The United States also began retaliatory strikes in Iraq and Syria, the U.S. military said, after a drone attack in Jordan this week killed three U.S. troops, developments likely to increase concern about spiralling tensions in the Middle East. The U.S. strikes targeted Iran-backed militants that Washington has blamed for the drone attack, the first deadly strike against U.S. forces since the Israel-Gaza war erupted in October.  More than half of Gaza's 2.3 million residents are now homeless and crammed into Rafah on the Egyptian border. Tens of thousands have arrived in recent days, carrying belongings in their arms and pulling children on carts, since Israeli forces last week launched one of the biggest assaults of the war to capture adjacent Khan Younis, the main southern city. If the Israeli tanks keep coming, \"we will be left with two choices: stay and die or climb the walls into Egypt,\" said Emad, 55, a businessman and father of six, reached on a mobile phone chat app. \"Most of Gaza's population are in Rafah. If the tanks storm in, it will be a massacre like never before during this war.\" Israeli Defence Minister Yoav Gallant said on Thursday that troops would now \"eliminate terror elements\" in Rafah, one of the few areas not yet taken in an almost four-month-old assault. As the only part of Gaza with access to the limited food and medical aid trickling across the border, Rafah and nearby parts of Khan Younis have become a warren of makeshift tents, clogged by winter mud. Wind and cold add to the misery, blowing tents down or flooding them and the ground in-between. \"What should we do? We live in multiple miseries, a war, starvation, and now the rain,\" said Um Badri, a mother of five from Gaza City, now in a tent in Khan Younis. \"We used to wait for winter, to enjoy watching the rain from the balcony of our house. Now, our house is gone, and the rainwater has flooded the tent we have ended up in.\" With phone service mostly absent across Gaza, residents climbed a sandy berm at the border fence and crouched beside the razor wire hoping for an Egyptian mobile signal. Mariam Odeh was trying to get a message to family still in Khan Younis, \"to tell them we are still alive and not martyrs like the others\".  'PRESSURE COOKER OF DESPAIR' The United Nations says rescuers can no longer reach the sick and wounded on the battlefield in Khan Younis, and the prospect of combat reaching Rafah is almost unthinkable. \"Rafah is a pressure cooker of despair, and we fear for what comes next,\" Jens Laerke of the U.N. Office for the Coordination of Humanitarian Affairs told a briefing in Geneva. The Gaza war was triggered by fighters from the Hamas militant group that runs Gaza who stormed across the border fence into Israel on Oct. 7, killing 1,200 people and capturing 253 hostages, according to Israeli tallies. Since then, Gaza health authorities say more than 27,000 Palestinians have been confirmed killed, 112 of them in the past 24 hours, with thousands more bodies feared lost amid the ruins. Imagery analysed by the U.N. Satellite Centre shows that 30% of Gaza's buildings have also been destroyed or damaged in the Israeli offensive. Hamas' armed wing said on Friday it had killed 15 Israeli soldiers in battles west of Gaza City, although no confirmation was immediately available from Israel. So far, Israel has confirmed the loss of well over 200 of its soldiers.  Mediators are awaiting a response from Hamas to a proposal for the war's first extended ceasefire, drafted last week with Israeli and U.S. spy chiefs and passed on by Egypt and Qatar. The only truce so far lasted just a week in late November, when militants freed 110 women, children and foreign hostages. The proposal envisages a first phase lasting 40 days, during which Hamas would free remaining civilian hostages, followed by further phases to hand over soldiers and bodies, according to a Palestinian official. But the sides remain far apart over what would follow. Hamas chief Ismail Haniyeh and Islamic Jihad chief Ziad al-Nakhala said in a joint statement that \"any negotiations should lead to a complete end to the aggression, the withdrawal of the occupation army outside the Gaza Strip, the lifting of the siege\" as well as reconstruction, provision of Gaza's basic needs and a full exchange of captives. However, Israel says Hamas must be eradicated before it pulls its troops out of Gaza or frees detainees, and its main ally, the United States, has not publicly set any goals that call that into question. BLINKEN HEADS FOR REGION AGAIN Linda Thomas-Greenfield, U.S. envoy to the United Nations, said an Algerian draft Security Council resolution demanding an immediate humanitarian ceasefire could jeopardize \"sensitive negotiations\" aimed at brokering a pause in fighting. And Washington said U.S. Secretary of State Antony Blinken would work for a humanitarian pause and the release of hostages still held by Hamas when he begins his latest trip to Israel, the West Bank, Saudi Arabia, Egypt and Qatar from Sunday. \nU.S. officials have said the response against Iran-backed militias will involve strikes over multiple days. Tehran says it will respond if its territory or interests are hit. On another front, the Israeli military said it had intercepted a missile heading for Israel in the area of the Red Sea, and Yemen's Houthis, allied with Iran, confirmed they had fired ballistic missiles in the direction of the Israeli port and resort city of Eilat."
}