{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0S0QM_L.jpg",
  "title": "Complaint alleges Harvard didn't protect pro-Palestinian students from threats",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 29, 2024 05:16PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/complaint-alleges-harvard-didnt-protect-propalestinian-students-from-threats-3286465",
  "paragraph": "© Reuters. FILE PHOTO: Demonstrators take part in an \"Emergency Rally: Stand with Palestinians Under Siege in Gaza,\" amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, at Harvard University in Cambridge, Massachusetts, U.S., October 1\nBy Kanishka Singh WASHINGTON (Reuters) - Over a dozen students alleged on Monday that Harvard University failed to protect them from harassment and threats \"based solely\" on their pro-Palestinian identity, the group representing them said. The Muslim Legal Fund of America said its legal division filed a civil rights complaint on Monday with the U.S. Education Department's Office for Civil Rights on behalf of those students. The complaint urged a probe into Harvard. Rights advocates have noted a rise in Islamophobia, anti-Palestinian bias and antisemitism in the U.S. since the eruption of war in the Middle East. Among anti-Palestinian incidents that raised alarm were a November shooting in Vermont of three students of Palestinian descent and the fatal stabbing of a 6-year-old Palestinian American child in Illinois in October. The Harvard students alleged \"harassment, intimidation, threats and more based solely on them being Palestinian, Arab, Muslim, and supporters of Palestinian rights,\" the group said. It added the students also underwent racist attacks, doxxing, stalking, and assault, including for wearing keffiyehs, or Palestinian scarves. A Harvard spokesperson said the university had no comment on the complaint on Monday, but added that Harvard had resources in place to support students including a task force announced on Friday to combat Islamophobia and anti-Arab bias. Harvard and other U.S. colleges have simmered with tension over responses to the Oct. 7 Hamas attack on Israel and Israel's subsequent offensive in Gaza.  Earlier this month, Claudine Gay resigned as president of Harvard following backlash over her congressional testimony on antisemitism. She and two other university presidents declined to give a definitive \"yes\" or \"no\" answer to a question on whether calling for the genocide of Jews would violate their schools' codes of conduct regarding bullying and harassment, saying it would have to be balanced against free-speech protections. Some students alleged that Harvard had threatened \"to limit or retract the students' future academic opportunities,\" the Muslim Legal Fund of America said on Monday. \nThe affected students attend Harvard College, Harvard Graduate School of Arts and Sciences, Harvard Divinity School, and Harvard Law School, the group said.  Some of those students have family in Gaza, where local health officials say more than 26,000 people have been killed since Israel launched its military offensive in response to the Oct. 7 rampage by Palestinian Islamist group Hamas that killed 1,200, according to Israeli tallies."
}