{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "Anti-war activists in New York City, Washington protest U.S., UK strikes in Yemen",
  "category": "World news",
  "publisher": "Investing.com",
  "date": [
    "Published Jan 11, 2024 10:52PM ET",
    "Updated Jan 12, 2024 03:10AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Brad Albright",
        "2024-01-12 18:13:40",
        "How about demonstrating against Houti attacks?",
        "https://www.investing.com/members/236251128"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/antiwar-activists-in-new-york-city-washington-protest-us-uk-strikes-in-yemen-3272989",
  "paragraph": "By Kanishka Singh WASHINGTON (Reuters) - A few dozen anti-war activists gathered at Times Square in New York City and outside the White House late on Thursday to protest U.S. and British strikes against Houthi military targets in Yemen, saying the step threatened to widen the war in Gaza. The United States and Britain launched the strikes from the air and sea in response to attacks by Houthis on ships in the Red Sea, which the movement says is a show of support for Palestinians under siege by Israel in Hamas-governed Gaza. Protesters at Times Square chanted slogans such as \"hands off the Middle East,\" \"hands off Yemen,\" and \"hands off Gaza.\" The demonstrators near the White House waved Palestinian flags and carried banners that read \"Free Palestine\" and \"stop bombing Yemen.\" The strikes in Yemen represent one of the most dramatic demonstrations to date of the widening of the war in Gaza since it erupted in October, although the U.S. and its allies said in a joint statement there was no intent to escalate tensions. Iran-backed Houthis, who control most of Yemen, have targeted commercial shipping in the Red Sea with drones and missiles, forcing shippers to change course and take longer routes. The Gaza conflict followed an attack on Israel on Oct 7 by the Palestinian Islamist group Hamas, which Israel said killed 1,200 people. Israel's subsequent assault on Gaza has killed more than 23,000 Palestinians, about 1% of the 2.3 million population there, according to Gaza's health ministry. Thursday's protests were organized by, among others, the coalition group ANSWER, an acronym for \"Act Now to Stop War and End Racism.\" \nThe group considers the strikes in Yemen a \"major escalation\" that could lead to a broad regional war, it said on the social media platform X. The Gaza war has led to protests in many parts of the U.S., including near airports and bridges in New York City and Los Angeles, vigils outside the White House, and marches in Washington near the U.S. Capitol."
}