{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK030OD_L.jpg",
  "title": "White House says Russia used missiles from North Korea to strike Ukraine",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 04, 2024 01:40PM ET",
    "Updated Jan 05, 2024 02:46AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Brad Albright",
        "2024-01-04 19:53:32",
        "Putin has taken Russia from modernity to a dependent of backwater autocracies. Poor Russian saps.",
        "https://www.investing.com/members/236251128"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/white-house-north-korea-recently-provided-russia-with-ballistic-missiles-launchers-3267601",
  "paragraph": "By Jeff Mason and Josh Smith WASHINGTON/SEOUL (Reuters) -Russia recently used short-range ballistic missiles (SRBMs) sourced from North Korea to conduct multiple strikes against Ukraine, the White House said on Thursday, citing newly declassified intelligence. National security spokesperson John Kirby (NYSE:KEX) told reporters the United States will raise the development with the United Nations Security Council. Kirby called North Korea's arms transfer to Russia a \"significant and concerning escalation\" and said the United States would impose additional sanctions against those facilitating the arms deals. Both Moscow and Pyongyang have denied conducting any arms deals, but vowed last year to deepen military relations. The use of the missiles drew condemnation from Britain, as well as South Korea, which had reported in November that North Korea may have supplied SRBMs to Russia as part of a larger arms deal that also included anti-tank and anti-air missiles, artillery and mortar shells, and rifles. \"Our information indicates that the Democratic People's Republic of Korea recently provided Russia with ballistic missile launchers and several ballistic missiles,\" said Kirby, using the official name of North Korea. On Dec. 30, he said, \"Russian forces launched at least one of these North Korean ballistic missiles into Ukraine,\" adding that it appeared to have landed in open field. Then on Tuesday Russia launched \"multiple\" North Korean missiles as part of a broader wave of heavy air strikes, Kirby said. Washington was still assessing the impact of those missiles. Russia recently has launched some of its most intense strikes on Ukraine since the war began almost two years ago. Kyiv on Tuesday said that Russia had launched well over 300attack drones and missiles of various kinds at cities across Ukraine since Friday. HELPS RUSSIA \"Just like the artillery and munitions, this all helps prolong Russia's warfighting efforts,\" said Jenny Town, director of the Stimson Center's 38 North Program, which studies North Korea. While the White House would not say specifically what type of missiles Pyongyang had sent to Russia, Kirby said they had a range of about 900 km (550 miles) and released a graphic that appeared to show KN-23 and KN-24 missiles. Such missiles are new, solid-propellant SRBMs that North Korea began testing in 2019, said Ankit Panda, of the U.S.-based Carnegie Endowment for International Peace.  \"This is the first known combat use of these North Korean missiles,\" he said. Joost Oliemans, a Dutch researcher and expert on North Korea's military, said images from Ukrainian social media accounts clearly show fragments of the ring housing the control vanes that are characteristic to North Korea's Hwasong-11 family of missiles, which includes the KN-23 and KN-25. China, which has ties with both North Korea and Russia, said it had no information on their cooperation, with foreign ministry spokesman Wang Wenbin calling on all parties to commit to easing tensions and creating favourable conditions for a political settlement of the Ukrainian crisis. Kirby said the U.S. expects Russia and North Korea to learn from these launches, and anticipates Russia will use additional North Korean missiles to target Ukraine.  \nHe said Iran has not delivered close-range ballistic missiles to Russia, but Washington believes Russia intends to purchase missile systems from Iran. Moscow has been heavily reliant on Iran for drones and other weaponry for use against Ukraine."
}