{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0209I_L.jpg",
  "title": "Ex Pakistan PM Imran Khan charged with contempt of electoral watchdog - lawyer",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 03, 2024 05:46AM ET",
    "Updated Jan 03, 2024 06:48AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/ex-pakistan-pm-imran-khan-charged-with-contempt-of-electoral-watchdog-lawyer-3266094",
  "paragraph": "© Reuters. FILE PHOTO: Security officers escort Pakistan's former Prime Minister Imran Khan, as he appeared in Islamabad High Court, Islamabad, Pakistan May 12, 2023. REUTERS/Akhtar Soomro/File Photo\nKARACHI, Pakistan (Reuters) -Former Pakistan prime minister Imran Khan was charged on Wednesday with contempt of the electoral commission, his lawyer Naeem said, a move related to allegations he made derogatory remarks about the chief election commissioner. The 71-year-old former cricket star has been embroiled in political and legal battles since he was ousted as prime minister in April 2022. He has not been seen in public since he was jailed for three years in August for unlawfully selling state gifts while in office from 2018 to 2022. \"The Election Commission indicted Imran Khan in the absence of lawyers,\" Khan's lawyer Haider Panjutha wrote on social media platform X.  The Election Commission of Pakistan (ECP) initiated contempt proceedings against Khan and other former leaders of his Pakistan Tehreek-e-Insaf (PTI) party, saying Khan and his colleagues had made \"derogatory and contemptuous remarks against the Chief Election Commissioner of Pakistan and used intemperate and insulting language.\" Khan, who is widely seen as the country's most popular leader, denies all charges against him and says he is being by hounded by the powerful military, which wants to keep him out of the polls due next month. The military denies this. Last week, a high court refused to suspend Khan's disqualification from contesting the elections. Separately, a Pakistan court on Wednesday ruled that Khan's party will not be allowed to use its traditional election symbol of a cricket bat in the February elections, Panjutha said.  \nThe electoral body last month declared that PTI intra-party elections in December were void. The party had needed to hold those elections in order to retain the symbol. The PTI challenged that decision in court and got a stay order before Wednesday's decision to continue with the ECP's earlier decision.  Khan's party plans on challenging the decision at the Supreme Court of Pakistan, PTI leader Barrister Gohar Ali Khan said on Wednesday, adding the party will not boycott elections."
}