{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "UN experts sound alarm over planned first US execution by nitrogen gas",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 03, 2024 05:26AM ET",
    "Updated Jan 03, 2024 05:03PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/un-experts-sound-alarm-over-planned-first-us-execution-by-nitrogen-gas-3266071",
  "paragraph": "GENEVA (Reuters) -United Nations experts urged U.S. authorities on Wednesday to halt the planned execution of a prisoner by asphyxiation using pure nitrogen, saying the untested method may subject him to \"cruel, inhuman or degrading treatment or even torture.\"  Kenneth Smith, convicted for a murder-for-hire committed in 1988, is scheduled to be executed in the U.S. state of Alabama on Jan. 25 using the method, which is intended to deprive him of oxygen by using a face mask connected to a cylinder of nitrogen. It would be the first time a judicial execution has been carried out anywhere in the world using asphyxiation with an inert gas, according to capital-punishment experts. Smith, 58, is one of only two people alive in the U.S. to have survived an execution attempt after Alabama botched his previously scheduled execution by lethal injection in November 2022 when multiple attempts to insert an intravenous line failed. Four U.N. human rights special rapporteurs said the new execution method could cause \"grave suffering\" and \"a painful and humiliating death\" that would likely violate an international treaty, to which the U.S. is a party, which bans torture and other cruel, inhuman or degrading punishment.  Smith's lawyers have said the untested gassing protocol likely violates the U.S. Constitution's ban on \"cruel and unusual punishments\", and have argued a second attempt to execute him by any method is unconstitutional.  A federal judge in Alabama is weighing whether to agree to Smith's request to issue a temporary injunction halting the execution to allow his lawsuit challenging the constitutionality of the new protocol to proceed.  \nSmith's attorneys and the Alabama Department of Corrections declined to comment on Wednesday. Spokespeople for Alabama Governor Kay Ivey and the U.S. State Department did not respond to questions about the U.N. experts' statement. Most U.S. executions are carried out using lethal doses of a barbiturate, but some states have struggled to obtain the drugs because of a European Union law banning pharmaceutical companies from selling drugs that can be used in executions to prisons."
}