{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBO06I_L.jpg",
  "title": "US welcomes Russia's Navalny being located, concerned for his well-being",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Dec 25, 2023 02:40PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-welcomes-russias-navalny-being-located-concerned-for-his-wellbeing-3263265",
  "paragraph": "© Reuters. FILE PHOTO: Russian opposition leader Alexei Navalny is seen on a screen via video link from the IK-2 corrective penal colony in Pokrov before a court hearing to consider an appeal against his prison sentence, in Moscow, Russia May 17, 2022. REUTERS/Evgen\nBy Kanishka Singh WASHINGTON (Reuters) - The United States welcomed reports on Monday that jailed Russian opposition politician Alexei Navalny had been located but remained \"deeply concerned\" about his well-being, the U.S. State Department said, calling for his immediate release. THE TAKE Navalny has been tracked down to a penal colony north of the Arctic Circle, his spokeswoman said on Monday, after supporters lost touch with him for more than two weeks. Navalny's allies had been preparing for his expected transfer to a \"special regime\" colony, the harshest grade in Russia's prison system, and had said earlier he had not been seen by his lawyers since Dec. 6, raising alarm about his fate. KEY QUOTES \"We welcome reports that Mr. Navalny has been located. However, we remain deeply concerned for Mr. Navalny's well-being and the conditions of his unjust detention,\" a U.S. State Department spokesperson said on Monday. \"We have conveyed to the Russian government that they are responsible for  what happens to Mr. Navalny in their custody.\" The State Department called for Navalny's immediate release and accused Russia of repressing independent voices in the country. Russia denies carrying out such a crackdown. BACKGROUND Navalny, 47, was tracked down to the IK-3 penal colony in Kharp in the Yamal-Nenets region, about 1,900 km (1,200 miles) north east of Moscow, his spokeswoman, Kira Yarmysh, said. Navalny's new home, known as \"the Polar Wolf\" colony, is considered to be one of the toughest prisons in Russia. \nRussia says Navalny is a convicted criminal. He denies all the charges he has been convicted of and casts Russia's judicial system as deeply corrupt. His supporters see him as a future leader of Russia, while Russian authorities call him and his supporters extremists with links to the CIA intelligence agency who they say is seeking to destabilize Russia."
}