{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJAN0CR_L.jpg",
  "title": "Factbox-What is the humanitarian situation in war-ravaged Gaza?",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 19, 2024 05:04PM ET",
    "Updated Jan 19, 2024 05:09PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/factboxwhat-is-the-humanitarian-situation-in-warravaged-gaza-3278713",
  "paragraph": "3/3\n© Reuters. Displaced Palestinians return to their homes as they walk near houses destroyed in an Israeli strike during the conflict, amid the temporary truce between Hamas and Israel, in Khan Younis in the southern Gaza Strip November 24, 2023. REUTERS/Ibraheem Abu \n2/3\nGENEVA (Reuters) - The Israeli offensive in the Gaza Strip, launched in the wake of a deadly rampage by Hamas militants in southern Israel on Oct. 7, has displaced most of the enclave's 2.3 million people and caused a humanitarian crisis.  Here are some key facts and figures on the conditions there: DISPLACEMENT  More than 1.7 million people - around 75% of the population - are estimated to be displaced inside Gaza, many of them forced to move repeatedly, according to the U.N. Palestinian refugee agency (UNRWA). It is difficult give a more precise numbers because of the incessant hostilities and regular evacuation orders, UNRWA says. The southern city of Rafah, on the border with Egypt, is currently the most crowded area.  Its population has almost quadrupled to more than 1.2 million people since the start of the conflict, UNRWA head Philippe Lazzarini said. Many people are sheltering in cramped spaces that are conducive to the spread of infectious diseases. Tens of thousands have sought refuge in makeshift tents and under plastic sheets that do little to protect them from the elements.  HEALTH AND HOSPITALS The World Health Organization says most of the enclave's 36 hospitals have stopped working. Only 15 are partially functioning and those are operating at up to three times their capacity, without adequate fuel or medical supplies, it says.  There are no functioning laboratories in Gaza, severely limiting medics' ability to diagnose patients.  Infectious diseases have been spreading rapidly. The number of diarrhoea cases among children aged under five was 20 times higher in November 2023 compared with the average the previous year, according to Richard Peeperkorn, WHO representative in Gaza. Cases of hepatitis A, a contagious liver infection that can be transmitted through contaminated food and water, have also been detected, the U.N. body says. \"The inhumane living conditions - barely any clean water, clean toilets and possibility to keep the surroundings clean - will enable hepatitis A to spread further,\" WHO Director General Tedros Adhanom Ghebreyesus wrote on X on Thursday. FOOD, WATER, AID Israel stopped all imports of food, medicine, power and fuel into Gaza at the start of the war. It later let deliveries in through some crossings. But aid officials say security checks, fighting and the difficulty of moving through a war zone are hindering operations severely. The United Nations says the amount of food entering Gaza is just a fraction of what is needed to meet basic needs. A U.N.-backed report published last month said the entire population was facing crisis levels of hunger.  The United Nations humanitarian office (OCHA) said last week Israeli authorities were systematically denying it access to northern Gaza.  Israel, which screens goods going into Gaza and holds back items it deems could be used for military purposes by Hamas, denies hampering aid. A government spokesperson has blamed the United Nations' distribution mechanism for the insufficient aid reaching Gaza civilians. \nIn December, Israel opened what has since served as a second crossing for aid trucks, intended to double the amount of food and medicine reaching Gaza to some 200 trucks a day.  The World Health Organization says it has been forced to cancel several planned aid deliveries in recent weeks, after failing to receive security guarantees."
}