{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK12072_L.jpg",
  "title": "Ukraine hits Russia's Volgograd oil refinery in latest drone attack- source",
  "category": "Commodities news",
  "publisher": "Reuters",
  "date": "Published Feb 03, 2024 11:24AM ET",
  "comments": [
    2,
    [
      [
        "Usman Sulehri",
        "2024-02-03 20:16:56",
        "increase tensions ",
        "https://www.investing.com/members/206356764"
      ],
      [
        "Benjamin USA",
        "2024-02-03 19:40:50",
        "Putin 99D chess",
        "https://www.investing.com/members/200821892"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/commodities-news/ukraine-hits-russias-volgograd-oil-refinery-in-latest-drone-attack-source-3291919",
  "paragraph": "© Reuters. FILE PHOTO: A general view shows the oil refinery of the Lukoil company in Volgograd, Russia April 22, 2022. Picture taken April 22, 2022. Picture taken with a drone. REUTERS\nBy Tom Balmforth KYIV (Reuters) -Two Ukrainian attack drones struck the largest oil refinery in southern Russia on Saturday, a source in Kyiv told Reuters, detailing the latest in a series of long-range attacks on Russian oil facilities. Local authorities in Russia said earlier that a fire had been extinguished at the Volgograd refinery following a drone attack. Oil producer Lukoil, which owns the refinery, later said the plant was working as normal. The Kyiv source said the operation by the SBU security service struck the primary processing facility, without which the refinery could lose significant production capacity. Ukrainian officials seldom take responsibility publicly for deep strike attacks on Russian territory.  The Volgograd refinery is the latest in a series of facilities to be targeted by drones. Kyiv sees such infrastructure as important for the Kremlin's war effort.  The source told Reuters such drone attacks would continue.  \"By hitting oil refineries working for the Russian military-industrial complex, we not only cut off the logistics of fuel supplies for enemy equipment, but also reduce funds into the Russian budget,\" the source said.  The distance between the northeastern Ukrainian city of Kharkiv near the Russian border and the southern Russian city of Volgograd is more than 600km.  \nRussia has been conducting regular long-range missile strikes on targets in Ukraine since the beginning of its full-scale invasion, prompting Kyiv to scramble for ways to close the gap on Moscow's more advanced military technology.  Ukraine has sought to spur innovation in drone technology and to support the production of long-range drones to allow it to strike back."
}