{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "Pacific storm douses California, flooding roads, in first of one-two punch",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 01, 2024 05:48PM ET",
    "Updated Feb 02, 2024 12:06AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/pacific-storms-douse-california-flooding-roads-in-first-of-onetwo-punch-3290590",
  "paragraph": "By Steve Gorman and Jorge Garcia LOS ANGELES (Reuters) - The first in a one-two punch of atmospheric river storms soaked Southern California with drenching rains on Thursday, triggering scattered flooding and rush-hour road closures in a precursor to a larger, wetter blast expected to sweep ashore over the weekend. The city of Long Beach, just south of Los Angeles, was one of the hardest-hit areas, with rainwater flooding a stretch of freeway and adjacent streets beneath a railroad bridge, leaving several vehicles submerged up to their roofs. At least one motorist, Franklin Capitulo, 54, a hotel employee who was driving home from work, had to be rescued after his car stalled in the middle of an inundated roadway, leaving him trapped in his vehicle as water steadily rose around him. \"I ran into this water, but I didn't expect it was that deep already,\" said Capitulo, recounting that he grew panicky and called his brother for help, and was ultimately pulled through a window by firefighters who arrived at the scene. Flooding, mud flows and rock slides forced the closure of numerous other roads across the region, including a busy tunnel passage that connects Pacific Coast Highway with a freeway in Santa Monica and a major freeway on-ramp in L.A.'s San Fernando Valley. The California Highway Patrol reported at least 50 spinouts and crashes in central Los Angeles Thursday morning, and firefighters rescued a man trapped in an Orange County flood-control channel, according to the Los Angeles City News Service. A flash-flood warning was posted for Los Angeles County and flood advisories were issued for San Diego and Orange counties. But the storm's center passed through the region fairly swiftly, minimizing flood threats, the National Weather Service reported. The storm first blew into Oregon and Northern California on Wednesday and spread south, blasting the San Francisco Bay area with intense rains and strong, gusty winds. Heavy snow fell in the higher-elevations of California's Sierra Nevada range. BIGGER DELUGE STILL TO COME A second, more potent storm was forecast to roll into California late Saturday and Sunday, bringing high winds back to the northern part of the state and much heavier downpours in the south, while dumping yet more snow in the mountains. \"This system will likely produce 24 to 36 hours (or more) of continuous rain,\" the weather service said in a forecast notice. Early estimates call for widespread rainfall totals of 2-4 inches (5-10 cm) from Sunday through Wednesday, and likely twice that in some foothill and low-elevation mountain areas, forecasters added. Both storms formed from vast airborne currents of dense moisture called atmospheric rivers. They also fit the definition of a storm system known as a \"Pineapple Express,\" drawing on especially warm, subtropical waters around the Hawaiian islands. A series of about a dozen atmospheric river storms lashed California in rapid succession last winter, causing mass evacuations, power outages, levee breaches and road closures in a state long preoccupied with drought and wildfires. At least 20 people perished in those storms, which nevertheless helped break the grip of a years-long drought in California. The latest storms are likewise expected to help improve the state's water supply picture by bolstering mountain snowpacks, currently lagging well below average levels for this time of year. Snow in the Sierras has traditionally accounted for nearly a third of California's freshwater supplies. But the warmer nature of these storms relative to last year, an apparent consequence of the prevailing El Nino weather pattern, means California will likely receive less of the precipitation this winter in the form of snow. \nWhile the U.S. West Coast has averaged 10 or 11 atmospheric river storms a year since 1980, they are projected to become more frequent and more extreme over the next century if planetary warming from human-induced climate change continues at current rates, according to scientists. Climate change also is likely to contribute to the warming effect of Pacific storms, depressing mountain snowfall amounts, even in otherwise wet winters, scientists say."
}