{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0N0KK_L.jpg",
  "title": "Senior FDIC attorney pleads guilty to sexually exploiting children - DOJ",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 24, 2024 10:17AM ET",
    "Updated Jan 24, 2024 03:31PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/senior-fdic-attorney-pleads-guilty-to-sexually-exploiting-children--doj-3281906",
  "paragraph": "© Reuters. A U.S. Justice Department logo or seal showing Justice Department headquarters is seen behind the podium in the Department's headquarters briefing room before a news conference with the Attorney General in Washington, January 24, 2023. REUTERS/Kevin Lama\nBy Pete Schroeder WASHINGTON (Reuters) -A senior attorney with the Federal Deposit Insurance Corporation has pleaded guilty to one charge of sexually exploiting children, the U.S. Justice Department announced late Tuesday. Mark Black, 50, was a member of two online groups dedicated to finding prepubescent girls and convincing them to livestream themselves engaging in sexually explicit content, the Justice Department said. Black had most recently worked as special counsel in the office of the FDIC's general counsel, according to his LinkedIn profile. He had been with the FDIC since 2013. An FDIC spokesperson said Black was suspended by the agency after learning of the allegations, and none of the activity was related to the FDIC or involved agency resources. Black and his attorneys could not be immediately reached for comment.  The Justice Department said Black induced a minor to engage in such conduct in 2019 and secretly recorded it. Also in 2019, he and an unnamed co-conspirator also convinced another girl to engage in similar acts on a livestream, which was also secretly recorded and shared. \nBlack pleaded guilty to one count of conspiracy to produce child pornography and one count of coercion and enticement. He will be sentenced on April 30, and faces a minimum of 15 years in prison and a maximum of a life sentence. The case was investigated by the FBI, as well as the FDIC's Office of Inspector General. The case was brought as part of a nationwide initiative to combat child sexual exploitation, launched in 2006."
}