{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBU01X_L.jpg",
  "title": "Kharkiv strikes were retaliation for Ukraine's Belgorod attack, Russia says",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 31, 2023 12:41AM ET",
    "Updated Dec 31, 2023 11:01AM ET"
  ],
  "comments": [
    2,
    [
      [
        "Ac Tektrader",
        "2024-01-01 03:34:59",
        "time to round up Putin supporters and send the back to Russia. Russians have become the supporters of crazy blood thirsty Putin and his dirty war. it's time for the Ukrainians to send another 300,000 Russians black to RUSSIA in body bags.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Milan Shukla",
        "2023-12-31 15:59:42",
        "time for Russia to Nuke Ukies?",
        "https://www.investing.com/members/234688095"
      ],
      [
        "Brad Albright",
        "2023-12-31 22:59:10",
        "Bloodthirsty ignoramous.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Ken Roth",
        "2024-01-01 04:45:03",
        "Well dont think russia wants to start a nuclear war. Using a nuclear weapon against ukraine would result in immidiate action from NATO in entering the war directly and all russian soldiers will be wiped out in ukraine. Should russia then decide to use nuclear weapons against NATO then ww3 starts and all residents in moscow and skt. Petersburg will be gone in 10 minutes. Its a loose loose strategy, and kremlin knows this.",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/toll-in-ukraine-air-strikes-on-russias-belgorod-rises-to-22-officials-say-3264925",
  "paragraph": "2/2\n© Reuters. A view shows destroyed cars following what Russian authorities say was a Ukrainian military strike in Belgorod, Russia December 30, 2023. REUTERS/Stringer\n2/2\n(Reuters) -Russia on Sunday said it attacked military facilities in the Ukrainian city of Kharkiv overnight, including a hotel housing military commanders and \"foreign mercenaries\", in response to Ukraine's strikes on Belgorod the previous day. Kharkiv officials had said that at least six missiles hit Ukraine's second city, injuring at least 28 people and damaging residential buildings, hotels and medical facilities, followed by waves of drone attacks on housing blocks. Russia's statement said its attack hit the former Kharkiv Palace hotel and the headquarters of the Ukrainian Security Service for the Kharkiv region. It said military and intelligence officers involved in Ukraine's attack on Belgorod had been among those killed, along with \"foreign mercenaries and militants\" preparing to carry out cross-border raids. Ukraine military intelligence spokesman Andriy Yusov told local media that no military objects had been targeted in Russia's attack on Kharkiv and that no one from his agency was harmed. Vyacheslav Gladkov, governor of the Belgorod region adjoining northern Ukraine, said the death toll from Saturday's Ukrainian rocket attack on the regional capital had risen to 24. In a posting on Telegram he said there were also 108 wounded and that 37 apartment buildings had been damaged. There was no official comment from Kyiv in the hours after the attack on Belgorod and Reuters was unable to independently verify the Russian reports.  Like other Russian border zones, Belgorod has suffered shelling and drone attacks all year, which authorities have blamed on Ukraine, though none have previously been on such a scale. Both sides deny targeting civilians in a war that Russia launched against its neighbour in February 2022. The United Nations says that more than 10,000 civilians have been killed in Ukraine and nearly 60 people inside Russia.  \nUkrainian news outlet RBC-Ukraine on Saturday quoted unidentified sources as saying that Ukrainian forces had directed fire at military targets in Belgorod in response to the massive Russian bombardment of cities and infrastructure across Ukraine the previous day. Russian newspaper Kommersant reported that Ukraine had fired its missiles from the Kharkiv region across the border."
}