{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK060AK_L.jpg",
  "title": "US defense secretary's hospitalization kept secret even from deputy",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 07, 2024 02:45PM ET",
    "Updated Jan 07, 2024 09:16PM ET"
  ],
  "comments": [
    5,
    [
      [
        "American Truth",
        "2024-01-08 02:03:43",
        "Just exactly who is running the government? ",
        "https://www.investing.com/members/218062379"
      ],
      [
        "Jeff Steinberg",
        "2024-01-08 01:35:44",
        "The administration is lead by Joe- what can you expect? Soon it will be over ",
        "https://www.investing.com/members/205261432"
      ],
      [
        "Stoxer One",
        "2024-01-07 23:06:00",
        "And this is the guy we have to trust with having good judgment in a nuclear war? ",
        "https://www.investing.com/members/200770726"
      ],
      [
        "Roger Miller",
        "2024-01-07 22:43:43",
        "One more major blunder by the Democrat White House regime.  One can only imagine how the media would have blasted President Trump had this happened under his presidency.  Although in the end not a big deal, only proves that Biden is a puppet.",
        "https://www.investing.com/members/205083859"
      ],
      [
        "Casador Del Oso",
        "2024-01-07 21:28:40",
        "Austin out sick, Biden once again on vacation. Perfect time for our enemies to attack. And still no word on the mystery illness.",
        "https://www.investing.com/members/221023565"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/top-military-officials-were-initially-unaware-of-austins-hospitalization-media-3268711",
  "paragraph": "© Reuters. FILE PHOTO: US Secretary of Defense Lloyd Austin attends a welcome ceremony before an annual security meeting with South Korean Defence Minister Shin Won-sik at the Defence Ministry in Seoul, South Korea on November 13, 2023. JUNG YEON-JE/Pool via REUTERS\nBy Phil Stewart and Hannah Lang WASHINGTON (Reuters) -U.S. Defense Secretary Lloyd Austin's hospitalization was kept far more secret than previously known, officials disclosed on Sunday, adding his deputy to a long list of people right up to President Joe Biden who were kept in the dark for days. Austin, who is 70, was admitted to Walter Reed National Military Medical Center's Intensive Care Unit on New Year's Day after experiencing severe pain following a still-undisclosed elective medical procedure on Dec. 22.  Austin sits just below Biden at the top of the chain of command of the U.S. military, and his duties require him being available at a moment's notice to respond to any national security crisis. That includes always being ready to enter secure communications with other officials in the event of an incoming nuclear attack, something that would be difficult to do from an ICU bed. Deputy Defense Secretary Kathleen Hicks assumed some of his operational duties on Jan. 2, while she was on vacation in Puerto Rico, a U.S. official said. But, Hicks was only told why Austin was unavailable on Jan. 4, three officials told Reuters. That's the same day that Biden and other senior White House officials were told that Austin had been hospitalized since Jan. 1, five officials said.  At least some circles in the Pentagon were aware of Austin's situation earlier. The chairman of the Joint Chiefs of Staff, Air Force General Charles \"CQ\" Brown, learned of the hospitalization two days earlier, on Jan. 2, one U.S. official said. The Pentagon said on Sunday the delay in disclosing his whereabouts was at least partially due to Austin's chief of staff being off sick. Austin said in a statement on Saturday that he took \"full responsibility\" for the secrecy surrounding his hospitalization. The U.S. Congress was only informed on Friday, shortly before the Pentagon published its public statement. The Pentagon has yet to say what Austin is being treated for, when he will be discharged from hospital and whether he lost consciousness or was under anesthesia over the past week. Secretary of State Anthony Blinken said during a press conference on Sunday he \"wasn't aware of (Austin's) medical issue.\"  \"I'm very much looking forward to seeing him fully recovered and working side by side,\" Blinken said.  Several lawmakers say the communication breakdown raises serious questions about Pentagon leadership. A joint statement from the top Democrat and Republican lawmakers on the House Armed Services Committee called for the Pentagon to be transparent about Austin's health \"and the decision-making process that occurred in the past week.\" \"Several questions remain unanswered including what the medical procedure and resulting complications were, what the Secretary's current health status is, how and when the delegation of the Secretary's responsibilities were made, and the reason for the delay in notification to the President and Congress,\" the joint statement said. The top Republican on the Senate Armed Services Committee, Senator Roger Wicker, also took aim at Austin's handling of his ill health. \"When one of the country's two National Command Authorities is unable to perform their duties, military families, Members of Congress, and the American public deserve to know the full extent of the circumstances,\" Wicker said in a statement. \nThe Pentagon said Austin remained in hospital on Sunday but was recovering well and was in good spirits. \"Since resuming his duties on Friday evening, the Secretary has received operational updates and has provided necessary guidance to his team,\" it said."
}