{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "Six people found slain in Southern California's high desert",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 24, 2024 05:11PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/six-people-found-slain-in-southern-californias-high-desert-3282306",
  "paragraph": "LOS ANGELES (Reuters) - California homicide detectives sought clues on Wednesday to the slayings of six people whose bodies were found strewn in a desolate patch of the Mojave Desert, according to the San Bernardino County Sheriff's Department. Sheriff's deputies responding to a call discovered the bodies on Tuesday night in a remote area of flat desert scrub off Highway 395 near the community of El Mirage, some 60 miles(97 km) northeast of Los Angeles, sheriff's spokesperson Mara Rodriguez told reporters. Neither the gender, nor ages of the victims were immediately available.  Officials said the cause and manner of deaths had yet to be confirmed, but the Victor Valley News Group reported that the victims had been shot. Officials initially reported the discovery of five bodies, but Rodriguez said the remains of a sixth victim had been found during the investigation. Los Angeles television station KTLA-TV said aerial footage from the scene showed multiple bloodied bodies on the ground with dozens of evidence markers and bullet casings surrounding them. Some of the victims also appeared to have been burned, the TV station said, adding that the images were too graphic to air. Two vehicles - a blue SUV and a white van - were also left at the scene. KTLA said the SUV was riddled with bullet holes and appeared to have some of its windows blown out. One of the bodies was found in one of the vehicles. Authorities said no arrests had been made, and they offered no possible explanation for the motive or circumstances behind the killings. El Mirage is an unincorporated community that lies adjacent to a flat, dry lake bed in the western Victor Valley of the Mojave Desert."
}