{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0804N_L.jpg",
  "title": "South Korea passes bill to ban consumption of dog meat",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 09, 2024 02:40AM ET",
    "Updated Jan 09, 2024 08:52AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Charles Manson",
        "2024-01-09 19:34:54",
        "Don't tell the North Koreans this. It's a Staple in their diet. They call it Kagogi. Baste with some bulgogi sauce and Hmmmmm Good.  Later, Charles.",
        "https://www.investing.com/members/249519852"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/south-koreas-parliament-passes-bill-to-ban-dog-meat-trade-3269969",
  "paragraph": "3/3\n© Reuters. FILE PHOTO: Dogs look on from their cages at a dog meat farm in Hwaseong, South Korea, November 21, 2023. REUTERS/Kim Hong-Ji/File Photo\n2/3\nBy Hyonhee Shin SEOUL (Reuters) -South Korea's parliament passed a bill on Tuesday to ban the eating and selling of dog meat, a move that will end the controversial centuries-old practice amid growing support for animal welfare.  Eating dog meat was once seen as a way to improve stamina in the humid Korean summer. But the practise has become rare - largely limited to some older people and specific restaurants - as more Koreans consider dogs as family pets and as criticism of how the dogs are slaughtered has grown. Activists say most dogs are electrocuted or hanged when slaughtered for meat, though breeders and traders argue there has been progress in making the slaughtering more humane. Support for the ban has grown under President Yoon Suk Yeol, an animal lover who owns six dogs and eight cats with first lady Kim Keon Hee, also a vocal critic of dog meat consumption. Pet ownership has also climbed over the years. One in four Korean households owned a pet dog in 2022, up from 16% in 2010, government data shows. Proposed by the ruling party and with rare bipartisan support, the bill was passed by an overwhelming 208 votes with two abstentions in the single-chamber parliament. The legislation, which states its purpose is \"to eradicate the consumption of dogs\" will take effect after a three-year grace period. The breeding and slaughtering of dogs to produce meat for human consumption will be punishable by up to three years in prison or 30 million won ($22,800) in fines. The bill does not stipulate any penalties for eating dog meat per se. \"This is history in the making,\" said Chae Jung-ah, executive director of Humane Society International Korea, an animal protection group. \"We have reached the tipping point where most Korean citizens reject eating dogs and want to see this suffering consigned to the history books.\"  In a survey released on Monday by Animal Welfare Awareness, Research and Education, a Seoul-based think tank, more than 94% of respondents said they had not eaten dog meat for the past year and about 93% said they would not do so in the future.  Other polls have shown backing for the ban at around 56%. Previous efforts to prohibit sales of dog meat failed in the face of industry protests and the bill seeks to provide compensation so that businesses can move out of the trade.  Son Won-hak, an official at the Korean Association of Edible Dogs, a coalition of breeders and sellers, said the group plans to take the matter to the country's Constitutional Court to question the law's legitimacy but did not elaborate.  But prior to the passing of the bill, its members laid out demands for compensation should it become law. They are seeking at least 2 million won ($1,520) per dog to compensate for losses over the next five years on top of the costs for facilities that will become defunct.  The agriculture ministry said it will consult with relevant businesses to ensure they continue to operate stably and provide \"maximum support within a reasonable range\".  The ministry has estimated that as of April 2022 some 1,100 farms were breeding 570,000 dogs to be served at around 1,600 restaurants. \nThe farmers' association said the ban will affect 3,500 farms raising 1.5 million dogs as well as 3,000 restaurants. ($1 = 1,314.8400 won)"
}