{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBP04K_L.jpg",
  "title": "Pakistan deported Afghans waiting for US resettlement -sources",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 26, 2023 03:31AM ET",
    "Updated Dec 26, 2023 11:35AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Tom Saltzman",
        "2023-12-26 09:40:49",
        "Americans first.",
        "https://www.investing.com/members/200520915"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/exclusivepakistan-deported-afghans-waiting-for-us-resettlement-sources-3263377",
  "paragraph": "2/2\n© Reuters. FILE PHOTO: Police officers, along with workers from the National Database and Registration Authority (NADRA), check the identity cards of Afghan citizens during a door-to-door search and verification drive for undocumented Afghan nationals, in an Afghan \n2/2\nBy Jonathan Landay and Charlotte Greenfield WASHINGTON/ISLAMABAD (Reuters) -Pakistan's huge deportation drive has forcibly repatriated scores of Afghans awaiting resettlement in the United States, an advocacy group and Afghan applicants say, adding that Pakistani authorities often ignored U.S. embassy letters of protection. That complicates the efforts of such Afghans, as the U.S. has shuttered its embassy in Kabul and they must also grapple with human rights restrictions and stubborn financial and humanitarian crises in their homeland. Islamabad began expelling more than a million undocumented foreigners, mostly Afghans, on Nov. 1, amid a row over accusations that Kabul harbours Pakistani militants, a charge the ruling Taliban deny. More than 450,000 Afghans have returned home, the United Nations says, many now living in difficult winter conditions near the border. At least 130 Afghans being processed for U.S. special immigration visas or refugee resettlement in the United States have been deported, said Shawn VanDiver, president of #AfghanEvac, the main coalition of groups helping such efforts. He cited data from coalition members and details provided to the U.S. government by its Islamabad embassy, which he has seen. Pakistani police have arrested more than 230 such Afghans, although about 80 have since been released, he added. Speaking on condition of anonymity, a senior State Department official said the United States had \"no formal way to track these kinds of cases\", adding that the number of Afghans deported while awaiting U.S. resettlement was \"very small\". Pakistan's foreign and interior ministries did not respond to requests for comment. As the clock ticked down to Nov. 1, the embassy e-mailed protection letters to some 25,000 Afghans to prove to Pakistani authorities they were being processed for resettlement in the United States, after its last troops left Kabul in 2021. A U.S. State Department spokesperson said Washington had also supplied Pakistan with a list of Afghans \"in the U.S. resettlement pipelines\" after it unveiled the deportation plan in October. VanDiver and two Western diplomatic sources, who requested anonymity to discuss the issue, said local authorities had ignored the letters in many instances.  \"The letters matter in some cases and not in others,\" said VanDiver. \"Not all local officers are abiding by it.\" The senior State Department official said the United States has examples of Pakistani police respecting the letters, but gave no details. Reuters spoke with two Afghan families whose members were deported after showing police the letter, and an Afghan who was detained despite the letter. The latter said he was released with a warning that he would be arrested again without a visa extension. Refugee advocates and Afghans say the deportations and arrests underscore the precarious nature of the long wait facing Afghans whom Washington has vowed to protect and resettle, many of them told to travel to a third country for processing. UNDOCUMENTED Many Afghans entered Pakistan with visas that expired as the processing of their SIV or refugee resettlement applications languished, facing them with long renewal times and high fees. One applicant for refugee status, whom Reuters is not naming for security reasons, said he sold almost all he owned in Oct 2022 to move his family to Pakistan from the Afghan capital for processing. All seven had passports and visas, he said. But mounting costs ate into his savings, and though he turned to selling street food to earn money, he could barely meet rent and utilities, putting out of reach the hundreds of dollars in fees needed to renew the one-year visas that expired. \"We had no money for food, how could we apply for visas?\" he said. Last month, police knocked on his door, but would not accept the embassy letter - seen by Reuters - that carried his refugee application number. \"They gave us two hours' time to pack our belongings,\" said the former employee of a U.S.-funded women's advocacy organisation. He tried calling the U.S. embassy, but could not get through. Now, he is lying low with his family in Kabul.  \"I have five children, have no house, I'm currently living in the home of one of my relatives,\" he said. \"I can't apply for a job here. I don't know what to do.\" U.S. officials say they are trying to keep in touch with the thousands of Afghans in Pakistan through an emergency hotline based on the WhatsApp communications app in the languages of Dari, Pashto and English. The state department has successfully averted deportations in several cases flagged up on the hotline, the senior State official said. Ahmadullah, a former U.S. government worker resettled to the United States in 2021, said his stepmother and two sisters had been waiting in Pakistan for the processing of applications for P1 visas, meant for those at risk of persecution, but were deported and living in fear in Kabul.  Police came to his uncle's home in Pakistan's northern city of Peshawar on a mid-November night, saw the expired visas in the women's passports, ignored their embassy letters, drove them to the border and ordered them to leave, Ahmadullah said.     \"They didn’t even let them pack,\" said Ahmadullah, who was evacuated with his family from Kabul as the last U.S. troops left in August 2021. Ahmadullah, who wanted his last name withheld to protect his family, said the women had sought extension of their Pakistani visas.  Now, they feel at risk because of his work and the Taliban's curbs on women appearing in public unaccompanied by a close male relative. They switch between their Kabul house and relatives' homes to avoid attention, he added. The Taliban, who oppose Pakistan's mass deportation, say they have a general amnesty for former foes of their 20-year insurgency and will support those returning. Few Afghans accept those assurances and live in fear of the Taliban's curbs on women and a humanitarian crisis fuelled by foreign aid cuts and the severance of ties to global banking. Islamabad says it is battling economic and security crises and cannot host the 600,000 Afghans who have arrived since the Taliban takeover, swelling the burden of hosting millions who fled during decades of war. \nThis month, the caretaker government said it would extend to February a Dec. 31 deadline for Afghans seeking resettlement in third countries to renew paperwork, while halving an overstay fee for those leaving with expired visas. Three senior U.S. officials, including Afghanistan Special Representative Thomas West, recently visited Islamabad for talks on the issue, but the outcome is not clear."
}