{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0N0E7_L.jpg",
  "title": "Analysis-Netanyahu faces doubts over goals, strategy and post-war plans",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 24, 2024 06:40AM ET",
    "Updated Jan 24, 2024 08:37AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/analysisnetanyahu-faces-doubts-over-goals-strategy-and-postwar-plans-3281519",
  "paragraph": "3/3\n© Reuters. Israeli Prime Minister Benjamin Netanyahu speaks to the media during a joint press conference with German Chancellor Olaf Scholz, in Tel Aviv, Israel, Tuesday, Oct. 17, 2023. Maya Alleruzzo/Pool via REUTERS/File Photo\n2/3\nBy Maayan Lubell and Dan Williams JERUSALEM (Reuters) - More than 100 days into Israel's quest to destroy Hamas, Prime Minister Benjamin Netanyahu is being challenged by members of his own war cabinet about strategy, pressured by Washington over post-war Gaza plans and hemmed in by his far-right ministers. On Thursday, two hours before the prime-time airing of an interview with an increasingly critical cabinet minister and former military chief, Netanyahu summoned reporters to say he would not relent until Hamas was eradicated. The combative performance was a response to those in Israel who increasingly argue that the war's twin aims of destroying Hamas and freeing the hostages still held by the dominant Palestinian faction in Gaza are incompatible, and that a ceasefire is needed.  There are those \"who claim victory is impossible. I utterly reject this. Israel under my leadership will not compromise on less than total victory over Hamas,\" Netanyahu said in the televised press conference. With the prime minister's political survival at stake, he is also facing demands to stick to the tough line from his far-right coalition partners, some of whom have threatened to bring down the government if he wavers. Nearly four months into the war, however, Israel's top Hamas leadership targets are still thought to be hiding deep within their extensive network of tunnels beneath Gaza. A poll by Hebrew University researchers from Jan. 14 shows nearly half those surveyed said the top priority was freeing the hostages, as fears grow for their survival nearly four months after the cross-border rampage into southern Israel on Oct. 7 that killed some 1,200 people.  More than 100 of the 253 hostages that were seized on that day were freed during a week-long November truce, but none have left alive since.  The rising urgency has now been voiced clearly in public for the first time by a member of the war cabinet. A flurry of diplomatic activity with mediators from Doha, Cairo and Washington also indicates a renewed focus on ceasefire negotiations behind the scenes.  \"I think it is necessary to say boldly that it is impossible to bring the hostages back alive in the near future without a deal,\" Gadi Eizenkot, the minister who went public with his concerns on the day Netanyahu spoke, said in his pre-taped interview with Channel 12's current affairs show \"Uvda\". WAR STRATEGY Israel's war strategy is being set by a triumvirate of Netanyahu, Defence Minister Yoav Gallant and Benny Gantz, the centrist opposition politician who leads Eizenkot's party and who joined the emergency government shortly after the bloody attack.  The three have a vote on the war, while Eizenkot and a close Netanyahu ally, Ron Dermer, are observers in the war cabinet. Statements released by the three around the 100-day mark of the attack displayed slight differences in the approach to the conflict, with Gantz also saying that the recovery of the hostages must take precedence over other military aims.  His office declined to elaborate further due to the \"sensitivity\" of the situation.  Gallant said only military pressure would achieve Israel's twin aims, but he also called for the cabinet to set diplomatic goals and discuss plans for post-war Gaza. Political indecision on a post-war plan, he added, could harm military progress. Israel's military on Monday suffered the highest toll of its Gaza offensive with 24 fatalities, including 21 in a rocket-propelled grenade (RPG) attack and explosion in central Gaza, and three elsewhere. In the latest weekly Hebrew University survey, of 1,373 adults from Israel's Jewish majority, 42% said a deal should be struck to release hostages even at the cost of releasing Palestinians jailed for lethal militant attacks. Seventeen percent said a deal could include a slowdown in the Israeli military response. Combined, the support of 59% for the two measures is up from the 39% who backed them on Oct. 9.  Nimrod Nir, a researcher involved in the polling, said the public was increasingly seeing it as a zero-sum game: \"either we release the hostages, meaning that we need to finish at least the heavy part of the (Gaza) operation. Or we continue to fight, though it will cost us the hostages.\" Relatives of hostages on Saturday set up camp outside Netanyahu's home, adding to weekend rallies demanding more be done to free hostages. This weekend, demonstrators at the rally also called for an early election and on Monday hostage relatives stormed a parliamentary committee session in Jerusalem. TRICKY TIGHTROPE Already walking a tricky diplomatic tightrope between Washington and his hard-right coalition government, Netanyahu will likely be challenged further when the more intense fighting phase starts to end. Antony Blinken, the U.S. secretary of state, has said Israel's Arab and Muslim neighbours could be prepared to more fully integrate Israel in the region, but they would also need to see a commitment to a pathway to a Palestinian state.  But top-level Israeli discussions on who runs Gaza after the war have been repeatedly deferred amid political infighting.  An official briefed on the matter said the war cabinet had originally scheduled a session but, under pressure from Netanyahu's far-right coalition partners, who had been excluded, shifted it to be discussed in a wider security cabinet.  Now, the official said, the various post-war visions are so divergent as to make convening another such discussion \"problematic\". Netanyahu's finance minister, ruling coalition partner Bezalel Smotrich, has said Palestinians should move out of Gaza, in comments condemned by Washington. Smotrich said on Saturday that the White House should quit pushing for Palestinian statehood. Far-right police minister Itamar Ben-Gvir has ramped up his rhetoric in recent weeks against the war cabinet. In a letter to Netanyahu last week he said it was going soft on Hamas in Gaza and warned he would not be a rubber stamp for policies to which he objects, hinting that his Jewish Power party could quit the coalition, a move that could trigger an early election. He told reporters at the Knesset on Monday that if the war ended prematurely: \"there'll be no government.\"  A poll published in early January showed only 15% of Israelis want Netanyahu to stay in office after the war ends, underlining how the collapse in his support seen after the Hamas attack has not recovered.  Despite this weak support, Gideon Rahat, a political science professor at the Israel Democracy Institute, said Netanyahu was showing signs of campaigning for an election.  \"He is trying to frame himself as the person who will stop the creation of a Palestinian state,\" Rahat said.  Netanyahu's office did not respond to a request for comment about his future electoral plans. He has publicly denied making any kind of political moves, saying his only focus was on winning the war.  Netanyahu released a statement on Sunday, saying he had previously withstood \"great international and internal pressures\" to prevent the establishment of a Palestinian state which would have posed \"an existential danger to Israel\". \nHe stopped short of totally ruling out a Palestinian state, but said Israel must always retain full security control over all the territory west of Jordan - a stance that he would always insist on \"as long as I am prime minister\". \"If someone has a different position, let them show leadership and state their position honestly to the citizens of Israel,\" he said."
}