{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0I0PI_L.jpg",
  "title": "US conducts strikes against 3 Houthi anti-ship missiles",
  "category": "Commodities news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 19, 2024 03:18PM ET",
    "Updated Jan 19, 2024 06:30PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Ron Warren",
        "2024-01-19 20:48:17",
        "Seems like a war with Iran would be the result of this conflict. Algos pumping to dump?",
        "https://www.investing.com/members/204573762"
      ],
      [
        "First Last",
        "2024-01-19 20:59:53",
        "War between Iran and many other countries has been simmering for years..",
        "https://www.investing.com/members/200601457"
      ],
      [
        "First Last",
        "2024-01-19 21:02:54",
        "Maybe if Trump had hit back at Iran after Iran attacked US troops in Iraq in Jan 2020, ...",
        "https://www.investing.com/members/200601457"
      ],
      [
        "Mark Jannetty",
        "2024-01-20 11:47:22",
        " maybe if Biden didn't leave them pallets of cash on the tarmac. ",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Mark Jannetty",
        "2024-01-20 14:40:35",
        "Mark Jannetty",
        "https://www.investing.com/members/241633026"
      ],
      [
        "First Last",
        "2024-01-20 22:32:19",
        "Mark Jannetty",
        "https://www.investing.com/members/200601457"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/commodities-news/us-conducted-three-strikes-against-houthi-targets-on-friday-white-house-3278638",
  "paragraph": "By Andrea Shalal and Kanishka Singh WASHINGTON (Reuters) -U.S. Central Command forces on Friday conducted strikes against three Houthi anti-ship missiles that were aimed into the Southern Red Sea and were prepared to launch, the U.S. military said on X, formerly called Twitter. \"U.S. forces identified the missiles in Houthi-controlled areas of Yemen and determined that they presented an imminent threat to merchant vessels and the U.S. Navy ships in the region. U.S. forces subsequently struck and destroyed the missiles in self-defense,\" the U.S. Central Command said in the post on X. The incident, the latest amid growing tensions in the Red Sea that have disrupted global trade and raised fears of supply bottlenecks, took place around 6:45 p.m. Yemen time (1545 GMT), the U.S. Central Command added. Attacks by the Iran-aligned Houthi militia on ships in and around the Red Sea for the past several weeks have slowed trade between Asia and Europe and alarmed major powers in an escalation of the war in Gaza. The Houthis, who control the most populous part of Yemen, say their attacks are in solidarity with Palestinians under attack from Israel in Gaza.  Since last week, the United States has been launching strikes on Houthi targets in Yemen, and this week returned the militia to a list of \"terrorist\" groups.  President Joe Biden said on Thursday that air strikes would continue even as he acknowledged they may not be halting the Houthi attacks. The confrontation risks an expansion of the conflict beyond Hamas-governed Gaza, where the local health ministry says over 24,000 people - or more than 1% of Gaza's 2.3 million population - have been killed in Israel's assault.  Israel launched its offensive following Oct. 7 attacks on Israel by the Palestinian Islamist group, which Israeli officials say killed 1,200 people. \nWhite House spokesperson John Kirby (NYSE:KEX) said Friday's strikes were the fourth in the past week by the U.S. military against Houthi missile launchers that were prepared to launch attacks. The Houthis launched two anti-ship ballistic missiles at a U.S.-owned tanker ship late on Thursday that hit the water near the vessel but caused no injuries or damage, according to the U.S. military."
}