{
  "image": "https://i-invdn-com.investing.com/news/LYNXNPEC1P12O_L.jpg",
  "title": "US officials deliver warning that Chinese hackers are targeting infrastructure",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 31, 2024 05:14AM ET",
    "Updated Jan 31, 2024 02:01PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/chinese-hackers-are-targeting-us-infrastructure-fbi-chief-to-testify-3287951",
  "paragraph": "By Michael Martina, Patricia Zengerle and Andrew Goudsward WASHINGTON (Reuters) -Hackers linked to the Chinese government are targeting critical U.S. infrastructure, preparing to cause \"real-world harm\" to Americans, FBI Director Christopher Wray told a congressional committee on Wednesday. Water treatment plants, the electric grid, oil and natural gas pipelines and transportation hubs are among the targets of state-sponsored hacking operations, he told the House of Representatives Select Committee on competition with China Wray spoke the same day U.S. officials announced that they had disrupted a sweeping Chinese cyber-spying operation. \"They're not focused just on political and military targets. We can see from where they position themselves across civilian infrastructure, that low blows aren't just a possibility in the event of conflict, low blows against civilians are part of China's plan,\" Wray said. The Chinese foreign ministry did not immediately respond to a request for comment on the matter. Wray stressed that U.S. government concerns were not linked to Chinese Americans or Chinese nationals in the U.S., who he said were themselves often targets of Beijing's \"aggression\". The hearing came at a time of heightened tensions between the United States and China over the status of democratically governed Taiwan, China's rapid military build-up, economic and technology competition, and Beijing's human rights record.  According to U.S. media reports, China's President Xi Jinping told President Joe Biden in November that Beijing would not interfere in the 2024 U.S. election. Asked about the reported pledge, Wray said: \"China has promised a lot of things over the years. So, I guess I'll believe it when I see it.\" The officials told the hearing they had confidence in the U.S. election infrastructure. Wray has repeatedly said Beijing is trying to undermine the United States through espionage campaigns, intellectual property theft and cyberattacks. The Chinese government has previously accused the United States and its allies of spreading \"disinformation\" through its accusations against what Washington says are state-sponsored hacking groups. 'EQUIVALENT OF PLACING BOMBS' Wray testified along with General Paul Nakasone, commander of U.S. cyber command, and other top federal cybersecurity officials. Nakasone, who steps down from his position this week, was greeted by the committee with a standing ovation. \"This is the cyberspace equivalent of placing bombs on American bridges, water treatment facilities, and power plants. There is no economic benefit for these actions. There is no intelligence gathering rationale,\" said Republican Representative Mike Gallagher, the committee's chairman. Jen Easterly, director of the Cybersecurity and Infrastructure Security Agency, said the United States has \"found and eradicated\" Chinese cyber intrusions in aviation, water, energy and transportation infrastructure, and said Americans need to prepare for an unexpected attack. \nThe hearing is one of the highest-profile events conducted by the year-old bipartisan select committee, set up in part to explain to Americans why they should care about addressing growing threats posed by the top U.S. geopolitical rival. Gallagher reiterated calls to ban or force the sale of short-video sharing app TikTok, owned by Chinese tech company ByteDance, saying its continued unfettered use in the U.S. would \"be bordering on national suicide\"."
}