{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0J07P_L.jpg",
  "title": "Israeli soldiers uncover Gaza tunnel that once held hostages -army",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 20, 2024 03:39PM ET",
    "Updated Jan 21, 2024 02:00AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/israeli-soldiers-uncover-gaza-tunnel-that-once-held-hostages-army-3278897",
  "paragraph": "3/3\n© Reuters. An underground cell which, according to Israel's military, was used by Palestinian Islamist group Hamas to hold hostages in the Gaza Strip, in this handout picture released on January 20, 2024. Israel Defense Forces/Handout via REUTERS\n2/3\n(Corrects spellings in media slug of Jan. 20 story, no change to story text) JERUSALEM (Reuters) -At the end of a kilometer-long, booby-trapped tunnel in the Gaza Strip, Israeli soldiers discovered cramped cells where the military said Hamas kept about 20 hostages. They found a holding area, five narrow rooms behind metal bars, toilets, mattresses, and even drawings by a child hostage who was freed during a November truce, military spokesman Rear Admiral Daniel Hagari said. No hostages were there when it was discovered. The military released photos from the underground labyrinth and said it brought in journalists to document the tunnel before it was destroyed. The tunnel entrance, Hagari said, was in the house of a Hamas member in the southern Gaza city of Khan Younis, where Israel has been focusing its fight in recent weeks against the Palestinian Islamist group. \"The soldiers entered the tunnel where they encountered terrorists, engaging in a battle that ended with the elimination of the terrorists,\" Hagari said. The tunnel was rigged with blast doors and explosives, he said. \n\"According to the testimonies we have, about 20 hostages were held in this tunnel at different times under harsh conditions without daylight, in dense air with little oxygen, and terrible humidity that makes breathing difficult,\" he said. Some of the hostages kept there were freed during the week-long Qatari-mediated truce. Others are among the more than 130 captured during Hamas' Oct. 7 rampage through southern Israel that are still in Gaza."
}