{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0O0SA_L.jpg",
  "title": "Trump seeks to disqualify Georgia prosecutor, accusing her of 'stoking racial animus'",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 25, 2024 02:24PM ET",
    "Updated Jan 25, 2024 03:06PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Mark Jannetty",
        "2024-01-25 22:14:41",
        "this case is done",
        "https://www.investing.com/members/241633026"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/trump-seeks-to-disqualify-georgia-prosecutor-willis-in-election-case-court-filing-3283390",
  "paragraph": "© Reuters. FILE PHOTO: Fulton County District Attorney Fani Willis speaks during a Harrison Floyd bond revocation hearing, at the Fulton County Courthouse in Atlanta, Georgia, U.S. November 21, 2023. Dennis Byron/Pool via REUTERS/File Photo\nWASHINGTON (Reuters) -Former U.S. President Donald Trump on Thursday joined an effort by a co-defendant in his Georgia election interference case to disqualify prosecutor Fani Willis and dismiss the criminal charges, according to a court filing. Trump co-defendant Michael Roman has alleged in previous court filings that Willis had an inappropriate relationship with Nathan Wade, the lawyer she hired to help run the criminal case. Trump's defense team endorsed those claims and leveled new accusations that Willis, the district attorney of Fulton County, \"inappropriately injected race into the case and stoked racial animus\" during a speech responding to Roman's allegations. Willis, during an address this month at a historically Black church in Atlanta, questioned why Wade, who is Black, had come under scrutiny and not two other special prosecutors assigned to the probe, who are white. \"I’m a little confused. I appointed three special counsel, as is my right to do,\" Willis said, according to a transcript of the speech included in the filing. \"They only attack one.\" Trump's filing said Willis' comments risk improperly turning potential jurors against the defendants in the case. Trump and 14 of his political allies are facing racketeering and other charges for allegedly plotting to overturn Trump's 2020 election loss in Georgia to Democrat Joe Biden, which he falsely claims was the result of fraud. Trump is the frontrunner for the Republican presidential nomination. Roman previously sought to dismiss the case and disqualify Willis and her office, accusing Willis of financially benefiting from an alleged romantic relationship with Wade. Willis' office has paid Wade more than $650,000 for his work on the case, records show. \nWillis has not yet responded to the allegations in court. A judge has scheduled a Feb. 15 hearing on the issue."
}