{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK1010P_L.jpg",
  "title": "Costs, crackdown put a damper on Pakistan's election campaigns",
  "category": "Economy",
  "publisher": "Reuters",
  "date": [
    "Published Jan 31, 2024 09:12PM ET",
    "Updated Jan 31, 2024 09:31PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/economy/costs-crackdown-put-a-damper-on-pakistans-election-campaigns-3289124",
  "paragraph": "6/6\n© Reuters. A worker carries campaign posters of a political party to decorate the area, ahead of general elections, in Karachi, Pakistan January 23, 2024. REUTERS/Akhtar Soomro\n2/6\nBy Ariba Shahid KARACHI (Reuters) -Higher living costs and political uncertainty have muted Pakistan's once boisterous election campaigns, with both candidates and those who supply them with materials bemoaning the need to do more with much less. The Feb. 8 general election, the first since 2018, will take place as Pakistan battles an economic crisis, inflation running at almost 30% and a weak currency while navigating a recovery path under a $3 billion International Monetary Fund bailout.  The vote also follows a widespread state-sanctioned crackdown on the Tehreek-e-Insaf party of popular former Prime Minister Imran Khan, who has been in jail since August over a raft of charges, including corruption. \"There was a lot of activity in previous elections and our business boomed, but in this election our business has been reduced to half compared to the last one,\" said Jawad Jiwani, who sells party flags in the commercial hub Karachi. Candidate are hosting fewer outdoor gatherings for supporters and the trucks that usually drive up and down the streets, festooned with campaign posters and blaring music and slogans, are also noticeably quieter. Syed Arsalan Haider, a Karachi printer, said the cost of a square foot of banner was up by 130% since the last election. Lahore printer Abdul Aziz said the cost of printing stickers had risen almost 70% and posters by nearly 90%. TV adverts are also limited, with Senator Taj Haider from the Pakistan People's Party (PPP) of prime ministerial candidate Bilawal Bhutto Zardari saying his party chose TV over public rallies and printed materials in a bid to save costs. \"If we had resources like we did in our past campaigns, then we could have done it better,\" added Senator Faisal Subzwari of the Mutahida Quami Movement (MQM) which is known for its colourful campaign materials. THE KHAN FACTOR Pakistan's political parties are mainly funded by wealthy candidates and donors from within the country and abroad, but uncertainty over the election date affected this funding. The elections were supposed to be held in November after parliament was dissolved in August, but was postponed to February because of a census. In January, members of Pakistan's Senate called for further delays citing security reasons. The absence of Khan's PTI - and fears of falling foul of the politically powerful military establishment - have also put a damper on campaigning, businessmen and candidates say. Khan, whose party won the last election, says the military wants to keep him from power, which the military denies. Meherbano Qureshi, a PTI candidate and daughter of the party's jailed vice chairman Shah Mehmood Qureshi, said people were scared to show their support and hang campaign material. \"Wherever we have put them up, they have been torn down, or people are too scared to put them up, because the moment a house puts up a flag, they put up a target on their backs, and then they are harassed by the local police,\" she said. There was no immediate comment from the Lahore police when asked about the intimidation.  \nKhurram Sher Zaman, a former PTI member of parliament and current candidate, also said fundraising had become challenging because businessmen were reluctant to support the party. \"They're probably scared of the establishment. Whatever we are spending it’s from our pocket,\" he added."
}