{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0A0RF_L.jpg",
  "title": "Scientists conclude New Mexico fossil is new Tyrannosaurus species",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 11, 2024 11:11AM ET",
    "Updated Jan 11, 2024 11:18AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/scientists-conclude-new-mexico-fossil-is-new-tyrannosaurus-species-3272715",
  "paragraph": "3/3\n© Reuters. An artist's reconstruction of the newly identified dinosaur species Tyrannosaurus mcraeensis, based on a partial skull fossil collected in New Mexico, U.S. Sergei Krasinski/Handout via REUTERS\n2/3\nBy Will Dunham WASHINGTON (Reuters) - Scientists reassessing a partial skull first unearthed in 1983 in southeastern New Mexico have concluded that the fossil represents a new species of Tyrannosaurus - the fearsome apex predator from western North America at the twilight of the dinosaur age - that predated the fabulously famous T. rex. Subtle differences from Tyrannosaurus rex observed in the skull merit recognizing the dinosaur as a separate species called Tyrannosaurus mcraeensis that lived several million years before T. rex and was comparable in size, the researchers said on Thursday. The skull previously was identified as a T. rex.  Other researchers expressed doubt that it represents a new Tyrannosaurus species, saying differences between it and other T. rex skulls were unremarkable and the study's conclusion that the fossil dated to 71-73 million years ago was problematic. T. rex has been the sole species of the genus Tyrannosaurus recognized since the dinosaur was first described in 1905. A genus is a broader grouping of related organisms than a species. T. rex fossils date to the couple million years before an asteroid struck Earth 66 million years ago, dooming the dinosaurs. The first parts of the New Mexico skull were found near the base of Kettle Top Butte in 1983, with more later discovered. Paleontologist Anthony Fiorillo, executive director of the New Mexico Museum of Natural History & Science and one of the authors of the study published in the journal Scientific Reports, said about 25% of the skull has been collected. Most of the braincase and the upper jaws are missing.  \"Compared to T. rex, the lower jaw is shallower and more curved towards the back. The blunt hornlets above the eyes are lower than in T. rex,\" said paleontologist Nick Longrich of the University of Bath in England, another of the researchers. \"It's the nature of species that the differences tend to be subtle. The key thing is they're consistent. We looked at lots of different T. rex, and our animal was consistently different from every known T. rex, in every bone,\" Longrich added. The researchers said the differences involve important traits. Fiorillo noted that the feature above the Tyrannosaurus eyes has been interpreted as important in sexual selection. \"So, these differences imply that our animal ate differently and may have selected mates differently than the more famous Tyrannosaurus rex,\" Fiorillo said. Tyrannosaurus had a massive head, tremendous bite strength, walked on two strong legs, and had puny arms. Perhaps the largest-known T. rex is a specimen named Sue at the Field Museum in Chicago, at 40-1/2 feet (12.3 meters) long. The researchers said the existence of T. mcraeensis changes the understanding of Tyrannosaurus origins. The researchers said T. mcraeensis was larger than other close Tyrannosaurus relatives inhabiting northern North America before T. rex, suggesting that giant species of this group evolved millions of years earlier than previously thought and came from southern North America.  Paleontologist Thomas Carr of Carthage College in Wisconsin, who has studied variation within T. rex, called the new study \"unpersuasive.\" \"The features in the New Mexico specimen that supposedly make it unique are seen among other T. rex fossils,\" Carr said. \"The 'differences' are not discrete and obvious, instead they are like shades of gray or shapes in clouds. I have seen the specimen myself several times and nothing leaps out to me as anything different from other T. rex adults. The differences that can be seen can be accounted for by relative maturity and individual variation.\" \nThe fossil was dated not based on the skull itself but on rock beneath it, Carr said. Existing evidence indicates Tyrannosaurus appeared no earlier than 67 to 68 million years ago, Carr added. The issue of potential additional Tyrannosaurus species has been contentious. Some researchers in 2022 proposed the existence of three Tyrannosaurus species, based on thighbone and tooth variations among fossils. Other researchers disagreed, seeing insufficient evidence."
}