{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "Condemned Alabama prisoner asks US Supreme Court to stop rare second execution attempt",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 19, 2024 05:53PM ET",
    "Updated Jan 20, 2024 12:40PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/condemned-alabama-prisoner-asks-us-supreme-court-to-stop-rare-second-execution-attempt-3278722",
  "paragraph": "By Jonathan Allen (Reuters) - An Alabama death row prisoner who survived a botched execution attempt by lethal injection asked the U.S. Supreme Court on Friday to halt the state's planned second attempt next week, this time by the novel method of asphyxiation with nitrogen gas. Lawyers for Kenneth Smith, convicted for a murder-for-hire committed in 1988, are arguing that for a government to make a second attempt to execute a prisoner after painfully botching a first attempt violates the U.S. Constitution's Eighth Amendment ban on cruel and unusual punishment.  Such a scenario has happened only once before in U.S. history, in 1947, Smith's lawyers told the Supreme Court.  They said that if courts allow execution to proceed on Thursday, \"states will be free to engage in serial execution attempts regardless of the reasons or circumstances of the previous failed attempt - and regardless whether that failed attempt caused (and continues to cause) physical and emotional pain.\"  \"With respect, that is the very definition of torture,\" the lawyers wrote.  Alabama officials have said they are required to carry out a sentence and a death warrant issued by state courts. In separate proceedings on Friday before the Atlanta-based 11th U.S. Circuit Court of Appeals, Smith also challenged the constitutionality of Alabama's new gassing method. The state's Department of Corrections has said it expects the method will kill a condemned prisoner swiftly, within a few minutes, and without undue suffering. \"Alabama has adopted the most painless and humane method of execution known to man,\" Alabama Solicitor General Edmund LaCour told the three-judge 11th Circuit panel that is considering Smith's request for an order to delay his execution to allow his legal challenges to continue. Smith's lawyers argued that the department's decision to gas Smith by strapping to his face a commercially made industrial-safety breathing mask connected to a canister of pure nitrogen comes with risks of botching their second attempt to execute Smith. In past decades, some governments, including in the United States, have used toxic gases such as hydrogen cyanide to carry out executions. Alabama's method uses nitrogen, which makes up about 78% of breathable air, in a pure form to displace any oxygen the prisoner can inhale.  Lawmakers in Oklahoma and Mississippi also have approved gassing methods in recent years as lethal-injection drugs become more difficult to obtain, though they have not used the method yet. Smith's lawyers have said that the seal between the mask's rubber edges and Smith's face could break, allowing in at least some oxygen that could prolong the execution or result in him surviving it but with serious brain injury from oxygen deprivation. They also have said that some people who have tried to use masks to gas themselves in assisted suicides have vomited, and that there is a risk that Smith, who will be strapped to a gurney, could end up choking to death on his own vomit.  Smith's lawyers told the 11th Circuit on Thursday they would propose that Alabama instead use a hood filled with a high flow of nitrogen, which they said has become the preferred approach in assisted suicides using inert gases. \nSmith, according to his lawyers, has been suffering from nausea as a symptom of post-traumatic stress disorder since his first time in the execution chamber in November 2022, where officials spent hours trying to insert a needle into various parts of his body before abandoning the attempt. Alabama has said it will not stop the execution if Smith vomits once the pure nitrogen is running. LaCour said Smith's claims about the risks of the mask are speculative, and told the 11th Circuit that if the prisoner is concerned about vomiting into the mask then he could opt \"to have his last meal earlier in the day, or the day before the planned execution.\""
}