{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0Q003_L.jpg",
  "title": "US Supreme Court is asked to stop West Point from considering race in admissions",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 26, 2024 07:26PM ET",
    "Updated Jan 26, 2024 07:45PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Mark Jannetty",
        "2024-01-27 15:43:26",
        "Democrats are pathetic with their racist behavior. ",
        "https://www.investing.com/members/241633026"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/us-supreme-court-is-asked-to-stop-west-point-from-considering-race-in-admissions-3284661",
  "paragraph": "© Reuters. FILE PHOTO: People attend the 2023 graduation ceremony at the United States Military Academy (USMA), at Michie Stadium in West Point, New York, U.S., May 27, 2023. REUTERS/Eduardo Munoz\nBy John Kruzel and Andrew Chung WASHINGTON (Reuters) - A group opposed to affirmative action on Friday asked the Supreme Court to block the U.S. Military Academy at West Point from considering race as a factor in admissions decisions while a dispute over the practice proceeds in a lower court. The request came from Students for Fair Admissions, the group behind a successful Supreme Court challenge to race-conscious collegiate admissions policies in cases involving Harvard University and the University of North Carolina.  West Point is a prestigious military service academy in New York state that educates cadets for commissioning into the U.S. Army. Students for Fair Admissions said that West Point's application deadline for the class of 2028 is Jan. 31, and asked the Supreme Court to decide the request for an injunction by that time.  The U.S. Justice Department in court filings has said that West Point is a \"vital pipeline to the officer corps\" and that its race-conscious admissions practices help the Army achieve its \"mission critical\" goal of having officers as diverse as its enlisted military personnel.  Edward Blum, president of Students for Fair Admissions, in a statement called race-conscious admissions \"antithetical to our nation's military institutions and mission.\" \"It is our hope that the Supreme Court will forbid West Point from using racial classifications and preferences in their admissions process for their incoming class going forward from today,\" Blum said. His group's Supreme Court filing came after a federal judge rejected its request for a preliminary injunction on Jan. 3 and rebuffed its request for an emergency injunction the next day. The group appealed to the New York-based 2nd U.S. Circuit Court of Appeals, which has yet to rule on their request.  The group sued last September challenging West Point's admissions process on behalf of two Students for Fair Admissions members - a high school student applying for the first time and a first-year college student applying for the second time. Both students \"are fully qualified but white,\" the group said.  The lawsuit said West Point's admissions practices discriminated against white applicants and violated the principle of equal protection in the U.S. Constitution. In invalidating admissions policies at Harvard and UNC last year, the Supreme Court did not address race in admissions at military academies, which Chief Justice John Roberts in a footnote said had \"potentially distinct interests.\" President Joe Biden's administration, in defending the race-conscious admissions policies used by the U.S. military academies, said that senior military leaders long have recognized that a scarcity of minority officers can create distrust within the armed forces. \nAlthough Black people make up 20.2% of the Army's active duty enlisted personnel, only 11% of officers are Black, the Justice Department said. Hispanic people constitute 18% of active personnel but only 9% of officers, the department said. White people by contrast constitute 51.7% of the Army active duty enlisted corps and 68% of its officers, the Justice Department said."
}