{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "Yemen's Houthis hit US-owned dry bulk ship, no injuries - U.S Centcom",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 15, 2024 12:14PM ET",
    "Updated Jan 15, 2024 12:42PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Mark Jannetty",
        "2024-01-15 17:44:33",
        "what will pathetic Brandon do about this? probably send them a couple of pallets of cash like Obama ",
        "https://www.investing.com/members/241633026"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/yemens-houthis-hit-usowned-dry-bulk-ship-no-injuries--us-centcom-3274498",
  "paragraph": "By Ahmed Elimam and Tala Ramadan DUBAI (Reuters) -Houthi forces in Yemen struck the U.S.-owned and operated dry bulk ship Gibraltar Eagle with an anti-ship ballistic missile, U.S Central Command said on Monday, although there were no reports of injuries or significant damage. The vessel's U.S.-based operator Eagle Bulk Shipping (NYSE:EGLE) said that it was hit by an \"unidentified projectile\" while sailing 100 miles off the Gulf of Aden and suffered limited damage to its cargo hold, and no seafarers were injured. \"As a result of the impact, the vessel suffered limited damage to a cargo hold but is stable and is heading out of the area,\" Eagle Bulk said in a statement, adding that it was carrying a cargo of steel products. The Iran-backed Houthis who control most of Yemen's Red Sea coast have been attacking commercial ships in the area they say are linked to Israel or bound for Israeli ports, in action they claim is aimed at supporting the Palestinians in the war and Hamas in Gaza. U.S. and British forces responded last week by carrying out dozens of air and sea strikes on Houthi targets in Yemen. Earlier in the day British Maritime Security firm Ambrey said that a Marshall Islands-flagged, U.S.-owned bulk carrier was reportedly struck by a missile while transiting near Yemen's port of Aden. The vessel was assessed not to be Israel-affiliated, according to Ambrey, which also assessed the attack to have targeted U.S. interests in response to the recent strikes on Houthi military positions. The latest attack suggests that despite the U.S. strikes, the Houthis appear undeterred. Later on Monday an explosion was heard near Yemen's Hodeidah airport, residents reported. Hodeidah is some distance from Aden, however, and it was not immediately clear what had caused the blast. The Houthis, who control the capital Sanaa and much of the west and north of Yemen, have vowed to continue attacks in the Red Sea since the U.S and British strikes. The group's leader, Abdel-Malek al-Houthi, said on Thursday in a televised speech that any U.S. attack on Yemen would not go without a response. The U.S. military said on Sunday a U.S. fighter jet shot down an anti-ship cruise missile that the Houthis fired towards the USS Laboon in the southern Red Sea."
}