{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK090AU_L.jpg",
  "title": "Exclusive-Iraq seeks quick exit of US forces but no deadline set, PM says",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 10, 2024 05:07AM ET",
    "Updated Jan 10, 2024 08:05AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/exclusiveiraq-seeks-quick-exit-of-us-forces-but-no-deadline-set-pm-says-3271076",
  "paragraph": "3/3\n© Reuters. Iraqi Prime Minister Mohammed Shia al-Sudani walks before an interview with Reuters in Baghdad,Iraq January 9, 2024. REUTERS/Thaier Al-Sudani\n2/3\nBy Timour Azhari BAGHDAD (Reuters) - Iraq wants a quick and orderly negotiated exit of U.S-led military forces from its soil but has not set a deadline, Prime Minister Mohammed Shia al-Sudani said, describing their presence as destabilising amid regional spillover from the Gaza war. Longstanding calls by mostly Shi'ite Muslim factions, many close to Iran, for the U.S-led coalition's departure have gained steam after a series of U.S. strikes on Iran-linked militant groups that are also part of Iraq's formal security forces. Those strikes, which came in response to dozens of drone and missile attacks on U.S. forces since Israel launched its Gaza campaign, have raised fears that Iraq could once again become a theatre for regional conflict.  \"There is a need to reorganise this relationship so that it is not a target or justification for any party, internal or foreign, to tamper with stability in Iraq and the region,\" Sudani told Reuters in an interview in Baghdad on Tuesday. Giving the first details of his thinking about the future of the coalition since his Jan. 5 announcement that Iraq would begin the process of closing it down, Sudani said the exit should be negotiated under \"a process of understanding and dialogue\".  \"Let's agree on a time frame (for the coalition's exit) that is, honestly, quick, so that they don't remain long and the attacks keep happening,\" he said, noting that only an end to Israel's war on Gaza would stop the risk of regional escalation.  \"This (end of the Gaza war) is the only solution. Otherwise, we will see more expansion of the arena of conflict in a sensitive region for the world that holds much of its energy supply,\" Sudani said.  A U.S. withdrawal would likely increase concern in Washington about the influence of arch foe Iran over Iraq's ruling elite. Iran-backed Shi'ite groups gained strength in Iraq after the 2003 U.S.-led invasion. The Pentagon on Monday said it had no plans to withdraw U.S. troops, which are in Iraq at the invitation of its government.  Iraq, OPEC's second-largest oil producer, has been among the fiercest critics of Israel's Gaza campaign, describing the mass killing and displacement of Palestinian civilians as a textbook case of genocide, claims Israel vehemently denies.  But Iraq's government has repeatedly also said the attacks by armed groups on foreign forces and diplomatic missions in Iraq were illegal and went against the country's interests, and says it has arrested some perpetrators and prevented attacks.  At the same time, Baghdad has condemned U.S. strikes on bases used by the groups, as well as a recent strike against a senior militia commander in the heart of Baghdad, as grave violations of sovereignty.  Critics say the armed groups, including Kataeb Hezbollah and Haraket Hezbollah al-Nujaba, use their status as members of the Popular Mobilization Forces (PMF), a state security force that began as a grouping of militias in 2014, as a cover. When striking at U.S. forces, they operate outside the chain of command under the banner of the Islamic Resistance in Iraq; when the U.S. retaliates, they mourn their losses as members of the PMF and reap the rewards of rising anti-U.S. sentiment.  U.S.-led forces invaded Iraq and toppled former leader Saddam Hussein in 2003, withdrawing in 2011 but then returning in 2014 to fight Islamic State as part of an international coalition. The U.S. currently has some 2,500 troops in Iraq. With Islamic State territorially defeated in 2017 and on the demise ever since, Sudani said the coalition's raison d'etre had long-since ended.  YEARS IN THE MAKING But calls for the coalition's withdrawal have been around for years and, so far, little has changed. Iraq's parliament in 2020 voted for its departure days after the U.S. assassinated top Iranian general Qassem Soleimani and a senior Iraqi militant commander in a strike outside Baghdad airport.  The next year, the U.S. announced the end of its combat mission in Iraq and a shift to advising and assisting Iraqi security forces, a move that changed little on the ground. The Gaza war has put the issue back in centre stage, with many Iraqi groups that brought Sudani's government to power and are close to Tehran calling for the final exit of all foreign forces, a move long sought by Iran and its regional allies. The chief of Lebanon's Hezbollah group, Sayyed Hassan Nasrallah, said in a speech on Friday that U.S. strikes in Iraq should pave the way for the final withdrawal of U.S. forces from Iraq, which would also make their presence in northeastern Syria untenable.  Sudani said he was seeking the coalition's exit because Iraq could now defend itself from terrorism and should exert full sovereignty over its territory - thereby avoiding giving anyone an excuse to draw Iraq into regional conflict.  \"Ending its presence will prevent more tensions and the entanglement of internal and regional security issues,\" Sudani said.  \nHe said Iraq was open to establishing bilateral relations and engaging in security cooperation with coalition nations, including the U.S. This could including training and advising Iraqi security forces as well as weapons purchases.  The U.S. \"is not an enemy to us and we are not at war with it, but if these tensions continue it will definitely impact and create a gap in this relationship,\" he said."
}