{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK1402S_L.jpg",
  "title": "China court gives Australian writer Yang Hengjun suspended death sentence",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 04, 2024 10:30PM ET",
    "Updated Feb 05, 2024 09:31AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/australian-writer-yang-hengjun-sentenced-by-beijing-court-friend-3292154",
  "paragraph": "© Reuters. FILE PHOTO: People walk past one of the entrances of Beijing No. 2 Intermediate People's Court where Australian writer Yang Hengjun is expected to face trial on espionage charges, in Beijing, China May 27, 2021. REUTERS/Carlos Garcia Rawlins/File Photo\nBy Kirsty Needham and Laurie Chen SYDNEY/BEIJING (Reuters) -A Beijing court on Monday handed Australian writer Yang Hengjun a suspended death sentence on espionage charges, threatening a recent rebound in bilateral ties that followed several years of strained relations between Beijing and Canberra. The sentence, handed down five years after Yang was detained in China and three years after his closed-door trial on espionage charges, shocked his family and supporters. It also threatens a recent warming of relations between Australia and China, analysts say, which until late last year had been marred by tensions over trade, COVID-19 and China's security posture. Yang, a pro-democracy blogger, is an Australian citizen born in China who was working in New York before his arrest at Guangzhou airport in 2019. An employee of China's Ministry of State Security from 1989-1999, he had been accused of spying for a country China has not publicly identified, and the details of the case against him have not been made public. Wang Wenbin, a Chinese foreign ministry spokesperson, told reporters in Beijing that Yang had been found guilty of espionage and \"sentenced to death with two years probation, and it was ordered that all his personal properties be confiscated\". Wang added that \"the Australian side\" was allowed to sit in on the sentencing and that all procedures were followed.  A suspended death sentence in China gives the accused a two-year reprieve from being executed, after which it is automatically converted to life imprisonment, or more rarely, fixed-term imprisonment. The individual remains in prison throughout. Yang's wife was in court to hear the verdict, said Sydney-based scholar Feng Chongyi, a longtime friend of Yang's who called it a \"serious case of injustice\", adding that Yang had denied the charges. \"He is punished by the Chinese government for his criticism of human rights abuses in China and his advocacy for universal values such as human rights, democracy and rule of law,\" Feng said. He urged the Australian government to seek medical parole for Yang, saying five years of detention had taken a heavy toll on his health. Australia is \"appalled\" at the court's decision and had called in China's ambassador, Australian Foreign Minister Penny Wong said. Wong said the Australian government understood the sentence can be commuted to life imprisonment after two years if the individual does not commit any serious crimes in that period. \"This is harrowing news for Dr Yang, his family and all who have supported him,\" she said. Yang's family was \"shocked and devastated by this news, which comes at the extreme end of worst expectations\", said a family spokesman in Sydney. His two sons, who live in Australia, wrote to Prime Minister Anthony Albanese in October on the eve of his visit to Beijing, urging him to seek Yang's release on medical grounds. His supporters have argued Yang should be released on medical parole after he was told last year he had a 10 cm (4 inch) cyst on his kidney that may require surgery.  Australia had said it was troubled by repeated delays in Yang's case, and had advocated for his well-being, including access to medical treatment, \"at the highest levels\". A Beijing court heard Yang's trial in secret in May 2021 and the case against him has never been publicly disclosed. He has denied working as a spy for Australia or the United States and has denied any wrongdoing in letters to family from jail. HIGH-PROFILE BLOGGER Yang was detained as Australia-China ties deteriorated in 2019. But hopes of his release had been lifted by a recent warming of relations and the release of Australian broadcaster Cheng Lei shortly before Albanese visited China last year. Albanese was the first Australian leader to visit China since 2016, as ties soured over Chinese telecoms company Huawei, allegations of espionage, Australia's push to investigate the origins of COVID-19, and tensions over the South China Sea. James Laurenceson, director of the Australia-China Relations Institute at the University of Technology Sydney, said that Beijing had said it wanted to move beyond the stabilisation of ties with Australia, but that the sentence would make a thaw harder. \"This decision makes it extremely difficult for the Albanese government to do so in terms of managing the domestic politics. The strong language already used by the foreign minister makes plain their disappointment,\" he said. Yang wrote about Chinese and U.S. politics as a high-profile blogger. He was living in New York in 2019 as a visiting scholar at Columbia University who supplemented his income by working as a \"daigou\" or online shopping agent for Chinese consumers seeking American products. He was arrested while visiting China in January 2019, accompanied by his wife.  Yang had been detained in China for a short period once before, in 2011, on suspicion of links to online democracy activists. He was released after a few days following interventions by the Australian government. At the time, he wrote to Feng to say he had worked for China’s Ministry of State Security for a decade starting in 1989, including in Hong Kong and Washington, before quitting and moving to Australia, Feng had told Reuters. Yang migrated to Australia in 1999 and became an Australian citizen in 2002, undertaking PhD studies at Sydney's University of Technology in 2006, where Feng was his supervisor. \nYang spent the next four years writing spy novels, published in Taiwan, about a double agent, also surnamed Yang.  Elaine Pearson, who heads Human Rights Watch in Asia, said the sentence was \"outrageous\", and called on the Australian government to work \"with other governments that also have their citizens arbitrarily detained\" including in Canada, Japan and the United States."
}