{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0H0WD_L.jpg",
  "title": "US says 'no way' to solve Israel security, Gaza war without Palestinian state",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 18, 2024 03:18PM ET",
    "Updated Jan 19, 2024 04:06AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-says-no-way-to-solve-israel-security-gaza-war-without-palestinian-state-3277677",
  "paragraph": "© Reuters. Smoke rises following Israeli strikes, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, as seen from Rafah, in the southern Gaza Strip, January 18, 2024. REUTERS/Ibraheem Abu Mustafa\nBy Simon Lewis and Humeyra Pamuk WASHINGTON (Reuters) - There is \"no way\" to solve Israel's long-term security challenges in the region and the short-term challenges of rebuilding Gaza without the establishment of a Palestinian state, U.S. State Department spokesperson Matthew Miller said on Thursday. Speaking at a news briefing, Miller said Israel had an opportunity right now as countries in the region were ready to provide security assurances to Israel.  \"But there is no way to solve their long-term challenges to provide lasting security and there is no way to solve the short-term challenges of rebuilding Gaza and establishing governance in Gaza and providing security for Gaza without the establishment of a Palestinian state.\" The comments came after Israeli Prime Minister Benjamin Netanyahu said in a press conference he had told Washington that he objected to any Palestinian statehood that did not guarantee Israel's security. \"I clarify that in any arrangement in the foreseeable future, with an accord or without an accord, Israel must have security control over the entire territory west of the Jordan River. That's a necessary condition. It clashes with the principle of sovereignty but what can you do,\" Netanyahu said in Tel Aviv. He added that the lack of Palestinian statehood had not stood in the way of normalization agreements with Arab states a few years ago and that he still intended to add more countries to those accords. Israel and its biggest backer the United States appear at odds now, with Netanyahu and his right-wing coalition government largely rejecting the establishment of a Palestinian state even though Washington maintains that the two-state solution is the only feasible way to bring lasting peace to the region. U.S. Secretary of State Antony Blinken, in his fourth trip to the Middle East last week since the Oct. 7 attack by Hamas, took a rough agreement to Israel that its predominately Muslim neighbors would help rehabilitate Gaza after the war and continue economic integration with Israel, but only if it committed to eventually allowing the creation of an independent Palestinian state. U.S.-brokered talks on a Palestinian state in territory now occupied by Israel collapsed almost a decade ago.  The latest episode of hostilities in the decades-old Israeli-Palestinian conflict started when Hamas militants stormed into southern Israel on Oct. 7, killing 1,200 people and taking 240 hostages. Israel says more than 130 remain in captivity. Israel responded to Hamas' assault with a siege, bombardment and ground invasion of Gaza that have devastated the tiny coastal territory and killed more than 24,000 people, according to Gaza health officials. \nDespite the disagreements, U.S. support for longtime ally Israel \"remains ironclad,\" Miller said.  \"This is not a question of the United States pressuring them to do anything. This is about the United States laying out for them the opportunity that they have.\""
}