{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBQ0F1_L.jpg",
  "title": "Mexico hails unspecified 'important' deals with US in talks on migration, trade",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 27, 2023 01:19PM ET",
    "Updated Dec 28, 2023 11:46AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/mexico-leader-urges-us-to-invest-in-people-not-walls-ahead-of-blinken-meeting-3264109",
  "paragraph": "2/2\n© Reuters. Mexico President Andres Manuel Lopez Obrador gestures during a news conference as his government re-launched former state airline Mexicana de Aviacion, at the National Palace, in Mexico City, Mexico, December 26, 2023. Mexico Presidency/Handout via REUTER\n2/2\nBy Ana Isabel Martinez, Sarah Morland and Valentine Hilaire MEXICO CITY (Reuters) -Mexico said on Wednesday it had struck unspecified \"important\" deals with the United States after talks that U.S. officials sought to focus on curbing record-high migration, a key issue in next year's U.S. elections. Secretary of State Antony Blinken led the closed-door negotiations for the U.S. side, and Mexican Foreign Minister Alicia Barcena told reporters she had pushed U.S. officials to ease any remaining curbs on cross-border trade. The administration of U.S. President Joe Biden is seeking the help of President Andres Manuel Lopez Obrador to reduce a record high number of migrants wanting to enter the world's wealthiest economy from Mexico, a key issue with voters ahead of Biden's expected re-election bid next year. In a post on social media, Lopez Obrador hailed what he described as \"important agreements\" following the talks with U.S. officials, but without giving any details on the deals.  Lopez Obrador said he had requested the meeting to discuss cooperation on migration, the economy and security. The meetings come after more than half a million migrants this year crossed the dangerous Darien Gap jungle connecting South America with Central America – double last year's record – with many fleeing crime, poverty and conflict to seek better prospects in the United States. Earlier this month, the U.S. border authorities temporarily closed two key rail border crossings for five days and shuttered other crossings in order to redeploy enforcement resources elsewhere in response to spiking migration. In remarks outside Lopez Obrador's downtown offices, Barcena described reopening the crossings as a \"priority\" for Mexico.  \"We are talking about the economic part, as well as the structural causes of migration,\" she said. Last week, Lopez Obrador pledged to help ease migratory pressures on the United States and earlier on Wednesday he urged U.S. lawmakers to invest more to help the poor in Latin America and the Caribbean \"instead of putting up barriers, barbed wire fences in the river, or thinking about building walls.\" Former U.S. President Donald Trump, the leading candidate to take on Biden in 2024, has promised to crack down on illegal immigration and restrict legal immigration if elected. During his previous term, Trump focused on building a wall on the Mexico border. His administration built 450 miles (725 km) of barriers across the roughly 2,000-mile (3,200-km) border, but much of that replaced existing structures. Lopez Obrador met with Blinken, while the U.S. delegation also included Homeland Security Secretary Alejandro Mayorkas, who leads border security efforts. \"We had a very productive meeting,\" Mayorkas said in a post on X, adding that \"the regional challenge of migration requires regional solutions.\" \nEarlier, thousands of migrants and asylum seekers marched slowly north hoping to reach the U.S. border. \"We don't need to go back to our country if we don't have anything there,\" said Nohemia Zendejas, a mother on the road with four children.  \"I come from Venezuela,\" she said. \"And Venezuela is broken.\""
}