{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK090G4_L.jpg",
  "title": "Gaza's children mourn parents killed by Israeli bombardment",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 10, 2024 08:14AM ET",
    "Updated Jan 10, 2024 12:52PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/gazas-children-mourn-parents-killed-by-israeli-bombardment-3271435",
  "paragraph": "5/5\n© Reuters. Laila Al-Sultan, a displaced Palestinian girl who was wounded in an Israeli strike that killed her father, plays with her brother Khaled inside their makeshift shelter, in Rafah in the southern Gaza Strip, January 8, 2024. REUTERS/Ibraheem Abu Mustafa\n2/5\nBy Saleh Salem RAFAH, Gaza (Reuters) - When 7-year-old Laila al-Sultan wakes up at night she shouts for her father, killed in the same Israeli air strike that injured her leg in a Gaza war thought to have deprived thousands of Palestinian children of one or both parents.  She and her brother Khaled, 4, roll around on the floor of the shanty they now live in amid a tent city of homeless people, facing up to a life with no father as their mother struggles to cope in the rubble of a ruined enclave.  \"The house collapsed on us and Daddy went to heaven and he is very happy,\" said Khaled, bouncing up and down on Laila's lap as they sat.  Three months of war have been devastating for the children of Gaza. Health authorities in the Hamas-run territory have estimated that about 40% of those confirmed killed, a figure they now put at 23,357, were aged under 18.  Most of those who survive have lost their homes. They live in shelters in schools, in tents or shanties, or crammed into still-standing houses, whole families living in single rooms. With very little food in Gaza, children are always hungry. \"We are still unable to count the numbers, but we have initial estimates of thousands of orphans. The figures are high and the challenges are big,\" said Ahmed Majdalani, the Palestinian Social Development Minister in the Israeli-occupied West Bank.  Laila has an ungainly metal brace attached to her injured leg and scars on her face and foot. The children play among the lines of laundry strung between tents on the sand of Rafah.  The hardship - and fear in a conflict where intense Israeli bombing of civilian areas continues - is made worse by their sadness. Laila described a father she loved \"as much as there are fish and skies and everything\", and who used to take her to the park and the zoo.  \"My father was martyred... my uncle Awad was martyred as well as my uncles Ibrahim, Suhaib and Baha. All of us were injured, and here I am, with a leg injury,\" she said.  In another tent in Rafah, Ahmed al-Saker, 13, cried as he stoked a fire under a cooking pot and recalled his father, killed in a strike on their house. \"He used to sing to me at bed time and hug me and hold me before I slept,\" he said, wiping away tears.  \"My mother cannot bear all these worries and burdens and she can't carry my injured brother on her own,\" he said.  DARK FUTURE Fears for the future especially mark Gazan children who lost a parent. Already forced to grow up by war, they now have to bear an extra burden of work in their hard new life in the rubble.  \"My father is gone. He used to always help my mother. He used to help her in cooking and would help us study. Now he is gone, God bless his soul, and at this age I will have to bear more responsibility to help my younger siblings,\" said Raghad Abu Nadi, 14. She walked among the tents with her little brother Osama, 9, who dreams of their dead father. \"I used to love him so much,\" Osama said.  Yet still bombs keep falling. On Tuesday night an air strike in Rafah's Tal al-Sultan district killed several people including children, survivors said.  Israel's stated war aim is the destruction of Hamas, whose fighters rampaged across the border in a surprise attack on Oct. 7, killing more than 1,200 people, mainly civilians and seizing 240 hostages.  The Israeli military says it does what it can to limit harm to civilians and accuses Hamas of trying to increase the death toll by sheltering among ordinary people, something the militant group denies. Israel says the war will last months longer.  \nAhmed Jarbou, sitting with his mother, clearly remembers the moment he lost his father. The family had sought shelter at his uncle's home on the fourth storey of a five-floor building when an Israeli missile struck lower down.  \"My cousin was martyred. He flew out from the window of the fourth floor and crashed onto the ground. My brother's legs were amputated... and my father fell kneeling to the floor and he was martyred,\" 12-year-old Jarbou said."
}