{
  "image": "https://i-invdn-com.investing.com/news/LYNXNPEBAI13Z_L.jpg",
  "title": "Ukraine says it hit targets in St Petersburg with domestic-made drone",
  "category": "Commodities news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 18, 2024 06:33AM ET",
    "Updated Jan 18, 2024 01:06PM ET"
  ],
  "comments": [
    3,
    [
      [
        "Gary Flam",
        "2024-01-18 21:07:19",
        "So are they winning again?",
        "https://www.investing.com/members/248903202"
      ],
      [
        "Fred Johnson",
        "2024-01-18 19:49:24",
        "Good job Ukraine.  Next time launch a dozen of them.",
        "https://www.investing.com/members/246856018"
      ],
      [
        "alexandra kharybina",
        "2024-01-18 13:39:18",
        "\"Reuters could not independently verify the statement.\" because it is a lie, like always. Another attemt to get more money that they will steal!",
        "https://www.investing.com/members/252636904"
      ],
      [
        "Brad Albright",
        "2024-01-18 18:38:46",
        "Confirmed by Russian state media.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Fred Johnson",
        "2024-01-18 19:50:08",
        "Money?  Why do you care, comrade?  You live in Moscow.",
        "https://www.investing.com/members/246856018"
      ],
      [
        "Carl Tom",
        "2024-01-19 00:19:02",
        "seek help as lex",
        "https://www.investing.com/members/248294422"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/commodities-news/ukraine-hits-targets-in-russia-during-drone-attack-on-oil-terminal--military-source-3277167",
  "paragraph": "© Reuters. \n(Reuters) -Ukraine hit targets in Russia's St Petersburg overnight using a domestic-produced drone that flew 1,250 km (775 miles), a Ukrainian government minister was quoted as saying by Interfax-Ukraine news agency on Thursday.  A Ukrainian military source told Reuters earlier that an oil terminal in Russia's second city, located some 850 km (530 miles) from the nearest section of the Ukrainian border, was targeted as part of a \"new stage of work in this region\".  \"...Last night we hit the target, and this thing flew exactly 1,250 kilometres last night,\" Oleksandr Kamyshin, the minister of strategic industries who oversees weapons production, was quoted as saying in Davos.  Reuters could not independently verify the statements. A Russian-appointed official in occupied southeastern Ukraine said earlier that Ukraine had tried and failed to target a Russian Baltic Sea oil terminal with a drone overnight.  Nearly two years since Moscow launched its full-scale invasion of Ukraine in February 2022, the attack shows how Kyiv is trying to strike back, including at targets deep inside Russia.  Kyiv has been trying to develop and produce attack drones with a longer range, to narrow the gap in strike capabilities with Russia, which regularly conducts long-range aerial bombardments of Ukraine with missiles and drones.  Kyiv has used drones and missiles to strike targets on the Black Sea peninsula of Crimea, which Russia seized and annexed in 2014."
}