{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0M0F5_L.jpg",
  "title": "CIA tries to recruit double agents in Russia with new video",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 23, 2024 09:43AM ET",
    "Updated Jan 23, 2024 11:40AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/cia-tries-to-recruit-double-agents-in-russia-with-new-video-3280797",
  "paragraph": "© Reuters. FILE PHOTO: CIA Director William Burns testifies before a House Intelligence Committee hearing on \"worldwide threats to U.S. security\", on Capitol Hill in Washington, U.S., March 9, 2023. REUTERS/Ken Cedeno/File Photo\nBy Andrew Osborn LONDON (Reuters) -The U.S. Central Intelligence Agency has released a Russian-language video to try to persuade Russian intelligence employees to switch sides and work as double agents for Washington. CIA Director William Burns said in July that disaffection among some Russians over the war in Ukraine was creating a rare opportunity to recruit spies, and that the CIA was not letting it pass. The video, released on the CIA's official social media channels, tries to appeal to what it suggests are patriotic Russians working in intelligence agencies who may feel betrayed by what it called corruption in elite circles and the poor way the Russian armed forces are equipped and supplied. \"Those around you may not want to hear the truth. But we do. You are not powerless,\" says the video, the latest in a series of recruitment videos targeting Russia, before detailing ways to contact the CIA. Accompanied by melancholy classical music, the video's main, fictional character is an unnamed 35-year-old male employee of Russia's military intelligence agency who casts himself as a patriot who loves Russia and once served as a paratrooper.  \"Do I have enough courage to confront this betrayal?\" the video shows him saying, before he says he has realised the real enemy is inside Russia in the form of a corrupt leadership and elite.  \"The top leadership has sold the country out for palaces and yachts at a time when our soldiers are chewing rotten potatoes and firing from prehistoric weapons. Our people are forced to give bribes to simply find work,\" the man says as video clips of a bleak Russian winter are spliced with images of official limousines and wealthy Russians giving toasts. The fictional character says his patriotism has spurred him to act and work with the CIA, and the video's final shot depicts a well-dressed man contacting the CIA by mobile phone from a snowy courtyard. A CIA official said on condition of anonymity: \"We are seeing more outreach from Russians as a result of these videos.\" Reuters could not independently confirm that statement. KREMLIN SHRUGS OFF VIDEO President Vladimir Putin, a former KGB spy who served in what used to be East Germany, has called on Russia's FSB domestic security service to step up its activity to counter what he has said is increasing espionage by the West.  The Kremlin says everything is done to ensure the Russian military has the equipment it needs to be successful in what Moscow calls its \"special military operation\" in Ukraine.  It has rejected as false various corruption allegations, and shrugged off the CIA video.  \"You know, this practice is quite common, intelligence agencies around the world very often use the media and social networks to recruit new employees. And they do it all the time, the CIA does it every year,\" Kremlin spokesman Dmitry Peskov said on Tuesday.  The CIA circulated the video on Facebook (NASDAQ:META), on X, and on Telegram, which is a popular messaging and social network app in Russia. \nPeskov suggested the CIA was wasting its time by trying to reach Russians on X, which is banned in Russia and can be accessed only by using a virtual private network, many of which are also banned. Facebook is also blocked in Russia.  \"Somebody needs to tell the CIA that in our country (Russian social network) VKontakte is much more popular than the banned X. And that VKontakte's audience is much larger,\" Peskov said."
}