{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0300Q_L.jpg",
  "title": "Former Harvard head said she was called 'N-word,' got death threats",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 03, 2024 07:48PM ET",
    "Updated Jan 04, 2024 01:23PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Rajesh Kumar",
        "2024-01-05 04:23:23",
        "I don't understand what is the big deal in being called the 'N-word'. No one can rewrite the history. Those who take offense should pick up Persian dictionary or the Arabic dictionary and see the meaning of the word 'Hindu'. For centuries People from India who follow Sanatan Dharma are being called Hindu which means , dark skin, low level, dirty smelly ugly crooks, bad people. It is used as an insult, derogatory term for those who do not follow Abrahamic religion. Compared to that N word is very respectable. ",
        "https://www.investing.com/members/229240398"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/former-harvard-head-said-she-was-called-nword-got-death-threats-3266757",
  "paragraph": "© Reuters. FILE PHOTO: Harvard University President Claudine Gay testifies before a House of Representatives Education and The Workforce Committee hearing titled \"Holding Campus Leaders Accountable and Confronting Antisemitism\" on Capitol Hill in Washington, U.S., D\n(Reuters) - Former Harvard President Claudine Gay said she received emailed death threats and was called the \"N-word\" countless times prior to resigning after her congressional testimony on antisemitism and plagiarism allegations. Gay made the comments in a New York Times opinion piece on Wednesday, a day after she yielded to pressure from Harvard's Jewish community and members of Congress to step down over the Dec. 5 congressional hearing and allegations about her academic work. \"My character and intelligence have been impugned. My commitment to fighting antisemitism has been questioned. My inbox has been flooded with invective, including death threats. I've been called the N-word more times than I care to count,\" Gay said in the 870-word piece titled \"What Just Happened at Harvard Is Bigger Than Me\". Gay, former University of Pennsylvania President Liz Magill and Massachusetts Institute of Technology President Sally Kornbluth testified before a U.S. House of Representatives committee on Dec. 5 about an alleged rise in antisemitism on college campuses after Israel attacked Gaza in response to Hamas' Oct.7 strike on Israel. The three said it depended on the context when asked by U.S. Republican Representative Elise Stefanik whether calling for the genocide of Jews would violate their universities' codes of conduct regarding bullying and harassment. More than 70 U.S. lawmakers demanded the universities fire the presidents over the response, which they judged unacceptable. Magill resigned on Dec. 9. Harvard's board defended Gay. One of her critics, billionaire hedge fund manager Bill Ackman, has said he had heard the search pool from which Gay emerged as president was limited by diversity, equity and inclusion (DEI) efforts. Ackman has said his statement was not racist. \nGay said the campaign against her was part of a \"war\" to undermine trust in pillars of American society ranging from education to public health agencies and news organizations. \"For the opportunists driving cynicism about our institutions, no single victory or toppled leader exhausts their zeal,\" she said in the opinion piece."
}