{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0E0BN_L.jpg",
  "title": "Guatemala's liberal new leader faces huge obstacles to anti-graft drive",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 15, 2024 07:35AM ET",
    "Updated Jan 15, 2024 06:56PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/reformist-arevalo-assumes-guatemalan-presidency-after-opposition-delays-3274402",
  "paragraph": "© Reuters. Guatemala's President Bernardo Arevalo gestures on the balcony of the National Palace in Guatemala City, Guatemala, January 15, 2024. REUTERS/Jose Cabezas\nBy Sofia Menchu GUATEMALA CITY (Reuters) -Guatemala's new liberal president, Bernardo Arevalo, took office early on Monday after an extended delay that underlined the uphill struggle he faces to meet high expectations and enact a sweeping anti-graft agenda in opposition-controlled Congress. Arevalo, an academic and former diplomat, powered to victory in August, vowing to lift up millions of poor Indigenous Guatemalans, crack down on corruption and protect a democracy that has been under attack. But in a sign of the battles to come, Arevalo's foes in Congress delayed his scheduled inauguration on Sunday by nine hours, signaling that efforts underway since before his landslide election victory to undermine his authority are unlikely to stop soon. Chile's leftist President Gabriel Boric, who had planned to attend the formal swearing in ceremony, left the Guatemalan capital late on Sunday before the delay ended. Now Arevalo's upstart Semilla party, which has only 23 lawmakers in the 160-seat legislature, must broker deals with conservative lawmakers who spent months working with right-wing prosecutors to try to thwart him taking office. \"Given the institutionalized opposition to the new president, and the government's limited financial resources, he has his work cut out,\" said Donald J. Planty, a former U.S. ambassador to Guatemala. Arevalo has signaled he plans to follow moderate, centrist policies, Planty noted, but it remains to be seen whether he will be accepted by conservatives suspicious of the political left due to Guatemala's history of leftist insurgent groups. Arevalo's unexpected election victory over two rounds of voting last year was seen as a watershed moment for Guatemala, where the 65-year-old has cast himself as a leader of a people-powered movement bent on reshaping a political landscape long dominated by conservative elites. In a speech early on Monday, Arevalo pledged he would not leave behind Guatemala's Indigenous peoples, saying there would be \"no more discrimination, no more racism.\" More than 40% of Guatemalans are Indigenous, mainly Maya. Guatemala's Indigenous have historically suffered from discrimination and poverty, with 80% of their children facing inadequate access to nutritious food, according to U.N. studies. U.S. AID ANNOUNCED The challenges confronting Arevalo as he takes the helm of Central America's largest economy are formidable, including rampant corruption, the rising cost of living and gang violence - all key drivers of migration to the United States. U.S. President Joe Biden was among several foreign leaders who congratulated Arevalo. Biden vowed to work with Guatemala to advance human rights, improve security, combat corruption, address the root causes of migration and expand economic opportunities for people in the Americas and the rest of the world, according to a White House statement. The U.S. government will spend $6 million to launch a program for financial inclusion in Guatemala, according to a statement by its international aid office. The funds are part of a more than $200 million assistance that will be deployed for this program. \"You are not alone,\" said Samantha Power, the U.S. aid chief who led the delegation from the United States, at a press conference in Guatemala City on Monday afternoon. Arevalo also faces a battle for control of institutions that have been firmly in the grip of conservative adversaries. Last week he said he wanted to see the resignation of Guatemala's attorney general - an ally of former President Alejandro Giammattei - who had moved to hinder his accession, including by attempting to suspend Semilla and annul the election. Still, Arevalo received a boost on Sunday when Semilla's Samuel Perez was elected president of Congress, a move some saw as a dividend of U.S. pressure after Washington last year slapped visa restrictions on 100 outgoing lawmakers for undermining democracy. \n\"It was incredible how it hit the lawmakers when their visas were revoked,\" said Mario Taracena, a former lawmaker with the center-left UNE party. \"The new (legislators) were very afraid their visas would be taken away.\" Arevalo's father, Juan Jose Arevalo, was Guatemala's first democratically elected president, taking office in 1945. His successor, however, was toppled in a U.S.-backed military coup."
}