{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "Run-DMC star Jam Master Jay slain by childhood friend, godson, jury hears",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 29, 2024 07:08AM ET",
    "Updated Jan 29, 2024 05:26PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/trial-begins-for-two-men-accused-of-rap-pioneer-jam-master-jays-murder-3285762",
  "paragraph": "By Jonathan Allen NEW YORK (Reuters) -The 2002 killing of Run-DMC's Jam Master Jay, one of the most infamous unresolved slayings in hip-hop, was carried out by the rap pioneer's godson and a childhood friend, federal prosecutors told a jury on Monday as the murder trial for the two accused men began in New York City. Ronald Washington, 59, and Karl Jordan Jr., 40, have pleaded not guilty to federal charges of murder while engaged in drug trafficking in the shooting of Jam Master Jay, the stage name of Run-DMC founding member Jason Mizell, in his New York recording studio. Mizell helped shape hip-hop with his Run-DMC bandmates in the 1980s, bringing the genre into the mainstream with hits including \"It's Tricky\" and the cover of Aerosmith's \"Walk This Way\" off the best-selling 1986 album \"Raising Hell.\" Some of their songs advocate against illegal narcotics, and the group even recorded a \"Just Say No!\" anti-drug public service announcement in the late 1980s for the U.S. Drug Enforcement Administration. But as Mizell's music-industry success waned in the 1990s, he turned to dealing cocaine to help fund his music career, a prosecutor said in opening statements at the U.S. District Court in Brooklyn. He was 37 when he was shot dead on Oct. 30, 2002, shortly after acquiring 10 pounds of cocaine from a Midwest distributor to be sold in Baltimore, according to the federal indictment.  Prosecutors said his godson, Jordan, and Washington, a friend who was staying with Mizell's sister, thought they would be part of the lucrative Baltimore deal, worth nearly $200,000, and became enraged when Mizell told them they were cut out. \"They were left with nothing,\" Miranda Gonzalez, a prosecutor for the U.S. Attorney for New York's Eastern District, told the jury. So the men plotted to kill Mizell, she said.  \"It was an ambush. An execution. And you will learn that it was motivated by greed and by revenge,\" she said. Lawyers defending Washington and Jordan both bluntly told the jury that the defendants did not kill Mizell.  John Diaz, a lawyer for Jordan, said prosecution witnesses will testify about events that happened more than two decades ago, including some who cooperated with federal investigators in exchange for leniency in their own criminal cases. Attorney Ezra Spilke said his client, Washington, was struggling with alcoholism at the time and relied on Mizell to keep a roof over his head. \"Why bite the hand that feeds you?\" Spilke said. \"Why kill the person you depend on?\" He said there was no forensic evidence tying Washington to the murder, only \"aging memories.\" If convicted, Washington and Jordan face a maximum sentence of life in prison and a mandatory minimum of at least 20 years.  In May, a third defendant, Jay Bryant, was also indicted in the murder and is due to face a separate trial in 2026. In the prosecutors' account of the murder, Mizell was in his recording studio in Hollis, the Queens neighborhood in eastern New York City where he and the two defendants grew up.  The studio was a neighborhood hangout, prosecutors said. Mizell's manager, Lydia High, was there, along with Mizell's friend Tony Rincon, while three other people were working on music in the enclosed recording suite. Byrant, a friend of Jordan whom Mizell did not know, entered the front door and let Washington and Jordan in through a locked back fire exit, both armed with handguns, prosecutors said. Mizell stood up from a couch to greet his godson. Jordan shot him in the head from a few inches away, killing him instantly, Gonzalez told the jury. All three defendants fled moments later. Both Rincon and High will testify, Gonzalez said, and explain why they took so long to tell investigators the identities of the killers. \nDiaz, the lawyer for Washington, said investigators had built a flimsy case and landed on the wrong men.  \"They have no clue who did it,\" he said."
}