{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0M0NV_L.jpg",
  "title": "US envoy McGurk in Cairo to focus on humanitarian pause, hostage deal",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 23, 2024 01:18PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-envoy-mcgurk-in-cairo-to-focus-on-humanitarian-pause-hostage-deal-3280937",
  "paragraph": "By Jeff Mason WASHINGTON (Reuters) - U.S. Middle East envoy Brett McGurk is in Cairo and will travel in the region for \"active\" discussions on ensuring the release of hostages held by Hamas in Gaza and securing a humanitarian pause, the White House said on Tuesday. White House spokesperson John Kirby (NYSE:KEX) said the U.S. would support a longer humanitarian pause in combat in Gaza to ensure hostages could be released and aid brought in. He declined to specify a timeframe and cautioned he would not characterize the discussions as negotiations. \"The conversations are very sober and serious about trying to get another hostage deal in place,\" Kirby told a regular White House briefing, adding the talks included discussion on how long of a pause would be needed to get the hostages out. Israel suffered its worst day of losses in Gaza, with 24 soldiers killed, the Israeli military said on Tuesday, as its forces encircled southern Gaza's main city, trapping Palestinian residents trying to flee. Qatar, asked about media reports that a ceasefire deal was being discussed, said mediation efforts were ongoing. Israeli government spokesperson Eylon Levy said the war's goals were unchanged. Kirby said McGurk was also discussing other issues during his trip, including getting an assessment of Israel's military operations and its efforts to protect civilians, as well as continuing to explore the idea of normalizing Israel-Saudi ties. Asked how Tuesday's death toll of 24 Israeli solders in Gaza affected Israel's perception of the war, Kirby said only the Israelis could answer that question. \"It was a terrible, terrible day for the IDF yesterday. That's an enormous amount of troops lost in one day and certainly our condolences go out to all the families and their teammates as well,\" he said. \nKirby reiterated Washington's insistence that future post-conflict Gaza leadership could not include Hamas leaders, and said Washington did not want the territory of Gaza reduced. \"Whatever governance looks like in Gaza, after this is over, it's got to be representative of the aspirations of the Palestinian people who are not represented by Hamas,\" he said."
}