{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0B0OZ_L.jpg",
  "title": "Israeli soldiers on northern border dig in and wait as tensions mount",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 12, 2024 12:08PM ET",
    "Updated Jan 12, 2024 12:16PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/israeli-soldiers-on-northern-border-dig-in-and-wait-as-tensions-mount-3273755",
  "paragraph": "5/5\n© Reuters. An Israeli soldier looks out from a military outpost in Kibbutz Hanita, close to Israel's Lebanese border in northern Israel, January 11, 2024. REUTERS/Alexandre Meneghini\n2/5\nBy James Mackenzie HANITA, Israel (Reuters) - For Israeli troops on the northern border with Lebanon, the government's strategy of avoiding full-scale war with the Hezbollah troops just a few hundred metres away is embodied in the pages of a 68-year-old training manual. \"The Rifle Department\", first issued in 1956 and hastily reprinted in the wake of the mass mobilization that followed the attack on southern Israel by Hamas gunmen on Oct. 7, teaches soldiers old techniques of static defence, said Lt. Col. Dotan Razili, a home front brigade commander in the north. \"The IDF usually is an attacking force. We take the initiative,\" he told reporters in Hanita, one of a string of kibbutzim along the northern border that were evacuated in the days following the Oct. 7 attack and now stand empty. \"We had to teach units how to start defending,\" he said, a battered looking copy of the manual in his hand. The book, one of the Israeli army's first ever training manuals, teaches soldiers and junior officers more used to modern high tech warfare, classic infantry techniques like how to dig foxholes that can be occupied for weeks at a time. \"We got better at it, because we trained and we moved our forces and we built posts and we're more ready,\" Razili said. While Israeli troops have been engaged in heavy battles in the southern Gaza Strip, the forces in the north have been engaged in a lower intensity crossborder standoff with Hezbollah fighters during which each side has fired on the other without ever moving to full scale war. The two sides last fought a major war in 2006 but Israeli Prime Minister Benjamin Netanyahu and Defence Minister Yoav Gallant have repeatedly said they do not wish to go to war with Hezbollah, while warning that Israel would be ready to go on the attack if it felt it necessary. There have been similar statements from Hezbollah leaders. How long the uneasy standoff can last is unclear. Exchanges of anti-tank missiles, mortars, air strikes and machine gun fire have already reached levels that in other times might have triggered a much heavier response from both sides. Around 140 fighters from the Iranian-backed Hezbollah militia as well as at least 25 Lebanese civilians have been killed as well as at least nine Israeli soldiers and a civilian, and the intensity has been growing in recent weeks. KORNET ROCKETS Tens of thousands on both sides of the border have been evacuated, with more than 96,000 Israelis now in temporary accommodation and many of the farms along the northern border tended only irregularly by workers who come in during the day. Roads up to the border are largely deserted, with troops at checkpoints checking vehicles travelling north and roads marked by the tracks of heavy armoured vehicles. Hanita, a kibbutz founded in 1938 under the British mandate, with a population of some 700, is a pretty community of houses in a wooded area within a few hundreds metres of the border. The roof of one of the houses was destroyed by a mortar and apart from soldiers and the household cats left behind by their owners, it now stands largely empty.  Near to the border itself, occasional bursts of machine gun fire or mortars are heard regularly and occasional signs of damage to houses from Hezbollah rockets or mortars can be seen. \"We've had a lot of action with Hezbollah. They're firing at us almost every day around this area,\" said a senior officer, who briefed reporters on condition of anonymity. Another officer said Hezbollah fighters had fired at least 800 Kornet, wire-guided anti tank missiles at Israeli positions since the start of the war as well as drone strikes such as the one which hit a military command post on Tuesday. For its part, Israeli forces regularly hit Hezbollah positions with air strikes and artillery and this week a senior commander of the elite Radwan forces was killed, although Israel has not claimed responsibility. \nFor the moment, however, the Israeli soldiers standing guard in the north say their orders are to fire only when they perceive a direct threat. \"I'm holding myself because I understand the situation and we are here until the government will say otherwise,\" the officer said. \"Yes, it is difficult but we are managing.\""
}