{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0706F_L.jpg",
  "title": "Four killed in combined Russian air strike on Ukraine",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 08, 2024 01:43AM ET",
    "Updated Jan 08, 2024 07:23AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/russia-launches-missile-attacks-across-the-country-say-ukrainian-officials-3268775",
  "paragraph": "5/5\n© Reuters. Rescuers work at the site of a Russian missile strike in an area in the village of Rivne near the Pokrovsk town, amid Russia's attack on Ukraine, in Donetsk region, Ukraine January 7, 2024. REUTERS/Oleksandr Ratushniak\n2/5\nBy Dan Peleschuk and Pavel Polityuk KYIV (Reuters) -Russia sent dozens of missiles across Ukraine early on Monday, killing at least four civilians and hitting residential areas and commercial sites in its latest combined air attack, Ukrainian authorities said.  Two people were killed in the western Khmelnytskyi region, local officials reported, where critical infrastructure had also been struck. In Kryvyi Rih, a 62-year-old was killed and a shopping centre and scores of private homes and apartment buildings damaged after nine Russian missiles hit the south central city, said Oleksandr Vilkul, the mayor. \"The mad enemy once again struck civilians,\" regional governor Serhiy Lysak wrote on the Telegram messaging app. \"Directed missiles at people.\" Ukraine's National Police said a total of 38 people in total had been wounded across the country. Russia said it hit military-industrial targets in Ukraine from sea and air on Monday.  \"This morning, a multiple attack was carried out with high-precision, long-range, sea and air-based weapons, including the Kinzhal hypersonic missile system, on facilities of the military-industrial complex of Ukraine,\" the defence ministry said in a daily dispatch. Ukraine said its air defences had destroyed 18 out of 51 missiles, a much lower shoot-down rate than normal, which Kyiv attributed to the large number of ballistic missiles fired by Russia which are more difficult to intercept.  \"On the one hand, you have lots of missiles not shot down,\" air force spokesman Yuriy Ihnat said on Ukrainian television. \"The explanation is simple: they were flying on a ballistic trajectory, and into the regions where we can't shoot them down.\" All eight drones launched by Russia were also shot down.  The strikes came amid a cold snap sweeping Ukraine, with Vilkul, the Kryvyi Rih mayor, also reporting that 15,000 residents were without power and that local trams and trolleybuses were not running. In the eastern city of Kharkiv, an industrial site and educational facility were damaged after at least four missile strikes, Governor Oleh Synehubov said.  A 63-year-old woman was killed in a strike on a town south of Kharkiv, he added. Five people were also wounded in the southeastern city of Zaporizhzhia, where governor Yuriy Malashko said residential areas had been struck. \n\"Not a single military target,\" he wrote on Telegram. Russia in recent weeks has resumed a campaign of regular air strikes on Ukrainian population centres far behind the lines of its nearly two-year-old full-scale invasion."
}