{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0M0R6_L.jpg",
  "title": "Haiti's gang wars death toll doubles to nearly 5,000 in a year -UN",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 23, 2024 03:11PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/haitis-gang-wars-death-toll-doubles-to-nearly-5000-in-a-year-un-3280972",
  "paragraph": "© Reuters. FILE PHOTO: People huddle in a corner as police patrol the streets after gang members tried to attack a police station, in Port-au-Prince, Haiti April 25, 2023. REUTERS/Ralph Tedy Erol\nPORT-AU-PRINCE (Reuters) - The number of people reported killed as Haiti faces a worsening conflict between heavily armed gangs increased by more than 110% last year to reach 4,789, United Nations Secretary-General Antonio Guterres said in a report published on Tuesday. \"I am appalled by the staggering and worsening level of gang violence,\" Guterres said in the report. \"Gang killings, kidnappings and sexual violence, notably against women and young girls, among other abuses, continue with widespread impunity.\" Guterres added that the spread of violence to rural areas marked \"further cause for serious alarm.\" Haiti's out-gunned police has struggled to recover areas from gang control and stop the spread of powerful alliances to key farmlands. After over 1,600 left the force through 2023, the report said the national force counted just 13,196 personnel. One in 10 police stations nationwide had been attacked through the year, it said, while many of the police's armored vehicles were left inoperable after clashes with gang members - who often donned fake police uniforms to carry out kidnappings. Reported kidnappings, carried out en masse on people traveling not only north but increasingly south from the capital, soared 83% to 2,490 over the year, it said, adding that many were forced to sell homes and take loans to pay ransoms. The U.N.'s migration agency estimates over 206,000 people were forcibly repatriated to Haiti through the year, 96% from the neighboring Dominican Republic, which sent back 23,000 in September alone as it tightened its border. The number of Haitian migrants entering Honduras hoping to travel north rocketed 23-fold from July to October, the report said. Families in Haiti hosting friends and families who lost homes face a huge burden as the Western Hemisphere's poorest country looks to mark a fifth year of recession while food prices soar as gangs exhort illegal taxes and block off transport. \nGuterres called on countries to \"contribute generously\" to a voluntary international force the U.N. ratified to support police late last year. \"It is difficult to overstate the gravity of the political, security, human rights and humanitarian situation in Haiti today,\" he said."
}