{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK110PD_L.jpg",
  "title": "Brazil's military reinforces border with Venezuela and Guyana due to Esequibo",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 02, 2024 03:06PM ET",
    "Updated Feb 03, 2024 10:32AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/brazils-military-reinforces-border-with-venezuela-and-guyana-due-to-esequibo-3291672",
  "paragraph": "3/3\n© Reuters. Brazil's army moves armored vehicles from Manaus to Boa Vista to reinforce the border with Venezuela and Guyana due to tensions over Venezuelan claims to the Esequibo region, in Manaus Brazil, February 2, 2024. REUTERS/Bruno Kelly\n2/3\nBy Bruno Kelly MANAUS (Reuters) -A convoy of military trucks and armored vehicles set off for Brazil's northern border on Friday to reinforce the presence of the Brazilian army in response to tensions over Venezuela's claim to Guyana's Esequibo region. More than two dozen armored cars arrived in Manaus by river transport and some left by road for Boa Vista, capital of Roraima state, where the local garrison will be increased to 600 soldiers, the army said in a statement.  The armored vehicle reinforcements include six Cascavel, a six-wheeled Brazilian armored car with a 37-mm cannon; eight Guarani, a 6×6 personnel carrier; and 14 Guaicuru, a four-wheel drive multitask light armored car, the army said. The heavier armored cars were transported on flatbed trailer trucks. Army Commander General Tomas Paiva said the Boa Vista garrison would become a regiment with the tripling of equipment and men, and part would stay in the city while some would be deployed to Pacaraima on the border with Venezuela. \"The army's role is to guarantee our national sovereignty,\" he told reporters in Manaus, adding: \"We really believe the situation has been resolved peacefully by diplomatic means.\" The border conflict involves a 160,000-sq km (62,000 sq mile) region of Guyana that is more than twice the size of Ireland and mostly thick jungle. Venezuela has reactivated an old claim to Esequibo in recent years after large oil and gas deposits were discovered offshore. Venezuela and Guyana agreed in December not to use force or escalate tension in the dispute at a meeting in St Vincent and the Grenadines. Last week, at a meeting mediated by Brazil, Venezuela vowed to stick to diplomacy to resolve the conflict. But Caracas' revival of its claim nevertheless prompted Brazil to say it would not let Venezuela use Brazilian territory in Roraima to invade Esequibo, there being no other land route through the jungle. A report by the Brazilian military Joint Chiefs of Staff found that Venezuela does not have the military capability to invade Esequibo because it has \"little logistical capacity\" to support missions over the border. \nThe seven-page document seen by Reuters said Brazil has a contingency plan to prevent any Venezuelan military incursion against Guyana passing through Brazilian territory. It concluded, however, that a clash between Brazil's two neighbors was unlikely as a peaceful solution was emerging."
}