{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0G0X8_L.jpg",
  "title": "Minority children in US get poorer healthcare, analysis finds",
  "category": "General",
  "publisher": "Reuters",
  "date": [
    "Published Jan 17, 2024 06:38PM ET",
    "Updated Jan 18, 2024 11:44AM ET"
  ],
  "comments": [
    2,
    [
      [
        "Teena Marie",
        "2024-01-18 18:59:12",
        "These studies exclude location and economics.",
        "https://www.investing.com/members/242916302"
      ],
      [
        "Mark Jannetty",
        "2024-01-18 17:35:37",
        "what a pile of 💩",
        "https://www.investing.com/members/241633026"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/general/minority-children-in-us-get-poorer-healthcare-analysis-finds-3276760",
  "paragraph": "© Reuters. A child receives a dose of the Pfizer-BioNTech coronavirus disease (COVID-19) vaccine at Smoketown Family Wellness Center in Louisville, Kentucky, U.S., November 8, 2021. REUTERS/Jon Cherry/File Photo\nBy Nancy Lapid (Reuters) - The quality of healthcare for minority children in the United States is universally worse than it is for white children, even after accounting for insurance coverage, an analysis of dozens of recent studies found. The pattern was similar across all medical specialties, including newborn care, emergency medicine, primary care, surgery, hospital care, endocrinology, mental health care, care for developmental disabilities, and palliative care, researchers said. Even after adjusting for type of health insurance, family socioeconomic position, and other health conditions, the disparities were clear. “Across multiple healthcare specialties, non-white children receive poorer care relative to white children,\" study coauthor Dr. Monique Jindal of the University of Illinois Chicago School of Medicine said in an email. \"These differences by race and ethnicity will persist without comprehensive changes in research, clinical practice and policy,” she said. The findings, which come from an analysis of more than 70 studies published between 2017 and 2022, were reported on Wednesday in The Lancet Child and Adolescent Health journal. The strongest evidence of disparities was in pain management, with minority children less likely to receive painkillers in emergency departments for a broken limb, appendicitis, or migraine, the researchers said.  Among children with diabetes, those from minority groups were less likely to be treated with an insulin pump and to have continuous glucose monitoring, even after controlling for insurance status, the researchers found. Minority children also received fewer x-rays for asthma, were more likely to have preventable and high-severity adverse events while hospitalized, and were less likely to have their developmental disabilities diagnosed before preschool or kindergarten. \nStructural racism underlies the differences, Jindal said.  “The impacts of housing, employment, health insurance, the criminal justice system, and immigration are impossible to disentangle and are cumulatively responsible” for the poorer care for minority children, she said."
}