{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK010DX_L.jpg",
  "title": "Suspect arrested after breaking into Colorado Supreme Court building",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 02, 2024 10:37AM ET",
    "Updated Jan 02, 2024 08:57PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/suspect-arrested-after-breaking-into-colorado-supreme-court-building-3265650",
  "paragraph": "© Reuters. FILE PHOTO: A general view of the Colorado Supreme Court in Denver, Colorado, U.S., December 20, 2023, the day after the court ruled that former President Donald Trump is disqualified from serving as U.S. president and cannot appear on the primary ballot \nBy Brendan O'Brien (Reuters) -A man was arrested on Tuesday after he broke into the Colorado Supreme Court building in Denver with a handgun and lit a fire in a stairwell, police said. Police arrested Brandon Olsen, 44, on charges of arson, robbery and burglary, saying he fled the scene of a car crash shortly after 1 a.m., broke into the Ralph L. Carr Colorado Judicial Center in downtown Denver and shot out a window. Police said Olsen took keys from an unarmed security guard whom he held at gunpoint and made his way up the building's seventh floor, where he fired shots and lit a fire in a stairwell that was soon extinguished by the sprinkler system.  Olsen surrendered to police without incident at about 3 a.m., the Denver Police Department said in a statement. Although the suspect was taken to hospital and cleared by medical personnel, nobody was injured, the Colorado State Patrol said in a statement. It was unclear whether Olsen was represented by a lawyer who could make a statement in his defense. The motive for the break-in was unclear, but the Colorado State Patrol all but ruled out any connection to the Colorado Supreme Court's recent decision over Donald Trump's presidential candidacy. The Colorado Supreme Court disqualified the former president from the state's Republican primary ballot for his role in the Jan. 6, 2021, attack on the U.S. Capitol by his supporters.  The court ruled that Trump was barred by a U.S. constitutional provision that prohibits anyone who \"engaged in insurrection or rebellion\" from holding public office. \nJustices then became the target of harassment and possible threats. A preliminary investigation showed a \"high probability\" the break-in was unrelated to recent threats against the justices, the state patrol said in the statement."
}