{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0205Q_L.jpg",
  "title": "Russia says Ukraine mounts new missile and drone attacks on southern region",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 03, 2024 02:48AM ET",
    "Updated Jan 03, 2024 11:32AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/russia-says-ukraine-attacks-belgorod-region-again-with-missiles-and-drones-3265917",
  "paragraph": "2/2\n© Reuters. A view shows a damaged house following what local authorities say was a Ukrainian military strike in the Belgorod region, Russia, in this picture released January 2, 2024. Telegram channel of Governor of Belgorod Region Vyacheslav Gladkov/Handout via REUT\n2/2\n(Reuters) -Ukraine launched repeated missile and drone attacks on Wednesday on Russia's southern region of Belgorod, Russia's defence ministry and local authorities said.  Regional governor Vyacheslav Gladkov said the situation \"continues to remain tense\" in Belgorod, where Russia says 25 civilians including five children were killed in Ukrainian attacks on Saturday. There was no word of any casualties from the latest attacks.  Later, Gladkov said authorities were evacuating residents near potentially unexploded munitions, with sappers called in to evaluate the danger.  Defence ministry explosive technicians were working on disposing of an unexploded projectile and around 600 residents from 323 houses within a 500-metre radius had been evacuated, Gladkov said. Several other villages came under fire on Wednesday and a power line was knocked out, he said. Ukraine's escalation of attacks on Belgorod over the New Year period has come as Russia launched some of its most intense strikes on Ukraine since the war began almost two years ago. Kyiv said on Tuesday that Russia had launched well over 300 attack drones and missiles of various kinds at cities across Ukraine since Friday.  Belgorod, like other Russian regions on the border with Ukraine, has seen frequent low-level attacks since the start of the war, but Saturday's was by far the deadliest. President Vladimir Putin said it would \"not go unpunished\". One person was killed and seven more wounded in the region on Tuesday, Russian authorities said. In Wednesday's attacks, Russia's defence ministry said Ukraine fired six Tochka-U ballistic missiles and six guided missiles launched from a Vilkha heavy multiple rocket launcher.  \nGladkov said Ukraine also launched several drones on the region and the city of Belgorod, which is the administrative centre of the region. Reuters could not independently verify the reports. There was no immediate comment from Ukraine."
}