{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBT08N_L.jpg",
  "title": "Twin Russian missile strikes on Kharkiv injure 21, officials say",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 30, 2023 05:30PM ET",
    "Updated Dec 30, 2023 05:40PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/twin-russian-missile-strikes-on-kharkiv-injure-21-officials-say-3264915",
  "paragraph": "6/6\n© Reuters. A local resident carrying his dog stands at the site of a Russian missile strike, amid Russia's attack on Ukraine, in central Kharkiv, Ukraine December 30, 2023. REUTERS/Sofiia Gatilova\n2/6\nKHARKIV, Ukraine (Reuters) -Twin Russian missile strikes on central Kharkiv on Saturday injured at least 21 people, Ukrainian officials said. The Kharkiv regional chief prosecutor said two boys aged 14 and 16 and a security advisor for a team of German journalists were among those injured. The missiles came from the direction of Belgorod, Russia, he added. Russian officials said a Ukrainian attack on the provincial capital of Belgorod hours earlier killed 18 people and injured 111. That came a day after Russia's biggest air assault of the war, in which Ukrainian officials said at least 40 civilians were killed and 159 wounded in 158 missile and drone attacks across the country.  The head of the regional police in Kharkiv, Volodymyr Tymoshenko, said preliminary evidence suggested Russia had used S-300 missiles as surface-to-surface weapons to hit Kharkiv.  One missile hit the Kharkiv Palace Hotel, and the second hit a residential building in central Kharkiv. Another three hit an industrial area but caused no damage, Tymoshenko said.  \nOleh Synehubov, governor of Kharkiv region, said 10 of the victims were in hospital, and one woman was in a serious condition.  \"We are fixing damage to a medical institution, multi-apartment residential buildings, shops, public places and transportation,\" Synehubov said."
}