{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "US retaliates in Iraq after three US troops wounded in attack",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 25, 2023 09:29PM ET",
    "Updated Dec 25, 2023 10:50PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/three-us-troops-wounded-in-attack-in-iraq-us-retaliates-3263282",
  "paragraph": "By Phil Stewart (Reuters) -The U.S. military carried out retaliatory air strikes on Monday in Iraq after a one-way drone attack earlier in the day by Iran-aligned militants that left one U.S. service member in critical condition and wounded two other U.S. personnel, officials said. The back-and-forth clash was the latest demonstration of how the Israel-Hamas war is rippling across the Middle East, creating turmoil that has turned U.S. troops at bases in Iraq and Syria into targets.  Iran-aligned groups in Iraq and Syria oppose Israel's campaign in Gaza and hold the United States partly responsible. At President Joe Biden's direction, the U.S. military carried out the strikes in Iraq at 1:45 GMT, likely killing \"a number of Kataib Hezbollah militants\" and destroying multiple facilities used by the group, the U.S. military said. \"These strikes are intended to hold accountable those elements directly responsible for attacks on coalition forces in Iraq and Syria and degrade their ability to continue attacks. We will always protect our forces,\" said General Michael Erik Kurilla, head of U.S. Central Command, in a statement. A U.S. base in Iraq's Erbil that houses U.S. forces came under attack from a one-way drone earlier on Monday, leading to the latest U.S. casualties.  The base has been repeatedly targeted. Reuters reported on another significant drone attack in October on the barracks at the Erbil base on Oct. 26, which penetrated U.S. air defenses but failed to detonate.  The Pentagon did not disclose details about the identity of the service member who was critically wounded or offer more details on the injuries sustained in the attack. It also did not offer details on how this drone appeared to penetrate the base's air defenses. \"My prayers are with the brave Americans who were injured,\" U.S. Defense Secretary Lloyd Austin said in a statement.  The White House National Security Council said Biden was briefed on the attack on Monday and ordered the Pentagon to prepare response options against those responsible.  \"The President places no higher priority than the protection of American personnel serving in harm’s way. The United States will act at a time and in a manner of our choosing should these attacks continue,\" NSC spokesperson Adrienne Watson said. Still, it is unclear if the latest U.S. retaliation will deter future action against U.S. forces, who are deployed in Iraq and Syria to prevent a resurgence of Islamic State militants.  The U.S. military has already come under attack at least 100 times in Iraq and Syria since the Israel-Hamas war began in October, usually with a mix of rockets and one-way attack drones.  The U.S. embassy compound in Baghdad also came under mortar fire earlier in December, the first time it had been attacked in more than a year, in a major escalation.  The latest unrest came less than a week after Austin returned from a trip to the Middle East focused on containing efforts by Iran-aligned groups to broaden of the Israel-Hamas war. That includes setting up a U.S.-led maritime coalition to safeguard Red Sea commerce following a series of drone and missile attacks against commercial vessels by Houthi militants in Yemen. The Pentagon said on Thursday that more than 20 countries have agreed to participate in the new U.S.-led coalition, known as Operation Prosperity Guardian."
}