{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0H0JZ_L.jpg",
  "title": "Brazil police target congressman in raids part of 2023 riots probe",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 18, 2024 08:28AM ET",
  "comments": [
    1,
    [
      [
        "Tre Hsi",
        "2024-01-18 16:06:43",
        "Jordy said on social media that he was targeted by \"an authoritarian measure, without any basis or evidence, aimed only at persecuting, intimidating and creating narratives ahead of local elections.\"  - this guy even sounds exactly like an american MAGA nutjob",
        "https://www.investing.com/members/203741693"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/brazil-police-target-congressman-in-raids-part-of-2023-riots-probe-3277418",
  "paragraph": "© Reuters. Brazil's flag is reflected on a broken window, after the supporters of Brazil's former President Jair Bolsonaro participated in an anti-democratic riot at Planalto Palace, in Brasilia, Brazil, January 9, 2023. REUTERS/Ueslei Marcelino/ File Photo\nRIO DE JANEIRO/BRASILIA (Reuters) - Brazil's federal police on Thursday served search-and-seizure warrants against a congressman as they continue to investigate the Jan. 8, 2023 riots in Brasilia, in which supporters of former President Jair Bolsonaro stormed government buildings. The raid targeted Congressman Carlos Jordy, a fierce ally of far-right Bolsonaro who is currently the leader of the opposition in the lower house, representing Rio de Janeiro state as a member of Bolsonaro's Liberal Party (PL). In January 2023, Bolsonaro supporters invaded and ransacked Congress, the presidential palace and the Supreme Court a week after leftist President Luiz Inacio Lula da Silva took office, protesting his election victory and calling for a military coup. Jordy said on social media that he was targeted by \"an authoritarian measure, without any basis or evidence, aimed only at persecuting, intimidating and creating narratives ahead of local elections.\" The congressman is expected to run in October for mayor of Niteroi, a city next to Rio de Janeiro. Federal police confirmed in a separate statement they were serving 10 search-and-seizure warrants ordered by the Supreme Court in two states on Thursday, but did not name Jordy as a specific target. A source familiar with the matter told Reuters that the warrants included searches of Jordy's congressional office. \nThe raids were part of an operation launched last year to identify people who participated in, funded or fostered the riots. People are being investigated for crimes of \"violent abolition of the rule of law, coup d'état, criminal association and incitement,\" according to the police."
}