{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0P0CN_L.jpg",
  "title": "Taiwan reports Chinese 'combat patrols' ahead of China-US talks",
  "category": "Economy",
  "publisher": "Reuters",
  "date": "Published Jan 26, 2024 06:24AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/economy/taiwan-reports-chinese-combat-patrols-ahead-of-chinaus-talks-3283911",
  "paragraph": "© Reuters. Airplane is seen in front of Chinese and Taiwanese flags in this illustration, August 6, 2022. REUTERS/Dado Ruvic/Illustration/File Photo\nTAIPEI (Reuters) - Taiwan's defence ministry said it detected 23 Chinese air force planes operating around Taiwan and carrying out \"joint combat readiness patrols\" with Chinese warships on Friday, ahead of high-level China-U.S. talks in Thailand. China, which views Taiwan as its own territory, has over the past four years regularly sent warplanes and warships into the skies and waters around the island as it seeks to assert sovereignty claims that the Taipei government rejects. Taiwan's defence ministry said that starting around 4 p.m. (0800 GMT) on Friday it had detected 23 Chinese aircraft including Su-30 fighters and drones operating off northern and central Taiwan and to the island's southwest. Thirteen of those aircraft crossed the Taiwan Strait's median line, or areas close by, working with Chinese warships to carry out \"joint combat readiness patrols\", the ministry added. The strait's median line once served as an unofficial barrier between the two sides, but Chinese planes now regularly fly over it. China says it does not recognise the line's existence. Taiwan sent its own forces to monitor, its defence ministry said. There was no immediate response from China's defence ministry. The activity comes as U.S. National Security Advisor Jake Sullivan and Chinese Foreign Minister Wang Yi prepare to meet in Bangkok, building on a pledge by the leaders of the world's two largest economies to deepen dialogue. The officials will meet on Friday and Saturday, a little more than two months after U.S. President Joe Biden and Chinese President Xi Jinping met for about four hours on the sidelines of the Asia-Pacific Economic Cooperation (APEC) summit in San Francisco. Biden and Xi agreed to open a presidential hotline, resume military-to-military communications, and work to curb fentanyl production, but remained at odds over Taiwan, which enjoys strong U.S. backing despite the absence of formal diplomatic ties. China's foreign ministry said earlier on Friday that Taiwan would be a subject for discussion. \nTaiwan elected a new president earlier this month, Lai Ching-te from the ruling Democratic Progressive Party. China views Lai, who takes office on May 20, as a dangerous separatist and has rebuffed his offers of talks. Taiwan's government says only Taiwan's people can decide their future."
}