{
  "image": "https://i-invdn-com.investing.com/news/World_News_9_800x533_L_1420026261.jpg",
  "title": "US Navy sailor given 27 months in jail for sharing military data with China",
  "category": "General",
  "publisher": "Reuters",
  "date": [
    "Published Jan 08, 2024 05:03PM ET",
    "Updated Jan 09, 2024 03:41AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/general/us-navy-sailor-given-27-months-in-jail-for-sharing-military-data-with-china-3269856",
  "paragraph": "(Reuters) -A U.S. Navy sailor was sentenced to 27 months in jail on Monday for accepting nearly $15,000 in bribes from a Chinese intelligence officer in exchange for photos of unclassified private U.S. military information. Petty Officer Wenheng \"Thomas\" Zhao, 26, pleaded guilty last October to conspiracy and receiving a bribe. Zhao, who had faced a maximum of 20 years in prison, was also fined $5,500, the U.S. justice department said in a statement. Zhao, who worked at Naval Base Ventura County in California, admitted sending his Chinese handler plans for U.S. military exercises in the Indo-Pacific region, operational orders, and electrical diagrams and blueprints for a radar system on a U.S. military base in Okinawa, Japan. \"Zhao chose to betray the oath he took to our country and put others at risk,\" said Larissa Knapp, executive assistant director of the Federal Bureau of Investigation's National Security Branch.  \"Today's sentencing demonstrates, yet again, the inability of China's intelligence services to prevent the FBI and our vital partners from apprehending and prosecuting the spies China recruits,\" she said in a statement. The United States has accused China of an extensive campaign of espionage and cyberattacks, a charge that Beijing rejects. On Tuesday, the Chinese foreign ministry said it was unaware of the details. \"I'm not aware of the specifics, but I would note that high-level U.S. intelligence officials said they made progress in rebuilding their spy network in China,\" said Mao Ning, a foreign ministry spokesperson, at a regular news conference. \"America on the one hand repeatedly disseminates false information about so-called Chinese spies, and yet on the other hand openly declares it wants to launch large-scale espionage activities against China. This is a double standard.\" In recent years, bilateral relations have grown tense over a range of issues including national security, trade curbs, COVID-19 and Taiwan. But a summit in San Francisco in November between Chinese President Xi Jinping and U.S. President Joe Biden was widely seen to have helped cool tensions. \n\"China-U.S. relations saw extreme difficulty at the beginning of 2023,\" Chinese Foreign Minister Wang Yi said on Tuesday at a symposium in Beijing.  \"After arduous efforts, both sides restructured communication and dialogue, and bilateral relations were able to stop worsening and to stabilise.\""
}