{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "US personnel suffer minor injuries in Iraq base attack: U.S. official",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 20, 2024 12:17PM ET",
    "Updated Jan 20, 2024 06:16PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Uttam Maheshwari",
        "2024-01-20 18:06:45",
        "crudeoil down every news",
        "https://www.investing.com/members/251296092"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/us-personnel-suffer-minor-injuries-in-iraq-base-attack-us-official-3278882",
  "paragraph": "By Phil Stewart and Timour Azhari WASHINGTON/BAGHDAD (Reuters) -U.S. personnel suffered minor injuries and a member of Iraq's security forces was wounded in an attack on Iraq's Ain al-Asad air base on Saturday, a U.S. official said on Saturday, speaking on condition of anonymity. The U.S. military's Central Command said in a statement that the base was hit by multiple ballistic missiles and rockets fired by Iranian-backed militants from inside Iraq. The statement did not confirm the extent of any U.S. injuries but said personnel were being evaluated for traumatic brain injury. The U.S. military's assessment was more severe than initial accounts from security sources in Iraq, who, along with an Iraqi government source, had only reported rocket fire against the base. Offering a sense of the scale of the attack, Central Command said most of the missiles were intercepted though others hit the base.  \"Damage assessments are ongoing,\" Central Command said, adding the attack took place at 1830 in Iraq (1530 GMT). \"At least one Iraqi service member was wounded.\" Since the Israel-Hamas war began in October, the U.S. military has come under attack at least 58 times in Iraq and another 83 times in Syria by Iran-backed militants, usually with a mix of rockets and one-way attack drones. The militants are seeking to impose a cost on the United States for its support of Israel against Iran-backed Palestinian militant group Hamas. The U.S. has 900 troops in Syria and 2,500 in Iraq on a mission to advise and assist local forces trying to prevent a resurgence of Islamic State, which in 2014 seized large parts of both countries before being defeated. Iraq is deeply concerned about becoming a battleground between the United States, Israel and Iran. Iraq's Prime Minister Mohammed Shia al-Sudani's office announced moves to evict U.S. forces following a U.S. drone strike in Baghdad that was condemned by the government. The Pentagon said the strike killed a militia leader responsible for recent attacks on U.S. personnel. The Pentagon said it has not been formally notified of any plans to end the U.S. troop presence in the country, and says its troops are deployed to Iraq at the invitation of the government in Baghdad. Iran on Monday struck Erbil, the capital of Iraq's semi-autonomous Kurdistan region, with ballistic missiles in what it said was an attack on an Israeli spy headquarters -- claims denied by Iraqi and Iraqi Kurdish officials."
}