{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0F0BH_L.jpg",
  "title": "Icelandic volcano eruption eases, but risk remains",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 16, 2024 04:47AM ET",
    "Updated Jan 16, 2024 02:16PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/icelandic-volcano-calms-down-but-risk-remains-3274674",
  "paragraph": "© Reuters. FILE PHOTO: Smoke rises as lava flows from a volcano in Grindavik, Iceland, on January 14, 2024. Icelandic Coast Guard/Handout via REUTERS \nREYKJAVIK (Reuters) -A volcanic eruption in Iceland that had threatened to engulf a seaside town appeared to subside on Tuesday, although authorities and geologists warned that danger still persisted. A flow of red-hot lava on Sunday reached the outskirts of Grindavik, a fishing town of some 4,000 residents, setting three houses ablaze but causing no harm to people who had been evacuated for a second time since November. Live footage on Tuesday morning no longer showed signs of molten rock erupting from the ground, even as experts warned that new fissures could emerge at short notice. The Icelandic Meteorological Office said new cracks could still open without warning, adding that magma continued to flow underground and it was too early to declare the eruption over. \"This is a very hazardous area and it has a potential to be repeating events in the future as well,\" Rikke Pedersen, who heads the Nordic Volcanological Centre research group based in Reykjavik, told Reuters. \"What is certain is that we will have more periods of activity on the peninsula and the whole area is sort of in a stage of great uncertainty,\" she added. Grindavik resident Hrannar Jon Emilsson watched his almost-finished house burn down on live TV after the volcano erupted on Sunday. \"You sit and watch the news showing everything go up in smoke,\" Emilsson told Icelandic independent broadcaster Channel 2. \n\"Last week I asked the electricians to start their work so that they could finalise their part of the work with the view of arranging for moving in before springtime. Things change fast.\" It was the second eruption on the peninsula of Reykjanes in four weeks, and the fifth since 2021."
}