{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK020OJ_L.jpg",
  "title": "US Military Academy at West Point can continue to consider race in admissions, judge rules",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 03, 2024 05:35PM ET",
    "Updated Jan 03, 2024 09:26PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-military-academy-at-west-point-can-continue-to-consider-race-in-admissions-judge-rules-3266706",
  "paragraph": "2/2\n© Reuters. FILE PHOTO: U.S. Vice President Kamala Harris speaks during the 2023 graduation ceremony at the United States Military Academy (USMA), at Michie Stadium in West Point, New York, U.S., May 27, 2023. REUTERS/Eduardo Munoz/File Photo\n2/2\nBy Nate Raymond (Reuters) -The U.S. Military Academy at West Point can continue to consider race for now when evaluating who to admit to the elite military school, a federal judge ruled on Wednesday, rejecting a bid by the group behind the successful U.S. Supreme Court challenge to race-conscious college admissions policies. U.S. District Judge Philip Halpern in White Plains, New York, rejected a request for a preliminary injunction sought by Students for Fair Admissions, which was founded by affirmative action opponent Edward Blum. The judge, an appointee of Republican former President Donald Trump, wrote that he could not at this early stage in the case rule in SFFA's favor without a full factual record to establish whether the use of race in West Point's admissions furthers compelling governmental interests. Halpern said an injunction at this stage would also disrupt the current admissions cycle that is set to end Jan. 31, requiring \"a new policy be applied to the current applicant pool midstream\" and the withdrawal of offers to some applicants. Blum in a statement said his group was \"reviewing the opinion and will be taking the next steps to stop the unfair and unconstitutional racial preferences at West Point.\" SFFA later on Wednesday filed an emergency notice of appeal. A spokesperson with the U.S. Department of Justice, which was defending West Point's admissions policy, declined to comment. The ruling came after a federal judge in Maryland on Dec. 14 rejected a similar request by Blum's group to prevent the U.S. Naval Academy at Annapolis from considering race. Blum's group had sued both military academies this year with the goal of ending what was essentially an exemption for them tucked into the Supreme Court's ruling on college admissions in June that allowed them to continue to consider race in admissions. In the ruling by its conservative majority, the U.S. Supreme Court rejected policies long used by American colleges and universities to increase the number of Black, Hispanic and other minority students on U.S. campuses. In invalidating admissions policies at Harvard University and the University of North Carolina, the Supreme Court did not address race in admissions at military academies, which Chief Justice John Roberts in a footnote said had \"potentially distinct interests.\" Blum's group in a lawsuit filed in September alleged the West Point, New York-based academy's admissions practices discriminated against white applicants and violated the principle of equal protection in the U.S. Constitution's Fifth Amendment. President Joe Biden's administration in defending the military academies' policies argued that senior military leaders have long recognized that a scarcity of minority officers can create distrust within the armed forces. The Justice Department in court filings said the prestigious West Point was a \"vital pipeline to the officer corps\" and that its race-conscious admissions practices helped the Army achieve its \"mission critical\" goal of having officers as diverse as its enlisted military personnel. \nAlthough Black people make up 20.2% of the Army's active duty enlisted personnel, only 11% of officers are Black, the Justice Department said. Hispanic people constitute 18% of active personnel but only 9% of officers, the department said. White people by contrast constitute 51.7% of the Army active duty enlisted corps and 68% of its officers, the Justice Department said."
}