{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0A0RC_L.jpg",
  "title": "Exclusive-Survivors of mass kidnapping in Mexico recount 'terrifying' experience",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 11, 2024 11:03AM ET",
    "Updated Jan 11, 2024 11:11AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/exclusivesurvivors-of-mass-kidnapping-in-mexico-recount-terrifying-experience-3272712",
  "paragraph": "© Reuters. Birds fly near the border wall, on the border between Mexico and the United States, during a day of low temperatures, as seen from Ciudad Juarez, Mexico January 8, 2024. REUTERS/Jose Luis Gonzalez\nBy Laura Gottesdiener MONTERREY, Mexico (Reuters) - Honduran migrant Noel Castillo heard a volley of shots just after 7:30 p.m. in late December as he and his family traveled on a highway in northern Mexico. Through the window, he saw trucks swarm around the bus, trapping them from all sides. \"We couldn't believe what was happening; there was so much gunfire,\" said Castillo. Armed, masked men in military-style clothing stormed aboard, and demanded identification from the passengers. They then abducted Castillo and 31 other migrants in a mass kidnapping that sparked a vast manhunt by Mexican authorities and underscored the risks faced by the hundreds of thousands of people who traverse Mexico each year en route to the United States to seek asylum. Reuters interviewed Castillo and his sister, Dilcia, who also survived the kidnapping, by telephone on Wednesday evening, hours after they legally crossed into the United States. Theirs is the first public account by migrants of the events of Dec. 30, when six Hondurans and 26 Venezuelans were kidnapped. All the migrants were freed on Jan. 3.  The Castillo family said they fled Honduras over the summer to escape powerful drug gangs that were trying to forcibly recruit Dilcia's two teenage daughters, whose names Reuters is withholding at the family's request. After months in southern Mexico, the family reached the northern city of Monterrey and on Dec. 30 boarded a commercial bus to Matamoros.  They intended to wait there while applying for an appointment on a U.S. government smartphone app, CBP One, that would allow them to legally enter the United States. The bus passed through two official checkpoints, Castillo recalled, where he said he and other migrants were extorted by officials for 500 pesos, or $30, per person each time.  Mexican authorities did not immediately respond to a request for comment on the extortion allegation, which Reuters could not independently verify. Soon after they passed the city of Reynosa, armed men encircled the bus. An array of warring crime networks control swaths of this border region and commonly extort and kidnap migrants who travel through their territory. The criminals whisked Castillo, his niece and other migrants away in one truck, while Dilcia, her eldest daughter and other members of the group were taken to another location. For four days, Dilcia had no news of her youngest daughter. All she heard were the kidnappers' threats: If you don't pay up, you'll never see her again. \"You imagine the worst: What is happening? What have they done with her?\" she recalled. \"It was terrifying.\" Days passed without food, without water, the cramped house where they were imprisoned crawling with rats and cockroaches, she said. Meanwhile, Castillo and his niece were taken to a ranch with a house so packed with dozens of other kidnapped migrants that sometimes there wasn't even enough room to sit down, he said. They were stripped of their phones, cash and even their shoes. Back in Honduras, their relatives received a series of calls in which the kidnappers demanded thousands of dollars in ransom.  The family sold Dilcia's house and scrapped together other funds to pay about $7,000 to the kidnappers, who asked that the money be sent to a series of bank accounts, which the family believes were Peru-based.  On Jan. 3, all 32 migrants who had been kidnapped together five days earlier were loaded onto a bus by their kidnappers and abandoned in a parking lot of a shopping center not far from the border. \"'They'll come get you here',\" Castillo recalls the kidnappers saying. About 10 minutes later, he said, the authorities arrived.  Mexican authorities say they discovered the group after an anonymous 911 emergency call. They say the migrants were released by their captors due to the large deployment of security forces and the ensuing manhunt.  \nThey also said the case was \"atypical\" due to the large number of migrants kidnapped at one time, though they acknowledged migrants are routinely kidnapped in this part of Mexico. When they left the ranch, dozens of other migrants remained imprisoned there, Castillo said. Authorities say the investigation is ongoing but no one has been arrested so far."
}