{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0S0MF_L.jpg",
  "title": "Qatar hopes US retaliation will not undercut Israel-Hamas hostage talks",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 29, 2024 01:42PM ET",
    "Updated Jan 29, 2024 05:52PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/qatar-hopes-us-retaliation-wont-undercut-hostage-talks-3286302",
  "paragraph": "© Reuters. Qatar's Prime Minister Mohammed bin Abdulrahman bin Jassim Al Thani looks on during the 54th annual meeting of the World Economic Forum in Davos, Switzerland, January 16, 2024. REUTERS/Denis Balibouse/ File photo\nWASHINGTON (Reuters) -Qatar's prime minister on Monday said he hoped U.S. retaliation for an drone attack that killed three U.S. troops in Jordan would not undercut progress toward a new Israel-Hamas hostage release deal in weekend talks. \"I hope that nothing would undermine the efforts that we are doing or jeopardize the process,\" Qatari Prime Minister Sheikh Mohammed bin Abdulrahman bin Jassim al Thani told a Washington think tank audience when asked if U.S. retaliation for the attack by Iran-backed militants could scuttle an emerging deal. It was the first deadly strike against U.S. forces since the Israel-Hamas war erupted in October, and marked a major escalation in tensions that have engulfed the Middle East. CIA Director William Burns met Sheikh Mohammed, as well as the head of Israel's Mossad intelligence service and the head of Egyptian intelligence on Sunday in Paris for talks described as constructive by Israel, Qatar and the U.S., albeit with significant gaps remaining. U.S. President Joe Biden has been trying to facilitate the release by Hamas, which rules Gaza, of more than 100 hostages seized by the militants in their deadly Oct. 7 rampage into southern Israel. U.S. Secretary of State Antony Blinken said the Paris talks provided hope for a resumption of a negotiating process mediated by Qatar that collapsed after a first agreement in November saw Hamas free around 100 hostages. A framework for a possible second deal developed in Paris \"is a strong one and a compelling one that ... offers hope that we can get back into this process,\" he said at a news conference with NATO Secretary General Jens Stoltenberg. \"Hamas will have to make its own decisions,\" said Blinken, who declined to reveal details of the proposal. According to Israel, some 1,200 people were killed and 253 abducted in the attack, which sparked Israel's war to eliminate Hamas. Israel has since unleashed a torrent of strikes on Gaza that have flattened most of the Palestinian enclave and killed more than 26,000 people, Palestinian health officials said. Tensions have surged around the Middle East since Israel began its aerial and ground offensive, with Yemen's Iran-backed Houthi forces striking U.S. and other targets in the Red Sea in attacks that have disrupted global shipping. \nU.S. officials said on Sunday three U.S. service members were killed and at least 34 wounded in the attack by Iran-backed militants on U.S. troops in northeastern Jordan near the Syrian border. Speaking at Washington's Atlantic Council think tank, the Qatari prime minister said U.S. retaliation \"will definitely have an impact ... One way or another it will definitely have an impact on regional security and we hope things get contained.\""
}