{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "US relists Houthis as terrorists in response to Red Sea attacks",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 17, 2024 10:34AM ET",
    "Updated Jan 18, 2024 02:46AM ET"
  ],
  "comments": [
    2,
    [
      [
        "Ken Roth",
        "2024-01-18 15:14:06",
        "Trump did not attack the Houthis but Biden does to defend the world trade transportation. So Stephen whats your point?",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Mark Jannetty",
        "2024-01-18 16:46:23",
        "His point was Trump was right again. ",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Stephen Fa",
        "2024-01-17 16:54:19",
        "Team Biden clearly acknowledges and corrects yet another foreign policy and national security mistake that prior administration got right.",
        "https://www.investing.com/members/200910591"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/us-relists-houthis-as-terrorists-in-response-to-red-sea-attacks-3276450",
  "paragraph": "By Simon Lewis and Steve Holland WASHINGTON (Reuters) -The U.S. government on Wednesday returned the Yemen-based Houthi rebels to a list of terrorist groups in the latest attempt by Washington to stem attacks on international shipping. Officials said the \"Specially Designated Global Terrorist\" (SDGT) designation, which hits the Iran-aligned group with harsh sanctions, was aimed at cutting off funding and weapons the Houthis have used to attack or hijack ships in vital Red Sea shipping lanes.  \"This designation is an important tool to impede terrorist funding to the Houthis, further restrict their access to financial markets, and hold them accountable for their actions,\" White House National Security Advisor Jake Sullivan said in a statement.  \"If the Houthis cease their attacks in the Red Sea and Gulf of Aden, the United States will immediately reevaluate this designation,\" Sullivan said. President Joe Biden's administration also issued \"carve outs\" aimed at avoiding an impact on Yemen's population, which relies on food imports and humanitarian aid, and pledged to conduct outreach to groups including aid agencies before the designation comes into effect in 30 days. The Houthis' campaign has disrupted global commerce, stoked fears of inflation and deepened concern that fallout from the Israel-Hamas war could destabilize the Middle East. Biden last week called the Houthis a \"terrorist\" group. American and British warplanes, ships and submarines have launched dozens of airstrikes targeting the Houthis, who control the most populous parts of Yemen. The U.S. military on Tuesday carried out its latest strike against four Houthi anti-ship ballistic missiles, two U.S. officials told Reuters. Houthi spokesperson Mohammed Abdulsalam on Wednesday told Reuters that the designation would not affect operations, which the group says are in support of the Palestinians and target Israeli ships or ships heading to Israel.  The attacks are part of a broad response to the Gaza conflict by a so-called Axis of Resistance - including the Houthis alongside Palestinian militants Hamas, Lebanon-based Hezbollah and Iraq's Shiite militias - with ties to U.S. adversary Iran.  \"We will continue to counter and blunt Iranian malign influence wherever we can. So of course the choice to move away from Iran is now in the hands of the Houthis,\" said one of three administration officials who briefed reporters ahead of the announcement on condition of anonymity. A Saudi Arabia-led military coalition intervened in Yemen in 2015, backing government forces fighting the Houthis in a war widely seen as a proxy conflict between U.S. ally Saudi Arabia and Iran. POLITICAL TUSSLE Former President Donald Trump's administration added the Houthis to two lists designating them as terrorists a day before its term ended. The United Nations, aid groups and some U.S. lawmakers expressed fears that sanctions would disrupt flows of food, fuel and other commodities into Yemen. U.S. Secretary of State Antony Blinken revoked the designations days after taking office in 2021, citing concerns sanctions would disrupt flows of vital humanitarian goods to Yemen. The Houthis on Wednesday were relisted as an SDGT group, but not as a \"foreign terrorist organization\" (FTO), which includes stricter prohibitions on providing material support to those on the list and would mean automatic travel bans. U.S. officials said this would make it easier to exempt humanitarian goods from sanctions.  House Foreign Affairs Committee Chairman Michael McCaul said in a statement it was \"past time for this administration to take a clear-eyed view situation and re-designate the Iran-backed Houthis as a FTO.” 'CHILLING EFFECT' The U.S. Treasury Department issued licenses authorizing certain transactions involving the Houthis, including transactions related to agricultural commodities, medicine, medical devices, telecommunications and personal remittances. Also authorized were transactions involving the Houthis related to port and airport operations as well as refined petroleum products in Yemen. The U.N. describes the humanitarian crisis in Yemen as \"severe,\" with more than 21 million people — two-thirds of the population — in need of aid. It says more than 80% of the population struggles to access food, safe drinking water and adequate health services. Anastasia Moran, the International Rescue Committee's associate director for U.S. advocacy, warned that even with carve outs, the designation would likely have \"a serious chilling effect\" on the supply of food to Yemen's population, 75% of which lives in areas controlled by the Houthis. \"Humanitarian exemptions alone are often not enough to mitigate harm from sanctions,\" she said.  \nThe United Nations said it would continue providing aid in Yemen but called for Washington to clarify its exemptions and encourage commercial activity to continue. \"We remain concerned about the potential reluctance from the private sector to continue business involving Yemen as a result of this designation, based on the associated reputational risks or potential lack of clarity over the exact scope of exemptions,\" said Eri Kaneko, spokesperson for the U.N. Office for the Coordination of Humanitarian Affairs."
}