{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK090S3_L.jpg",
  "title": "Ukraine is 'test site' for North Korean missiles: South Korea",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 10, 2024 02:17PM ET",
    "Updated Jan 10, 2024 02:22PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/ukraine-is-test-site-for-north-korean-missiles-south-korea-3271764",
  "paragraph": "4/4\n© Reuters. A view shows parts of an unidentified missile, which Ukrainian authorities believe to be made in North Korea and was used in a strike in Kharkiv earlier this week, amid Russia's attack on Ukraine, in Kharkiv, Ukraine January 6, 2024. REUTERS/Vyacheslav Ma\n2/4\nBy Jonathan Landay and Arshad Mohammed WASHINGTON (Reuters) - The United States and its allies on Wednesday condemned what they described as Russia's firing of North Korean missiles at Ukraine, with Washington calling it abhorrent and Seoul calling Ukraine a test site for Pyongyang's nuclear-capable missiles. Speaking at a U.N. Security Council session on the nearly two-year-old war ignited by Russia's invasion of Ukraine, Russia's envoy said the United States seemed to be spreading \"wrong\" information.  But he stopped short of outright denying that Russia was using North Korean arms, which Deputy U.S. Ambassador to the U.N. Robert Wood and other U.S. allies said would violate U.N. resolutions. \"It's abhorrent that a permanent member of the U.N. Security Council is flagrantly violating Council resolutions to attack another U.N. member state, violations that further the suffering of the Ukrainian people, support Russia’s brutal war, and undermine the global nonproliferation regime,\" Wood said. Earlier, the United States and seven other nations accused Russia of exploiting its position as a veto-holding permanent member of the Council by acquiring North Korean missiles and firing them into Ukraine in violation of Council resolutions. \"A permanent Security Council member that willingly engages in these violations demonstrates a clear exploitation of its position,\" said a statement by permanent Council members Britain, France and the United States, nonpermanent members Malta, Slovenia and South Korea as well as Japan and Ukraine. The fact that Russia holds a veto on the Council, as do Britain, China, France and the United States, effectively guarantees the body cannot punish Moscow. The White House said last week that Russia recently used short-range ballistic missiles sourced from North Korea to conduct multiple strikes against Ukraine, citing newly declassified intelligence.  Moscow and Pyongyang have both denied conducting any arms deals but they vowed last year to deepen military relations. Russia recently has launched some of its most intense strikes on Ukraine since it invaded almost two years ago. Russian U.N. Ambassador Vasily Nebenzya said Western states had called the Security Council session as an exercise in \"anti-Russian propaganda\" but stopped short of making an unequivocal denial that Moscow had fired North Korean missiles at Ukraine. \"Today, Western members of the Security Council repeated the 'fact' that the Russian military is using missiles from the DPRK in its special military operation in Ukraine,\" Nebenzya said, saying a Ukrainian Air Force representative had denied there was any evidence \"of this 'fact.' So the U.S. seems to be spreading information that is wrong without going through the trouble of checking this beforehand.\" South Korea's ambassador said Russia's use of North Korean missiles gave Pyongyang \"valuable technical and military insights\" about its arms. \"By exporting missiles to Russia, the DPRK uses Ukraine as the test site of its nuclear-capable missiles,\" said South Korean envoy Hwang Joon-kook. \n\"Some experts assess that the missiles fired into Ukraine are KN-23s, which the DPRK claims can deliver nuclear warheads,\" he added, saying one flew 460 km, the distance from a North Korean launch site to South Korean's city of Pusan. \"From the ROK standpoint, it amounts to a simulated attack,\" he said."
}