{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "US lawmakers to press for humanitarian action on Myanmar",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 01, 2024 08:05AM ET",
    "Updated Feb 01, 2024 12:06PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-lawmakers-to-press-for-humanitarian-action-on-myanmar-3289972",
  "paragraph": "By Simon Lewis WASHINGTON (Reuters) - Members of the House of Representatives on Thursday will launch the first bipartisan caucus on Myanmar to pressure U.S. administrations to act on the crisis in the Southeast Asian country since the military staged a coup three years ago, according to a statement. Republican Bill Huizenga of Michigan and Democrat Betty McCollum of Minnesota will chair the Congressional Burma Caucus, which the statement from the two lawmakers said was intended to bolster congressional support for the fight for democracy and human rights in the country also known as Myanmar. Myanmar's military seized power three years ago on Thursday, detaining democratic leaders including Nobel laureate Aung San Suu Kyi and sparking a youth-led pro-democracy uprising that morphed into an armed resistance movement after a lethal crackdown. \"The humanitarian crisis in Burma has risen to a level that urgently needs attention from congressional leaders,\" said the lawmakers' statement, shared with Reuters ahead of an announcement on Thursday.  The caucus was expected to have at least 30 lawmakers as initial members, according to Kristiana Kuqi of Campaign for a New Myanmar, an advocacy group that helped set up the caucus, in part to keep a sustained focus on Myanmar as issues like the wars in Ukraine and Gaza, and U.S. rivalry with China, dominate discussion in Washington. \"The more engaged we have Congress and congressional staff ... the more we're able to push the needle\" on Myanmar, Kuqi said. Advocates want the Biden administration to give more support to anti-coup forces in Myanmar after Congress last year passed legislation allowing the U.S. government to provide them with non-lethal support, and to form an advisory group to decide what to do with roughly $1 billion in Myanmar assets frozen by the U.S. government after the coup. Washington on Wednesday announced new sanctions on companies and individuals with ties to the military aimed at the fuel used to conduct aerial bombings that have often targeted civilians, as well as the military's ability to produce arms."
}