{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK02040_L.jpg",
  "title": "Overseas figures reject prosecution accusations in Hong Kong trial of Jimmy Lai",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 03, 2024 01:00AM ET",
    "Updated Jan 03, 2024 05:50AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/overseas-figures-refute-allegations-in-hong-kong-security-trial-for-jimmy-lai-3265878",
  "paragraph": "By Jessie Pang and Edward Cho HONG KONG (Reuters) - Several overseas activists, right campaigners and politicians named in Hong Kong's national security trial of democrat Jimmy Lai have rejected claims by a government prosecutor that they colluded with the newspaper publisher. Lai, 76, founder of now-shuttered pro-democracy paper Apple (NASDAQ:AAPL) Daily and a leading critic of the Chinese Communist Party, faces two counts of conspiracy to collude with foreign forces - including calling for sanctions against Hong Kong and Chinese officials - under a national security law China imposed in 2020.  He is also charged with conspiracy to publish seditious publications. \"Hang in there,\" a supporter shouted to Lai before Wednesday's proceedings began, as he sat in a glass-enclosed dock surrounded by prison guards.  Earlier, prosecutor Anthony Chau accused Lai of conspiring with activist Andy Li, a paralegal, Chan Tsz-wah, exiled activist Finn Lau, Britain-based rights campaigner Luke de Pulford, Japanese politician Shiori Yamao, U.S. financier Bill Browder and others to lobby foreign countries for sanctions. Some of these individuals rejected the accusations. \"Jimmy had nothing whatsoever to do with any of my work on Hong Kong at all,\" Luke de Pulford, the head of the Inter-Parliamentary Alliance on China (IPAC), said on social network X. \"But Jimmy's case isn't about truth. It's about delivering Beijing's narrative.\" IPAC, a group of more than 300 lawmakers in 33 countries, condemned attempts to implicate several of its members in the \"sham\" trial, saying in a statement these were an \"unacceptable infringement of the rights of foreign citizens\".  Self-exiled Hong Kong activist Finn Lau, now based in Britain, also said on X that Lai was not involved in any of his advocacy work for human rights and democracy, while calling for the immediate release of Lai and others.  At least seven others have been accused of being Lai's agents or intermediaries in requesting sanctions. These include former U.S. Army General Jack Keane, former U.S. deputy defense secretary Paul Wolfowitz, former U.S. consul general to Hong Kong James Blair Cunningham and the founder of Hong Kong Watch, Benedict Rogers (NYSE:ROG).  \"The idea that it is a crime for him (Lai) to speak to politicians, business leaders, international media and activists, as well as myself as a former diplomat, is ludicrous in the extreme,\" Cunningham said in a statement. Rogers said on X that Lai's alleged criminal interactions with various foreigners \"ought to be regarded as entirely normal legitimate activity\" for a newspaper publisher. The trial demonstrated \"just how dramatically and extensively Hong Kong's basic freedoms and the rule of law have been dismantled,\" he added. At Wednesday's hearing, Chau showed the court videos, scanned Apple Daily articles and Whatsapp messages from Lai's personal phone. He said they showed Lai directed one of his executives on how to mobilise more protesters and contacted former British governor Chris Patten.  Chau said Lai directed an assistant to liaise with Wall Street Journal columnist Bill McGurn to invite Patten to make a video appealing to people to subscribe to Apple Daily in May 2020. Chau also accused Lai of launching an English-language news website that month, in a push to get foreign countries to \"impose sanctions\" against China and Hong Kong.  Chau added that Lai directed one of his executives to launch a \"One Hongkonger, One Letter to Save Hong Kong\" campaign. Such letters were meant to be sent to Donald Trump, then president of the United States, to ask him to confront China over the June 2020 national security law that outlawed crimes like collusion with foreign forces, setting jail terms of life. In a statement on Wednesday, the commissioner's office of China's foreign ministry in Hong Kong described Lai as an \"agent and pawn of foreign anti-China forces, who has blatantly colluded with external forces to endanger national security.\" It also criticised some foreigners named in the trial for \"rebelling against China\", slandering its policies in the city and \"interfering with Hong Kong's judicial justice\".  \nBoth the United States and Britain have called for Lai's immediate release, saying his trial is politically motivated.  Hong Kong authorities dispute claims that Lai will not receive a fair trial, saying all are equal before the law and the national security law has brought stability to the city after mass protests in 2019."
}