{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBT094_L.jpg",
  "title": "North Korea to launch new satellites, build drones, calling war inevitable",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 30, 2023 05:58PM ET",
    "Updated Dec 31, 2023 06:15AM ET"
  ],
  "comments": [
    3,
    [
      [
        "Mark Jannetty",
        "2023-12-31 15:42:12",
        "this is so much better than the 4 years of global peace under Trump ",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Brad Albright",
        "2023-12-31 23:22:12",
        "Global peace? Another magaloon living free from the facts.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Barry Nickerson",
        "2023-12-31 11:43:09",
        "Kim rules the NK and is not about to end that.  The position is his estate to leave his kids.  Since SK is not about to change into a commie country, these two have to learn to co-exist.  With Kim's mind apparently deteriorating (severe paranoia) , they'll probably be at war with one another within a decade.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Levan Jackson",
        "2023-12-31 14:14:58",
        "Is it paranoia? I ask because sometimes he behaves exactly like my friends kids when they want something and they aren't getting it; particularly the young adults (teens). In summary, stomping feet to get desired result. It's highly probable that the electronics in the satellite failed during entry into orbit. He's unlikely to nuke the south because we'll.. wind. Sounds like his speeches are more geared to put fear in the hearts of his own population which makes me inclined to think things have much worsened during the border closures. ",
        "https://www.investing.com/members/206341051"
      ],
      [
        "Levan Jackson",
        "2023-12-31 14:16:02",
        "well wind not we'll... auto incorrect got me again",
        "https://www.investing.com/members/206341051"
      ],
      [
        "Barry Nickerson",
        "2024-01-01 10:52:57",
        "Levan Jackson",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Ringki Nababan",
        "2023-12-31 08:37:25",
        "it's funny to find news like this in investment media. Ordered by Gold speculators. Freefall soon 🤦",
        "https://www.investing.com/members/205121952"
      ],
      [
        "Barry Nickerson",
        "2023-12-31 11:37:18",
        "There are plenty of business categories to choose from.  This article is in the world news category.  This site is basically a Reuters distribution center.",
        "https://www.investing.com/members/249373719"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/north-korea-plans-to-launch-three-more-reconnaissance-satellites-in-2024-kcna-reports-3264916",
  "paragraph": "© Reuters. FILE PHOTO: A North Korean flag flutters at the propaganda village of Gijungdong in North Korea, in this picture taken near the truce village of Panmunjom inside the demilitarized zone (DMZ) separating the two Koreas, South Korea, July 19, 2022. REUTER\nBy Cynthia Kim, Josh Smith and Jack Kim SEOUL (Reuters) -North Korea vowed to launch three new spy satellites, build military drones, and boost its nuclear arsenal in 2024 as leader Kim Jong Un said U.S. policy is making war inevitable, state media reported on Sunday. Kim lashed out at Washington in lengthy remarks wrapping up five days of ruling party meetings that set economic, military and foreign policy goals for the coming year. \"Because of reckless moves by the enemies to invade us, it is a fait accompli that a war can break out at any time on the Korean peninsula,\" he said, according to state news agency KCNA. He ordered the military to prepare to \"pacify the entire territory of South Korea,\" including with nuclear bombs if necessary, in response to any attack. Kim's speech comes ahead of a year that will see pivotal elections in both South Korea and the United States. Experts predict North Korea will maintain a campaign of military pressure for leverage around the U.S. presidential elections in November, which could see the return of former President Donald Trump, who traded in both threats and historic diplomacy with Kim. \"Pyongyang might be waiting out the U.S. presidential election to see what its provocations can buy it with the next administration,\" said Leif-Eric Easley, professor of international studies at Ewha Womans University in Seoul. President Joe Biden's administration says it is open to talks, but it imposed new sanctions as North Korea pushed ahead with more missile tests banned under United Nations' sanctions.  South Korea's defence ministry condemned Pyongyang's plans to press ahead with its nuclear ambitions. \"If North Korea attempts to use nuclear weapons against us,  we will retaliate overwhelmingly by utilizing the dramatically  strengthened extended deterrence of the ROK-U.S. alliance and the three-axis system, and the Kim Jong-Un regime will face its end,\" the defense ministry said in a statement. Seoul's Unification Ministry said in a statement analyzing the KCNA report that \"further provocation is always possible to highlight North Korea's presence ahead of the U.S. presidential election\". \"(North Korea) could maintain its hard line stance against the U.S. and anti-American, anti-imperialist solidarity, and also seek opportunities to turn the situation around at the same time.\"  WAR A 'REALISTIC REALITY' The U.S. has also increased drills and deployed more military assets, including nuclear-armed submarines and large aircraft carriers, near the Korean peninsula. Kim said the return of such weapons had completely transformed South Korea into a \"forward military base and nuclear arsenal\" of the United States. \"If we look closely at the confrontational military actions by the enemy forces... the word 'war' has become a realistic reality and not an abstract concept,\" Kim said. Kim said he has no choice but to press forward with his nuclear ambitions and forge deeper relations with other countries that oppose the United States. North Korea has deep ties with both China and Russia. \"North Korea is preparing for further escalation of tension with Washington and Seoul, for at least a year or more, and its hard line policies are likely to be accompanied by efforts for dialogue as well ahead of the U.S. election,\" Yang Uk, an analyst at the Asan Institute for Policy Studies, said. \"Kim is building on his success of the spy satellite to do three more because he knows satellite capabilities are powerful targeting tool for better nuclear command and control.\" South Korea holds a parliamentary election in April that could impact the domestic and foreign agenda for conservative President Yoon Suk Yeol, who has maintained a hawkish stance toward Pyongyang. Pyongyang has now ruled out the possibility of unifying with South Korea, and the country must fundamentally change its principle and direction toward South Korea, Kim said. \"North-South relations are no longer a kinship or homogeneous relationship but have completely become a relationship between two hostile countries, two belligerents at war,\" he said, calling the South a colonised state completely dependent on the United States for national defence and security. Both Yoon's ruling party and the opposition democratic party slammed the Sunday report and urged North Korea to return to dialogue for peace talks. \"If North Korea repeats hostile acts, we will respond strongly using all means and methods ... If the Kim Jong-un regime misjudges the situation and makes a wrong decision, the Republic of Korea will definitely correct it based on its overwhelming power,\" the ruling People Power Party said in a commentary.  \nKim also promised to develop the economy, including the metals, chemicals, power, machinery and railway sectors, while modernising wheat facilities to boost production. One key policy goal is to invest in science and technological research at schools, he said."
}