{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0E02R_L.jpg",
  "title": "Former US official says commitment to Taiwan 'rock solid'",
  "category": "Economy",
  "publisher": "Reuters",
  "date": [
    "Published Jan 14, 2024 10:34PM ET",
    "Updated Jan 15, 2024 02:56AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Derick Lim",
        "2024-01-15 07:56:46",
        "American lackey ",
        "https://www.investing.com/members/214364779"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/economy/us-says-commitment-to-taiwan-rock-solid-looks-forward-to-continuity-3274190",
  "paragraph": "3/3\n© Reuters. Taiwan's President Tsai Ing-wen meets former U.S. National Security Advisor Stephen J. Hadley at the Presidential building in Taipei, Taiwan, January 15, 2024. Central News Agency/Pool via REUTERS\n2/3\nBy Ben Blanchard and Fabian Hamacher TAIPEI (Reuters) -The United States looks forward to continuity in the Taiwan-U.S. relationship under the new Taiwanese administration and the U.S. commitment to the island is \"rock solid\", a former senior U.S. official told Taiwan President Tsai Ing-wen on Monday. Lai Ching-te from Taiwan's ruling Democratic Progressive Party (DPP) won the presidential election on Saturday as expected and will take office on May 20. In a show of support for the government, a senior administration official said last week that President Joe Biden planned to send an unofficial delegation to the Chinese-claimed island. Taiwan's government rejects Beijing's sovereignty claims. The Biden administration has feared that the election, transition and new administration would escalate tensions with Beijing, which has pressured Taiwan militarily and economically to assert its sovereignty claims. Meeting Tsai at the presidential office, former U.S. National Security Advisor Stephen Hadley said he was there to convey from the American people congratulations on the election. \"Taiwan's democracy has set a shining example to the world,\" Hadley said, in comments released by Tsai's office. \"We are honoured to have the opportunity to meet with you today to reaffirm that the American commitment to Taiwan is rock solid, principled and bipartisan and that the United States stands with its friends,\" he added. Hadley said he looked forward to meeting Lai and other political leaders. \"We look forward to continuity in the relationship between Taiwan and the United States under the new administration, and for common efforts to preserve cross-strait peace and stability.\" Lai, meeting the group later at party headquarters, said he hoped the United States would continue to support Taiwan and deepen cooperation with the island. Lai said his administration will \"keep defending peace and stability in the Taiwan Strait\" as Tsai has done. China's military has not directly commented on the election, but on Monday its Eastern Theatre Command released footage of naval combat drills in the East China Sea, without giving a detailed location. \"Battle alert, battle alert!\" the command said in accompanying text. \"The enemy suddenly arrives and the commander quickly issues combat instructions.\" CHINA ANGER AT LAI Before the election, China had repeatedly denounced Lai as a dangerous separatist. Two sources familiar with the U.S. trip, speaking on condition of anonymity as they were not authorised to speak to the media, told Reuters this post-election visit by a former U.S. official was not out of the ordinary. China, which has never renounced the use of force to bring Taiwan under its control, has criticised several countries for congratulating Lai on his election victory, saying they should not interfere in China's affairs. Taiwan's government says Beijing has no right to speak for the island's people or represent them on the world stage. The United States is Taiwan's most important international backer, despite the lack of formal diplomatic ties, and a major arms supplier to Taipei. On Saturday following the election, U.S. President Joe Biden said the United States does not support the independence of Taiwan. Lai says he does not seek to change the status quo across the Taiwan Strait, sticking by Tsai's long-standing policy of neither seeking independence nor union with China and that only Taiwan's people can decide their future. Tsai told the U.S. delegation, which also includes former Deputy Secretary of State James Steinberg, that their visit fully demonstrates U.S. support for Taiwan's democracy and highlights their \"staunch\" partnership. \"We hope that Taiwan-U.S. relations continue to advance and serve as a key driving force in regional and global prosperity and development,\" he said. \nWhile Lai won election, albeit with less than half the vote, the DPP lost its majority in parliament, potentially making it much harder for him to pass legislation. Taiwan's stock market on Monday largely brushed off any post-election uncertainty, with the benchmark index closing up 0.2%."
}