{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0N0EV_L.jpg",
  "title": "Explainer-What do we know about when the UK election will be?",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 24, 2024 06:58AM ET",
    "Updated Jan 24, 2024 07:03AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/explainerwhat-do-we-know-about-when-the-uk-election-will-be-3281553",
  "paragraph": "© Reuters. The door of Number 10 Downing Street in London, Britain, March 3, 2023. REUTERS/Henry Nicholls/File Photo\nLONDON (Reuters) - Britain's next national election is expected this year, although its timing is uncertain. Here is what is known about when to expect the vote, and the process determining its timing, and details of how it works. WHEN WILL THE ELECTION BE? By law, the last possible date for a general election is Jan. 28, 2025, although Prime Minister Rishi Sunak told reporters in December that 2024 would be an election year. Sunak in January said his \"working assumption is we will have a general election in the second half of this year\", citing a busy agenda he wants to push on before any vote. That has fuelled expectations for a vote in October or November, rather than in May, which had been seen as a plausible time for an earlier general election as it could coincide with other local votes. HOW IS AN ELECTION CALLED? The decision to call a general election will be one for Sunak to take, as only the government can determine the timing of an election unless it loses a motion of no confidence in a vote in parliament. When Sunak decides to call a vote, parliament will be dissolved, and all sitting lawmakers, known as MPs, will lose their seats in the House of Commons. The timetable between the dissolution of parliament and the general election is 25 working days. Every election since 1935 has been held on a Thursday. Parliament will automatically dissolve on Dec. 17, with a vote on Jan. 28, if Sunak does not call an election before then. WHO IS ELECTED? Candidates stand for election across 650 constituencies under a first-past-the-post system, where the outright winner of each constituency is returned as the local MP.  If a party wins a majority of over 325 MPs, then King Charles will invite the party's leader to form a government, with the leader serving as prime minister. If no party achieves a majority, then parties might try to form a coalition government, where smaller parties have some ministerial roles, or the largest party might try to govern as a minority government, with informal support from other MPs. \nThe Conservative Party governed in a coalition with the Liberal Democrats from 2010 to 2015 and governed as a minority government with support from Northern Ireland's Democratic Unionist Party (DUP) from 2017-2019. Currently, the governing Conservatives have a majority, but polls show the Labour Party has around a 20-percentage point lead over the Conservatives, with some projections saying that it would likely have a substantial majority if that level of support was replicated at an election."
}