{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0A0FY_L.jpg",
  "title": "The toll on migrants of a free bus north from the border",
  "category": "World news",
  "publisher": "Investing.com",
  "date": [
    "Published Jan 11, 2024 06:34AM ET",
    "Updated Jan 11, 2024 08:11PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/the-toll-on-migrants-of-a-free-bus-north-from-the-border-3272248",
  "paragraph": "© Reuters. Jose Manuel, a Venezuelan asylum seeker, talks on the phone outside of a migrant processing center in downtown Brownsville, Texas, U.S., October 22, 2023. After passing an initial asylum screening in detention, Jose Manuel was released and headed to Chica\nBy Kristina Cooke, Ted Hesson and Mica Rosenberg BROWNSVILLE, Texas (Reuters) - Jose Manuel, a Venezuelan asylum seeker, boarded the Chicago-bound charter bus in Brownsville, Texas, a town on the U.S.-Mexico border, at around 7 a.m. on a late October morning, his journey paid for by the state of Texas. Jose Manuel, whose full name is being withheld for security reasons, was among some 100,000 migrants the Republican-led state of Texas has bused to Democratic cities since April 2022. After passing an initial asylum screening in detention, Jose Manuel was released and had planned to head to South Carolina to meet a friend and find work. But Republican Governor Greg Abbott wasn't providing free buses to a fellow Republican state, so Jose Manuel opted to take the bus to the Democratic-run city of Chicago. Texas said it has spent more than $100 million since April 2022 to bus migrants who recently crossed the U.S.-Mexico border to Chicago, New York, Denver and other Democratic-led cities. The arrivals have exacerbated homelessness and taxed social services in those cities and increased the pressures on U.S. President Joe Biden as he runs for re-election in November. Biden, who was facing criticism from Republicans for his border policies, now also faces demands from his own party to ease the burden on the cities receiving migrants. Abbott has said the free bus transport was intended to \"bring the border\" to Democratic cities and provide relief to overwhelmed border communities. Tom Perez, a senior White House adviser, said the Biden administration shares Democratic mayors' and governors' frustrations with \"extreme Republicans like Governor Abbott who attempt to use migrants as political pawns.\" He said Biden is focused on securing more funding for communities receiving migrants. Reuters journalists spoke with more than a dozen migrants traveling from Brownsville to Chicago, New York City and Denver, and then tracked the 26-hour, 1,400-mile (2,250-km) journey of one bus to Chicago. They followed seven of the migrants for several months. Some – like Jose Manuel – changed their destinations based on the offer of free transportation, even though they had immigration court dates in other parts of the U.S., or friends and family waiting for them elsewhere. Barbara and Brenda, who came to the U.S. hoping to live openly as a same-sex couple, got on a bus to New York although they had a friend in Maryland. After their Chicago-bound bus was delayed, Fernando Fernandez and his partner Mariela Gil headed in different directions. Fernandez waited for the bus while Gil took up an offer of a bus ticket and a temporary housekeeping job in Sarasota, Florida. Alejandra Perez ended up sleeping in a tent outside a Chicago police station with her former partner Jader Castro, and her children Sharlott Barrios, 9, and Juan Sebastian Castro, 5, because of a shortage of shelter beds. Miskel Gomez got off the bus in Chicago and moved on to Ohio. Chicago is now housing more than 15,000 migrants in shelters, some of whom spent the fall sleeping outside police stations.  New York, unlike Chicago, is legally obliged to house the homeless, and is housing more than 69,000 migrants in hotels, government buildings and tent cities, even as officials worry that this might make the city a magnet for more migration. The mayors of New York, Chicago and Denver have repeatedly pushed for more federal funds and taken steps to discourage uncoordinated migrant bus drop offs, including penalizing bus companies. They have also pushed for faster access to work permits, so that the newcomers can support themselves.  \"We need a resolution at the border,\" New York Mayor Eric Adams told reporters this week. \"You cannot just place the financial responsibilities onto the cities.\" The Biden administration in 2021 and 2022 rejected a proposal to transport some migrants to other U.S. cities because the White House did not want \"full ownership\" of the issue, one former official said. The White House declined to comment. While the migrants Reuters spoke with welcomed the free busing, many had little understanding of the geography of the United States or the winter conditions that awaited them at their destinations. JOSE MANUEL When Jose Manuel told Team Brownsville volunteer Gerry Page he was going to Chicago, she shuddered. \"Muy frio,\" Page said, with a broad American accent. She handed him a long-sleeved shirt. They had run out of coats. The migrants, mostly from Venezuela, waited near the bus station for news of when a bus to their chosen destination would be leaving. Arrivals were slow that weekend, and buses were taking days to fill up. The first bus to depart, carrying Jose Manuel, Fernandez and Gomez, cut through Arkansas before arriving in Chicago. Reuters followed that bus. A second bus, carrying Perez and her family, took an alternate route through Oklahoma. Both trips took more than 26 hours. In Chicago, Jose Manuel waited several hours for a friend to pick him up. He has an initial court date scheduled in October 2025 in Charlotte, North Carolina. If he decides to stay in Chicago, he will need to file a motion with the immigration court to change his hearing location. ALEJANDRA PEREZ At the drop-off point, city officials directed Alejandra Perez and her family to a waiting yellow school bus. Perez had heard from a relative in the U.S. that as a family with young children they would get priority for shelter spots. But the bus took them to the Shakespeare district police station, where they said they were told there was no space for them to sleep. Officials told them to take public transport to O'Hare airport and try to sleep there, Perez said. But at the airport, they were told they could not stay without a plane ticket, Perez said, and were sent back to the same police station. It was midnight and drizzling when they bedded down in a tent outside a different police station in central Chicago, more than 40 hours after they left Brownsville. The next evening, Perez bathed the children in the police station bathrooms, before withdrawing to the tent to eat instant soup for dinner. The family would stay there for two weeks, even as temperatures dropped below freezing and snow began to fall. \"Our local economies are not designed and built to respond to this type of crisis,\" Chicago Mayor Brandon Johnson told reporters last month. FERNANDO FERNANDEZ At another Chicago police station a few miles away, Fernandez got a video call from his partner Mariela Gil, who had taken a commercial bus to Florida. He assured her he was doing well. But the night before, arguments had broken out outside the police station over people hoarding donations, he said. After they hung up, he glanced at his phone and saw a social media post that read: \"Thank you, God, for one more day of life and health and for my work.\" \"That's Mari,\" he said, pointing at the post, smiling. The couple fled Colombia after a gang left a written threat on the Fernandez family's door, telling them to pay the equivalent of thousands of dollars within hours or be killed, he said. Fernandez remained at the police station in Chicago for three weeks until he found a place in a shelter in late November, where he said he kept to himself to avoid trouble. Gil moved on to a job as a house cleaner and was living in a shared apartment in Sarasota, Fernandez said. In Chicago, Fernandez applied for a work permit. Chicago, New York, Boston and Denver are providing free clinics to help speed up work permit applications. A spokesperson for U.S. Citizenship and Immigration Services said the agency had served more than 10,000 people at these clinics since September, and that it had reduced median processing times to 30 days for certain migrants. MISKEL GOMEZ Miskel Gomez had initially hoped to go to Denver and work in a factory, maybe at a slaughterhouse, a similar job to the one he had in Venezuela. After waiting for a few days for a bus to Denver, he boarded a bus to Chicago instead. He then made his way to Columbus, Ohio, where he had a friend who said he could stay with him in a shared house. In Columbus, he set about trying to get his work permit. While he was eligible to apply immediately, he was told it could still take months to process, he said. \"It's still very difficult,\" he said.  BARBARA AND BRENDA Barbara and Brenda's bus arrived at the Port Authority bus terminal in Manhattan at 9:30 p.m. on Friday, about 38 hours after leaving Brownsville. They were given a room in a hotel that the city has repurposed as a migrant intake center. The next morning, they were given subway fare and directions to a hotel in Queens. They had originally hoped to head to Maryland to join a friend, but had no money to get there. An acquaintance provided an address that allowed them to board the bus to New York, but she told them they could not stay there once they arrived. A social worker at the hotel in Queens explained where they could sign up for legal help, medical appointments and other assistance, they said. But they said they could not afford the subway fares to the addresses provided. WAITING ON WORK PERMITS By early January, Fernandez had taken a commercial bus to reunite with Gil in Sarasota, Florida. Gomez was still in Ohio, but was considering trying his luck elsewhere. Perez and her children were at a family shelter in Chicago. Her former partner Castro was in a shelter for single adults. All five migrants were still waiting for their work permits. At the shelter where Perez and her children were staying, she said about a hundred families slept on cots on one floor of the building.  As she waits for her work permit, Perez said, \"we are in a holding pattern.\" \nBy late November, the children were enrolled in school and starting to learn English. The Chicago public schools have allocated an additional $15 million this school year to additional support for pupils who are English learners, a spokesperson said. A week before Christmas, Perez lined up for medical care at the shelter for Sharlott, who had chicken pox and Juan Sebastian who had been vomiting for two days. She said she did not have money for medicine."
}