{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0801D_L.jpg",
  "title": "China piles pressure on Taiwan ahead of election",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 08, 2024 09:03PM ET",
    "Updated Jan 09, 2024 01:21PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Mark Jannetty",
        "2024-01-09 15:46:36",
        "China sounds alot like the Biden administration. ",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Brad Albright",
        "2024-01-09 18:51:14",
        "Just who is the equivalent of Taiwan in your delusion?",
        "https://www.investing.com/members/236251128"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/taiwan-ruling-party-candidate-will-maintain-status-quo-engage-with-china-3269921",
  "paragraph": "3/3\n© Reuters. Lai Ching-te, Taiwan's vice president and the ruling Democratic Progressive Party's (DPP) presidential candidate gestures at an election campaign event in Taipei City, Taiwan January 3, 2024. REUTERS/Ann Wang\n2/3\nBy Ben Blanchard and Liz Lee TAIPEI/BEIJING (Reuters) -China on Tuesday threatened new trade measures against Taiwan, which accused Beijing of \"economic coercion\" ahead of pivotal weekend elections on the island and also voiced anger at a surprise Chinese satellite launch over its air space.  Saturday's presidential and parliamentary polls are taking place against a backdrop of a ramped-up war of words between Taiwan and China, which views the island as its own territory despite the strong objections of the Taiwanese government. Taiwan's government has accused China of an unprecedented campaign of election interference, using everything from military activity to trade sanctions to sway the vote towards candidates Beijing may prefer. China has cast the election as a choice between war and peace, and says interference allegations are \"dirty tricks\" from Taiwan's ruling Democratic Progressive Party (DPP) to try and win support.  The DPP's presidential candidate Lai Ching-te said on Tuesday he would maintain the status quo and pursue peace through strength if elected, remaining open to engagement with Beijing under the preconditions of equality and dignity. Beijing has denounced him as a separatist and warned that any attempt to push for Taiwan's formal independence means conflict.  Despite this, Lai pledged to try to engage with China. \"Peace is priceless and war has no winners,\" Lai told reporters at a news conference. \"Peace without sovereignty is just like Hong Kong. It is fake peace.\" Beijing is unswayed by Lai's outreach attempts. On Tuesday evening, China's commerce ministry said it was looking into further steps to suspend tariff concessions on products including agriculture and fishery, machinery, auto parts and textiles from Taiwan, following up on such a move made against some petrochemical products last month. \"Taiwan authorities have not taken effective measures to lift trade restrictions on China. Instead, they have engaged in political manoeuvring in an attempt to plant blame and evade responsibility,\" the commerce ministry said in a statement. Taiwan's Office of Trade Negotiations responded by calling on China to \"immediately stop using economic coercion to try to interfere in Taiwan's election\".  FALSE ALARMS AND CHINESE BALLOONS Adding to the tense atmosphere, a separate news conference on Tuesday in Taipei with Taiwan Foreign Minister Joseph Wu was interrupted by the shrill sound of a government mobile phone alert warning of a possible Chinese air raid. The defence ministry then had to apologise after the English version of the alert referred to a \"missile\" but in Chinese a \"satellite\". The alert came around the same time Chinese state media confirmed the launch of a science satellite. Still, Wu described the launch as part of a pattern of harassment towards Taiwan, just like recent cases of Chinese balloons spotted over the island. \"With these kinds of threats against Taiwan I think we should be clear-eyed, we should not be provoked.\" Taiwan's opposition jumped on the snafu, blaming the government for misleading the public. Taiwan has complained since last month about Chinese balloons flying over the sensitive Taiwan Strait, some of which have crossed the island, in what its defence ministry has called an effort at psychological warfare, though not directly saying the balloons were for spying purposes. The defence ministry said at its own separate briefing on Tuesday that it had not recovered any remains of the balloons and were not at the moment considering shooting them down. \"We won't attack and destroy due to the harassment of the balloons,\" said Wang Chia-chun from the ministry's joint combat planning department. \nTop Chinese leaders have generally avoided public comments on the election, though Chinese President Xi Jinping said in a New Year's address that China's \"reunification\" with Taiwan is inevitable. Lai told reporters the election will serve as a \"testament to our commitment to democracy\" while noting that China's alleged interference in this election has been the \"most serious\" yet."
}