{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK090BT_L.jpg",
  "title": "Finnish, Chinese presidents discussed pipeline damage, Finland says",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 10, 2024 07:01AM ET",
    "Updated Jan 10, 2024 07:07AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/finnish-chinese-presidents-discussed-pipeline-damage-finland-says-3271269",
  "paragraph": "© Reuters. FILE PHOTO: A damaged Balticconnector gas pipeline that connects Finland and Estonia is pictured in this undated handout picture in the Baltic Sea. Finnish Border Guard/Handout via REUTERS/File Photo\nBy Anne Kauranen and Liz Lee HELSINKI/BEIJING (Reuters) -Finland's President Sauli Niinisto said on Wednesday he had held constructive talks with China's President Xi Jinping over the damage inflicted last year to the Balticconnector gas pipeline linking Finland and Estonia. Finnish police have named the Hong Kong-flagged NewNew Polar Bear container ship as the prime suspect in damaging the gas pipeline, saying last year it was too early to tell if this was an accident or a deliberate act. A large anchor, believed to belong to the Chinese vessel, was found near the pipeline, and the investigators said the pipe was likely broken as the anchor was dragged across the sea bed. Finland in November said China had promised full cooperation in the pipeline probe. \"The presidents noted the constructive dialogue between the countries regarding the case of the Balticconnector pipeline,\" the Finnish president's office said in a statement on Wednesday, following talks with Xi. Chinese state television CCTV quoted Xi as saying China had a deep friendship with Finland and that the countries had expanded their cooperation in recent years. \"In the face of the current complex and severe international situation, China is willing to strengthen cooperation with Finland to increase stability in a turbulent world,\" CCTV quoted Xi as saying. \nThe broadcaster made no mention of the pipeline. Niinisto and Xi also discussed other bilateral relations as well as global political issues, Finland said."
}