{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0A0I9_L.jpg",
  "title": "Germany's Scholz slams 'fanatics' after far-right deportation row",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 11, 2024 07:08AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/germanys-scholz-slams-fanatics-after-farright-deportation-row-3272292",
  "paragraph": "© Reuters. German Chancellor Olaf Scholz attends the weekly cabinet meeting at the Chancellery in Berlin, Germany, January 10, 2024. REUTERS/Liesa Johannssen/ File Photo\nBy Thomas Escritt BERLIN (Reuters) - German Chancellor Olaf Scholz urged democrats to stand against far-right \"fanatics\" after reports emerged of Alternative for Germany party members attending a meeting where expelling citizens with foreign ethnic backgrounds was discussed. The AfD did not deny that two of its senior politicians attended the November meeting in a villa near Berlin, where far-right influencer Martin Sellner outlined plans for the \"remigration\" of \"unassimilated\" people with German citizenship out of the country, but said the plans were not party policy. News of the meeting drew outrage, with critics drawing comparisons between proposals at the meeting for people to be deported to a \"model state in north Africa\" and the Nazis' initial plan to deport European Jews to Madagascar before they settled on mass murder instead. \"We protect all, regardless of origin, skin colour or how uncomfortable someone is for fanatics with assimilation fantasies,\" Scholz wrote on social media platform X on Thursday. \"Learning from history is about more than just lip service. Democrats must stand together.\" The AfD is soaring in polls ahead of regional and European elections this year, buoyed by severely constrained public finances and state services burdened by rising immigration. In response, all parties have pledged to crack down on illegal immigration, an approach that has only given more visibility to the AfD's signature policy. \nFar from being embarrassed by the meeting, Maximilian Krah, the party's lead candidate for November's European Parliament elections, doubled down on the party's pledge to deport illegal immigrants. \"In 2022, 2.7 million people migrated to Germany,\" he wrote on X. \"That is destroying our country! Only the AfD will stop this and arrange their return.\""
}