{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0L0NB_L.jpg",
  "title": "Families of jailed Cuban protesters file petition for their freedom",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 22, 2024 01:32PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/families-of-jailed-cuban-protesters-file-petition-for-their-freedom-3279947",
  "paragraph": "© Reuters. FILE PHOTO: People detain a protester during a rally in Havana, Cuba, July 17, 2021. REUTERS/Alexandre Meneghini\nHAVANA (Reuters) - Family members of 34 prisoners in Cuba who were jailed following anti-government protests in July 2021 have filed a petition with lawmakers seeking an amnesty for their loved ones. According to rights groups, some 1,000 people were jailed in the wake of the protests, the largest since Fidel Castro's 1959 revolution. Some of those were immediately released, but hundreds are now serving sentences that range from a few years to over 20 years, according to NGO and official tallies. The petition letter, filed on Friday, asks Ana Maria Mari Machado, vice president of the National Assembly, to begin the process of proposing and debating a law that would \"recognize that there was no crime in expressing the will for democratic change by citizens who protested in July 2021.\" It includes signatures from the relatives of several high-profile protesters, including Maykel Castillo and Luis Manuel Otero, both of whom appeared in the music video for the Latin Grammy-winning song \"Patria y Vida,\" the unofficial anthem of the July 11 protests. An online petition also began circulating this week, seeking support both domestically and abroad. Cuban officials say those jailed following the protests violated Cuban law and were convicted after facing trial for crimes ranging from assault and public order offenses to sedition. \nThe United States and the European Union have criticized Cuba's response as repressive and heavy-handed, and together with the Catholic Church have called for the release of prisoners.  More than a dozen additional people from Nuevitas, in eastern Cuba, faced trial last week for protests that took place in August 2022, according to a court document viewed by Reuters, and are currently awaiting their sentences."
}