{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0D00A_L.jpg",
  "title": "Explainer-What's the Israel-Palestinian conflict about and how did it start?",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 13, 2024 07:08PM ET",
    "Updated Jan 13, 2024 07:22PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Hot rocker",
        "2024-01-14 06:30:46",
        "thanks for your informatons ",
        "https://www.investing.com/members/256105515"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/explainerwhats-the-israelpalestinian-conflict-about-and-how-did-it-start-3274014",
  "paragraph": "2/2\n© Reuters. A tank manoeuvres next to destroyed buildings in central Gaza, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, near the Israel-Gaza border, as seen from Israel, January 13, 2024. REUTERS/Amir Cohen\n2/2\nLONDON (Reuters) - Israel and Hamas have been waging war for 100 days since gunmen from the Palestinian militant group went on the rampage in southern Israel, triggering an Israeli military campaign in which nearly 24,000 Palestinians have been killed. The war between Israel and Hamas that has raged since October is the latest in a conflict between Israelis and Palestinians that has rumbled on for seven decades and destabilised the Middle East. Since the devastating Hamas attack on Oct. 7, in which Israel says about 1,200 people were killed and around 240 taken hostage, Israel has carried out an air and land offensive on the Gaza Strip which it says aims to eradicate Hamas. WHAT ARE THE ORIGINS OF THE CONFLICT? The conflict pits Israeli demands for security in what it has long regarded as a hostile Middle East against Palestinians' unmet aspirations for a state of their own. In 1947, while Palestine was under British mandate rule, the United Nations General Assembly agreed a plan to partition it into Arab and Jewish states and for international rule over Jerusalem. Jewish leaders accepted the plan, giving them 56% of the land. The Arab League rejected the proposal. Israel's founding father, David Ben-Gurion, proclaimed the modern state of Israel on May 14, 1948, a day before the scheduled end of British rule, establishing a safe haven for Jews fleeing persecution and seeking a national home on land to which they cite deep ties dating to antiquity. Violence had been intensifying between Arabs, who made up about two thirds of the population in the late 1940s, and Jews. A day after Israel was created in 1948, troops from five Arab states attacked. In the war that followed, some 700,000 Palestinians fled or were driven from their homes, ending up in Jordan, Lebanon and Syria as well as in Gaza, the West Bank and East Jerusalem. Palestinians lament this as the \"Nakba\", or catastrophe. Israel contests the assertion that it forced out Palestinians. Armistice agreements halted the fighting in 1949 but there was no formal peace. Palestinians who stayed put in the war and their descendants make up about 20% of Israel's population now. WHAT MAJOR WARS HAVE BEEN FOUGHT SINCE THEN? In 1967, Israel made a pre-emptive strike against Egypt and Syria, launching the Six-Day War. Israel captured the West Bank and Arab East Jerusalem from Jordan, the Golan Heights from Syria and the Gaza Strip from Egypt and occupied them. An Israeli census that year put Gaza's population at 394,000, at least 60% of them Palestinian refugees and their descendants. In 1973, Egypt and Syria launched a surprise attack on Israeli positions along the Suez Canal and Golan Heights, touching off the Yom Kippur War. Israel pushed both armies back within three weeks. Israel invaded Lebanon in 1982 and thousands of Palestine Liberation Organization (PLO) fighters under Yasser Arafat were evacuated by sea after a 10-week siege. Israeli troops pulled out of Lebanon in 2000. In 2005 Israel unilaterally withdrew settlers and soldiers from Gaza. Hamas won parliamentary elections in 2006, and seized full control of Gaza in 2007. Gaza saw major flare-ups of fighting between Palestinian militants and Israel in 2006, 2008, 2012, 2014 and 2021. In 2006, Lebanon's Iran-backed Hezbollah militants captured two Israeli soldiers in the volatile border region and Israel launched military action, triggering a six-week war. Besides wars, there have been two Palestinian intifadas, or uprisings, from 1987 to 1993, and 2000 to 2005. During the second, Hamas and other Palestinian militant groups carried out suicide bombings against Israelis, and Israel carried out tank and airstrikes on Palestinian cities. Since then there have been several rounds of hostilities between Israel and Hamas, which refuses to recognise Israel and is regarded as a terrorist organisation by Israel, the European Union, the United States and other countries. Hamas says its armed activities are resistance against Israeli occupation. WHAT ATTEMPTS HAVE THERE BEEN TO MAKE PEACE? In 1979, Egypt became the first Arab state to sign a peace treaty with Israel. In 1993, Israeli Prime Minister Yitzhak Rabin and PLO leader Arafat shook hands on the Oslo Accords establishing limited Palestinian autonomy. In 1994, Israel signed a peace treaty with Jordan. U.S. President Bill Clinton, Israeli Prime Minister Ehud Barak and Arafat took part in the Camp David summit in 2000, but failed to reach a final peace deal. In 2002, an Arab League plan offered Israel normal relations with all Arab countries in return for a full withdrawal from the lands it took in the 1967 Middle East war, the creation of a Palestinian state and a \"just solution\" for Palestinian refugees. The presentation of the plan was overshadowed by Hamas, which blew up an Israeli hotel full of Holocaust survivors during a Passover seder meal. Further peace efforts have been stalled since 2014. Palestinians stopped dealing with U.S. President Donald Trump's administration after he broke with decades of U.S. policy by recognising Jerusalem as the capital of Israel. The Palestinians seek East Jerusalem as the capital of their future state. Qatar and Egypt have acted as mediators in the latest war, securing a truce that lasted seven days, during which hostages held by Hamas were exchanged for prisoners held by Israel, and more humanitarian aid flowed into Gaza. WHERE DO PEACE EFFORTS STAND NOW? U.S. President Joe Biden's administration has focused on trying to secure a \"grand bargain\" in the Middle East that includes normalisation of relations between Israel and Saudi Arabia, custodian of Islam's two holiest shrines. The latest war is diplomatically awkward for Riyadh as well as for other Arab states, including some Gulf Arab states next to Saudi Arabia that have signed peace deals with Israel. WHAT ARE THE MAIN ISRAELI-PALESTINIAN ISSUES? A two-state solution, Israeli settlements on occupied land, the status of Jerusalem, agreed borders, and the fate of Palestinian refugees. Two-state solution: An agreement that would create a state for the Palestinians in the West Bank and Gaza Strip alongside Israel. Israel has said a Palestinian state must be demilitarised so as not to threaten its security. Settlements: Most countries deem Jewish settlements built on land Israel occupied in 1967 to be illegal. Israel disputes this and cites historical and biblical ties to the land. Continued settlement expansion is among the most contentious issues between Israel, the Palestinians and the international community. Jerusalem: Palestinians want East Jerusalem, which includes the walled Old City's sites sacred to Muslims, Jews and Christians alike, to be the capital of their state. Israel says Jerusalem should remain its \"indivisible and eternal\" capital. Israel's claim to Jerusalem's eastern part is not recognised internationally. Trump recognised Jerusalem as Israel's capital, without specifying the extent of its jurisdiction in the disputed city, and moved the U.S. embassy there in 2018. \nRefugees: Today about 5.6 million Palestinian refugees - mainly descendants of those who fled in 1948 - live in Jordan, Lebanon, Syria, the Israeli-occupied West Bank and Gaza. About half of registered refugees remain stateless, according to the Palestinian foreign ministry, many living in crowded camps. Palestinians have long demanded that refugees should be allowed to return, along with millions of their descendants. Israel says any resettlement of Palestinian refugees must occur outside its borders."
}