{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0900Z_L.jpg",
  "title": "North Korea's Kim visits arms factories amid criticism over trade with Russia",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 09, 2024 09:40PM ET",
    "Updated Jan 09, 2024 09:47PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/north-koreas-kim-visits-arms-factories-amid-criticism-over-trade-with-russia-3270825",
  "paragraph": "By Hyunsu Yim SEOUL (Reuters) - North Korean leader Kim Jong Un visited arms factories this week, state media outlet KCNA reported on Wednesday as the United States and its partners condemned the country's arms transfers with Russia. Kim also highlighted recent \"shortcomings\" in the organisation of munitions production and called for readjustment while emphasizing the \"strategic importance of the production of major weapons\", state media said. KCNA photos of Kim's visit to a munitions factory showed him inspecting mobile short-range missile launch vehicles. His visit comes as nearly 50 countries condemned Russia's procurement and use of North Korean ballistic missiles against Ukraine. \"Russia’s use of DPRK ballistic missiles in Ukraine also provides valuable technical and military insights to the DPRK,\" the joint statement said on Tuesday, using the initials of North Korea's official name. White House national security adviser Jake Sullivan in a call with his South Korean counterpart, Chang Ho-jin, on Tuesday \"condemned in the strongest possible terms\" North Korea's transfer of the missiles to Russia, the White House said.  U.S. National Security Council spokesman John Kirby (NYSE:KEX) said on Tuesday that after the initially reported uses of North Korean ballistic missiles on Dec. 30 and Jan. 2, Russia had fired more such weapons at Ukraine, including one that landed in Kharkiv. The United States and its allies and partners will raise the issue with the U.N. Security Council on Wednesday, he said at a briefing.  Kim also said the time has come to define South Korea as a state \"most hostile\" towards his country, KCNA reported.  He accused Seoul of inciting confrontation and an arms buildup while urging his country to step up its military capabilities for self-defence and its nuclear war deterrent. He described worsening relations between the two Koreas as a \"new phase of change\" and \"unavoidable reality\". \n\"We would by no means unilaterally bring a great event by the overwhelming strength in the Korean peninsula but we have no intention of avoiding a war as well,\" the leader was quoted as saying. In remarks to a year-end party meeting last month, Kim said peaceful reunification is impossible, adding that the government would make a \"decisive policy change\" in relations with South Korea."
}