{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK020FS_L.jpg",
  "title": "Sierra Leone charges ex-president Koroma with treason over foiled coup",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 03, 2024 11:35AM ET",
    "Updated Jan 03, 2024 01:36PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/sierra-leone-charges-expresident-koroma-with-treason-over-foiled-coup-3266575",
  "paragraph": "© Reuters. Sierra Leone's former President Ernest Bai Koroma addresses an international observers briefing on Kenya's general election organised by the Independent Electoral and Boundaries Commission (IEBC) in Nairobi, Kenya August 11, 2022. REUTERS/Monicah Mwangi/ \nBy Umaru Fofana FREETOWN (Reuters) -Sierra Leone's ex-President Ernest Bai Koroma has been charged with four offences including treason for his alleged role in a failed military attempt to topple the West African country's government in November, a court in the capital Freetown said on Wednesday. The court's decision could escalate tensions in Sierra Leone coming after the attempted coup and a contentious election in which President Julius Maada Bio was reelected for a second term in June 2023. Tensions have been on the rise in the country that is still recovering from a 1991-2002 civil war in which more than 50,000 were killed.  The result of the election was rejected by the main opposition candidate, and questioned by international partners including the United States and the European Union. Gunmen on Nov. 26 attacked military barracks, a prison and other locations in Sierra Leone, freeing about 2,200 inmates and killing more than 20 people. The government said later that it was a foiled coup led mostly by Koroma's bodyguards. They summoned the ex-president for questioning at the start of December. The former president condemned the attacks in a statement shortly after they happened. Koroma's charges, which also include misprision of treason and two counts of harbouring, were read out while he stood in the dock and some of his supporters cried in the courtroom. \"A dangerous precedent has been set... We are dragging a former head of state - democratically elected - on trumped up charges under a political vendetta,\" Koroma’s lawyer, Joseph Kamara, told Reuters. A high court later on Wednesday granted bail to the former president, who is currently restricted at his home in the capital. The case was adjourned until Jan. 17.  According to Sierra Leone's penal code, a person found guilty of treason could face imprisonment for life. A letter from West Africa's main regional bloc, ECOWAS, dated Tuesday and seen by Reuters, said Nigeria had offered to host Koroma on a temporary basis, and that the former president had accepted the offer. Sierra Leone's foreign minister, Timothy Kabba, told Reuters the government had received the letter, which he said did not accurately reflect the meeting President Bio has recently held with an ECOWAS delegation in Freetown. \nKabba said the government will \"not countenance\" the proposal to relocate Koroma. Twelve other people also have been charged with treason in connection with the failed coup, including ex-police and correctional officers and a member of Koromoa's security detail, the government said on Tuesday."
}