{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBT080_L.jpg",
  "title": "Massive waves on California coast cause flooding, force evacuations",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 30, 2023 04:54PM ET",
    "Updated Dec 30, 2023 05:43PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/massive-waves-on-california-coast-cause-flooding-force-evacuations-3264912",
  "paragraph": "3/3\n© Reuters. Lifeguards patrol the waters off the coast of Del Mar, California as large ocean swells batter the coastline in California, U.S., December 30, 2023. REUTERS/Mike Blake\n2/3\n(Reuters) - Coastal communities in California faced another day of towering waves and possible flooding on Saturday as officials issued evacuation orders in some areas and warned residents to stay off beaches and coastal roadways.  The National Weather Service in Los Angeles forecast significant flooding in low-lying coastal areas with powerful waves and strong rip current posing an \"exceptional risk\" of drowning and damage to structures like piers and jetties. Waves as high as 20 feet (6.1 meters) could wreak more havoc on waterside homes in vulnerable communities along much of the California shoreline, which was battered by extreme surf and heavy rains over the end of the week. Officials in southern California's Ventura County issued an evacuation warning on Saturday for residences along the Pacific Coast Highway and area beaches remained closed, the Ventura County Fire Department said.  In the San Francisco Bay Area, forecasters said a coastal flood warning and high surf warning would remain in effect into early Saturday afternoon. Breaking waves of 26-30 feet were expected along west-facing beaches along the central and northern California coastline, it said.  \nVentura, about 65 miles (105 km) northwest of Los Angeles, was hit by the extreme weather conditions beginning on Thursday, when heavy surf inundated homes and businesses with seawater, sand and ocean debris, damaging structures and reportedly injuring at least eight people.  The treacherous surf and coastal flood threat was attributed to a Pacific storm system that also brought heavy downpours to much of the West Coast on Friday night, while coinciding with the latest arrival of exceptionally high tides known as king tides."
}