{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0O0PB_L.jpg",
  "title": "Chinese music student convicted in US of threatening pro-democracy activist",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 25, 2024 12:38PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/chinese-music-student-convicted-in-us-of-threatening-prodemocracy-activist-3283349",
  "paragraph": "© Reuters. FILE PHOTO: Xiaolei Wu, a citizen of China who at the time was a student at the Berklee College of Music in Boston, sits for an interview with the Federal Bureau of Investigation at its office in Chelsea, Massachusetts, December 14, 2022 in a still image \nBy Nate Raymond BOSTON (Reuters) - A Chinese music student was convicted on Thursday of U.S. charges that he harassed an activist who posted fliers at the Berklee College of Music in Boston supporting democracy in China and threatened to report her activities to Chinese law enforcement. A federal jury in Boston found Xiaolei Wu, 25, who sent the activist online messages saying he would chop off her hands and demanding she tear down her \"reactionary posters,\" guilty at the end of a four-day trial. His lawyers had argued Wu's comments were not threats but a \"misguided\" attempt during an \"immature\" online dispute to remind the activist, referred to in court as Zooey, of the consequences of her activism. But prosecutors said the messages led Zooey to fear for herself and her family in China, after Wu claimed he called in a tip to a Chinese public security agency about her advocacy. Wu was convicted of cyberstalking and threat charges and faces sentencing before U.S. District Judge Denise Casper on April 24. His lawyers did not respond to requests for comment. U.S. and Western authorities have been working to counter efforts by China's government to silence its critics abroad. Human rights groups have complained of threats to academic freedom and monitoring of Chinese students on international university campuses. Wu was charged in December 2022, two months after prosecutors say he launched a campaign to harass the activist. He did so after seeing a photo on Instagram the activist posted in October 2022 of a flier she had placed in a window near the private Boston-based music college that said \"We Want Freedom,\" \"We Want Democracy,\" and \"Stand with Chinese People.\" Wu in response posted on a 300-person chat of Chinese Berklee students and alumni on the social media app WeChat a demand that she take down the fliers.  \nProsecutors said he made additional threats via email and on Instagram and claimed to have called in a tip to a Chinese public security agency about her. Assistant U.S. Attorney Alathea Porter in her opening statement to jurors on Monday called that a serious threat, as the Chinese government does not allow the type of expression her fliers contained."
}