{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBR09C_L.jpg",
  "title": "Israeli raids in West Bank target Hamas funding",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 28, 2023 06:57AM ET",
    "Updated Dec 28, 2023 01:33PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/israeli-raids-in-west-bank-target-hamas-funding-3264313",
  "paragraph": "2/2\n© Reuters. Israeli soldiers operate in the Gaza Strip amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, in this handout picture released on December 28, 2023. Israel Defense Forces/Handout via REUTERS/File Photo\n2/2\nRAMALLAH (Reuters) - Israeli forces raided foreign exchange and money transfer agencies in Ramallah and other cities in the occupied West Bank on Thursday, seizing millions of dollars suspected of being intended to fund the Islamist group Hamas, the military said. At least one person was killed and 14 others were wounded in a clash between Israeli troops and Palestinians in the centre of Ramallah, the main city in the West Bank and the seat of the Palestinian Authority, the Palestinian health ministry said. An Israeli military statement said police, army and Shin Bet security personnel carried out the raids across the West Bank, making 21 arrests in Ramallah as well as Tulkarm and Jenin, in the northern West Bank and Hebron in the south. \"During the operation, terrorist funds were found and tens of millions of shekels, safes, documents, recording systems and telephones were confiscated,\" it said. As well as financial service providers, the operation also targeted cryptographic currencies, with a special cyber crimes unit taking part in the investigation, the military said. Clashes also broke out in several other locations. The Israeli military said its soldiers opened fire after explosives, petrol bombs and rocks were thrown at them. In Jenin, an Israeli aircraft fired on militants who had attacked troops, it said. Israeli security forces have stepped up raids across the West Bank since the Oct. 7 attack by Hamas in southern Israel and the subsequent Israeli offensive now raging in the Gaza Strip. Hamas, which seized power in the Gaza Strip in 2007, and other militant groups such as Islamic Jihad have steadily increased their reach in the West Bank, where they have growing popular support and millions of dollars in funding from Iran, according to Israeli officials. Prior to Oct. 7, Hamas militants had carried out a series of attacks on Israelis around West Bank settlements and Israeli forces had been carrying out raids on an almost daily basis but the level of intensity has picked up sharply in recent weeks. Attacks by Jewish settlers on Palestinians have also increased, drawing concern from the United States and other Western countries. According to the United Nations office for Human Rights (OHCHR) at least 4,785 Palestinians have been arrested since Oct. 7, with at least 291 killed in clashes with Israeli forces in the West Bank and East Jerusalem. An OHCHR report published on Thursday said there had been a \"rapid deterioration\" of human rights in West Bank. Most of the killings occurred during operations by Israeli security forces or confrontations with them, it said. OHCHR said it had also recorded mass arbitrary detentions, unlawful detentions, and cases of reported torture and other forms of ill-treatment of Palestinian detainees. A spokesperson for the Israeli Prime Minister's Office dismissed the report as \"ridiculous\" and \"outrageous\". She said Israel faced a major security threat in the West Bank and it would continue to arrest people to protect itself.  \nThe West Bank had already been experiencing the highest levels of unrest in decades during the 18 months preceding the Oct. 7 attack on Israel by Hamas. U.S.-brokered peace talks aimed at establishing a Palestinian state in the West Bank, the Gaza Strip and East Jerusalem broke down almost a decade ago. Prospects of their revival had already been dim before the war in Gaza."
}