{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0R02A_L.jpg",
  "title": "UN urges reversal of funding pause for Palestinian agency, vows accountability with staffers",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 28, 2024 05:29AM ET",
    "Updated Jan 28, 2024 12:55PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Benjamin USA",
        "2024-01-29 17:12:23",
        "The agency needs to be disbanded and the regular UN agency for dealing with refugees should take over.",
        "https://www.investing.com/members/200821892"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/un-urges-countries-to-reverse-funding-pause-for-palestinian-agency-3285230",
  "paragraph": "2/2\n© Reuters. Protesters wave Palestinian flags as they attend a demonstration demanding an immediate ceasefire in Gaza, as the conflict between Israel and the Palestinian Islamist group Hamas continues, in Bogota, Colombia, January 27, 2024. REUTERS/Luisa Gonzalez\n2/2\nBy Nidal al-Mughrabi and Emma Farge DOHA/GENEVA (Reuters) -U.N. officials urged countries to reconsider a pause in funding for the U.N. agency for Palestinians on Sunday, pledging that any staff found involved in Hamas' attack on Israel would be punished and warning that aid for some two million people in Gaza was at stake. At least nine countries, including top donors the U.S. and Germany, have paused funding for the UNRWA refugee agency after allegations by Israel that a dozen of its 13,000 staff in Gaza were involved in the Oct. 7 rampage. \"While I understand their concerns – I was myself horrified by these accusations - I strongly appeal to the governments that have suspended their contributions to, at least, guarantee the continuity of UNRWA's operations,\" U.N. Secretary-General Antonio Guterres said on Sunday, promising to hold to account \"any U.N. employee involved in acts of terror\". He said this could include criminal prosecution - a rare move within the global body since most staff enjoy functional immunity, although Guterres has the power to waive it.  Philippe Lazzarini, UNRWA commissioner-general, also urged countries to \"reconsider their decisions before UNRWA is forced to suspend its humanitarian response.\" A U.N. investigation into the Israeli allegations is underway. More than 26,000 people have been killed in Israel's military campaign against Hamas in Gaza, the enclave's health ministry said. With flows of aid like food and medicine into the territory just a trickle of pre-conflict levels, deaths from preventable diseases as well as the risk of famine are growing, aid officials say. Since the Oct. 7 attacks, which killed 1,200 people in Israel, most of Gaza's 2.3 million people have become more reliant on the aid UNRWA provides, including about one million who have fled Israeli bombardments sheltering in its facilities.  Responding to Guterres' statement, Israel’s U.N. Ambassador Gilad Erdan called on all donor states to suspend their support and demand an in-depth investigation into \"the involvement of all UNRWA employees in terror\". He added in a statement that Guterres' appeal for continued funding for the agency had \"proven once again that the security of the citizens of Israel is not really important for him\". Israel has not yet publicly given details of UNRWA staff members' alleged involvement in the attack on Israel. Guterres said 12 staff members had been implicated and that nine had been terminated, one was dead and the identities of the other two were being clarified. Israeli government spokesperson Eylon Levy told Reuters that to his knowledge the intelligence that led the U.S. to cut off its funding had not yet been declassified, but that an Israeli briefing would be dedicated to this topic later in the week. 'DO NOT STARVE CHILDREN'  Observers and aid workers said the move by the donors would exacerbate hunger. \"Donors, do not starve children for the sins of a few individual aid workers,\" said Jan Egeland, Secretary General of the Norwegian Refugee Council.  A U.N. appointed expert on the right to food, Michael Fakhri, warned that the funding cuts meant that famine was now \"inevitable\" in Gaza. Even before the conflict, UNRWA was struggling to secure funding and warned that it was on the verge of collapse. Many of its 13,000 staff members are refugees themselves and at least 150 have been killed since the Israel-Hamas conflict began. Palestinians expressed anger at the funding cuts. \"We used to say Israel was launching a war of famine against us in parallel to its war of destruction, now those countries who suspended the aid to UNRWA declared themselves partners in this war, and collective punishment,\" said Yamen Hamad, who lives at an UNRWA-run school in Deir Al-Balah in central Gaza Strip, after fleeing northern Gaza. \"UNRWA is our lifeline, who will give us food and drink after the war? May Allah help the people, what can I say,\" said another man, Raed Shaheen, standing next to a cart laden with blankets and bags outside the southern city of Khan Younis. Egyptian Foreign Minister Sameh Shoukry said he was \"surprised\" by the move to pause UNRWA funding and said it would lead to more suffering for Palestinians. The Turkish Foreign Ministry also urged countries that had paused funding to reconsider their move. UNRWA's role has long been criticised by Israel which alleges it has supported Hamas for years, an allegation the agency denies. Palestinian Authority President Mahmoud Abbas accused Israel of leading an oppressive campaign against the agency. \"The campaign aims to liquidate the issue of Palestinian refugees,\" he said in a statement. Senior Hamas official Sami Abu Zuhri said the Israeli accusations against UNRWA were a challenge to the International Court of Justice's decision on Friday that ordered Israel to prevent acts of genocide in Gaza.  There was no immediate sign of countries' heeding the U.N. call to reinstate aid. However, Norway and Ireland said they would continue funding the agency. “While I share the concern over the very serious allegations against some UNRWA staff, Norway has decided to continue its funding. UNRWA is a lifeline for millions of people in deep distress in Gaza as well as in the wider region,” Norwegian Foreign Minister Espen Barth Eide said on X, formerly Twitter. Israel has been strongly critical of the United Nations and in particular Guterres since early in the war.  \nIsrael's then foreign minister Eli Cohen said on Nov. 14 that Guterres was not fit to head the organisation, saying he had not done enough to condemn Hamas and was too close to Iran. UNRWA was set up to help refugees of the war at Israel's founding in 1948 and provides education, health and aid services to them in Gaza, the West Bank, Jordan, Syria and Lebanon."
}