{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0B01D_L.jpg",
  "title": "US political ad spending to grow 30% in 2024 amid digital boom",
  "category": "World news",
  "publisher": "Investing.com",
  "date": "Published Jan 11, 2024 08:49PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-political-ad-spending-to-grow-30-in-2024-amid-digital-boom-3272957",
  "paragraph": "© Reuters. Campaign signs are displayed on a table during an event for Republican presidential candidate and former U.S. President Donald Trump at the Machine Shed Restaurant ahead of the Iowa caucus vote where he is seeking the nomination as Republican presidential\nBy Sheila Dang (Reuters) - Spending on political advertising in the U.S. is expected to jump 30% this year from the last presidential election in 2020, partly driven by higher spending on digital platforms, research firm Insider Intelligence estimated on Thursday. Political candidates have larger advertising budgets, as polarized voters donate more to their picks and fundraising platforms make it easier to donate to multiple campaigns, said Peter Newman, forecasting director at Insider Intelligence.  Traditional television ads will continue to make up the majority of the estimated $12.3 billion to be spent on U.S. political advertising this year, the firm said. Broadcast TV remains favored in political advertising due to its ability to reach a broad audience.  Political ads are ramping up on the airwaves ahead of the Nov. 5 election. Supporters of Republican candidates Ron DeSantis and Nikki Haley aired attack ads targeting each other ahead of their head-to-head debate in Iowa on Wednesday. Digital platforms will see the largest growth among various platforms for political ads, with revenue rising 156% from 2020 to $3.46 billion this year, the firm estimated.  \nConnected TV, in which viewers can watch YouTube or Hulu on their TV sets, is driving digital growth because it allows for more granular ad targeting and can cost less than broadcast TV ads, Newman said.  \"It allows people with less funding to be able to reach the same screens,\" he said."
}