{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0F0J4_L.jpg",
  "title": "How to charge a phone in Gaza: patience required, sunshine helps",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 16, 2024 08:37AM ET",
    "Updated Jan 16, 2024 08:48AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/how-to-charge-a-phone-in-gaza-patience-required-sunshine-helps-3275174",
  "paragraph": "5/5\n© Reuters. Palestinians charge their devices outside the Emirati hospital, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, in Rafah in the southern Gaza Strip, January 15, 2024. REUTERS/Ibraheem Abu Mustafa\n2/5\nBy Saleh Salem and Ibraheem Abu Mustafa RAFAH, Gaza Strip (Reuters) - Huddling around a bewildering tangle of cables and extension leads plugged into a hospital power outlet, displaced Gazan men are pursuing a critical but elusive goal: getting their phones charged. In wartime Gaza, a charged phone is nothing less than a lifeline. It serves to check on loved ones after Israeli bombardments, helps find out where food and water might be available, and provides light in tents after darkness falls. \"Every day we come here for three or four hours and waste time to charge our phones,\" said Mohammed Abu Skheta, who fled with his family, including a baby boy, from Al-Shati refugee camp in northern Gaza to a tent in Rafah, southern Gaza. \"It's a dream to fully charge it. It's very difficult. You can charge it to 50 or 60%, 70% at most,\" he said. The charging spot outside the Emirati Hospital in Rafah is popular because it is free. The hospital allows displaced people to plug cables into its power sockets, which are fed either by solar panels or by a generator, when there is fuel for that. Elsewhere, some households or small businesses that have solar panels allow people to charge, but often for a fee, which not all can afford. \"My financial situation is difficult, so I have to look for an alternative, such as charging at a hospital or shop, without paying money,\" said Abu Skheta. Phones are not the only devices in need of regular charging. Mohamad Abu Taha, a barber in Rafah, said he was relying on a solar panel at the family home to recharge his electric razor in between jobs. \"For almost every haircut, I send my nephew to charge the razor. I have to inform the customer that if it's sunny I can work, if not then I cannot,\" he said. One tailor in Rafah has got around the lack of electricity by converting a dismantled child's bicycle into a pedal dynamo to power his sewing machine. NO PLACE TO CHARGE The war in Gaza started when Hamas militants stormed into southern Israel on Oct. 7, killing 1,200 people and kidnapping 240 hostages, of whom more than 130 are still being held captive, according to Israel's tally. Vowing to destroy Hamas, Israel has responded with a siege, bombardment and ground invasion of Gaza which have killed more than 24,000 Palestinians, according to Gaza health officials. Most of the population is displaced, and severe shortages of food, water, electricity and medicines have resulted in a humanitarian catastrophe, according to the United Nations. Charging a phone has become one of the challenges of daily life, as time-consuming and frustrating as the search for bread or water. \"We came here to charge, but there is no place,\" said Mahmoud Marouf, who is displaced from Jabalia in northern Gaza, and had brought a battery similar to the ones in cars to the charging spot at the Emirati Hospital. Alongside phones, people bring such batteries to charge so that they can then power devices they need in their tents. Volunteers at the hospital organise a rota allowing people to charge for a certain period of time. The system helps avoid tensions by giving access to precious sockets to as many people as possible, but demand is too high to satisfy everyone. Marouf said he needed to charge his battery to power medical devices for his children, who have respiratory conditions. \"We got them a large battery and came to charge it, because hospitals are full,\" he said. Despite the tedium, those lucky enough to have a spot waited patiently for their phones to charge as much as possible. \n\"It lasts us for one day, or one day and a half at most, not more. We use it for lighting only,\" said Mohamad Al-Shamali, who is displaced from Gaza City. \"Calls and telecoms are down so we don't have internet. We try as much as we can to secure lighting, to see the roads we are walking on and inside the tent we are in, no more than that.\""
}