{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0E0EU_L.jpg",
  "title": "WHO appeals for $1.5 billion to address crises from Gaza to Afghanistan",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 15, 2024 10:08AM ET",
    "Updated Jan 15, 2024 10:51AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/who-appeals-for-15-billion-in-funding-to-address-health-crises-3274432",
  "paragraph": "© Reuters. FILE PHOTO: World Health Organization logo is reflected in a drop on a syringe needle in this illustration photo taken March 16, 2021. Picture taken March 16, 2021. REUTERS/Dado Ruvic/Illustration/File Photo\nGENEVA (Reuters) - The World Health Organization (WHO) on Monday appealed for $1.5 billion in funding to respond to the health needs of millions of people caught up in dozens of humanitarian crises around the globe, from Ukraine and Gaza to Afghanistan. \"We aim to reach some 87 million people with life-saving humanitarian assistance this year,\" said WHO Director General Tedros Adhanom Ghebreyesus.  \"To do this, we need support totalling $1.5 billion, and we need this funding to arrive as early as possible and with as much flexibility as possible... A reactive approach is not enough.\" Tedros said an estimated 166 million people would require health assistance around the world this year, including in the occupied Palestinian territories, Ukraine, Haiti and Sudan. The health emergency requiring the most is taking place in the occupied Palestinian Territories - and Gaza in particular - where Israeli forces have carried out a relentless assault against the enclave in response to a deadly rampage by Hamas gunmen in southern Israel on Oct. 7. WHO said it required $219 million to meet critical needs there for a period of three to six months, depending on the evolution of the conflict.  The other two global health emergencies requiring the most funding are COVID and the situation in Afghanistan, where 23.7 million people urgently need access to clean water and sanitation, WHO said. \nThe resurgence of cholera around the globe, which Tedros said was \"especially concerning\", requires funding of nearly $50 million, while WHO's health response in Ukraine needs $77 million. \"The cost of inaction is one the world cannot afford,\" Tedros said."
}