{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK1010Y_L.jpg",
  "title": "Trump campaign outraised by Biden, legal bills a drag",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 31, 2024 08:22PM ET",
    "Updated Jan 31, 2024 11:20PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/trump-election-campaign-raised-19-million-in-q4-disclosure-3289113",
  "paragraph": "© Reuters. Signs supporting Former U.S. President Donald Trump stand ahead of the South Carolina Republican presidential primary election in Bonneau, South Carolina, U.S., January 31, 2024. REUTERS/Shannon Stapleton\nBy Jason Lange and Alexandra Ulmer WASHINGTON (Reuters) -Republican presidential candidate Donald Trump's fundraising slowed in the last three months of 2023 and he was outraised by his likely general election rival, Democrat Joe Biden, disclosures submitted to the Federal Election Commission showed on Wednesday. The disclosures also showed the heavy drag Trump's legal expenses have become, with the biggest super PAC supporting the former president sending nearly two-thirds of what it raised in the second half of 2023 to a separate Trump group that has been paying his legal bills. Trump's election campaign reported raising $19 million during the last three months of 2023, down from under $25 million in the third quarter and well under the $33 million reported by Biden's campaign. Trump did slightly outraise Nikki Haley, his only remaining opponent in the Republican presidential nomination contest, who reported raising $17 million in the fourth quarter.  While Haley has vowed to carry on after defeats in the Iowa and New Hampshire nominating contests this month, Trump is on track to clinch the Republican nomination to face Biden in the November general election.  That comes despite four pending criminal cases this year, including two over his efforts to reverse his 2020 presidential election loss and one over his handling of classified documents upon leaving office. Trump's legal fees appeared to drag on the finances behind his election effort. The largest super PAC supporting the former president, a group known as MAGA Inc, sent $30 million to a separate Trump group known as Save America, which has been paying the former leader's legal bills, during the second half of 2023 - more than twice what it had sent in the first half of 2023.  The $30 million transfer is also a sizable portion of the $48 million MAGA Inc raised in the second half of the year, meaning less money for MAGA Inc to spend backing Trump's election efforts.  Save America's legal spending accelerated in the second half of 2023, when it reported spending more than $25 million on legal expenses, according to a Reuters analysis of its latest filing. In the first half of the year, the committee reported spending around $22 million on legal matters.  To be sure, Trump has shown he can win elections when outspent by rivals, even when some big anti-Trump donors have tried to stop him this cycle.  In the months leading up to this month's Republican nomination contests in Iowa and New Hampshire, for example, MAGA Inc was outspent by a deeply-funded super PAC supporting Haley, though Trump easily won both contests. Major donors to the biggest pro-Haley super PAC, known as SFA Fund, include hedge fund billionaires Ken Griffin and Paul Singer, who each gave $5 million during the second half of 2023, disclosures showed on Wednesday. Top donors to the pro-Trump super PAC included oil and gas billionaire Tim Dunn, who gave $5 million. \nTrump's campaign ended last year with about $33 million in the bank, compared with nearly $46 million for Biden's campaign.  Haley's campaign had just under $15 million."
}