{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0C09M_L.jpg",
  "title": "Relatives recount Gaza deaths as protesters in Washington demand ceasefire",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 13, 2024 05:23PM ET",
    "Updated Jan 13, 2024 07:17PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/relatives-recount-gaza-deaths-as-protesters-in-washington-demand-ceasefire-3274010",
  "paragraph": "5/5\n© Reuters. People protest following the U.S. and Britain strikes across Yemen against Iran-backed Houthi forces, at a rally in Seattle, Washington, U.S., January 12, 2024. REUTERS/David Ryder\n2/5\nBy Michael Martina and Ismail Shakil WASHINGTON (Reuters) - Family members of Palestinians killed in Israel's military campaign in Gaza shared grief-ridden stories with thousands of protesters who gathered in downtown Washington on Saturday demanding an immediate ceasefire. In one of the largest pro-Palestinian demonstrations to date in the U.S. capital, the protesters repeated their call for U.S. President Joe Biden to stop sending arms to Israel and chanted \"free Palestine\" and \"ceasefire now.\" Some people chanted: \"From the river to the sea, Palestine will be free\" - a slogan that critics interpret as a call for the elimination of Israel. Adam Abosherieah, one of the speakers, said over 100 family members, including his 83-year-old father, mother, and brother, have been killed in Israeli air strikes. \"Dozens of my family members' bodies are still under the rubble,\" Abosherieah, a pharmacist from New Jersey, said. \"President Biden can easily put a stop to this genocide ... He can easily pick up the phone and call Israel to stop this madness.\" Other speakers included Randa Muhtaseb, who said she lost 36 family members in Gaza, and Alaa Hussein Ali, who spoke about over 100 of his relatives killed in Israeli attacks. Reuters could not independently verify these figures. The latest escalation in the Gaza conflict followed an attack on Israel on Oct. 7 by the Palestinian Islamist group Hamas, which Israel said killed 1,200 people. Israel's subsequent assault on Hamas-governed Gaza has killed more than 23,000 Palestinians, about 1% of the 2.3 million population there, according to Gaza's health ministry. Israel and the U.S. deny allegations of a genocide in Gaza. South Africa has officially pressed those charges against Israel at the International Court of Justice. Washington and Israel have also argued a ceasefire will benefit Hamas and have resisted such calls. The war has led to protests in many parts of the U.S., including near airports and bridges in New York City and Los Angeles, vigils outside the White House, and marches in Washington near the U.S. Capitol. On Saturday, protesters came to Washington from different parts of the country and echoed concerns about Biden's military support for Israel. \"We cannot tolerate this, we cannot allow our money to be used to murder children across the world ... that money could be used over here for good causes,\" said Suhail Mustafa, a protester from Cleveland. Though long a fervent supporter of Israel, Biden has expressed concern over civilian deaths as the war has gone on. Biden has previously described Israel's bombing campaign as \"indiscriminate,\" and said on Monday he had been working \"quietly\" with the Israeli government to encourage it to reduce its attacks and \"significantly get out of Gaza.\" Mohammed Kaiseruddin, 79, who flew in from Chicago for the protest, was holding a sign that read: “Freedom for Gaza and the West Bank.” “The Biden administration has truly disappointed everyone,” said Kaiseruddin, who described himself as typically voting for Democrats. “They seem to have lost their sense of humanity. When it comes to Palestine and Israel, his values are upside down completely.”  \nAnother protester, Judy Johnson, said she resigned from the Democratic Party over U.S. military support for Israel, although she added she would still vote for Democrats in the November U.S. presidential elections if the choice was between Biden and Republican rival former President Donald Trump. \"I don't think people see an alternative to Trump, so they'll vote for Biden,\" Johnson said."
}