{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0R02F_L.jpg",
  "title": "More Palestinians displaced as Israel battles Hamas in south Gaza",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 28, 2024 06:12AM ET",
    "Updated Jan 28, 2024 03:57PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/more-palestinians-displaced-as-israel-battles-hamas-in-south-gaza-3285247",
  "paragraph": "© Reuters. Israeli soldiers operate in the Gaza Strip amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, in this handout picture released on January 28, 2024. Israel Defense Forces/Handout via REUTERS \nBy Nidal al-Mughrabi and Ibraheem Abu Mustafa DOHA/GAZA (Reuters) -Medical facilities are at risk of collapse in Khan Younis, the southern Gaza city now at the focus of Israel's offensive, the Gaza Health Ministry warned on Sunday, as fighting raged across the Palestinian enclave. Residents said Israeli planes and tanks also pounded areas in Gaza City to the north, where Israel has been pulling out troops. The fighting could be heard in the nearby towns of Beit Lahiya and Jabalia, near to Gaza City. Israel's military said it was engaged in \"intensive battles\" in Khan Younis, where it said troops \"eliminated terrorists and located large quantities of weapons\". The armed wing of Hamas and the Islamic Jihad said fighters clashed with Israeli troops in several areas across the enclave overnight. Hamas' armed wing said its fighters destroyed two Israeli tanks in Khan Younis. The latest fighting came as U.N. officials and aid groups urged countries to reconsider their decision to pause funding for the U.N. refugee agency for Palestinians, a vital source of aid in Gaza. At least nine countries have paused funding following allegations by Israel that a dozen of UNRWA's staff were involved in the Oct. 7 Hamas attacks on Israel. Gaza Health Ministry spokesperson Ashraf Al-Qidra said 165 Palestinians were killed and 290 wounded in the past 24 hours, bringing the total killed in Israeli strikes since the war began to 26,422. Officials in the Hamas-ruled territory do not distinguish between militants and civilians in their count. Israel says it has lost 220 soldiers in the ground offensive and has killed 9,000 Gaza fighters, a figure that Hamas has dismissed. One strike on a house in a suburb of Gaza City killed eight people, health officials said. As night fell, Palestinian health officials said the number of Palestinians killed in an Israeli air strike on a multi-floor house in the Al-Nusseirat refugee camp in central Gaza rose to 20. The Israeli military said they were checking the report. In western Gaza City, residents said Israel naval boats opened fire on beachfront areas, but no injuries were reported. In other parts of the enclave, residents reported intensified fighting amid heavier Israeli aerial attacks. Israel launched a war it says aims to eliminate Hamas after the militants' unprecedented cross-border assault, in which 1,200 people were killed and 253 abducted, according to Israeli officials. The Israeli military declared a closed military zone at the Kerem Shalom crossing into Gaza after right-wing demonstrators and some families of hostages tried to stop aid from going into the enclave, saying it was merely helping Hamas. Protests in Israel demanding that the government do more to secure the hostages' release have been spreading, as little progress has been seen in ceasefire talks mediated by Egypt and Qatar since November amid disputes between Israel and Hamas. HEALTHCARE SYSTEM FAILURE Palestinian medics and residents said Israel continued to bomb areas around the two main hospitals in Khan Younis, hindering efforts by rescue teams to respond to desperate calls from people caught in the Israeli bombardment. “There is a complete failure of the healthcare system at Nasser and Al-Amal hospitals,\" said Qidra. Israel says it is taking steps to keep hospitals running and minimise civilian casualties. It accuses Hamas of operating in densely populated areas, including around hospitals, and using civilians as human shields and has released photos and videos supporting this allegation, which the Islamist group denies.  The Palestinian Red Crescent Society said in a statement that medical teams at Al-Amal Hospital in Khan Younis would be unable to perform surgeries because oxygen supplies were depleted. More families were displaced from Khan Younis on Sunday. Some people took dirt roads to get closer to the city of Rafah along the border with Egypt or Deir Al-Balah to the north. Others headed west to an area called Al-Mawasi where residents described being crammed into a small area. \"It is as crowded as it can get,\" said electrician Abu Raouf, a father of four. \"People have lost their ability to think, their ability to feel, they are moving like robots, it is just a matter of time before Israel sends tanks into here as well, there is no place safe.\" \nReem Abu Tair left Khan Younis in the cold with three children, one of them an infant. \"We managed to save our lives, we escaped bombings and the destruction that is surrounding us only to end up in the cold. So, if a child does not die from the bombing, he will die from the cold,” Abu Tair said. (Reporting and writing by Nidal al-Mughrabi in DohaAdditional reporting by Ibraheem Abu Mustafa in Gaza and Ari Rabinovitch and Lee Marzel in JerusalemEditing by Frances Kerry, William Maclean)"
}