{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "Four dead in Arizona hot air balloon crash",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 15, 2024 08:18PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/four-dead-in-arizona-hot-air-balloon-crash-3274532",
  "paragraph": "By Daniel Trotta (Reuters) - Four people including the pilot died and another person was critically injured when their hot air balloon crashed into the Arizona desert on Sunday after eight skydivers had successfully jumped out of the basket, investigators said. The Kubicek BB 85 Z balloon went down on Sunday in Eloy, about 65 miles (100 km) southeast of Phoenix, the U.S. National Transportation Safety Board said in a statement on Monday. The cause remained under investigation. \"The balloon impacted desert terrain following an unspecified problem with its envelope,\" the NTSB said, referring to the outer bag of the balloon. An initial inspection found no mechanical anomalies as both the balloon and basket appeared to be intact, the NTSB said, adding that the envelope would be inspected later. An electronic device containing flight information and a video camera have been sent to NTSB headquarters in Washington for further analysis, the NTSB said. \"It is important to clarify that the skydiving was intentional and was successfully completed by all skydivers before any issues with the hot air balloon were evident,\" the Eloy Police Department said in a statement. Police identified the four dead as Chayton Wiescholek, 28, from Union City, Michigan; Kaitlynn Bartrom, 28, from Andrews, Indiana; Atahan Kiliccote, 24, from Cupertino, California; and  the pilot, Cornelius Van Der Walt, 37, a South African national living in Eloy. Survivor Valerie Stutterheim, 23, of Scottsdale, Arizona, was in critical condition, police said.  The company operating the flight, Droplyne Hot Air Balloon Rides, had a perfect safety record, according to its website. Company representatives did not immediately respond to requests for comment. Droplyne said it conducts daily flights that rise up to 10,000 feet (3,000 meters) elevation from either the Eloy area of Arizona or Moab, Utah, depending on the time of year."
}