{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0G0IL_L.jpg",
  "title": "Iran foreign minister in Davos: Attacks on Israel will end if Gaza war stops",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 17, 2024 09:08AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/iran-foreign-minister-in-davos-attacks-on-israel-will-end-if-gaza-war-stops-3276348",
  "paragraph": "© Reuters. FILE PHOTO: Iranian Foreign Minister Hossein Amirabdollahian attends a side event during an event commemorating the 75th Anniversary of the Universal Declaration of Human Rights, amid the ongoing conflict between Israel and the Palestinian Islamist gro\nDAVOS, Switzerland (Reuters) -Iran's foreign minister said on Wednesday that attacks against Israel and its interests by the \"Axis of Resistance\" will stop if the Gaza war ends, warning that the conflict could heighten tensions across the Middle East. The Islamic Republic backs Palestinian Islamist group Hamas in its war with Israel, which has devastated Gaza in an aerial and ground offensive, and Tehran accuses the United States of backing what it calls Israeli crimes in Gaza. \"An end to the genocide in Gaza will lead to an end of military actions and crises in the region,\" Amirabdollahian said at the World Economic Forum in Davos. \"The security of the Red Sea is tied to the developments in Gaza, and everyone will suffer if Israel's crimes in Gaza do not stop ... All the (resistance) fronts will remain active.\"  U.S. President Joe Biden on Friday called Yemen's Iran-backed Houthi forces a \"terrorist\" group, after American and British warplanes, ships and submarines launched dozens of air strikes across Yemen overnight. The Houthi militia, which has been targeting Red Seas shipping in what it calls solidarity with Palestinians against Israel, has threatened a \"strong and effective response\" to the U.S. and British strikes. \nAmirabdollahian also said t Tehran shared intelligence with Iraq about what it said were activities of the Israeli intelligence agency Mossad in the Iraq's semi-autonomous Kurdish region. Iran has said its Revolutionary Guards attacked Israel's \"spy HQ\" in Iraq in the city of Erbil on Monday. Iraq later denied that there was any such spy centre in the country. (additional reporting by Elwely Elwelly; writing by Parisa Hafezi; editing by Andrew Heavens and Mark Heinrich)"
}