{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "US labor board tees up union election for Dartmouth College basketball players",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 05, 2024 06:57PM ET",
    "Updated Feb 05, 2024 07:05PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-labor-board-tees-up-union-election-for-dartmouth-college-basketball-players-3293306",
  "paragraph": "By Daniel Wiessner (Reuters) - A U.S. labor board official on Monday said men's basketball players at Dartmouth College, an Ivy League school in New Hampshire, are the school's employees and can vote on whether to join a union.  The ruling by Laura Sacks, a regional director with the National Labor Relations Board (NLRB) in Boston, sets the stage for what could be the first successful unionization bid in college athletics and comes amid a broader effort to roll back restrictions on compensation for student athletes.  Sacks said Dartmouth's basketball program generates publicity, alumni engagement and financial donations and that the school controls the work performed by players, making them its employees under U.S. labor law. \"While students at Dartmouth take part in many extracurricular activities, major media outlets do not pay for the right to broadcast and distribute video of the vast majority of those activities,\" Sacks wrote in a 26-page ruling. The ruling was on a petition by an affiliate of the Service Employees International Union seeking to hold a vote for the players to unionize. Sacks did not set a date for an election to be held. Dartmouth can appeal the decision to the five-member NLRB, but that would not prevent the vote from being held.  Dartmouth and the Service Employees International Union affiliate did not immediately respond to requests for comment. The decision is the first of its kind since NLRB General Counsel Jennifer Abruzzo issued a memo in 2021 arguing that many college athletes should be classified as schools' employees.  Abruzzo, an appointee of President Joe Biden, said at the time that her office would bring complaints against colleges that interfere with players' organizing efforts. The University of Southern California last May was hit with a complaint from Abruzzo's office claiming it has blocked student athletes from unionizing by not treating them as the school's employees.  Dartmouth, like other Ivy League schools, does not provide athletic scholarships to students.  But Sacks in her decision on Monday found that Dartmouth basketball players are compensated in other ways, such as early admission prior to graduating high school, equipment and apparel, tickets to games and lodging and meals."
}