{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0O0LV_L.jpg",
  "title": "Gaza starves as Israel presses war on Hamas",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 25, 2024 10:18AM ET",
    "Updated Jan 25, 2024 06:33PM ET"
  ],
  "comments": [
    1,
    [
      [
        "jew in exile israel",
        "2024-01-26 05:56:53",
        "So why won't they call on Hamas to surrender? That would immediately end this war.",
        "https://www.investing.com/members/255929742"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/gaza-starves-as-israel-presses-war-on-hamas-3283204",
  "paragraph": "© Reuters. Palestinian children carry pots as they queue to receive food cooked by a charity kitchen, amid shortages in food supplies, as the conflict between Israel and Hamas continues, in Rafah in the southern Gaza Strip December 14, 2023. REUTERS/Saleh Salem/File\nBy Arafat Barbakh and Emma Farge GAZA/GENEVA (Reuters) - In battered, hard-to-reach north Gaza, rare aid deliveries get mobbed by desperate, hungry Palestinians and aid workers report seeing people thin and visibly starving with sunken eyes.  Hunger stalks the entire Gaza Strip, the tiny enclave where 2.3 million people have been living under Israel's bombardment since Oct. 7 as it battles Hamas militants. The United Nations warned this week that pockets of the territory face famine.  While areas near the Egyptian border get limited supplies of imported food, people in the north and centre of the strip, where fighting has been fiercest, face catastrophe aid workers say.  \"The food situation in the north is absolutely horrific. There's almost no food available and everybody we talk to begs for food,\" said Sean Casey, a World Health Organization (WHO) coordinator in Gaza.  No comprehensive data on hunger is available for Gaza, with aid agencies struggling to move and communicate amid the fighting. They plan to assess malnutrition by measuring around children's arms for signs of wasting flesh.  A U.N.-backed report in December said the whole population of Gaza faced crisis levels of hunger and a growing risk of famine. Medics in Gaza hospitals describe babies born sick to malnourished mothers, infants losing weight, mothers unable to produce breast milk and injured patients too weak from hunger to fight off infection.  In a Rafah hospital ward, paediatric doctor Jabr al-Shaer pointed to a baby whose weight had plummeted to 5.5 kg (12 pounds) from 7.5 kg a month and a half ago.  \"This is bad. It impacts his immunity. He constantly has inflammation in the chest and gastroenteritis,\" he said.  His mother, Shoruq Shaaban, who is breastfeeding her baby, has little to eat herself. Like most other people in southern Gaza she now lives on a little bread and canned food.  MALNOURISHED  The U.N. children's agency UNICEF projects that over the coming weeks more than 10,000 children in Gaza risk wasting, one of the most serious results of malnutrition, which can stunt physical growth and brain development.  \"We saw a lot of very thin people just sitting around and staring into space looking wasted,\" said Nick Maynard, a British surgeon who worked in central Gaza in December and early January with the charity Medical Aid for Palestinians.  \"There was very clear evidence of people who were now malnourished,\" he said.  Ayadil Saparbekov, a WHO doctor who was recently in northern Gaza, said he had particularly seen children and elderly people showing signs of wasting, and described people coming to beg for food, raising hands to mouths to mime eating.  \"I saw children on the streets who were visibly malnourished by the look on their faces. They were visibly thin. Their hands were thin and they had sunken eyes,\" he said, estimating that two or three of every 10 children he saw there matched that description. At the start of the war, after a Hamas assault that killed more than 1,200 people, Israel announced it was cutting off all supplies to Gaza. It later agreed to let in humanitarian aid but far less is entering the enclave now than before Oct 7. Israel's military campaign in Gaza has killed at least 25,700 Palestinians since Oct. 7, health authorities in the Hamas-run enclave say.  Aid agencies say Israeli checks are hampering aid deliveries into Gaza and that the military prevents distribution outside the southern area around Rafah.  Israeli government spokesperson Eylon Levy has denied there are limitations on humanitarian aid entering Gaza and ascribed any problems to U.N. distribution capacity.  However, World Food Programme spokesperson Abeer Etefa said there was a \"systematic limitation\" on aid getting to the north and the U.N. humanitarian agency OCHA said Israel had only permitted about a quarter of planned aid deliveries there.  DESPERATION  Spokeswoman Juliette Touma said UNRWA, the U.N. aid agency for Palestinians, believed as many as 200,000 people remained in the north. Social media videos that Reuters has verified have shown chaotic scenes as crowds of desperate people rush for aid deliveries. Maynard, the British surgeon, described a boy of seven or eight years old approaching him in the hospital wanting food. \"He said all his family had been killed and he hadn't eaten for three days,\" he said.  Even in the south, people lack enough food and Gaza residents say they have taken to grinding animal feed to bake dry, barely edible bread.  Palestinians Reuters interviewed said they often went days without eating or could only eat once a day. What food was commercially available was often unaffordable.  The biggest threat in Gaza was severe acute malnutrition which occurs when people cannot get the right vitamins, minerals and proteins for the body to function, said Heather Stobaugh of Action Against Hunger, with children at highest risk of dying. \nBefore the war, Mariam from Gaza City fed her family a breakfast of eggs, milk, cheese, beans, falafel, hummus, tomato, cucumber and bread. At best they now have a piece of flatbread with some powdered thyme. Lunch or supper is now a small portion of canned sardines or tuna split among many people. They skip the other meal. She recently found eggs in the market for the first time in months - and paid more than four times what they used to cost. \"The children were so happy they laughed and jumped,\" she said."
}