{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0100N_L.jpg",
  "title": "Mexican Zapatista rebel group celebrates anniversary of anti-globalization uprising",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 01, 2024 08:41PM ET",
    "Updated Jan 01, 2024 08:46PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/mexican-zapatista-rebel-group-celebrates-anniversary-of-antiglobalization-uprising-3265164",
  "paragraph": "5/5\n© Reuters. Captain Insurgent Marcos of the EZLN, formerly known as Sub Commander Marcos, attends the celebration of the 30th anniversary of the Zapatista National Liberation Army uprising at the autonomous community of Caracol Dolores in Ocosingo, Chiapas, Mexico Ja\n2/5\nBy Quetzalli Nicte-Ha and Gabriela Sanabria CARACOL DOLORES HIDALGO, Mexico (Reuters) - Mexican revolutionary indigenous group, Zapatista Army for National Liberation, is celebrating the 30th anniversary of their armed uprising that ended up becoming an early symbol for the supporters of the anti-globalization movement. In 1994, Subcomandante Marcos led armed insurgents in the poor, southern state of Chiapas in a \"declaration of war\" against the government the day it opened borders to free trade. Named for Mexican revolutionary hero Emiliano Zapata, the EZLN, as the group is known, and Zapatista communities invited others to join them and celebrate what they described as the \"anniversary of the beginning of the war against oblivion\". Captain Insurgent Marcos, formerly known as Sub Commander Marcos and other identities, appeared to have made an appearance on Monday afternoon at the celebration.  His face was disguised by his trade mark ski mask as he was smoking a pipe. An enigma, the former rebel leader had not been seen in public for years. Reuters was unable to independently verify his identity. The four-day celebration, ending Tuesday, pays homage with theatre, dance and poetry to those who fought in the 12-day battle with the Mexican army that claimed at least 140 lives.  Back then, the uprising had thrilled leftists around the world and won Sub Commander Marcos comparisons with Cuban revolutionary legend Ernesto \"Che\" Guevara.  During the celebrations, many women wore dresses embroidered with colorful flowers and lace ornaments characteristic of their different indigenous communities. Other women, as well as many men, were dressed in military-style uniforms.  Nicolas Bautista said she had traveled to Chiapas from Michoacan state because her Purepecha community faced many of same the challenges as other indigenous from across the country.  \n\"We're all going to defend ourselves, we're going to defend our Mother Earth,\" he said. \"We're not fighting for anything other than respect for our practices and customs.\"  Chiapas remains one of the poorest states in the country."
}