{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0N0CH_L.jpg",
  "title": "Russia accuses Ukraine of killing 65 of its own PoWs by shooting down plane",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 24, 2024 08:23AM ET",
    "Updated Jan 25, 2024 12:46AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Ken Roth",
        "2024-01-24 18:21:55",
        "If a russian moves his lips the whole world knows he is lying.",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/russia-accuses-ukraine-of-killing-65-of-its-own-pows-by-shooting-down-plane-3281786",
  "paragraph": "2/2\n© Reuters. A Russian military transport plane crashes near Yablonovo, Belgorod Region, Russia, January 24, 2024, in this screen grab from a social media video obtained by REUTERS \n2/2\nMOSCOW (Reuters) -Russia accused Ukraine on Wednesday of deliberately shooting down a Russian military transport plane carrying 65 captured Ukrainian soldiers to a prisoner exchange in what it called a barbaric act of terrorism that had killed a total of 74 people.  Ukraine did not directly confirm it had shot down the Ilyushin Il-76 military transport plane, which was downed near the Russian city of Belgorod near the Ukrainian border, and challenged key parts of Moscow's narrative. Nor did it confirm that Ukrainian prisoners were on board. Ukrainian President Volodymyr Zelenskiy, in his evening address said greater clarity was needed about what happened, paticularly when it came to who was on board. \"It is clear that the Russians are playing with the lives of Ukrainian prisoners, the feelings of their loved ones and the emotions of our society,\" he said. Russian President Vladimir Putin has yet to comment on the incident.  Video footage posted on Telegram by Baza, a channel linked to Russian security services, and verified by Reuters, showed a large aircraft falling to the ground near the village of Yablonovo in Belgorod region and exploding in a fireball. The Russian defence ministry said six Russian crew members and three Russian soldiers had been on board too and that the prisoner exchange with Ukraine had been due to take place on Wednesday afternoon at a border checkpoint. It said Ukraine knew a transport plane carrying the captured Ukrainian soldiers was expected at the Belgorod airfield. Russian radar operators had detected the launch of two Ukrainian missiles at the time of the crash, it said.  \"By committing this terrorist act, the Ukrainian leadership has showed its true face. It disregarded the lives of its own citizens,\" the ministry said in a statement. Ukraine's GUR military intelligence agency confirmed a swap was meant to take place, but said it had not been told of how Russia would bring the prisoners to the handover point and said Ukraine had not been asked to ensure airspace security around Belgorod unlike previous swaps.  \"On this basis, we may be talking about planned and deliberate actions by Russia to destabilise the situation in Ukraine and weaken international support for our state,\" GUR said in a statement on Telegram. Without confirming it had shot down the plane, the Ukrainian military said it would continue to destroy Russian military transport aircraft it believed were carrying missiles with which to strike Ukraine. It said it had noticed more Russian military transport aircraft landing in Belgorod, something it linked to Russian missile strikes on Kharkiv and other Ukrainian cities. Air Force Commander Mykola Oleshchuk said:  \"Ukraine has the right to defend itself and destroy the means of the aggressors' aerial attack.\"  Russian Foreign Minister Sergei Lavrov called for a meeting of the U.N. Security Council and said Russia sought to establish \"the reasons behind the Ukrainian criminal act\". A French spokesperson at the U.N. said the meeting would be held at 1700 (2200 GMT) on Thursday. If the details are confirmed, it would be the deadliest incident of its kind inside Russia's internationally recognised borders during the almost two-year-old war. PRISONER SWAP Ukraine's military intelligence agency said Kyiv had upheld the terms of the planned prisoner swap and that the captured Russian servicemen involved had been delivered to the agreed exchange point on time and were safe. It added: \"Landing a transport plane in a 30-km combat zone cannot be safe and in any case must be discussed by both sides, because otherwise it jeopardises the entire exchange process.\"  It said it had no reliable information about who was on the downed plane. Russian state media published a list of names of the 65 captured Ukrainian soldiers it said were on board along with their dates of birth, which some Ukrainian media said included some names of people who had already been exchanged. The list could not be verified by Reuters.  Moscow and Kyiv have regularly swapped prisoners since Russia began what it calls its \"special military operation\" in Ukraine in February 2022.  Andrei Kartapolov, a member of Russia's parliament and a retired general, told the SHOT news outlet it was impossible for operators of Ukrainian surface-to-air missile systems to mistake transport planes for military planes or helicopters as targets. \"It was done deliberately to sabotage the prisoner exchange,\" Kartapolov said of the downing. He said a second Russian Il-76 transport plane carrying around 80 Ukrainian soldiers to the exchange had managed to turn around.  \nKartapolov, who has close links to the Russian defence ministry, said the plane had been downed by three missiles of either U.S. or German manufacture.  The Belgorod region, which borders Ukraine, has come under frequent attack from Ukraine in recent months, including a December missile strike which killed 25 people."
}