{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK060B4_L.jpg",
  "title": "Top US Congress Democrat, Republican reach spending deal, starting race to pass it",
  "category": "Economy",
  "publisher": "Reuters",
  "date": [
    "Published Jan 07, 2024 03:34PM ET",
    "Updated Jan 08, 2024 12:11AM ET"
  ],
  "comments": [
    12,
    [
      [
        "Charles Manson",
        "2024-01-09 02:51:37",
        "No deal until the votes are counted.",
        "https://www.investing.com/members/249519852"
      ],
      [
        "Tre Hsi",
        "2024-01-08 09:16:06",
        "nearly $900B in defense spending in just one year, and you wonder why we have a $30T national debt?",
        "https://www.investing.com/members/203741693"
      ],
      [
        "Barry Nickerson",
        "2024-01-08 11:54:38",
        "The price went up for those all expense paid trips to the abortion clinics, and those sex change procedures along with the drug treatments aren't cheap.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Maximus Maximus",
        "2024-01-08 12:11:05",
        "sub.. you need to get off that rightwing-koolaid before your brain stops functioning altogether...",
        "https://www.investing.com/members/204570756"
      ],
      [
        "Barry Nickerson",
        "2024-01-08 12:12:20",
        "Maximus Maximus",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Tre Hsi",
        "2024-01-08 14:17:10",
        "Barry Nickerson",
        "https://www.investing.com/members/203741693"
      ],
      [
        "Tomek Mi",
        "2024-01-08 06:13:05",
        "What about ukraine?",
        "https://www.investing.com/members/200058483"
      ],
      [
        "Mike Roddy",
        "2024-01-08 04:32:20",
        "When did shuting down the government become so popular? A shutdown is a loss for our entire nation. You can tripple leverage volatility and shut down the nation. But do you really think that's the best way to get a return on capital? Why not let Congress pass a frigging budget and ride the market as it moves higher! Trying to cripple our whole economy to make some quick cash is really what's disgraceful here. ",
        "https://www.investing.com/members/204910194"
      ],
      [
        "Tre Hsi",
        "2024-01-08 09:11:42",
        "\"When did shuting down the government become so popular?\" -- it's only popular in the MAGA world, not in the real world, even sane republicans (granted not too many of them left) realise a govt shut down is bad for their party",
        "https://www.investing.com/members/203741693"
      ],
      [
        "American Truth",
        "2024-01-08 02:01:43",
        "McConnell is a disgrace.",
        "https://www.investing.com/members/218062379"
      ],
      [
        "Ac Tektrader",
        "2024-01-08 09:06:33",
        "wy because O'Connell thinks Trump is a crook and dangerous to American Democracy and National security.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Mark Jannetty",
        "2024-01-08 00:51:54",
        "this is not a cut. shut the government down and we are guaranteed a 1% cut in discretionary spending from the last extension. Not increasing is not a cut",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Brad Albright",
        "2024-01-08 12:54:38",
        "No surprise with this comment. Constantly cheering for what is bad for America.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Mark Jannetty",
        "2024-01-08 16:52:27",
        " is living off your credit cards good for your household? 🤡",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Brad Albright",
        "2024-01-09 02:50:22",
        "Mark Jannetty",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Richie Berg",
        "2024-01-07 22:20:03",
        "So, government spending is getting a pay raise, mostly from debt, that is inflationary.",
        "https://www.investing.com/members/209338826"
      ],
      [
        "Barry Nickerson",
        "2024-01-07 22:05:53",
        "That works out to approximately $4,444.44 for every man, woman, and child, (oh, yeah, and its)i the U.S..  The article doesn't state whether or not any of that goes towards paying down the current deficit.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "John Avenetti",
        "2024-01-07 21:43:38",
        "a government shutdown is the only way out",
        "https://www.investing.com/members/225003989"
      ],
      [
        "Picaso Fish",
        "2024-01-07 21:55:44",
        "what would that accomplish?",
        "https://www.investing.com/members/206238369"
      ],
      [
        "Petey Pete",
        "2024-01-07 23:09:04",
        "Picaso Fish",
        "https://www.investing.com/members/245762756"
      ],
      [
        "John Miller",
        "2024-01-08 00:30:21",
        " Really? You ask that. If it's shut down so is some spending ",
        "https://www.investing.com/members/204555909"
      ],
      [
        "Merica Moment",
        "2024-01-07 21:38:44",
        "The USA is literally bankrupt and it is hilarious ",
        "https://www.investing.com/members/255178822"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/economy/us-congressional-leaders-to-announce-topline-spending-deal-on-sunday-media-3268712",
  "paragraph": "© Reuters. FILE PHOTO: The U.S. Capitol building is seen in Washington, U.S., April 6, 2023. REUTERS/Elizabeth Frantz/File Photo\nBy Kanishka Singh and Richard Cowan WASHINGTON (Reuters) -The top Democrat and Republican in the U.S. Congress on Sunday agreed on a $1.59 trillion spending deal, setting up a race for bitterly divided lawmakers to pass the bills that would appropriate the money before the government begins to shut down this month. Since early last year, House of Representatives and Senate appropriations committees had been unable to agree on the 12 annual bills needed to fund the government for the fiscal year that began Oct. 1 because of disagreements over the total amount of money to be spent.  When lawmakers return on Monday from a holiday break, those panels will launch intensive negotiations over how much various agencies, from the Agriculture and Transportation departments to Homeland Security and Health and Human Services, get to spend in the fiscal year that runs through Sept. 30. They face a Jan. 19 deadline for the first set of bills to move through Congress and a Feb. 2 deadline for the remainder of them. There were already some disagreements between the two parties as to what they had agreed to. Republican House Speaker Mike Johnson said in a statement that the top-line figure includes $886 billion for defense and $704 billion for non-defense spending. But Democratic Senate Majority Leader Chuck Schumer, in a separate statement, said the non-defense spending figure will be $772.7 billion. Last month, Congress authorized $886 billion for the Department of Defense this fiscal year which Democratic President Joe Biden signed into law. Appropriators will also now fill in the details on how that will be parceled out. The non-defense discretionary funding will \"protect key domestic priorities like veterans benefits, healthcare and nutrition assistance\" from cuts sought by some Republicans, Schumer and House Democratic Leader Hakeem Jeffries said in a joint statement. Last spring, Biden and then-House Speaker Kevin McCarthy reached a deal on the $1.59 trillion in fiscal 2024 spending, along with an increase in borrowing authority to avoid a historic U.S. debt default. But immediately after that was enacted, a fight broke out over a separate, private agreement by the two men over additional non-defense spending of around $69 billion. One Democratic aide on Sunday said that $69 billion in \"adjustments\" are part of the deal announced on Sunday. Another source briefed on the agreement said Republicans won a $6.1 billion \"recission\" in unspent COVID aid money.  FALSE DAWN? The agreement on a top line spending number could amount to little more than a false dawn, if hardline House Republicans make good on threats to block spending legislation unless Democrats agree to restrict the flow of migrants across the U.S.-Mexico border -- or if they balk at the deal hammered out by Johnson and Schumer. Hardline conservative House Freedom Caucus criticized the spending deal reached on Sunday, describing it as a \"total failure\" in a statement on social media platform X. Biden said on Sunday the deal moved the country one step closer to \"preventing a needless government shutdown and protecting important national priorities.\" \"It reflects the funding levels that I negotiated with both parties,\" Biden said in a statement after the deal was announced. Top Senate Republican Mitch McConnell said he was encouraged by the agreement. \"America faces serious national security challenges, and Congress must act quickly to deliver the full-year resources this moment requires,\" he said in a statement. Unless both chambers of Congress - the Republican-controlled House and the Democratic-majority Senate - succeed in passing the 12 bills needed to fully fund the government, money will expire on Jan. 19 for federal programs involving transportation, housing, agriculture, energy, veterans and military construction. Funding for other government areas, including defense, will continue through Feb. 2. House Republican hardliner Chip Roy said the top line spending figure agreed on Sunday was \"terrible.\" In his letter, Johnson said the \"final spending levels will not satisfy everyone, and they do not cut as much spending as many of us would like.\" \nThe past year has been chaotic for Congress, where Republicans pushed Washington to the brink of default and then paralyzed the body for weeks as they deposed one House speaker and struggled to find a replacement. Congress also came within hours of a government shutdown in September. Johnson's narrow 220-213 majority has been reduced by one since No. 2 Republican Steve Scalise will not be casting votes as he undergoes cancer treatment. Johnson's predecessor, McCarthy, was ousted by his own party after passing a bill averting a government shutdown that required Democratic votes to pass."
}