{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK080D6_L.jpg",
  "title": "More than 1,000 Ukrainian towns lose power due to extreme winter weather",
  "category": "Commodities news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 09, 2024 06:33AM ET",
    "Updated Jan 09, 2024 07:37AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/commodities-news/more-than-1000-ukrainian-towns-lose-power-due-to-extreme-winter-weather-3270056",
  "paragraph": "© Reuters. A full moon rises behind an electricity pylon with high-voltage power lines, amid Russia’s attack on Ukraine, in Dnipropetrovsk region, Ukraine November 7, 2022. REUTERS/Valentyn Ogirenko/ File Photo\nBy Olena Harmash KYIV (Reuters) - Ukraine's power grid operator said on Tuesday severe winter weather left more than 1,000 towns and villages without electricity in nine regions and urged residents to conserve power as the energy system has been weakened by Russian strikes. Electricity consumption was at this week's highest levels as temperatures fell to about -15 °C in many parts of the country, grid operator Ukrenergo said.  \"The consumption level continues to grow due to the considerable drop in temperature across the country,\" it said on the Telegram messaging app, adding that electricity consumption in the morning was already 5.8% higher than the day before. \"As of this morning due to bad weather - strong winds, ice power was cut off in 1,025 settlements.\" The weather caused significant damage to distribution networks with strong winds, frost, and a thick layer of ice on equipment, which delayed repair works, Ukrenergo said. Vitaliy Kim, governor of southern Mykolaiv region where 215 towns and villages have been cut off from electricity, said ice on electricity cables was over 5 cm thick. Ukrenergo said the power system was already working at maximum capacity and urged residents to save electricity as much as possible and avoid using several electrical appliances simultaneously to help the system cope. \"Currently, electricity is enough to supply all commercial and household consumers. But a big increase in consumption creates an additional load on power plants, which are already operating at maximum, and they need to increase generation very quickly and considerably and that can lead to technological disruptions,\" Ukrenergo said. Ukraine had to import electricity from neighbouring Romania and Slovakia to be able to meet the demand, it said.  Ukrenergo said that Ukranian thermal power plants were still recovering from last winter's massive Russian strikes and solar power plants could not work at full capacity due to dense clouds and bad weather. Last winter Russia targeted the Ukrainian power system with thousands of missiles and drones, causing frequent blackouts for millions of people. \nThermal power stations accounted for about a third of all electricity produced in Ukraine before the war. Ukrenergo also reported more damage to electricity networks in Donetsk, Kharkiv, and Kherson regions which are near to the frontline and within the reach of artillery shelling."
}