{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK090X4_L.jpg",
  "title": "UN Security Council demands Houthis stop Red Sea attacks",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 10, 2024 06:12PM ET",
    "Updated Jan 11, 2024 12:00AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/un-security-council-demands-houthis-stop-red-sea-attacks-3271897",
  "paragraph": "© Reuters. FILE PHOTO: Houthi military helicopter flies over the Galaxy Leader cargo ship in the Red Sea in this photo released November 20, 2023. Houthi Military Media/Handout via REUTERS/File Photo\nBy Jonathan Landay and Arshad Mohammed (Reuters) -The U.N. Security Council on Wednesday demanded Yemen's Houthis immediately end attacks on ships in the Red Sea and cautioned against escalating tensions while implicitly endorsing a U.S.-led task force that has been defending vessels. The demand came in a Security Council resolution that also called on the Houthis to release the Galaxy Leader, a Japanese-operated vehicle carrier linked to an Israeli businessman that the group commandeered on Nov. 19, and its 25-person crew. Eleven members voted for the measure demanding the Houthis \"immediately cease all attacks, which impede global commerce and navigational rights and freedoms as well as regional peace.\" Four members, including veto-wielding Russia and China, abstained. None voted against. The key provision of the resolution, sponsored by the U.S. and Japan, noted the right of U.N. member states, in accordance with international law, \"to defend their vessels from attack, including those that undermine navigational rights and freedoms.\" The provision amounted to an implicit endorsement of Operation Prosperity Guardian, a U.S.-led multinational naval task force that has been defending commercial ships in the Red Sea and Gulf of Aden from Houthi missile and drone attacks. \"The threat to navigational rights and freedoms in the Red Sea is a global challenge that necessitates a global response,\" U.S. Ambassador Linda Thomas-Greenfield said in urging the council to approve the resolution. The Houthis, an Iran-aligned group that seized much of Yemen in a civil war, have vowed to attack ships linked to Israel or bound for Israeli ports to show support for Hamas Islamists battling the Israeli offensive in Gaza. However, many of the targeted ships have had no links to Israel. The U.S. accuses Iran of providing critical support for the Houthi attacks, including advanced missiles and drones, in violation of U.N. Security Council resolutions. Tehran denies the allegation. The Houthi spokesman in Yemen, Mohammed Abdul Salam, dismissed the UN resolution as a \"political game\" and said the U.S. was the one violating international law. The council voted after rejecting amendments proposed by Russia that would have stripped out the implicit endorsement of the U.S.-led task force and included the war in Gaza among the \"root causes\" of the Houthi strikes. Russian Ambassador Vassily Nebenzia questioned the legitimacy of the task force and said the resolution as drafted was \"an open-ended blessing of it.\" The Houthi attacks have disrupted maritime commerce, prompting some shipping lines to divert vessels from the Red Sea to longer routes, threatening to increase energy and food prices. \nIn the latest strikes, Washington said U.S. and British warships on Tuesday shot down 21 drones and missiles fired by the Houthis at southern Red Sea shipping lanes in what London called the largest such attack in the area. U.S. Central Command said there have been 26 Houthi strikes on shipping since the Houthis seized the Galaxy Leader."
}