{
  "image": "https://i-invdn-com.investing.com/news/news_six_pile_69x52._800x533_L_1419494215.jpg",
  "title": "New Jersey imam shot dead outside mosque, no suspect or motive identified",
  "category": "General",
  "publisher": "Reuters",
  "date": [
    "Published Jan 03, 2024 05:38PM ET",
    "Updated Jan 03, 2024 08:48PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/general/new-jersey-imam-shot-dead-outside-mosque-no-suspect-or-motive-identified-3266705",
  "paragraph": "(Reuters) - A New Jersey imam has died after being shot outside a Newark mosque early on Wednesday morning, and authorities have yet to identify a suspect or motive for the attack, local prosecutors said. There is no indication that the shooting was a bias-motivated crime or an act of domestic terrorism based on the evidence collected so far in the investigation, New Jersey Attorney General Matthew Platkin said at an afternoon briefing. Platkin's office would not typically reveal that type of information at such an early stage, but he said he was doing so in light of the recent surge in bias incidents against various faiths, especially the Muslim community. The imam killed on Wednesday, Hassan Sharif, was shot multiple times shortly after 6 a.m. in his vehicle outside Masjid Muhammad mosque in Newark, said Essex County prosecutor Theodore Stephens at Wednesday's press conference. Sharif died from his injuries in a local hospital on Wednesday afternoon.  \"There are many in New Jersey right now who are feeling a heightened sense of fear,\" Platkin said. Antisemitic and Islamophobic incidents have surged across the United States since the Oct. 7 Hamas attack on Israel and the Israeli military response in Gaza. As a consequence, the U.S. Department of Homeland Security in December issued security guidance for faith-based communities. The agency's recommendations included developing a security plan, putting an individual or a committee in charge of security, completing risk assessment, coordinating with local community and identifying available resources. \nSince Oct. 7, authorities have beefed up the presence of law enforcement at all houses of worship in New Jersey, but especially mosques and synagogues, Platkin said. New Jersey Public Safety Director Fritz Frage echoed statements by Platkin and Stephens that nothing so far has indicated that the shooter was motivated by bias, but said investigators were pursuing \"all leads\" as they continue probing the incident."
}