{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0S0FU_L.jpg",
  "title": "Factbox-What is UNRWA, the U.N. Palestinian refugee agency?",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 29, 2024 09:10AM ET",
    "Updated Jan 29, 2024 09:17AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/factboxwhat-is-unrwa-the-un-palestinian-refugee-agency-3286037",
  "paragraph": "© Reuters. A Palestinian boy arranges bags of flour distributed by the United Nations Relief and Works Agency (UNRWA), amid the ongoing conflict between Israel and Hamas, in Rafah in the southern Gaza Strip January 29, 2024. REUTERS/Ibraheem Abu Mustafa\nGENEVA (Reuters) - Major donors to the U.N. Palestinian refugee agency (UNRWA) have suspended funding after allegations emerged that around 12 of its tens of thousands of Palestinian employees were suspected of involvement in the Oct. 7 attacks in Israel by Hamas. Here are some facts about UNRWA: WHAT DOES UNRWA DO? UNRWA (United Nations Relief and Works Agency for Palestine Refugees in the Near East) was established in 1949 by a U.N. General Assembly resolution, following the war surrounding the founding of Israel, when 700,000 Palestinians fled or were driven from their homes. Today it directly employs 30,000 Palestinians, serving the civic and humanitarian needs of 5.9 million descendants of those refugees, in the Gaza Strip, West Bank and in vast camps in neighbouring Arab countries. In Gaza, it employs 13,000 people, running the enclave's schools, its primary healthcare clinics and other social services, as well as distributing humanitarian aid. Its services in Gaza have increased in importance since 2005, when Israel and Egypt imposed a blockade causing an economic collapse with one of the highest unemployment rates in the world. Since Israel launched its war following the Oct. 7 attacks, around a million Gazans, or nearly 45% of the enclave's population, have been sheltering in UNRWA schools, clinics and other public buildings. Nearly the entire Gazan population now relies on UNRWA for basic necessities, including food, water and hygiene supplies. More than 150 UNRWA staff have been killed since the start of the conflict, making it the deadliest conflict ever for U.N. employees. WHO ARE ITS MAIN DONORS? Contributions from United Nations member states, including regional governments and the European Union, account for more than 89% of the agency's funding. It also receives funding from the regular U.N. budget and financial contributions from other U.N. bodies. In 2022, its top government donors were the United States, Germany, the European Union, Sweden, Norway, Japan, France, Saudi Arabia, Switzerland and Turkey. Countries including the United States, Britain, Germany, Italy, the Netherlands and Switzerland have suspended their funding of the agency in the wake of the allegations. WHAT ARE ISRAEL'S ALLEGATIONS? A six-page Israeli dossier shared with the United States and reviewed by Reuters says 12 UNRWA staff members took part in the Oct. 7 attacks, including nine who worked as teachers in the agency's schools. Ten of them directly participated in the raid into Israeli territory, during which fighters killed 1,200 people and captured more than 240 hostages, and two others were summoned to assist the raid. Prime Minister Benjamin Netanyahu said the number of UNRWA staff that participated in the raid was 13. The dossier says Israel also has wider evidence that UNRWA has employed 190 Hamas and Islamic Jihad militants. WHAT DOES UNRWA SAY ABOUT THE ISRAELI ACCUSATIONS? UNRWA says it acted swiftly to fire staff after being alerted of Israeli evidence that they participated in the Oct. 7 attacks. It believes the cuts to its funding now could jeopardise its entire mission and dramatically worsen an already catastrophic humanitarian emergency in Gaza. \"It is shocking to see a suspension of funds to the agency in reaction to allegations against a small group of staff, especially given the immediate action that UNRWA took by terminating their contracts and asking for a transparent independent investigation,\" UNRWA chief Philippe Lazzarini said. A spokesperson for the agency said on Monday that UNRWA would not be able to continue operations in Gaza and across the region beyond the end of February if funding did not resume. UNRWA has been under financial strain for years. In January 2023, it appealed for $1.6 billion in funding, saying its operations were at risk. WHAT HAS ISRAEL SAID ABOUT UNRWA OVER THE YEARS? Israeli authorities have long called for the agency to be dismantled, arguing that its mission is obsolete and it fosters anti-Israeli sentiment among its staff, in its schools and in its wider social mission. UNRWA strongly disputes this characterisation. UNRWA is \"perforated with Hamas\", Netanyahu said on Monday. \"In UNRWA schools they've been teaching the doctrines of extermination for Israel - the doctrines of terrorism, glorifying terrorism, lauding terrorism\". \nNetanyahu has in the past called on the United States, Israel's top ally and the agency's biggest donor, to roll back its support. He praised the Donald Trump administration for defunding the agency. UNRWA has also faced other controversies in the past. In 2019, the head of the agency resigned amid a misconduct inquiry. In 2014, the head of the United Nations expressed alarm after rockets were found at a vacant UNRWA school and later went missing."
}