{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0K06O_L.jpg",
  "title": "Battles rage as Palestinians say Gaza toll passes 25,000",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 21, 2024 07:14AM ET",
    "Updated Jan 21, 2024 07:52PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Mark Gesswein",
        "2024-01-21 14:08:24",
        "Turn Gaza into a parking lot. That would end the conflict quick!",
        "https://www.investing.com/members/245851936"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/death-toll-from-israeli-strikes-in-gaza-passes-25000-gaza-health-officials-say-3278944",
  "paragraph": "4/4\n© Reuters. Displaced Palestinians, who fled their houses due to Israeli strikes, take shelter in a tent camp in Rafah in the southern Gaza Strip January 21, 2024. REUTERS/Saleh Salem\n2/4\nBy Nidal al-Mughrabi and Ibraheem Abu Mustafa DOHA/GAZA (Reuters) -Israeli attacks and street battles raged across the Gaza Strip on Sunday as Palestinian health officials said the death toll from Israeli strikes since war broke out in October had passed 25,000. Gaza's health ministry said 178 Palestinians had been killed in the past 24 hours, one of the deadliest days of the war so far. Israel's military said a soldier was killed in fighting. Israeli forces and Hamas fighters clashed in several places, from Jabalia in the north to Khan Younis in the south, the focus of recent Israeli operations. Israeli planes resumed heavy bombing on Khan Younis in the south of the Gaza Strip and explosions echoed throughout the city.  Explosions lit the skies in parts of the Khan Younis refugee camp, and Palestinian health officials said one Palestinian was killed and seven wounded in one air strike as night fell.  Israel said its troops had cleared much of northern Gaza of Hamas' military network and more than 1 million residents of that enclave have moved south to flee the bombardments. Fighting, however, has continued in the Jabalia refugee camp and other areas around Gaza City.  Israel unleashed its campaign to eliminate Iran-backed Hamas after the militants burst into Israel on Oct. 7 and rampaged through southern towns and bases, killing 1,200 people, most of them civilians, and taking 253 hostages back to Gaza. Israel says it is fighting a threat to its very existence. The Hamas-run Gaza health ministry said 25,105 Palestinians - many of them women and children - had been killed and 62,681 have been wounded in Israeli strikes since Oct. 7. It does not differentiate between civilian and militant deaths, but says most of those killed have been civilians.  United Nations Secretary-General Antonio Guterres on Sunday denounced Israel for what he called the \"heartbreaking\" deaths of Palestinian civilians in Gaza. \"Israel's military operations have spread mass destruction and killed civilians on a scale unprecedented during my time as secretary-general,\" Guterres said. Israel says it takes steps to avoid civilian casualties, but accuses Hamas of operating in densely populated areas and using civilians as human shields, a charge the Islamist group denies. Guterres also said it was unacceptable for Israel to resist statehood for Palestinians and such a stance would indefinitely prolong a conflict. HAMAS CONDITIONS REJECTED His comments followed remarks by Israeli Prime Minister Benjamin Netanyahu that appeared to rule out the so-called two-state solution to the decades-long Israel-Palestinian conflict - as urged by the U.S. and other governments. Netanyahu's office said that in talks with U.S. President Joe Biden on Friday, he \"reiterated his policy that after Hamas is destroyed Israel must retain security control over Gaza to ensure that Gaza will no longer pose a threat to Israel, a requirement that contradicts the demand for Palestinian sovereignty.\" On Sunday, Netanyahu rejected conditions presented by Hamas to end the war and release hostages that would include Israel's complete withdrawal and leaving Hamas, an Islamist group dedicated to Israel's destruction, in power in Gaza. On Monday, the Israeli and Palestinian foreign ministers are to meet their European Union counterparts in Brussels as the EU considers potential steps toward a comprehensive peace. Hamas said Washington was ignoring Palestinian suffering and deaths while supporting Israeli actions financially and militarily. Hamas called its Oct. 7 assault a \"necessary step\". \"It was a defensive act in the frame of getting rid of the Israeli occupation, reclaiming the Palestinian rights and on the way for liberation and independence,\" Hamas said in a statement. The Oct. 7 attacks, in which many women and children were murdered and bodies mutilated, drew worldwide revulsion and condemnation.  Most of the Gaza Strip's 2.3 million people have since been displaced from their homes. With large areas razed to the ground and hospitals and humanitarian agencies struggling to cope, Palestinians described dire conditions. \"We struggle to survive bombs, but frankly we try to survive hunger more,\" Amer, 32, a father of three from northern Gaza, told Reuters. \"Finding food for the family, for the children, has become a more challenging adventure than surviving war.\" Israel's military said soldiers had killed 15 Palestinian gunmen in the north while snipers, backed by air support, had killed a number of militants in Khan Younis. Hamas dismissed this account. Palestinians said fighting has raged in Jabalia for the past three days. Some buildings caught fire and smoke rose where bombs had fallen.  Along Gaza's southern coast, witnesses said Israeli warships shelled the beach. \nIn the southern city of Rafah, where more than 1 million displaced people are concentrated, three Palestinians were killed in an Israeli air strike on a car. Another car was hit in Gaza City, killing three people, health officials said.  Violence has also surged in the Israeli-occupied West Bank, where Hamas' rival, the Palestinian Authority, has limited self-rule. The Palestinian Health Ministry there said Israeli forces have killed 360 Palestinians since Oct. 7. (Reporting and writing by Nidal al-Mughrabi and David Brunnstrom; Additional reporting by Ali Sawafta in Ramallah and Ari Rabinovitch in Jerusalem; Editing by Leslie Adler and Stephen Coates)"
}