{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0A0CJ_L.jpg",
  "title": "Jailed former Thai PM Thaksin gets extension to hospital stint",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 11, 2024 04:54AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/jailed-former-thai-pm-thaksin-gets-extension-to-hospital-stint-3272083",
  "paragraph": "© Reuters. FILE PHOTO: Former Thai Prime Minister Thaksin Shinawatra, who is expected to be arrested upon his return as he ends almost two decades of self-imposed exile, waves at Don Mueang airport in Bangkok, Thailand August 22, 2023. REUTERS/Athit Perawongmetha/Fi\nBANGKOK (Reuters) - Thailand's jailed former Prime Minister Thaksin Shinawatra has been allowed to remain in hospital for medical treatment, the corrections department said on Thursday, citing the need to continue to closely monitor his health.  The billionaire figurehead of the ruling Pheu Thai Party has been in hospital since his return in August from 15 years of self-imposed exile, after complaining of chest tightness and high blood pressure within hours of arriving at a Bangkok jail to serve eight years for abuse of power.  Thaksin's sentence was commuted to one year following a royal pardon and he is eligible for parole late next month. The corrections department said he should continue to receive specialist care. \"If something flares up that could be life-threatening, then he could receive treatment right away,\" it said in a statement.  The 74-year-old populist has been at the heart of 17 years of on-off turmoil in Thailand, playing an overt role from exile in forming a succession of governments led by his family and business allies after his ousting by the military and conviction in absentia for conflicts of interest.  The corrections department has come under criticism amid widespread scepticism about the extent of Thaksin's health problems, with his political opponents claiming he is being allowed to skip prison and calling for public disclosure of his medical records.  A protest is planned for Friday over Thaksin being spared jail, while a parliamentary police committee looking into complaints of specialist treatment said it plans to visit the hospital.  A hospital spokesperson said the committee would not be permitted to visit the floor where Thaksin is being treated. Thaksin's lawyer could not immediately be reached for comment.  \nThe telecoms tycoon received a rock star reception as a fugitive on his vaunted Aug. 22 return to Thailand, with crowds cheering his arrival by private jet and policemen saluting him before escorting him to court then jail.  The same day, his ally and real estate mogul Srettha Thavisin was elected prime minister by parliament and has since pursued the same populist agenda as previous Shinawatra governments. Thaksin has repeatedly denied allegations he is involved in politics and says he is retired."
}