{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK150QE_L.jpg",
  "title": "Biden blames Trump for sinking bipartisan immigration bill",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 06, 2024 01:38PM ET",
    "Updated Feb 06, 2024 04:11PM ET"
  ],
  "comments": [
    2,
    [
      [
        "AOC Donkeyshow",
        "2024-02-08 07:50:33",
        "PedoJoeSniffEm day one act was opening the border. Sh!tl!bs hide in shame and deny voting for potato. Sniff Sniff. Who is Pedo Peter by the way?",
        "https://www.investing.com/members/255276323"
      ],
      [
        "Ken Roth",
        "2024-02-07 02:17:40",
        "Gutless, spineless republicans will be punished by the voters in 2024 if the stop doing their work for the american people",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/biden-lays-blame-on-rival-trump-for-sinking-of-bipartisan-immigration-bill-3294280",
  "paragraph": "© Reuters. U.S. President Joe Biden holds a campaign rally ahead of the state's Democratic presidential primary, in Las Vegas, Nevada, U.S. February 4, 2024. REUTERS/Kevin Lamarque\nBy Steve Holland WASHINGTON (Reuters) -U.S. President Joe Biden said on Tuesday that the bipartisan immigration bill is falling apart under political pressure from Republican rival Donald Trump and vowed to hit the road to remind voters who was to blame if it fails. \"All indications are this bill won't even move forward to the Senate floor. Why? The simple reason: Donald Trump,\" Biden said. \"Because Donald Trump thinks it's bad for him politically.\" Concerns over immigration have become a top issue in this year's election campaign, with Trump preparing for a likely November rematch with Biden. Trump has been pushing congressional Republicans to reject the bipartisan border security deal unveiled on Sunday. A spokesperson for Trump did not immediately respond to a request for comment. Biden's vow to make the Republican ex-president's efforts to kill the bill a major theme of his reelection campaign is a risky bet given polls showing that Americans give Biden low grades for his handling of border security and immigration.  The Democratic president's approval rating sank to 38% in January as concerns over immigration flared, the latest Reuters/Ipsos poll showed. Biden has grappled with record numbers of migrants caught illegally crossing the U.S.-Mexico border during his presidency. Republicans contend that Biden should have kept the restrictive policies of Trump. In December, encounters averaged more than 9,500 per day, according to U.S. government statistics, but have dropped steeply in about the last month. Biden will test whether blaming Trump for thwarting a bipartisan compromise can help change American minds. \"I'll be taking this issue to the country and the voters are gonna know that...just at the moment we're going to secure the border and fund these other programs Trump and the MAGA Republicans said no because they're afraid of Donald Trump,\" Biden said at the White House. The $118 billion bill, which also includes aid for Israel and Ukraine as it fights a Russian invasion, is quickly losing support on Capitol Hill. House of Representatives Republicans have declared it dead on arrival, and more than 20 Republican senators have said the measure is not strict enough. Several Democrats have also opposed the bill because they say some of its measures treat migrants too harshly.  Biden didn't mention the Democratic opposition, but blamed Republicans for buckling under the pressure from Trump, who he said was reaching out to Republican lawmakers to \"intimidate them to vote against this proposal.\" \"Frankly, they owe it to the American people to show some spine and do what they know to be right,\" Biden said. \nSenate Majority Leader Chuck Schumer on Tuesday also took aim at Trump over the mounting opposition to the border security deal. \"Donald Trump would rather keep the chaos at the border so he can exploit it on the campaign trail instead of letting the Senate do the right thing and fix it,\" Schumer said."
}