{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0A0MU_L.jpg",
  "title": "Harvard is sued by Jewish students over 'rampant' antisemitism on campus",
  "category": "World news",
  "publisher": "Investing.com",
  "date": [
    "Published Jan 11, 2024 09:00AM ET",
    "Updated Jan 11, 2024 04:46PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/harvard-sued-by-jewish-students-over-antisemitism-on-campus-3272551",
  "paragraph": "© Reuters. FILE PHOTO: A view of Harvard campus on John F. Kennedy Street at Harvard University is pictured in Cambridge, Massachusetts, U.S., December 7, 2023. REUTERS/Faith Ninivaggi/File Photo\nBy Jonathan Stempel (Reuters) -Harvard University has been sued by Jewish students who accused it of allowing its campus to become a bastion of rampant antisemitism. In a complaint filed on Wednesday night, six students accused Harvard of selectively enforcing its anti-discrimination policies to avoid protecting Jewish students from harassment, ignoring their pleas for protection, and hiring professors who support anti-Jewish violence and spread antisemitic propaganda. \"Based on its track record, it is inconceivable that Harvard would allow any group other than Jews to be targeted for similar abuse or that it would permit, without response, students and professors to call for the annihilation of any country other than Israel,\" the complaint said. Harvard, the complaint said, treats Jews as \"unworthy of the respect and protection it affords other groups.\" The students are seeking an injunction to stop Harvard's alleged violations of Title VI of the Civil Rights Act of 1964, which bars federal funds recipients from allowing discrimination based on race, religion and national origin. They sued the Ivy League school eight days after Harvard president Claudine Gay resigned, under fire for her handling of antisemitism in the wake of Hamas' Oct. 7, 2023, attack on Israel. She also faced plagiarism allegations. Harvard declined on Thursday to comment on the lawsuit, which was filed in Boston federal court. The plaintiffs include Alexander Kestenbaum, who is a student at Harvard Divinity School; five unnamed students at Harvard's law and public health schools, and the nonprofit Students Against Antisemitism. Other schools that have faced similar lawsuits include New York University, the University of California, Berkeley and the University of Pennsylvania. Academic institutions around the world have been rocked by disputes over free speech and the right to protest since the Israel-Hamas war broke out in Gaza.  In November, the U.S. Department of Education opened a probe into Harvard's handling of antisemitism on campus, after starting probes at several other schools. A House of Representatives panel is also examining Harvard's handling of antisemitism, demanding a slew of materials from interim President Alan Garber and Harvard Corp Senior Fellow Penny Pritzker. 'JEW-BASHING' According to the complaint, antisemitism is not new at Harvard, which was founded in 1636 and is among the world's most prestigious universities, but has swelled since Hamas' attack. More than 30 student groups at the school signed a petition the day after the attack, blaming Israel. The plaintiffs said Harvard took a day to respond, offering \"platitudes\" but neither condemnation of the petition or Hamas, nor support for Jewish students. But after a billboard truck drove around campus and identified members of groups backing the petition, Harvard responded forcefully, offering to protect those students from the \"repugnant assault on our community,\" the complaint said. Harvard's \"double standards\" are unjustified, and it is no defense to sit idly and allow escalating \"Jew-bashing\" so people could express themselves freely, the complaint said. It said two of the law students, both \"visibly Jewish\" based on their clothing, said they have been regularly stopped and targeted in the law school's student lounge, which Harvard has let anti-Jewish protesters take over and chant slogans such as \"glory to the martyrs.\" The complaint said Harvard's bias even extends to admissions, including an alleged 60% decline in the number of Jewish students, mirroring quotas the school had a century ago. \"Harvard, America's leading university, has become a bastion of rampant anti-Jewish hatred and harassment,\" the complaint said. The lawsuit seeks compensatory and punitive damages, and requirements that Harvard suspend or expel students who engage in antisemitism, and return donations conditioned on hiring antisemitic professors or promoting an antisemitic curriculum. \"It is clear that Harvard will not correct its deep-seated antisemitism problem voluntarily,\" said the students' lawyer Marc Kasowitz, whose firm also filed the NYU and Penn lawsuits. \nGay resigned after being slow to condemn Hamas' attack, and botching her Dec. 5 Congressional testimony by failing to definitively say that calling for the genocide of Jews violated Harvard's code of conduct. Penn's president also resigned after offering similar testimony at the same hearing."
}