{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0D05P_L.jpg",
  "title": "Reformist Arevalo sworn in as Guatemala president after opponents delay inauguration",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 14, 2024 06:04AM ET",
    "Updated Jan 15, 2024 03:33AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/guatemalas-arevalo-due-to-assume-presidency-with-difficult-path-ahead-3274086",
  "paragraph": "© Reuters. FILE PHOTO: Guatemalan President-elect Bernardo Arevalo addresses the media after meeting with Honduras President Xiomara Castro, at the Presidential House, in Tegucigalpa, Honduras, January 4, 2024. REUTERS/Fredy Rodriguez\nBy Sofia Menchu GUATEMALA CITY (Reuters) -Anti-corruption crusader Bernardo Arevalo was sworn in as Guatemala's president in the early hours of Monday after a chaotic inauguration that was delayed for hours by a last-ditch attempt by Congress opponents to weaken his authority. The latest in a series of legislative setbacks triggered by opponents underscored the challenges Arevalo faces as leader of Central America's most populous nation, to which he has pledged to bring sweeping reforms and tackle the rising cost of living and violence, key drivers of migration to the United States. Arevalo won August elections by a landslide and about 9 hours after his inauguration was scheduled to start, he took the oath as president, replacing conservative politician Alejandro Giammattei whose government has been engulfed in corruption scandals. Giammattei skipped the ceremony. \"Our democracy has the strength to resist and through unity and trust we can transform the political landscape in Guatemala,\" Arevalo said moments after taking office. \"Never again will there be human rights violations,\" he added, as hundreds of supporters gathered in the capital's Plaza de la Constitucion to sing, dance and celebrate. Arevalo's unexpected election victory was seen as a watershed moment for Guatemala, where the 65-year-old has cast himself as a democracy advocate and the leader of a progressive movement bent on reshaping a political landscape long dominated by conservative parties. A career diplomat, sociologist and son of a former president, Arevalo has faced steady opposition from established political parties such as those of Giammattei, whose allies have repeatedly tried to undermine his election victory. Guatemala's attorney general, an ally of Giammattei, has made several attempts to hinder Arevalo's transition to the presidency, including trying to strip Arevalo and his vice president of legal immunity, attempting to suspend his Semilla party and annul the election.  The attorney general's office has defended its actions as within the framework of Guatemala's laws, but the political infighting has highlighted to many Guatemalans the limitations Arevalo's administration faces. \"My hopes are that he can at least really initiate change for Guatemala,\" said Adolfo Zacarías, 40, an accountant who waited many hours to hear Arevalo speak in Guatemala City. In addition to tackling domestic issues, the government of Arevalo and Vice President Karin Herrera will have to balance demands by the United States to stem migration amid record-high remittances that keep the local economy afloat. Acting on U.S. pressure, Giammattei often deployed the police and the military to stop migrants, and they used heavy-handed tactics such as launching tear gas at the crowds. In his inauguration speech, Arevalo said his government was committed to treating migrants crossing Guatemala's territory with \"dignity, respect, compassion, in the same way we will demand that Guatemalan migrants are treated abroad.\" CONGRESS WRANGLING Arevalo's inauguration was thrown into disarray after the Supreme Court allowed opposition lawmakers to maintain their leadership of Congress, and forced members of the president's Semilla party to stand as independents, further diluting its presence. Semilla holds only 23 of the 160 seats in Congress. The move sparked wrangling in Congress, and supporters of Arevalo threatened to storm the building as police in riot gear amassed in the streets. The United States and several Latin American countries also called for Arevalo's election win to be respected. Arevalo's authority, however, got a boost after prominent Semilla lawmaker, Samuel Perez Alvarez, was unexpectedly elected as the Congress president. Leftist Honduran President Xiomara Castro attended the inauguration but the lengthy delay meant Chilean leader Gabriel Boric missed the event as he had to fly back home. The delays, however, did not seem to dim the joy of many of Arevalo's supporters, who set off fireworks as they celebrated late into the night. \n\"The hopes for the new president of the republic are high,\" said Eli Montes, a 27-year-old doctor who waited for hours to hear Arevalo speak.  \"He has the opportunity to bring about change and leave to the next government a Guatemala that is on the road to the development.\""
}