{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "Hamas airs video purporting to show two Israeli hostages killed in captivity",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 15, 2024 03:07PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/hamas-airs-video-purporting-to-show-two-israeli-hostages-killed-in-captivity-3274513",
  "paragraph": "CAIRO/JERUSALEM (Reuters) - Palestinian Islamist group Hamas aired a new video on Monday showing what it said were the bodies of two Israeli hostages, and Israel's military said that while it was examining the footage, there was serious concern regarding the hostages' fate. In the video, 26-year-old university student Noa Argamani, seemingly reading a script in front of a blank white wall, said that fellow hostages Itai Svirsky and Yossi Sharabi had been killed. The video ends with pictures purporting to be the dead bodies of both men.  Aragamani said in the video that they were killed by Israeli strikes, while she was injured. Military spokesperson Rear Admiral Daniel Hagari identified hostage Itai Svirsky as one of the men, but did not give the name or other details about the second as per the family's request. \"Itai was not shot by our forces. That is a Hamas lie. The building in which they were held was not a target and it was not attacked by our forces,\" Hagari told reporters. \"We don't attack a place if we know there may be hostages inside,\" he said, adding that areas nearby had been targeted.  The military, he said, was examining the photos Hamas posted along with other information it had. Argamani became a prominent face among the more than 200 hostages taken during Hamas' Oct. 7 massacre across southern Israel that sparked the war in Gaza. She attended the music festival that became a killing field and was filmed by her captors being taken into Gaza on the back of a motorcycle, screaming for her life and reaching for her boyfriend who was being pushed on foot beside her. \"Stop this madness, return us to our families while we are still alive. Return us home,\" she said in Monday's video. Sharabi, 53, was taken hostage from Kibbutz Beeri, one of the hardest hit communities in the Hamas assault, along with his brother. His wife managed to save their daughters while his brother's family was killed. Svirsky, 35, was also taken from Kibbutz Beeri after being shot and wounded and witnessing the killing of his mother. His father was also killed. A day earlier Hamas aired a video showing the three hostages and promising to disclose their fate. Israeli Defense Minister Yoav Gallant said on Monday that Hamas carries out \"psychological abuse\" with its handling of the hostages. Forensic officials in Israel have said that autopsies of slain hostages who had been recovered found causes of death inconsistent with Hamas' account they had died in air strikes. But Israel has also made clear it is aware of the risks to hostages from its offensive, and is taking precautions. Around half of some 240 people seized by Hamas on Oct. 7 were released in a November truce. Israel says 132 remain in Gaza and that 25 of them have died in captivity. The hostage crisis has riveted Israelis reeling from the worst attack in their history. Some hostages' relatives have called on Prime Minister Benjamin Netanyahu to enter another truce or even call off the war. Gallant said that without keeping up military pressure, Hamas would have no reason to release more hostages."
}