{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0U0VN_L.jpg",
  "title": "Peru reopens train route to Machu Picchu after protests end",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 31, 2024 04:14PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/peru-reopens-train-route-to-machu-picchu-after-protests-end-3288951",
  "paragraph": "© Reuters. FILE PHOTO: A child traveling with tourists rests next to a train track near the Incan ruins of Machu Picchu, a tourism magnet, access to which is being limited by local protests against rising prices amid a worldwide surge most recently triggered by the \nBy Lucinda Elliott (Reuters) - Peruvian authorities have reopened the train route to Machu Picchu, the Andean country's railway operator said on Wednesday, after an agreement was struck to end protests that had blocked access to the famed Incan site and stranded tourists. PeruRail said in a statement a partial service had restarted on Wednesday and that a regular service would return on Thursday from the city of Cusco to Aguas Calientes near the archaeological site. The protests began late last week over a new centralized ticketing system, leaving hundreds of tourists unable to reach the ancient ruins high up in the Andes. Protesters said they feared the new electronic ticket sales platform would hurt local businesses by shifting the administration of ticket sales to one private company authorized by the Ministry of Culture. The two sides signed an agreement on Wednesday that will see a transition period to the new platform. \n\"We have to move forward to reactivate our economy,\" Peru's Minister of Culture, Leslie Urteaga, told a local radio station.  Agencies responsible for the preservation of the UNESCO World Heritage site have warned about overcrowding and tickets being oversold, leading authorities to find new ways to control visitor numbers as travel rebounds in the wake of the COVID pandemic."
}