{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0P09E_L.jpg",
  "title": "UN rights chief deplores US nitrogen gas execution",
  "category": "General",
  "publisher": "Reuters",
  "date": "Published Jan 26, 2024 04:38AM ET",
  "comments": [
    1,
    [
      [
        "Joe Blewit",
        "2024-01-26 16:36:39",
        "Who pays this guy's salary?",
        "https://www.investing.com/members/256551012"
      ],
      [
        "Mark Jannetty",
        "2024-01-26 17:16:40",
        "and who cares what he thinks ",
        "https://www.investing.com/members/241633026"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/general/un-rights-chief-deplores-us-nitrogen-gas-execution-3283784",
  "paragraph": "2/2\n© Reuters. The new UN High Commissioner for Human Rights Volker Turk, of Austria, poses in his office at the Palais Wilson, during a photocall for his taking official functions as United Nations High Commissioner for Human Rights in Geneva, Switzerland October 17, 2\n2/2\nGENEVA (Reuters) - The United Nations human rights chief on Friday condemned the execution of a prisoner in the U.S. state of Alabama by nitrogen gas, saying the method could amount to torture. Kenneth Smith, convicted of a 1988 murder-for-hire, was executed on Thursday with nitrogen gas, the first use of a new method of capital punishment since lethal injections began in the U.S. four decades ago. \"I deeply regret the execution of Kenneth Eugene Smith in Alabama despite serious concerns this novel and untested method of suffocation by nitrogen gas may amount to torture, or cruel, inhuman or degrading treatment,\" Volker Turk, the U.N. High Commissioner for Human Rights, said. \n\"The death penalty is inconsistent with the fundamental right to life. I urge all states to put in place a moratorium on its use, as a step towards universal abolition.\" Smith had survived one execution attempt. In November 2022, Alabama officials aborted his execution by lethal injection after struggling for hours to insert an intravenous line's needle in his body."
}