{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBO023_L.jpg",
  "title": "Christmas in China brings glittering decor and foreign influence concerns",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 25, 2023 12:30AM ET",
    "Updated Dec 25, 2023 04:15AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Stan Flation",
        "2023-12-25 07:06:07",
        "\"Foreign traditions should not be \"blindly\" followed\", neither local traditions, I think!!! Human civilization: thousands of years programming human minds with traditions. Happy Christmas!!!",
        "https://www.investing.com/members/203684658"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/christmas-in-china-brings-glittering-decor-and-foreign-influence-concerns-3263170",
  "paragraph": "3/3\n© Reuters. FILE PHOTO: A vendor sorts products at a booth selling Christmas decorations at a mall in Beijing, China December 14, 2023. REUTERS/Tingshu Wang/File Photo\n2/3\nBy Ryan Woo BEIJING (Reuters) -Giant Christmas trees adorned with lights, tinsel and gift boxes greet shoppers at glittering malls in big Chinese cities like Shanghai and Chongqing, but in many parts of China, extending season's greetings is out of the question.  In southwest Yunnan province, a property management company issued a notice to shopping mall tenants urging them not to sell Christmas cards and presents and to even refrain from hanging decorations, saying foreign traditions should not be \"blindly\" followed, and one should be confident in one's own culture. Schools in some cities from Dongguan in the south to Harbin in the northeast similarly called on students and parents not to follow foreign traditions and culture without thinking.  In Gansu province in China's northwest, a local branch of the Communist Youth League told its members to instead celebrate \"The Battle at Lake Changjin\", a 2021 Chinese film depicting a fierce fight between the Chinese People's Voluntary Army and U.S. forces during the Korean War.  China does not ban Christianity or forbid Christian worship, but like all permitted religions, it must be strictly managed and governed amid concern about \"foreign influences\".  China is keen, however, to export Chinese culture, such as traditions around the Spring Festival, or Lunar New Year, in a global projection of its soft power. Christmas Day is not a public holiday in mainland China, where Buddhism and Taoism are the major religions, with ancestral worship also a common practice. The Communist Party is officially atheist.  Wang Huning, the fourth-ranked member of the party's powerful Politburo Standing Committee led by President Xi Jinping, told Christian groups last week to \"adhere to the direction of the sinicisation of Christianity\". \"(We must) interpret the doctrines and rules in line with the requirements of contemporary China's development and progress, core socialist values ​​​​and excellent Chinese traditions and culture,\" said Wang, according to a report by the official Xinhua news agency on Saturday.  Over the years, the Vatican has also sparred with Beijing over China's unilateral appointment of bishops in a country that has about 12 million Catholics.  In 2018, Langfang, a city in Hebei province just south of Beijing, put a blanket ban on public displays for Christmas and the sale of items related to the holiday to \"maintain social stability\".  At the same time, China is ready for the world to celebrate Chinese culture and ideas. \nThe Spring Festival is about joy, harmony and peace, a foreign ministry spokesperson said on Monday after the United Nations last week designated the festival as a floating U.N. holiday. \"We would like to celebrate the Spring Festival with the whole world,\" the spokesperson said."
}