{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "South Korea, US conduct week-long firing drills near North Korea border",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 03, 2024 09:49PM ET",
    "Updated Jan 04, 2024 01:07AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/south-korea-us-conduct-weeklong-firing-drills-near-north-korea-border-3266773",
  "paragraph": "By Jack Kim SEOUL (Reuters) - South Korean and U.S. troops have conducted joint combat firing drills near the border with North Korea involving heavy weapons, as Pyongyang lambasted the allies for dangerous moves pushing the region to the brink of \"an inferno of nuclear war.\"  The exercise by a South Korean Army mechanised infantry brigade and U.S. Army armoured  Stryker  (NYSE:SYK) brigade was to test and enhance combat readiness simulating enemy aggression, South Korea said in a statement on Thursday. The drills took place over a week starting on Dec. 29 and ended on Thursday, the South Korean Army said.  The allies have dramatically increased the scale and intensity of joint drills in the past year amid escalating tension on the Korean peninsula as Pyongyang tested both long-range ballistic missiles and tactical weapons designed to strike targets in the South and the Pacific. The U.S. has also deployed more military assets near the Korean peninsula including a nuclear missile submarine, aircraft carriers and large bombers. Wrapping up a major ruling party meeting, leader Kim Jong Un on Saturday lashed out at Washington for deploying large weapons and vowed to increase the North's nuclear arsenal and grow attack capabilities to \"pacify the South.\" The North called the joint firing drills \"reckless war manoeuvres\" and mocked South Korea for backing Washington's hegemonic ambitions \"when it has no chance of winning or survival.\" \"With the instinct of confrontation deep in their bones, the puppets again marked the new year by making the aggressive choice that stokes war,\" the North's official KCNA news agency said in a commentary. \"2024 is the year of the highest risk of conflict,\" it said. \nThe joint drills involved more than 110 large combat weapons including South Korean army tanks, anti-aircraft artillery and combat earthmovers supported by U.S. military attack aircraft and armoured fighting vehicles, the Army said.  South Korea's navy on Wednesday conducted live firing drills and anti-submarine manoeuvres in the waters in the east, west and the south involving destroyers, frigates and corvettes, the navy said."
}