{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK101UO_L.jpg",
  "title": "Trump, Haley campaigns ramp up attacks in South Carolina",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Feb 01, 2024 02:03PM ET",
    "Updated Feb 01, 2024 02:15PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/trump-haley-campaigns-ramp-up-attacks-in-south-carolina-3290374",
  "paragraph": "2/2\n© Reuters. FILE PHOTO: Republican presidential candidate and former U.S. President Donald Trump holds a campaign rally ahead of the Republican caucus in Las Vegas, Nevada, U.S., January 27, 2024. REUTERS/Ronda Churchill\n2/2\nBy Tim Reid (Reuters) - The campaigns of Donald Trump and Nikki Haley went into full attack mode on Thursday in South Carolina, the state to hold the next major Republican presidential nominating battle on Feb. 24. Haley, Trump's last remaining rival, has infuriated the former president by refusing to drop out of the nominating race after his back-to-back wins in Iowa and New Hampshire strengthened his grip on the nomination and set up a likely general election rematch with Democratic President Joe Biden in November. Haley's campaign used a new ad and email blasts to call Trump a liar, a weak candidate and a coward for not debating her. Trump, who leads Haley by wide margins in opinion polls in South Carolina, her home state where she served as governor, deployed local politicians to savage her at an event in Columbia, the state capital. Bill Taylor, a Republican state representative and onetime Haley ally who is backing Trump in the primary contest, called her a political opportunist. \"Nikki is always about Nikki,\" Taylor said.  Another state representative supporting Trump, Stewart Jones, said Haley is weak on immigration, echoing a talking point put out by the Trump campaign on Thursday. Trump has made immigration a focus of the presidential battle, seizing on an issue that is a top concern for Republican voters as the Biden administration has struggled to cope with a surge of asylum seekers on the U.S.-Mexico border. Trump has criticized Haley for once opposing his proposed border wall. In a new ad, Haley touted her record as governor, including the signing of a tough immigration bill, and accused Trump of lying about her achievements. In an email to supporters, her campaign called Trump a \"gift\" to Democrats. Polls show Haley with significant leads in a head-to-head match up with Biden, but a Trump-Biden race to be much closer. \n\"Democrats couldn't dream up a weaker candidate if they tried,\" Haley's campaign said of Trump.  So far, most Republican voters do not appear to agree. A new Washington Post-Monmouth University poll shows Trump leading Haley by 58% to 32% among potential Republican primary voters in South Carolina."
}