{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0K01B_L.jpg",
  "title": "Why India's new Ram temple matters, and the dispute behind it",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 20, 2024 09:38PM ET",
    "Updated Jan 22, 2024 12:21PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/factboxwhat-are-the-contentious-events-behind-indias-new-ram-temple-3278918",
  "paragraph": "3/3\n© Reuters. Police officers patrol a street on horseback ahead of the opening of the temple of Hindu Lord Ram in Ayodhya, India, January 20, 2024. REUTERS/Adnan Abidi\n2/3\nBy Krishn Kaushik (Reuters) -Indian Prime Minister Narendra Modi led the consecration on Monday of a grand temple to the Hindu god-king Ram on a site believed to be his birthplace, in a historic event for the Hindu majority of the world's most populous nation. Coming months before Modi seeks a rare third term in general elections due by May, the event delivers on a campaign promise his political party made more than three decades ago, but also calls to mind some of India's worst sectarian strife. WHY DOES IT MATTER? The idol represents Ram as a five-year-old child, as many Hindus consider the temple site to have been the deity’s birthplace and where he spent his childhood. As the temple replaces a 16th-century Mughal-era mosque razed by radical Hindu groups in 1992, many Indians hail it as a sign of Hindu reawakening from centuries of foreign subjugation, including rule by Muslim dynasties such as the Mughals. Analysts say Modi's leadership of the ceremony symbolises for supporters of his Hindu nationalist party that India is finally ready to end what they call appeasement of minorities and move towards their goal of building a Hindu-first nation. WHAT ARE THE FEATURES OF THE NEW TEMPLE? Construction began in 2020, with Modi laying the foundation stone of the temple to one of Hinduism's principal deities on a 2.7-acre (one-hectare) plot within a complex that sprawls over 70 acres (28 hectares). Supervised by a panel headed by Modi's former chief of staff Nripendra Misra, construction cost an estimated 15 billion rupees ($181 million), funded by contributions amounting to more than twice that from 40 million people in India. WHAT WAS THE RELIGIOUS DISPUTE ABOUT? The Indian epic, the Ramayana, mentions Ayodhya, a town in the northern state of Uttar Pradesh nearly 700 km (435 miles) east of New Delhi, as the birthplace of Ram, whom Hindus believe to be a physical incarnation of Lord Vishnu. The razed mosque dating from 1528, during the rule of Babur, India's first Mughal emperor, is believed by many Hindus to have been built on the spot where Ram was born, following the demolition of an earlier temple there. In Dec. 1949, authorities seized the mosque after Hindu activists placed idols of Ram inside the disputed structure. Court orders barred removal of the idols, and use as a mosque effectively ceased. Hindu and Muslim groups filed separate claims over the site and the structure. In 1989, a high court ordered the maintenance of status quo. HOW WAS THE MOSQUE RAZED? Hindu and Muslim groups tried unsuccessfully to resolve the dispute through talks, before Modi's Hindu nationalist Bharatiya Janata Party (BJP) launched a nationwide campaign in 1990 to build the temple. Lal Krishna Advani, the president of the party at the time, embarked on a cross-country journey on a truck fitted out to resemble an ancient chariot. It whipped up Hindu fervour, deepening rifts with Muslims but also catapulting the party to national prominence. The BJP campaign climaxed in a rally in Ayodhya on Dec. 6, 1992, when a mob climbed the mosque and smashed its domes with axes and hammers, levelling the entire structure. The event triggered sectarian riots in several parts of India, killing about 2,000 people, mostly Muslims. Muslims are a minority in mainly Hindu India, making up about 14% of its 1.42 billion people. As a foot soldier of the party at the time, Modi helped organise the chariot's journey, which began in his home state of Gujarat. \nHe rode to the office of prime minister in 2014 on a Hindu nationalist platform that included the promise to build the temple. Temple construction began after the Supreme Court permitted it in 2019 on condition that Muslims received another plot for a mosque."
}