{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBT03X_L.jpg",
  "title": "Eurostar service to resume on Sunday after floods caused outages",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 30, 2023 09:58AM ET",
    "Updated Dec 30, 2023 04:01PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/flooded-tunnel-near-london-disrupts-eurostar-train-services-3264897",
  "paragraph": "6/6\n© Reuters. Passengers gather at the departure gates of the Eurostar terminal at St Pancras International Station after the services are cancelled due to a flooded tunnel, in London, Britain, December 30, 2023. REUTERS/Belinda Jiao\n2/6\nPARIS/LONDON (Reuters) -Eurostar train services linking London with Paris, Brussels and Amsterdam will fully resume on Sunday, the company said in a statement late on Saturday, after flooding in railway tunnels in southeastern England forced mass cancellations.  \"There will be some speed restrictions in place in the morning which may lead to delays, and stations are expected to be very busy,\" Eurostar said.  On Saturday the tunnel flooding brought international rail traffic between London and the European mainland to a halt, disrupting New Year travel for thousands of passengers - the second major headache for customers this holiday season.  On Dec. 21, a surprise industrial strike by French workers thwarted Christmas travel plans for thousands. It was not immediately clear what had caused the flooding in the railway tunnels under the River Thames near Ebbsfleet, east of London. Television footage showed water gushing into one of the tunnels and covering the track, while at St Pancras station in London hundreds of stranded passengers with suitcases sat waiting on the concourse. \n\"Eurostar has been working to ensure everyone affected has been supported in all of our stations,\" the company said in its latest update on the situation. \"Customers have had the option to re-book onto alternative services or opt for a refund,\" it added."
}