{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK140CX_L.jpg",
  "title": "Interview with Putin? Tucker Carlson says with a smile: 'We'll see'",
  "category": "General",
  "publisher": "Reuters",
  "date": [
    "Published Feb 05, 2024 05:00AM ET",
    "Updated Feb 05, 2024 09:16AM ET"
  ],
  "comments": [
    6,
    [
      [
        "Ken Roth",
        "2024-02-07 03:50:00",
        "Tucker Carlsson A russian agent stationed in USA is comming home to collect his fees for 10 years of loyal service promoting russian propaganda to the american people….hope he stays in russia.",
        "https://www.investing.com/members/213081368"
      ],
      [
        "John Hill",
        "2024-02-05 22:39:34",
        "Putin has a better history of telling the truth more than any liberal I know.",
        "https://www.investing.com/members/200125192"
      ],
      [
        "Brad Albright",
        "2024-02-06 01:13:08",
        "What a petty view of the world you have.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Mark Jannetty",
        "2024-02-06 01:50:21",
        " pretty factual ",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Ken Roth",
        "2024-02-05 19:58:58",
        "Or maybe he is in russia to accept the job offer on Russian state tv?",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Ken Roth",
        "2024-02-05 19:48:26",
        "The guy is a notorious liar so even fox needed to throw him out, he now needs money and putin will perhaps pay him for his loyalty to russia",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Ac Tektrader",
        "2024-02-05 17:38:13",
        "the Conservative Republicans have a history of loving dictators and dictatorships. just before ww2 they loved Hitler and some of the Republican leadership even received medals for their support from hitler himself. I'm $ure Tucker is hoping for a per$onal meeting with Putin hi$ hero and benefactor.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ken Roth",
        "2024-02-05 11:40:48",
        "Tucker is in town to collect some payment for his US hate and support of putin.",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Ac Tektrader",
        "2024-02-05 17:23:50",
        "Tucker has demonstrated his loyalties often by spreading Russianlies and propaganda over his podcasts. he has a loveseat going on with the brutal putin dictatorship ...",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ac Tektrader",
        "2024-02-05 17:26:11",
        "in other word he's kissing Putin's a-$$",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ac Tektrader",
        "2024-02-05 17:44:36",
        "Doug your support of Tucker's treachery against America is noted.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Mark Jannetty",
        "2024-02-05 18:28:39",
        "Ac Tektrader",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Mark Jannetty",
        "2024-02-05 18:29:19",
        "Ac Tektrader",
        "https://www.investing.com/members/241633026"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/general/kremlin-gives-nothing-away-about-why-tucker-carlson-might-be-in-russia-3292384",
  "paragraph": "© Reuters. Tucker Carlson speaks as conservative leaders and personalities attend Turning Point USA's AmericaFest 2023 in Phoenix, Arizona, U.S. December 18, 2023. REUTERS/Caitlin O’Hara/File Photo\nMOSCOW (Reuters) -Former Fox News host Tucker Carlson, whose arrival in Moscow has fuelled speculation he may become the first Western journalist to interview Russian President Vladimir Putin during the war in Ukraine, kept his cards close to his chest on Monday. Russian media showed pictures of Carlson at several spots around Moscow, including at a box at the Bolshoi Theatre and eating at a hotel.  \"It is beautiful,\" Carlson said of Moscow in an interview aired by the Izvestia newspaper. \"I just wanted to see it because, you know, I have read so much about it but I have never seen it before.\" When asked if he was in Moscow to interview Putin, Carlson said: \"We'll see\". He then smiled. The Kremlin, asked the same question, said it could hardly be expected to comment on the comings and goings of foreign journalists or provide a running commentary on them. \n\"Many foreign journalists come to Russia every day, many continue to work here, and we welcome this,\" Kremlin spokesman Dmitry Peskov said. \"We have nothing to announce in terms of the president's interviews to foreign media.\" Carlson launched a new subscription-based streaming video service in December to capitalize on his popularity among conservative U.S. voters. An interview he posted on X with former president Donald Trump last August has drawn more than 267 million views, according to the social media platform."
}