{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK1305K_L.jpg",
  "title": "Republican candidate Trump says U.S. needs to impose tariffs on China",
  "category": "General",
  "publisher": "Reuters",
  "date": [
    "Published Feb 04, 2024 10:58AM ET",
    "Updated Feb 04, 2024 12:25PM ET"
  ],
  "comments": [
    6,
    [
      [
        "Ken Roth",
        "2024-02-06 11:21:13",
        "When you have no policies go after the chinese that seems to be the republican party full palette ",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Barry Nickerson",
        "2024-02-05 23:58:32",
        "Quit allowing Chinese companies to deliver to your house, halfway around the world,  via USPS for pennies, while it costs us $5 to mail a one pound package to the next street.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Brad Albright",
        "2024-02-06 18:07:19",
        "Pretty sure USPS does not serve China.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Barry Nickerson",
        "2024-02-06 23:13:57",
        "Brad Albright",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Ken Roth",
        "2024-02-05 11:46:59",
        "Trump sounds more like broken record spewing hate and division like always.",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Ken Roth",
        "2024-02-05 09:49:41",
        "US farmers and industries have forgotten Trumps trade wars and the damage he made last time",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Teena Marie",
        "2024-02-04 22:06:35",
        "Trump sounds like he doesn't know what he's talking about.",
        "https://www.investing.com/members/242916302"
      ],
      [
        "Martijn WN",
        "2024-02-04 23:06:47",
        "What else is new? ",
        "https://www.investing.com/members/223157173"
      ],
      [
        "Barry Nickerson",
        "2024-02-06 23:15:30",
        "He knows....ready up on Trump and the UPU.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Tom Saltzman",
        "2024-02-04 16:41:31",
        "Would be better if we canceled corporate taxes and unnecessary regulations that would allow American companies to better compete with China.",
        "https://www.investing.com/members/200520915"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/general/republican-candidate-trump-on-china-tariffs-we-have-to-do-it-3292062",
  "paragraph": "© Reuters. FILE PHOTO: Republican presidential candidate and former U.S. President Donald Trump holds a campaign rally ahead of the Republican caucus in Las Vegas, Nevada, U.S., January 27, 2024. REUTERS/Ronda Churchill\nWASHINGTON (Reuters) -Republican presidential candidate Donald Trump said he would impose tariffs on China again if he is elected in November and they could exceed 60 percent. \"We have to do it,\" Trump said in an interview aired on Sunday with the Fox News program \"Sunday Morning Futures.\" \"I mean, look, the stock market almost crashed when it was announced that I won the Iowa primary (sic) in a record. And then when I won New Hampshire, the stock market went down like crazy,\" he said, referring to the Iowa caucus and New Hampshire primary nominating contests in January. Asked about a report that he is considering imposing 60 percent tariffs on Chinese goods if elected, Trump said, \"No, I would say maybe it's going to be more than that.\" Trump is the frontrunner for his party's nomination to challenge Democratic President Joe Biden in the Nov. 5 U.S. election. Trump imposed tariffs on hundreds of billions of dollars worth of Chinese goods in 2018 and 2019 amid a bitter trade war between the world's two largest economies. The Biden administration retained the tariffs and added new restrictions prohibiting the export of advanced semiconductors and the equipment to make them, citing security concerns. The U.S. trade representative is conducting a review of the tariffs. Trump dismissed the notion that he would start another trade war with China. \n\"It's not a trade war. I did great with China with everything,\" Trump said in the interview, taped last week.  \"I want China to do great, I do. And I like President Xi a lot. He was a very good friend of mine during my term.\""
}