{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBN06G_L.jpg",
  "title": "In Moldova, the Christmas spirit is conflict and rivalry for parishioners",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Dec 24, 2023 08:11PM ET",
  "comments": [
    1,
    [
      [
        "B T",
        "2023-12-25 04:26:56",
        "so sad to read such story. We are religious and not one. so sad.",
        "https://www.investing.com/members/243845004"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/in-moldova-the-christmas-spirit-is-conflict-and-rivalry-for-parishioners-3263132",
  "paragraph": "© Reuters. FILE PHOTO: People attend a service for Orthodox Epiphany celebrations in Chisinau, Moldova January 19, 2019. REUTERS/Gleb Garanich/File Photo\nBy Alexander Tanas CHISINAU (Reuters) - The head of Moldova's largest Orthodox Church, subordinated to its Russian parent church, has complained that his ranks were coming under attack in the run-up to Christmas -- marked on two separate days by rival churches in the former Soviet state. More than 90% of residents of the country, which lies between Ukraine and Romania, are Orthodox Christians. With Moldova's government seeking European Union membership, Metropolitan Vladimir of the larger Russia-linked church complained in a weekend interview that the media \"bolstered by political support\" was spreading division in the church. Vladimir's church, the Moldova Metropolis, last month reaffirmed its allegiance to the Russian Orthodox Church despite misgivings over the latter's support for the war in Ukraine. It marks Christmas on Jan. 7, but its hold on the faithful is being challenged by the Metropolis of Bessarabia, which reports to the Romanian church and has welcomed more than 60 priests who have left the rival church in recent months. The Metropolis of Bessarabia, which marks Christmas on Dec. 25, has come to be seen as a key element of the government's drive to move to the European mainstream. \"Every day, we see how the image of the Moldovan church is desecrated in our national information space, bolstered by political support,\" Vladimir said in the interview, published on his church's website. Priests leaving one church for another were \"devoid of all insight and faith (and) facilitating the destruction of the unity of the Church of Christ\". Both Dec. 25 and Jan. 7 have been declared public holidays in Moldova. Although the Russian-linked church has a greater following, more and more Moldovans are making the switch to celebrating Christmas on Dec. 25. Ukraine's largest Orthodox Church switched its festivities to Dec. 25 earlier this year and the date was made a public holiday. Russia and its Orthodox Church stand by the old calendar marking Christmas on Jan. 7. \nMoldova's president, Mala Sandu, has sought publicly to stay out of the debate over the two churches and their parishioners. She sidestepped a question last week about which of the two days she would be observing - saying she would celebrate on Dec. 25 with her immediate family in Chisinau and again on Jan. 7 in her native village near the Romanian border."
}