{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK1501Q_L.jpg",
  "title": "Explainer-California rains: good for drought, fuel for wildfires",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Feb 05, 2024 09:06PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/explainercalifornia-rains-good-for-drought-fuel-for-wildfires-3293339",
  "paragraph": "© Reuters. Workers pump flood water from the street surrounding the Inn at Playa del Rey, after heavy rains hit Southern California, in Los Angeles, California, U.S., February 5, 2024, as seen in this scree grab taken from a video. REUTERS/Sandra Stojanovic\nBy Daniel Trotta (Reuters) - The atmospheric river that has inundated California is a mixed blessing, at once easing drought conditions and promoting threatened fish species while also nourishing the growth of vegetation that will eventually fuel future wildfires. Here's a look at the environmental implications: HOW WET IS IT? After severe drought conditions for most of this century, California is forecast to have its second wet year in a row, though not quite as wet as the exceptional precipitation of a year ago. (California's water year is measured from October to September, with 85% of annual precipitation generally falling by April 1.) As of Monday morning, precipitation in Northern California so far this year was only 85% of its historic average, said Jay Lund, vice director for the Center for Watershed Sciences at the University of California, Davis.  In the southern part of the agricultural San Joaquin Valley, precipitation was a 65% of the historic average.  \"We won't really know how wet this year is going to be until late March,\" Lund said. DROUGHT RESISTANCE Of course, rain is better than drought for managing California's water resources, but not all rain is equal. The current storm is mostly affecting Southern California, which lacks the storage capacity of the northern part of the state and the resources to capture storm water before it drains into the Pacific Ocean. So while all the state's reservoirs are virtually at or above historic average levels, they are not topping off like they did last year when a parade of atmospheric rivers landed mostly in Northern California. \"It would be great if we could ask these atmospheric rivers to direct themselves to more convenient locations for our storage, but we can't do that,\" said Jay Famiglietti, a hydrologist at Arizona State University's Global Futures Laboratory. \"We just have to take what we can get.\"  FIRE SEASON The additional moisture is generally good for wildfire resistance, but the rain also promotes growth of grasses and brush that will become fuel for future fires when the weather inevitably turns dry again. \"You'll have that beautiful green hillside in July and August but subsequently that fuel will die off, which promotes rapid fire growth and what we call light flashy fuels,\" said Nick Schuler, spokesperson for the California Department of Forestry and Fire Protection (Cal Fire). California wildfires historically have burned between the warmer months of April to October, with a particular concentration during hot, dry Santa Ana winds of October and November. But given the extremes created by climate change, the state has gone to year-round footing for fire preparedness, especially after the devastating wildfires of 2020. Even with decent rains so far in 2024, California experienced 29 brush fires last week alone, Schuler said.  HAPPY FISH For California's endangered and threatened fish species such as the Chinook salmon, the rain is an unqualified benefit. Full or overflowing reservoirs require releasing water from dams that will replenish the rivers, streams and flood plains that make up fish habitat. \nA second consecutive wet year is especially helpful. And if California has even average rainfall next year, that third year in a row would be invaluable for extending through the typical lifecycle of many salmon that hatch in the fresh water upstream, migrate to the ocean as juveniles, and return upstream as adults to spawn. \"In the same way that three consecutive years of drought really hurt the population, three consecutive good water years could really benefit and lift us out of this giant hole that we're currently in,\" said Carson Jeffres, senior researcher for the Center for Watershed Sciences at UC Davis."
}