{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0R00S_L.jpg",
  "title": "Guterres: UN to punish staffers involved in 'terror,' urges UNRWA funding",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 28, 2024 12:03AM ET",
    "Updated Jan 28, 2024 04:31AM ET"
  ],
  "comments": [
    3,
    [
      [
        "Benjamin USA",
        "2024-01-29 17:19:39",
        "Tone deaf",
        "https://www.investing.com/members/200821892"
      ],
      [
        "michel Le havre",
        "2024-01-28 15:26:34",
        "if i as a father and bread earner of my family am going to dig tunnels and learn hang  gliding or motorbike racing  somebody must be looking after their families.  It takes years to learn all these skill to attack Isreal.  let alone killing old folks and raping young girls  Please do not stop your donation.  They are helping feed my family while i run around tunnels now bossing and torturing hostages",
        "https://www.investing.com/members/230946628"
      ],
      [
        "FMGK Blue",
        "2024-01-28 10:35:33",
        "What an enormous scandal.... Guterres resign!!! ",
        "https://www.investing.com/members/229798402"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/guterres-un-to-punish-staffers-involved-in-terror-urges-unrwa-funding-3285030",
  "paragraph": "2/2\n© Reuters. FILE PHOTO: United Nations Secretary-General Antonio Guterres addresses delegates at the opening of the Third South Summit (G77+China) in the Munyonyo suburb, of Kampala, Uganda January 21, 2024. REUTERS/Abubaker Lubowa/File Photo\n2/2\nBy Michelle Nichols NEW YORK (Reuters) -United Nations Secretary-General Antonio Guterres vowed on Sunday to hold to account \"any U.N. employee involved in acts of terror\" after allegations that some refugee agency staffers were involved in the Oct. 7 Hamas attacks on Israel. But Guterres implored governments to continue supporting the U.N. refugee agency for Palestinians (UNRWA) after nine countries paused funding. \"Any U.N. employee involved in acts of terror will be held accountable, including through criminal prosecution,\" the U.N. chief said in a statement. \"The Secretariat is ready to cooperate with a competent authority able to prosecute the individuals in line with the Secretariat’s normal procedures for such cooperation.\" At the same time, he said, \"The tens of thousands of men and women who work for UNRWA, many in some of the most dangerous situations for humanitarian workers, should not be penalized. The dire needs of the desperate populations they serve must be met.\" In his first direct comments on the issue, the U.N. chief gave details about the UNRWA staffers implicated in the \"abhorrent alleged acts.\" Of the 12 implicated, he said, nine had been terminated, one was confirmed dead and the identities of the other two were being clarified. Britain, Germany, Italy, the Netherlands, Switzerland and Finland on Saturday joined the United States, Australia and Canada in pausing funding to the aid agency, a critical source of support for people in Gaza, after the allegations by Israel. \"While I understand their concerns – I was myself horrified by these accusations - I strongly appeal to the governments that have suspended their contributions to, at least, guarantee the continuity of UNRWA’s operations,\" Guterres said. \nAdopting a sharper tone, UNRWA chief Philippe Lazzarini said, \"It would be immensely irresponsible to sanction an Agency and an entire community it serves because of allegations of criminal acts against some individuals, especially at a time of war, displacement and political crises in the region. \" In a statement he urged countries to reconsider funding suspensions. \"The lives of people in Gaza depend on this support and so does regional stability,\" Lazzarini said."
}