{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0302D_L.jpg",
  "title": "Mask mandates return at some US hospitals as COVID, flu jump",
  "category": "Stock market news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 03, 2024 10:07PM ET",
    "Updated Jan 04, 2024 11:46AM ET"
  ],
  "comments": [
    2,
    [
      [
        "Carl Tom",
        "2024-01-04 14:06:37",
        "you can't fix MAGA Stupid",
        "https://www.investing.com/members/248294422"
      ],
      [
        "John Kelly",
        "2024-01-04 09:03:02",
        "Whatever. Just in time for the elections. Go Brandon",
        "https://www.investing.com/members/215398235"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/stock-market-news/mask-mandates-return-at-some-us-hospitals-as-covid-flu-jump-3266774",
  "paragraph": "© Reuters. FILE PHOTO: Dr. Syed Naqvi, a pulmonologist, dons an N95 mask before entering the ICU at SSM Health St. Anthony Hospital amid the outbreak of the coronavirus disease (COVID-19) in Oklahoma City, Oklahoma, U.S., January 28, 2021. REUTERS/Nick Oxford/File \nBy Brad Brooks (Reuters) - Hospitals in at least four U.S. states have reinstated mask mandates amid a rise in cases of COVID, seasonal flu and other respiratory illness.  Healthcare facilities in New York, California, Illinois and Massachusetts have made masks mandatory among patients and providers.  New York City Health Commissioner Dr. Ashwin Vasan told WABC TV on Wednesday that mask mandates had resumed at all 11 of the city's public hospitals, 30 health centers and five long-term care facilities.  \"What we don't want is staffing shortages, right? When we saw the omicron wave in 2022, the biggest issues were not only people getting sick, but that we had a lot of frontline health workers, they were out with COVID,\" Vasan told WABC.  The most recent weekly data from the Centers for Disease Control and Prevention showed there were over 29,000 hospitalizations from COVID across the U.S. from Dec. 17-23, up more than 16% from the previous week. The CDC also reported over 14,700 flu hospitalizations in that same period.  Mask mandates were political and cultural flashpoints during the COVID pandemic, sparking anger among those who bucked medical advice and felt masks did little to suppress the spread of the illness.  A conservative-dominated Supreme Court struck down President Joe Biden's federal vaccine-or-test mandate for companies, and a judge appointed by his Republican predecessor struck down his public transportation mask mandate.  There was also deep resentment among those who did wear masks and felt their health was put in jeopardy by those who did not.  More than 1.1 million Americans have died from COVID, CDC figures show, a greater rate than most other wealthy countries.  Rush University medical system in Chicago said on Tuesday that it was requiring \"patients, visitors and staff to wear hospital-approved masks in some areas of the campus. They include clinical waiting areas and patient registration.\"  Cook County Health, which encompasses Chicago, and Endeavor Health in the Chicago suburbs, last month started requiring masks again, after the Illinois Department of Public Health asked hospitals to step up mitigation efforts in several areas, including facility-wide masking.  \nIn Massachusetts, Berkshire Health Systems began mandatory masking on Wednesday, according to a statement.  In California, Los Angeles County on Saturday reinstated masking at all licensed health care facilities, according to a county statement provided to the City News Service. The county's health department did not immediately respond to a request for comment."
}