{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0R09A_L.jpg",
  "title": "North Korea tests submarine-launched cruise missiles, KCNA says",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 28, 2024 04:28PM ET",
    "Updated Jan 29, 2024 12:31AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/north-korea-tests-submarinelaunched-cruise-missile-kcna-says-3285378",
  "paragraph": "© Reuters. FILE PHOTO: North Korean leader Kim Jong Un attends the 19th expanded political bureau meeting of the 8th Central Committee of the Workers' Party of Korea, which was held from January 23 to 24, in Pyongyang, North Korea, in this image released by the Kore\nBy Jack Kim SEOUL (Reuters) -North Korea tested its new submarine-launched cruise missiles (SLCM) on Sunday, firing an upgraded missile for the second time in a week and accelerating its navy's nuclear armament, state media reported on Monday. Leader Kim Jong Un supervised the test of the missile, called \"Pulhwasal-3-31,\" which is identical to the strategic cruise missiles that the North test-launched last week as part of upgrading its weapons system. State news agency KCNA and official Rodong Sinmun newspaper said the missiles flew above the sea off the country's east coast for 7,421 seconds and 7,445 seconds and hit an unspecified island target, indicating the flight time exceeded two hours. Kim called the test a success, KCNA said, \"which is of strategic significance in carrying out the plan...for modernizing the army which aims at building a powerful naval force.\"  South Korea's military said on Sunday that the North fired multiple cruise missiles off its coast but did not provide details. On Monday, it said the claimed flight time was an exaggeration saying it tracked the missiles real time and also played down the possibility it was propelled by solid fuel. Last week, the North said it had tested a new strategic cruise missile, implying it was designed to carry a nuclear warhead, but at the time did not mention it was being developed for submarine launch.  State media photographs published on Monday showed a missile launching into a cloudy sky from the water trailed by a plume of smoke which obscures the type of platform it was being fired from.  North Korea's cruise missiles are typically less controversial and are not explicitly banned under U.N. Security Council resolutions. But analysts have said intermediate-range cruise missiles were no less a threat than ballistic missiles and are a serious capability for North Korea. In recent months, the North has tested an array of weapons that include ballistic missile systems that are under development and an underwater drone. Kim separately inspected the construction of a nuclear submarine and discussed issues related to the manufacturing of other types of new warships, KCNA said but gave no details. North Korea last year launched what it called its first operational nuclear attack submarine, which analysts said appeared to be a modified from an existing submarine and likely designed to carry ballistic and cruise missiles.  There was scepticism over the real-world utility of such a vessel, especially compared to the more advanced land-based missile systems, because its diesel propulsion generates noise and is limited in range, according to weapons experts. \nSouth Korea's military said on Monday it believed the submarine \"has no military use\" and the vessel appeared to be under repair or maintenance. Kim said at the time the country would accelerate the programme to build nuclear-powered submarines."
}