{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK020G5_L.jpg",
  "title": "Israeli parents grieve in flat full of memories and bullet holes",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 03, 2024 10:24AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/israeli-parents-grieve-in-flat-full-of-memories-and-bullet-holes-3266541",
  "paragraph": "5/5\n© Reuters. Avi Hasidim, the father of Naor Hasidim, embraces Anati Elkabets, the mother of Sivan Elkabets, an Israeli couple who were killed during the deadly October 7 attack by gunmen from Palestinian Islamist group Hamas, in the apartment in which Naor and Sivan \n2/5\nBy Maayan Lubell KFAR AZA, Israel (Reuters) - Inside a bullet-riddled flat in Israel's Kfar Aza kibbutz, a set of photos show moments in the lives of the young couple who used to live there: sitting on a chairlift above a snowy slope, posing in military service uniforms, smiling for a selfie. Other photos on display document the scene after they were killed by Hamas militants on Oct. 7: blood stains on the floor and the sofa, bullet holes and traces of grenade shrapnel everywhere, clothes strewn amid overturned furniture. Sivan Elkabets and her long-term boyfriend, Naor Hasidim, who would have turned 24 on Wednesday, are now buried side by side in the city of Ashdod, about 50 km (31 miles) from the kibbutz. \"Today is his birthday. I came here to spend some time sitting in communion with him, to pray,\" said Naor's father, Avi Hasidim, during a visit to the ruined flat. He was wearing a T-shirt with a photo of Naor and Sivan on the front. \"There is a hole in my heart. I hope -- I don't know if it will close. It is opening wider and wider and wider,\" he said. Kfar Aza was one of the places hardest hit on Oct. 7, when Hamas gunmen invaded southern Israel from Gaza and killed 1,200 Israelis, raped and mutilated some women, and took 240 hostages, according to Israeli authorities. Israel responded by blockading, bombarding and invading the densely populated Gaza Strip, killing more than 22,000 people, according to Palestinian health officials, displacing most of the strip's population and causing a humanitarian catastrophe. The sound of explosions in Gaza could be heard on Wednesday from Kfar Aza, which is located close to the border fence, as Israeli forces kept up their assault on the Palestinian enclave. 'HUMAN REMAINS ON THE SOFA' On the walls inside and outside the flat where Sivan and Naor lived were inscriptions scrawled by Israeli soldiers and sappers who went from home to home after the Hamas rampage, clearing explosives and locating bodies to be recovered and buried. One inscription read: \"Human remains on the sofa\". Sivan's mother, Anati Elkabets, also returned on Wednesday to mourn and to show relatives and visitors the flat and the displays of photographs, which she has arranged as a kind of memorial to the young couple. \nHasidim said happy memories of them were the only thing giving him strength to cope with his grief. He recalled their joy at the wedding of his eldest daughter, four months ago. \"How he danced, how she danced. How they hugged and kissed. How much they loved everyone and everyone loved them. These are the most beautiful memories in the world.\""
}