{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "US issues sanctions targeting revenue supporting Houthi attacks",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 12, 2024 10:40AM ET",
    "Updated Jan 12, 2024 11:06AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-issues-sanctions-targeting-revenue-supporting-houthi-attacks-3273649",
  "paragraph": "By Daphne Psaledakis WASHINGTON (Reuters) -The U.S. on Friday issued sanctions targeting commodity shipments financing Iran's Quds Force and Yemen's Houthis as Washington stepped up pressure on the Iran-backed Houthis over attacks on international shipping. The revenue from the commodity sales supports the Houthis and their attacks against international shipping in the Red Sea and the Gulf of Aden, the U.S. Treasury Department said in a statement. The Treasury said it imposed sanctions on a Hong Kong-based company and a United Arab Emirates-based company shipping Iranian commodities on behalf of the network of a Quds Force-backed Houthi financial facilitator already under U.S. sanctions. It also targeted four oil tankers. The Treasury said one of the tankers, owned by Hong Kong-based Cielo Maritime Ltd, has shipped Iranian commodities to China on behalf of the facilitator, Sa’id al-Jamal. Another of the tankers sought to disguise the origin of the goods using forged documents, the Treasury said. The sanctions come after U.S. and British warplanes, ships and submarines launched dozens of air strikes across Yemen overnight in retaliation against Houthi forces for attacks on Red Sea shipping, widening regional conflict stemming from Israel's war in Gaza. “The United States continues to take action against the illicit Iranian financial networks that fund the Houthis and facilitate their attacks,” the Treasury's Under Secretary for Terrorism and Financial Intelligence, Brian Nelson, said. “Together with our allies and partners, we will take all available measures to stop the destabilizing activities of the Houthis and their threats to global commerce.\" The Houthis, an armed movement that has taken control of most of Yemen over the past decade, have been attacking shipping lanes at the mouth of the Red Sea, where 15% of the world's seaborne trade passes on routes between Europe and Asia. The U.S. and allies deployed a naval task force to the area in December, and the situation had escalated in recent days. Houthi attacks on commercial ships have forced shipping lines to send vessels on a longer, costlier route around Africa. This has raised fears of a new bout of global inflation and supply chain disruptions. The U.S. has also accused Iran of being involved operationally in the Houthi attacks, providing military capabilities and intelligence to carry them out."
}