{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0K0CG_L.jpg",
  "title": "Israel's Katz skirts EU talk of two-state solution with video show",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 21, 2024 06:18PM ET",
    "Updated Jan 23, 2024 02:51AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Mark Jannetty",
        "2024-01-22 10:54:39",
        "keep up the bombing",
        "https://www.investing.com/members/241633026"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/israeli-palestinian-ministers-to-attend-meeting-where-eu-will-push-for-peace-3279041",
  "paragraph": "2/2\n© Reuters. FILE PHOTO: Israeli Energy Minister Israel Katz listens to a talk on the gas platform for Leviathan, Israel's largest gas field, talks, near Haifa bay, northern Israel, August 1, 2023. REUTERS/Ari Rabinovitch/File Photo\n2/2\nBy Andrew Gray and John Irish BRUSSELS (Reuters) -Israel's foreign minister sidestepped discussion of a two-state solution to the Israeli-Palestinian conflict at a meeting with European Union counterparts on Monday, opting to show them aspirational videos of future infrastructure projects. The minister, Israel Katz, was in Brussels for discussions on the Middle East, focusing largely on the consequences of Palestinian militant group Hamas' Oct. 7 attack on Israel and Israel's retaliatory offensive in Gaza. EU ministers were keen to stress their calls for the establishment of a Palestinian state alongside Israel as part of a comprehensive long-term peace settlement. But the Israeli government has pushed back against such calls. At the meeting, Katz showed the ministers videos of an envisioned artificial island off the coast of Gaza and a rail network linking the Middle East to India, EU foreign policy chief Josep Borrell and other EU diplomats said. Borrell made clear he was not impressed with the move. \"The minister showed us a couple of videos which had little or nothing to do with the issues we were discussing,\" Borrell told reporters, adding that he thought Katz could have made better use of his time with his EU colleagues. Diplomats said the videos were part of ideas presented by Katz in a previous role and surprised others in the room. The EU ministers also met separately with their counterparts from Saudi Arabia, Egypt and Jordan, as well as with Palestinian Foreign Minister Riyad al-Maliki as they discussed both the current crisis in Gaza and the broader Middle East. PEACE PAPER Ahead of the meeting, Borrell sent a discussion paper to the EU's 27 member countries, suggesting a roadmap to peace in the broader Israeli-Palestinian conflict. At the heart of the plan is a call for a \"preparatory peace conference\" to be organised by the EU, Egypt, Jordan, Saudi Arabia and the League of Arab States, with the United States and United Nations also invited to be conveners of the gathering. But Monday's meeting did not appear to shift Israel's position a day after Prime Minister Benjamin Netanyahu reaffirmed a hard line against any Palestinian state on the basis that it would pose \"an existential danger\" to Israel.  Nonetheless, Borrell said he wanted to press ahead with international efforts to implement a two-state solution, although he did not spell out how this could be achieved if Israel continued to oppose it. The last talks on such a solution collapsed a decade ago amid mutual mistrust and intransigence. Israel's massive aerial and ground offensive in small, densely populated Gaza has killed more than 25,000 Palestinians, according to the Hamas-run enclave's health authorities, flattened built-up areas and left most of its 2.3 million people homeless. Israel has said the war could go on for \"many months\" and it would not rest until Hamas was eradicated, all Israeli hostages freed and the Gaza Strip posed no more security threat. On his way into the meeting, Katz told reporters he wanted the EU to focus on efforts to crack down on Hamas' network and to help free the hostages held by the militant group. \nBut Jordanian Foreign Minister Ayman Safadi said it was time for the international community to declare that a two-state solution was the only option and implement it. \"A moment of truth is upon us,\" he said."
}