{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "Enduring pain keeps public support for Gaza war strong in Israel",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 18, 2024 06:56AM ET",
    "Updated Jan 18, 2024 07:19AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/enduring-pain-keeps-public-support-for-gaza-war-strong-in-israel-3277213",
  "paragraph": "By Estelle Shirbon TEL AVIV (Reuters) - Life in Tel Aviv appears normal for Rhona Ukrainsky three months after Hamas killed 1,200 Israelis on Oct. 7, but the pain and fear are just under the surface, causing her to cry when the subject is mentioned and flinch when she hears a loud noise. The trauma inflicted by the deadliest day for Jews since the Holocaust has not faded. She feels distraught over the hatred directed at her country by Hamas and its allies, and fearful for the safety of her three young children. \"Sometimes you just try to keep with daily things, take the kids, go to work,\" said Ukrainsky, 35, a finance director at a medical equipment company, who was out walking in the city with her newborn baby in a pram. \"But it's lying down there at the bottom of the heart,\" she said, unable to contain her tears. Just over 100 days after Oct. 7, enduring pain is a key reason why polls in Israel show consistently high support for its military offensive in Gaza, even as optimism over whether it can achieve its stated goals has started to erode. Israeli forces have laid waste to much of the Palestinian enclave, killing over 24,000 people and wounding over 61,000, Gaza health officials say, as well as displacing most of the population, causing widespread hunger and disease. The scale of the deaths and suffering in Gaza have shocked much of the world and prompted widespread criticism of Israel's actions, including accusations of genocide brought by South Africa at the U.N.'s top court -- dismissed as false by Israel. But within the country the media are not dwelling on the unfolding humanitarian disaster in Gaza, and for most people the focus is on doing whatever it takes to keep Israelis safe and restore their shattered confidence. \"It's not a war that we chose. It was thrust upon us by this terrible invasion and all the atrocities that were committed,\" said Ray Parnes, 92, who immigrated to Israel from the United States in 1958. \"There's never been a more just war.\" DANGER EVERYWHERE One reason why Oct. 7 is still so painful for Israelis is empathy with over 130 hostages still being held in Gaza, out of an estimated 253 seized by Hamas that day, and with their families. Photos of the hostages are everywhere and tireless campaigning by the families is covered daily by the media. Another is the relentless drip-drip of harrowing details about what happened on Oct. 7, including sexual violence against women, still emerging from witness accounts. Televised funerals of soldiers killed in Gaza are also an emotional wrench in a country where most adults have to do military service and identification with the army is strong. \"For the rest of the world, Oct. 7 is something that happened three months ago, but Israelis are still living it every day,\" said commentator Chemi Shalev. In a society steeped in the history of antisemitic persecution, from Biblical times to the Holocaust, the scale and ferocity of the Hamas attack awakened fears ingrained into people's psyche since childhood, said political scientist Tamar Hermann. She pointed out that Jewish holidays such as Passover, Hanukkah and Purim commemorate moments when the Jewish people escaped from or revolted against persecution, or survived attempted extermination. \"The political culture and religion and everything here socialises Israelis into believing that danger is everywhere all the time,\" said Hermann, the academic director of a polling unit at the authoritative Israel Democracy Institute. Scenes of celebration among some Palestinians after Oct. 7 and polls showing support for Hamas rising in the occupied West Bank, both prominently covered by Israeli media, felt unbearably painful and threatening to most Israelis, she said. 'NO OTHER PLACE FOR US' Hermann said street protests against the war in Gaza, seen across the globe, and condemnation by some governments and U.N. officials, reinforced Israelis' sense of being alone in a hostile world, able to rely only on themselves. \"It makes me feel like there's no place other than Israel for us,\" said Ukrainsky. Oren Persico of the Seventh Eye, an independent website covering Israeli media, said one of the reasons why many Israelis felt the criticism abroad was unfair was because they were not seeing what the rest of the world was seeing in Gaza. Persico said mainstream domestic media were showing images captured by the military, such as strikes on buildings seen from the air, or by journalists embedded with the military, but covered very few personal stories or harrowing scenes like those receiving blanket coverage outside Israel. \"You do not see the wounded, the women and children, you do not see the dead, you do not see the grief of Gazans,\" he said, attributing this to editorial choices. \"The rationale is that showing those pictures might hurt the Israeli war effort.\" \nFor Ukrainsky, like for many of her compatriots, Israel has no choice but to fight Hamas and Palestinian suffering is another tragic consequence of what Hamas did on Oct. 7. \"I feel very compassionate for the suffering of the innocent civilians there in Gaza, but it's too difficult to do this operation (without harming them). We must do what we need to do to protect ourselves as a state and as a nation,\" she said."
}