{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0K02Z_L.jpg",
  "title": "NATO's Steadfast Defender exercises mark return to Cold War schemes, Russia says",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 21, 2024 12:13AM ET",
  "comments": [
    3,
    [
      [
        "Brad Albright",
        "2024-01-21 15:51:00",
        "Another result of Putin's actions that Putin doesn't like.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Ac Tektrader",
        "2024-01-21 08:34:35",
        "what else did anyone expect Lavrov he's Putin's stooge...",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ac Tektrader",
        "2024-01-21 08:23:33",
        "the Russians united NATO against them.. they brought on the new cold war with their brutal invasion of Ukraine...Putin's scheme has failed ..now Russia pays the price for their brutality and will continue to bleed people and treasure until they remove their troops from Ukrainian soil.",
        "https://www.investing.com/members/224473057"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/natos-steadfast-defender-exercises-mark-return-to-cold-war-schemes-russia-says-3278922",
  "paragraph": "© Reuters. FILE PHOTO: Army soldier figurines are displayed in front of the NATO logo and Russian flag colours background in this illustration taken, February 13, 2022. REUTERS/Dado Ruvic/Illustration/File Photo\n(Reuters) - The scale of NATO's Steadfast Defender 2024 exercises mark an \"irrevocable return\" of the alliance to Cold War schemes, Russia's Deputy Foreign Minister Alexander Grushko told the state RIA news agency in remarks published on Sunday. NATO said on Thursday it was launching its largest exercise since the Cold War involving some 90,000 troops, rehearsing how U.S. troops could reinforce European allies in countries bordering Russia and on the alliance's eastern flank if a conflict were to flare up with a \"near-peer\" adversary. \"These exercises are another element of the hybrid war unleashed by the West against Russia,\" Grushko told RIA.  \"An exercise of this scale ... marks the final and irrevocable return of NATO to the Cold War schemes, when the military planning process, resources and infrastructure are being prepared for confrontation with Russia.\" NATO did not mention Russia by name in its announcement. But its top strategic document identifies Russia as the most significant and direct threat to NATO members' security.  \nRussia launched a full-scale invasion of Ukraine in February 2022 in what Kyiv and its Western allies have said was an unprovoked imperialistic land grab.  Moscow, and its chief diplomat Foreign Minister Sergei Lavrov, have since often accused \"the collective West\" of conducting a \"hybrid war\" against Russia by backing Ukraine through financial and military aid."
}