{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBT044_L.jpg",
  "title": "Sweeping Chinese military purge exposes weakness, could widen",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 30, 2023 09:02AM ET",
    "Updated Dec 31, 2023 01:00AM ET"
  ],
  "comments": [
    1,
    [
      [
        "P Lance Sheldon",
        "2023-12-30 14:32:16",
        "\"Corruption\". Could be the purge targeted corruption. Or it could be the purge targeted road blocks to higher up corruption.",
        "https://www.investing.com/members/255854011"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/analysissweeping-chinese-military-purge-exposes-weakness-could-widen-3264891",
  "paragraph": "© Reuters. FILE PHOTO: Chinese President Xi Jinping waves from a vehicle as he reviews the troops at a military parade marking the 70th founding anniversary of People's Republic of China, China October 1, 2019. REUTERS/Thomas Peter/File Photo\nBy Yew Lun Tian and Laurie Chen BEIJING (Reuters) -A sweeping purge of Chinese generals has weakened the People's Liberation Army, exposing deep-rooted corruption that could take more time to fix and slow Chinese leader Xi Jinping's military modernization drive amid geopolitical tensions, analysts say.  China's top lawmakers senior military officers from the national legislative body on Friday, state media reported, a step that typically precedes further punishment for wayward cadres. Many of these were from the Rocket Force - a key arm of the PLA overseeing tactical and nuclear missiles. The purges are a setback for Xi who has pumped billions into buying and developing equipment as part of his modernising efforts to build a \"world-class\" military by 2050, with Beijing's outsized defence budget growing at a faster pace than the economy for some years. The recent downfall of generals and military equipment suppliers, however, has punctured some of this aura, and raised questions over whether there has been adequate oversight over these massive military investments as China vies with the United States in key areas, including Taiwan and the South China Sea.  Since Xi took power in 2012, he has embarked on a wide-ranging anti-corruption crackdown among Communist Party and government officials, with the PLA being one of its main targets.  The nine PLA generals removed from the legislature hailed from several military divisions; three were former commanders or vice commanders of the PLA Rocket Force; one a former Air Force chief and one a Navy commander responsible for the South China Sea. Four officers were responsible for equipment. \"It is a clear sign that they are being purged,\" said Andrew Scobell, Distinguished Fellow for China at the United States Institute for Peace. 'MORE HEADS WILL ROLL' Beijing did not explain why the generals were removed. Some analysts say the evidence points towards corruption over equipment procurement by the PLA Rocket Force. \"More heads will roll. The purge that centred around the Rocket Force is not over,\" said Alfred Wu, associate professor, Lee Kuan Yew School of Public Policy in Singapore. Wei Fenghe, a former defence minister who used to head the Rocket Force, has also vanished. When asked about his whereabouts, a defence ministry spokesman said in August that the military has zero tolerance for corruption. His successor, Li Shangfu, was abruptly removed as defence minister in October without explanation after also disappearing for months. He had previously headed the equipment department. One of his then deputies was removed from parliament on Friday. On the same day, Dong Jun, a Chinese ex-Navy chief, with a South China Sea background, was named Li's replacement as defence minister.  Analysts say that while the Chinese military has long been known for corruption, the extent of the latest crackdown and the involvement of the PLA's Rocket Force is shocking. \"This part of the PLA would have the most rigorous vetting process for senior officers, given the importance of having highly trusted men in charge of China's nuclear weapons,\" said Dennis Wilder, senior fellow for the Initiative for U.S.-China Dialogue on Global Issues at Georgetown University. \"Moreover, it seems to have involved several senior men rather than one 'bad apple'.\" Analysts say the purge of senior military leaders could leave the Rocket Force temporarily weakened until Xi manages to put the house in order.  \"The strategic nuclear force is what China relies on as the bottom line of its national security, and the last resort on Taiwan,\" said Yun Sun, Director of the China Program at the Stimson Center, a Washington D.C.-based thinktank. \"It will take some time for China to clean up the mess and restore confidence in the Rocket Force's competence and trustworthiness. It means for the time being, China is at a weaker spot.\" Sun described Xi's campaign to stamp out military corruption as a Sisyphean task \"that can never be completed\". FIGHT AND WIN BATTLES? In the longer run, analysts expect the chronic problem of corruption to persist in the Chinese military because some root causes - including low pay for officers and opacity in military expenditure - have not been addressed. Chen Daoyin, formerly an associate professor at Shanghai University of Political Science and Law, said that the ongoing crackdown might dissuade Xi from risking serious clashes with other militaries in the next 5-10 years. \n\"Before realising how rampant corruption was, he drank his Kool-Aid and thought the military can really 'fight and win battles' as expected by him,\" said Chen, who is now a political commentator based in Chile. \"But how can the generals' hearts be in fighting, if they are just busy lining their own pockets? Xi now knows that their proclamations of loyalty to the party and to the military ring hollow. I imagine this would zap his confidence somewhat.\""
}