{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0K06E_L.jpg",
  "title": "Ukraine shelling of Russian-controlled city of Donetsk kills 27, officials say",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 21, 2024 06:50AM ET",
    "Updated Jan 22, 2024 01:56PM ET"
  ],
  "comments": [
    4,
    [
      [
        "EL LA",
        "2024-01-21 23:37:02",
        "Why is Ukraine directly bombing innocent civilians?",
        "https://www.investing.com/members/240182636"
      ],
      [
        "Engin Rençber",
        "2024-01-21 22:21:40",
        "Elephants tussle, grasses are trampled. :(",
        "https://www.investing.com/members/207706984"
      ],
      [
        "Ken Roth",
        "2024-01-21 17:12:39",
        "At least 250.000 kil..led in ukraine by russia, when a russian is moving his lips he is lying and spreading fake news",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Otis Grant",
        "2024-01-21 15:29:47",
        "Lol puketin claiming terrorism in an illegally annexed city under occupation ",
        "https://www.investing.com/members/251132356"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/eighteen-killed-after-ukraine-shells-russiancontrolled-city-of-donetsk--officials-3278939",
  "paragraph": "6/6\n© Reuters. A man mourns his wife, who was killed while working at a food market following, what local Russian-installed authorities say, was a Ukrainian military strike in the course of Russia-Ukraine conflict in Donetsk, Russian-controlled Ukraine, January 21, 2024\n2/6\n(Reuters) -Twenty-seven people were killed and 25 injured when Ukrainian forces shelled the Russian-controlled city of Donetsk in eastern Ukraine, Denis Pushilin, the Russian-appointed head of the Donetsk region, said on Sunday. According to Alexei Kulemzin, the city's Russian-installed mayor, Ukrainian forces bombarded a busy area where shops and a market are located. Pushilin said the city was shelled by Ukrainian artillery.  Reuters photographs and video taken at the scene showed crying people, some of whom said they had lost relatives, and bodies lying on blood-soaked snow near one of the city's markets. Pushilin announced a day of mourning on Monday in the Donetsk People's Republic, the name given to the part of the region Russia says it has annexed. In his nightly video address, Ukrainian President Volodymyr Zelenskiy did not address the attack but said that in a single day, Russia had shelled more than 100 cities, towns and villages in nine regions in Ukraine, and that the attacks in Donetsk region had been \"particularly severe.\" Ukraine's forces in the Tavria, or southern zone, said in a Facebook (NASDAQ:META) post that soldiers under its command were not responsible. \"Donetsk is Ukraine!\" it said. \"Russia will have to answer for taking lives of Ukrainians.\" Pushilin said 18 of the injured were hospitalised and seven being treated as outpatients. In Moscow, the Russian Foreign Ministry called the attack \"a barbaric act of terrorism\" by Ukraine that was carried out \"with the use of weapons supplied by the West\".  \"The Russian side categorically condemns this treacherous strike against the civilian population,\" a ministry statement said. Russia, which launched a full-scale invasion of Ukraine almost two years ago, has voiced outrage in the past when Ukrainian attacks have killed civilians in Donetsk and other areas. Russia's own campaign of air strikes and heavy shelling, however, has killed thousands of Ukrainian civilians. The governor of the Ukrainian-controlled part of the region, Vadym Filashkin, said Russian attacks killed at least two people at two locations west of the city of Donetsk on Sunday. At Kurakhove, about 45 km (28 miles) from Donetsk, shelling killed a 31-year-old man and injured another person, while a 62-year-old man was killed and a 70-year-old man injured at Krasnohorivka between Donetsk and Kurakhove, he said. \"I call on everyone who remains in Donetsk: evacuate!\" Filashkin said in a post on the Telegram messaging app.  Donetsk is one of four regions in Ukraine's east and south that Russia claimed to have annexed in late 2022 in a move condemned as illegal by most countries at the U.N. General Assembly. Russia does not fully control any of the four regions. In three other incidents in the region, Pushilin said, a man born in 1979 was killed and another born in 1957 wounded by shelling, and another four people were injured. \nSeparately on Sunday, Russia's defence ministry said Russian forces had taken control of the village of Krokhmalne in Ukraine's northeastern Kharkiv region.  A Ukrainian military spokesperson confirmed that Kyiv's forces had withdrawn from the area but said the lost territory was tiny and of no consequence for the overall military situation."
}