{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK070D3_L.jpg",
  "title": "Bosnian river's floating waste dump threatens health, tourism",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 08, 2024 06:31AM ET",
    "Updated Jan 08, 2024 05:07PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/bosnian-rivers-floating-waste-dump-threatens-health-tourism-3269161",
  "paragraph": "5/5\n© Reuters. Environmental activist Robert Oroz looks at the floating rubbish dump in the canyon of the Drina river, near the town of Visegrad, Bosnia and Herzegovina January 5, 2024. REUTERS/Amel Emric\n2/5\nBy Amel Emric VISEGRAD, Bosnia (Reuters) - Visitors to the otherwise picturesque historic town of Visegrad in eastern Bosnia are first greeted by the sight of a huge floating waste dump caught in the deep turquoise waters of the Drina river canyon. The tons of floating garbage, mostly plastic bottles, are a threat to the local tourism-based economy and there are also fears about the impact on people's health when it is eventually burnt.  The Drina winds its way through Montenegro, Serbia and Bosnia, where the Visegrad hydro-power plant built a makeshift barrier out of old oil drums in the depths of the canyon some 20 years ago, protecting its dam from the debris carried by the river. \"There are about 5,000 cubic metres of different kinds of waste,\" said Eko Center Visegrad's Dejan Furtula, pointing to the trash barrier. \"It comes from all sides and this scene repeats each year, unfortunately.\" Furtula says the rubbish, which also includes the occasional home appliance, is carried from the Drina's upstream tributaries where rising water levels after heavy rains or snow wash garbage from nearby waste sites into the river.  \"You can find literally anything you can think of in the Drina river...dead animals, medical waste, car parts,\" Furtula said. \"We are like a sort of a regional waste depot because this trash has not been produced by Visegrad citizens but by those living in towns upstream.\"  He said toxic waste threatened the river's delicate ecological system and when it is burnt also the air Visegrad citizens and visitors must breath. \"This is a big disaster and shame for all of us, we are showing the world a bad picture,\" Furtula said, adding that ecologists suspect the river is also contaminated by heavy metals, and that a thorough water analysis will be undertaken this year.  Owners and employees of hotels and restaurants in Visegrad, known for its Ottoman-era bridge made famous by Yugoslav Nobel literature prize winner Ivo Andric, also complain that the waste dump is hurting tourism. \n\"Tourists first spot the garbage dump in the Drina and make negative comments - this influences both the tourism and the people who live here,\" said Dijana Rajic, chief receptionist at the Andricev Konak hotel. The Visegrad hydro-power plant could not immediately be reached for comment over a holiday period."
}