{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0O0TV_L.jpg",
  "title": "US warned Iran of 'terrorist threat' before Jan. 3 attack -official",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 25, 2024 03:21PM ET",
    "Updated Jan 25, 2024 03:26PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-warned-iran-of-terrorist-threat-before-jan-3-attack-official-3283416",
  "paragraph": "© Reuters. People attend the funeral ceremony of the casualties of the Islamic State attack in Kerman, Iran, January 5, 2024. Iran's Presidency/WANA (West Asia News Agency)/Handout via REUTERS/File Photo\nBy Simon Lewis and Arshad Mohammed WASHINGTON (Reuters) - The U.S. government privately warned long-time antagonist Iran about a \"terrorist threat\" within its borders ahead of a deadly attack this month that was claimed by the Islamic State militant group, a U.S. official said on Thursday. While the official said the warning about the Jan. 3 attack - two suicide bombings in the southeastern city of Kerman that killed nearly 100 people and wounded scores - was routine, analysts said it may imply a U.S. effort to build trust with Iran. Such an effort would come against the backdrop of attacks by Iran-backed proxies on Western interests, including the Oct. 7 Hamas rampage that killed some 1,200 in southern Israel and missile attacks on Saturday on an Iraqi air base housing U.S. troops. \"The U.S. government followed a longstanding 'duty to warn' policy that has been implemented across administrations to warn governments against potential lethal threats. We provide these warnings in part because we do not want to see innocent lives lost in terror attacks,\" said the U.S. official on condition of anonymity.  The Wall Street Journal first reported the warning on Thursday. Jon Alterman, director of the Middle East program at the CSIS think tank in Washington, said the warning may reflect a wider U.S. desire to seek dialogue with Iran despite recent attacks by Iranian-backed proxies on U.S., Israeli and other Western interests and the advances of Tehran's nuclear program. \"This is an olive branch,\" Alterman said, adding that U.S. President Joe Biden's administration came into office believing dialogue between Washington and Tehran could benefit both sides.  Efforts by Biden, a Democrat, to revive the 2015 Iran nuclear deal - which Republican former President Donald Trump abandoned in 2018 - have failed but Alterman suggested that Biden aides still wanted to explore ways to talk to Tehran. \"They have always believed in the desirability of dialogue, and that the problem is about what and on what terms,\" he said. \"This was an opportunity to begin to build trust, which strikes me as a page from the diplomatic playbook.\" \nAaron David Miller of Washington’s Wilson Center think tank largely concurred, noting the failed efforts on the nuclear deal and the improbability of transforming relations that have been largely antagonistic since the Islamic Republic's birth. \"You can't transform the U.S.-Iranian relationship. All you can do is to look for opportunities ... to transact, to de-escalate, and avoid an escalatory ladder that would lead to war,\" he said."
}