{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "Florida police clear state's ousted GOP chairman in sexual battery investigation",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 19, 2024 09:09PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/florida-police-clear-states-ousted-gop-chairman-in-sexual-battery-investigation-3278747",
  "paragraph": "By Brad Brooks (Reuters) - Police in Florida said on Friday they have cleared the ousted chairman of the state's Republican Party on sexual battery allegations but asked prosecutors to review their investigation of a possibly illegal recording of a sexual encounter. Christian Ziegler was accused in October of rape by a woman who previously had a sexual encounter with him and his wife, according to a warrant issued by a Florida Circuit Court in Sarasota. The Sarasota, Florida, police department said in a written statement they also investigated Ziegler for suspected \"video voyeurism\" after the woman accused him of filming a sexual encounter with without her consent.  Local and state prosecutors did not immediately respond to requests for comment. Ziegler's lawyer Derek Byrd said in an emailed statement that \"since day one, we have been confident Mr. Ziegler would be exonerated from these baseless allegations.\"  With regard to the police request for prosecutors to review the video voyeurism investigation, Byrd said: \"We strongly believe that the State Attorney will not prosecute Mr. Ziegler for any crime.\" The Florida Republican Party earlier this month forced Ziegler from his post. Florida Governor Ron DeSantis, who is seeking the GOP presidential nomination, had called on Ziegler to resign in November.  The Sarasota police said on Friday that Ziegler had used his cellphone to record the sexual encounter during which the alleged rape occurred. \"The video showed that the encounter was likely consensual,\" police said. \"Therefore, detectives were unable to develop probable cause to charge Ziegler with sexual battery.\"  Ziegler's accuser, however, told police she did not know she was being filmed, leading them to file a \"probable cause affidavit for the felony crime of Video Voyeurism against Christian Ziegler,\" the statement said.  The scandal has also embroiled Ziegler's wife, Bridget, a Sarasota School Board member who co-founded the conservative parents-rights group Moms for Liberty and has advocated against teaching young children about gender and sexuality issues. No criminal accusations have been lodged against her."
}