{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0F0JJ_L.jpg",
  "title": "Iran strike sparks dispute with Iraq as fears of regional upheaval grow",
  "category": "Commodities news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 16, 2024 08:46AM ET",
    "Updated Jan 16, 2024 09:48PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/commodities-news/iran-strike-triggers-row-with-iraq-as-fears-of-regional-turmoil-grow-3275184",
  "paragraph": "4/4\n© Reuters. A view of a damaged building following missile attacks, in Erbil, Iraq, January 16, 2024. REUTERS/Azad Lashkari\n2/4\nBy Parisa Hafezi and Timour Azhari DUBAI/BAGHDAD (Reuters) -An Iranian missile strike on targets in northern Iraq set off an unusual dispute between the neighbouring allies on Tuesday, with Baghdad recalling its ambassador in protest and Tehran insisting the attack was intended to deter threats from Israeli spies. Iran's Revolutionary Guards hit what they called an Israeli espionage centre in Iraq's semi-autonomous Kurdistan region, Iranian media reported late on Monday, while the elite force said they also struck in Syria against the Islamic State. The strike appeared likely to deepen worries about worsening instability across the Middle East since the war between Israel and Hamas started on Oct. 7, with Iran's allies also entering the fray from Lebanon, Syria, Iraq and Yemen. There has also been concern that Iraq could again become a theatre for regional conflict after a series of U.S. strikes on Iran-linked militant groups that are also part of Iraq's formal security forces. Those strikes came in response to dozens of attacks on U.S. forces in the region carried out since Oct. 7. The Guards said the late Monday attack, Iran's first direct military strike in the region linked to the Gaza war, was in response to Israeli \"atrocities\" against several of its commanders and those of Iranian-allied forces around the Middle East since the conflict started. Iraqi Prime Minister Mohammed Shia al-Sudani said the attack was \"clear aggression\" against Iraq and a dangerous development that undermined the strong relationship between Tehran and Baghdad, state media reported.  He said Iraq reserved its right to take all legal and diplomatic measures granted to it by its sovereignty.  In protest, Iraq recalled its envoy from Tehran and summoned Iran's charge d'affaires in Baghdad.  The strike, on a residential area near the U.S. consulate in Kurdistan's capital Erbil, was described by Iraqi Kurdish Prime Minister Masrour Barzani as a \"crime against the Kurdish people\" in which at least four civilians were killed and six injured. Multimillionaire Kurdish businessman Peshraw Dizayee and several family members were among the dead, killed when at least one rocket crashed into their home, Iraqi security and medical sources said. Iraq National Security Adviser Qasim al-Araji denied the house was an Israeli spy centre. \"To respond to the claim that there is a Mossad headquarters we visited the place and toured every corner of this house, and everything indicates that it is a family house belonging to an Iraqi businessman from Erbil,\" he told reporters. 'RECKLESS' Israeli government spokesperson Avi Hayman said he would not speculate, when asked at a press briefing about Iran's assertion that it struck a Mossad site. \"What I will say is Iran continues to use its proxies to attack Israel on multiple fronts. We condemn Iran's activities and we call on the international community to stand up in defiance of Iran and call for peace in the region,\" he said. Defending the attack, Iranian Foreign Ministry spokesman Nasser Kanaani said Tehran respected the sovereignty and territorial integrity of other countries but it was Iran's \"legitimate right to deter national security threats\". In addition to the Erbil strike, the Guards said they fired ballistic missiles in Syria and destroyed \"perpetrators of terrorist operations\" in Iran, including the Islamic State. Islamic State claimed responsibility for two explosions in Iran this month that killed nearly 100 people and wounded scores at a memorial for top commander Qassem Soleimani. France accused Iran of violating Iraq's sovereignty and Washington condemned the attacks as \"reckless\". U.S. officials said no U.S. facilities were hit and there were no U.S. casualties. Iran, which supports Hamas in its war with Israel, accuses the U.S. of backing what it calls Israeli crimes in Gaza. The U.S. has said it backs Israel in its campaign but has raised concerns about the number of Palestinian civilians killed. \nIran has in the past carried out strikes in Iraq's Kurdistan region, saying the area is used as a staging ground for Iranian separatist groups as well as agents of its arch-foe Israel.  Baghdad has tried to address Iranian concerns over separatist groups in the region, moving to relocate some members as part of a security agreement reached with Tehran in 2023."
}