{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBO04C_L.jpg",
  "title": "Thousands protest over Serbia election result, march to main police station",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 25, 2023 07:50AM ET",
    "Updated Dec 25, 2023 09:52PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/eight-police-injured-38-detained-in-serb-opposition-protest-over-election-3263246",
  "paragraph": "2/2\n© Reuters. A flower is seen amid the broken glass of the door of the city hall during a protest by supporters of the opposition 'Serbia Against Violence' (SPN), after the SPN alleged major election law violations in the Belgrade city and parliament races, in Belgrad\n2/2\nBy Ivana Sekularac BELGRADE (Reuters) -Several thousand people gathered in front of the central election commission building in Belgrade on Monday to protest over an election earlier this month that international monitors said was unfair.  The protesters marched to the main police station where they believed those detained by police were being held.  Earlier in the day, police said 38 people had been detained during and after an opposition protest over election results on Sunday. The police said eight policemen were injured in clashes. Protesters on Sunday broke windows and glass at the main entrance of the town hall, before police used pepper spray to disperse them around 10 p.m. (2100 GMT).  Ivica Ivkovic, head of the police administration, said two of the eight wounded policemen sustained serious injuries.  \"We will continue to work to maintain peace and order and we expect to see more arrests in relation to protests last night,\" Ivkovic told a news conference.  Serbia's ally Russia said foreign-backed forces were trying to foment trouble.  \"There are processes and attempts by third forces, including from abroad, to provoke such unrest in Belgrade,\" Kremlin spokesman Dmitry Peskov said. \"We have no doubt that the leadership of the republic will ensure the rule of law.\" The opposition parties accused police of excessive force, and some social networks showed footage of policemen beating up men in streets near the town hall. RUSSIAN HELP  Outgoing Prime Minister Ana Brnabic thanked the Russian secret service for providing information on planned activities by the opposition. \"This (my statement) is not going to be popular in the West,\" Brnabic, of the ruling Serbian Progressive Party (SNS), said on Serbian television. A European Union aspirant, Serbia has resisted pressure by Western countries to introduce sanctions against Russia.  Moscow has been one of Serbia's closest allies for decades, especially after 1999 when Russia opposed the NATO airstrikes against rump Yugoslavia that comprised Serbia and Montenegro.  An international monitoring mission last Monday said the SNS gained an unfair advantage through media bias, the improper influence of President Aleksandar Vucic and voting irregularities such as vote buying. Serbian authorities deny any irregularities.  \nThe populist ruling Serbian Progressive Party (SNS) won 46.72% of the votes in the Dec. 17 snap parliamentary election, according to state election commission preliminary results.  Serbia Against Violence came second in the election with 23.56% of the vote, and the Socialist Party of Serbia third with 6.56%."
}