{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK090R9_L.jpg",
  "title": "Man duped into placing fake bomb at Harvard pleads guilty",
  "category": "General",
  "publisher": "Reuters",
  "date": [
    "Published Jan 10, 2024 01:53PM ET",
    "Updated Jan 10, 2024 02:08PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/general/man-duped-into-placing-fake-bomb-at-harvard-pleads-guilty-3271755",
  "paragraph": "3/3\n© Reuters. A bag destroyed with a robotic device of Cambridge Police Department?s bomb disposal unit is seen on Harvard University Science Center Plaza in Cambridge, Massachusetts, U.S. April 13, 2023. U.S. District Court/Handout via REUTERS/File Photo\n2/3\nBy Nate Raymond BOSTON (Reuters) - A New Hampshire man who was duped last year into planting a fake bomb on Harvard University's campus as part of plot to extort bitcoin from the Ivy League school pleaded guilty on Wednesday to not alerting authorities to the crime as soon as possible. William Giordani, 55, pleaded guilty in federal court in Boston to a single charge for placing a bag with fireworks, a metal safe and wires on a bench on Harvard's campus in Cambridge, Massachusetts. It prompted an evacuation of the area in April. Prosecutors said Giordani acted in response to a Craigslist ad by someone claiming to be a Harvard student's father who offered $300 for Giordani to deliver materials needed for a science project. Assistant U.S. Attorney John McNeil in court said Giordani's crime was driven by a drug habit and that he told his drug dealer the materials sounded like they were possibly for a bomb. Yet Giordani still bought the materials and left them on the school's campus on April 13 as instructed by the Craigslist poster, McNeil said. Harvard's police department then received calls from a \"computer generated male voice\" claiming three bombs were planted on campus that would detonate unless the school paid a \"large\" amount of bitcoin, according to court papers. A Cambridge police bomb squad executed a controlled destruction of the bag with robotic device. McNeil said the Craigslist poster told Giordani he had been \"hoping to cause a panic.\" According to court papers, Giordani said the individual spouted \"racist things about Blacks and Jews.\" \nGiordani was arrested in May. Under a plea deal, prosecutors will drop one of two counts against him, and he pleaded guilty to a single count for not reporting the hoax. While that charge carries up to three years in prison, McNeil said prosecutors will recommend U.S. District Judge Angel Kelley sentence him on April 25 to three years of probation, citing his progress in intensive drug treatment. No one else has been charged over the hoax."
}