{
  "image": "https://i-invdn-com.investing.com/news/moved_LYNXMPEI5S0H9_L.jpg",
  "title": "Disney's \"new era,\" AI lifts Arm, Alibaba's income miss - what's moving markets",
  "category": "Economy",
  "publisher": "Investing.com",
  "date": "Published Feb 08, 2024 05:21AM ET",
  "comments": [
    1,
    [
      [
        "John Laurens",
        "2024-02-08 11:11:46",
        "DIsney... lmao",
        "https://www.investing.com/members/231182441"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/economy/disneys-new-era-ai-lifts-arm-alibabas-income-miss--whats-moving-markets-3296932",
  "paragraph": "© Reuters \nInvesting.com -- Walt  Disney  's chief executive says the entertainment titan has entered a \"new era\" after it reported higher-than-expected quarterly earnings. Surging demand for artificial intelligence leads Arm to lift its annual guidance, sending shares in both the chip designer and its major stakeholder SoftBank higher. E-commerce giant  Alibaba  's fourth-quarter income misses estimates, as fresh data suggests that China's economic woes have yet to abate.\n1. Futures subdued\nU.S. stock futures largely hovered around the flatline on Thursday, as investors parse through a raft of fresh corporate earnings.\nBy 05:17 ET (10:17 GMT), the S&P 500 futures contract had dipped by 4 points or 0.1%, Nasdaq 100 futures were mostly unchanged, and Dow futures had fallen by 23 points or 0.1%.\nThe main averages on Wall Street climbed in the prior session, with traders cheering on better-than-anticipated quarterly income from companies like carmaker Ford (NYSE:F), burrito chain Chipotle Mexican Grill (NYSE:CMG), and cybersecurity group  Fortinet  (NASDAQ:FTNT). The benchmark S&P 500 rose by 0.8%, closing at a new all-time high, while the tech-heavy Nasdaq Composite advanced by 1.0% and the 30-stock Dow Jones Industrial Average edged up by 0.4%.\nHowever, the buoyant mood was partially offset by comments from Federal Reserve officials that further upended hopes for imminent U.S. interest rate cuts. U.S. government bond yields, which typically move inversely to prices, increased.\nJitters also continued to surround the Chinese stock market, threatening to dent the upbeat sentiment. China's benchmark CSI 300 index has dropped by more than 2% so far this year despite Beijing rolling out a string of support measures, including short-selling bans and personnel changes at the country's top securities regulator.\n2. Disney hails \"new era\"; AI boom lifts Arm\nWalt Disney (NYSE:DIS) shares advanced in premarket U.S. trading on Thursday after the entertainment giant unveiled better-than-expected first-quarter earnings.\nDisney reported adjusted profit per share of $1.22 in the three months ended on Dec. 30, above Wall Street estimates of $1.00, as well as a $3 billion share buyback and 50% uptick in its quarterly dividend. The firm emphasized that it had registered \"significant\" cost savings worth $500 million during the period, and said it was on pace to hit its target of achieving profitablity at its key streaming business by this autumn.\nThe results come as Disney faces a proxy battle from activist investors keen on gaining board seats in order to institute strategic changes that they believe will help boost the company's share price. Yet Disney Chief Executive Bob Iger struck a bullish tone in the wake of the release, saying the numbers showed that the business had \"turned the corner and entered a new era.\"\nMeanwhile, shares in Arm surged in premarket trading after the chip designer hiked its annual guidance as royalty revenue was bolstered by soaring demand for artificial intelligence.\nIn only its second earnings report since going public in September, Arm said it expects future growth will be \"driven by the need for more energy-efficient compute and AI capability.\"\nThe U.K.-based company -- which counts Nvidia (NASDAQ:NVDA), Intel (NASDAQ:INTC) and Apple (NASDAQ:AAPL) among its backers -- also posted fiscal third-quarter adjusted income per share of $0.29, well ahead of Wall Street estimates of $0.25.\nEarnings season marches on today, with results due from names including Marlboro-parent Philip Morris International (NYSE:PM), energy group ConocoPhillips (NYSE:COP), and video game maker Take-Two (NASDAQ:TTWO) Interactive.\n3. Arm results boost SoftBank; Alibaba's earnings miss\nShares in SoftBank Group Corp. (TYO:9984) rallied on Thursday, tracking a roughly $16 billion windfall from an overnight bounce in subsidiary Arm.\nThe Japanese investment house holds around a 90% stake in Arm, meaning that it benefited from an overnight surge in the U.K. firm's stock price. CNBC has reported that SoftBank's stake in Arm jumped in value by almost $16 billion.\nSoftBank also clocked its first profit in five quarters, thanks in part to improving technology valuations on the back of an AI-fueled buying frenzy. It represented a potential turnaround for SoftBank, which has been reeling from an extended rout in the technology sector. The firm's flagship Vision Fund, through which it makes a bulk of its tech bets, saw an investment profit of 600.73 billion yen in the three months to Dec. 31.\nElsewhere, Hong Kong shares in Alibaba Group (NYSE:BABA) (HK:9988) slumped as worsening conditions in China led the e-commerce behemoth to post lower-than-projected fourth-quarter profit, while a $25 billion increase in its share repurchase program did little to inspire confidence. \nThe disappointing earnings came largely from slower revenue increases in the group’s flagship Taobao and Tmall Group, reflecting weak consumer demand in China. \nAlibaba's slide dragged the broader Hang Seng index lower. The group’s American depository receipts also dropped in premarket trading.\n4. Deflation in China deepens\nChinese consumer prices stayed in deflationary territory for the fourth consecutive month on a yearly basis in January, in the latest sign of the economic challenges facing government officials desperate to soothe nervous investors.\nThe country's consumer price index contracted by 0.8% in January, much worse than expectations for a drop of 0.5% and the prior month’s fall of 0.3%. Month-on-month, prices rose by 0.3%, weaker than estimates of 0.4% but faster than the 0.1% uptick in December.\nThe readings came even as the new year holiday spurred some increased consumer spending, particularly on travel and shopping. The People’s Bank of China also further loosened liquidity conditions in the month. \nHowever, consumer sentiment in China has been largely dismal, as concerns remain over a sluggish post-pandemic economic recovery. An anticipated rebound after harsh lockdowns largely failed to materialize in 2023, casting doubts over the resilience of the world’s second-largest economy. \n5. Oil prices muted\nOil prices were muted on Thursday, with traders gauging weak economic indicators from top importer China and faltering Israel-Hamas ceasefire deal negotiations.   \nBrent oil futures expiring in April rose 0.3% to $79.42 a barrel, while West Texas Intermediate crude futures climbed 0.2% to $74.04 per barrel by 05:17 ET. \nPrices were given some support after Israeli Prime Minister Benjamin Netanyahu rejected a ceasefire deal proposed by Hamas leaders, dashing hopes for a halt in hostilities to the conflict.\nU.S.-led forces also continued with their strikes against the the Iran-aligned Houthi group, which in turn gave little indication of ending its attacks on vessels in the Red Sea. The developments heralded more potential supply disruptions in the region, a key shipping artery between Europe and Asia. \nInventory data out of the U.S. provided middling signals on supply and demand as well. While gasoline and distillate inventories saw modest draws in the week to Feb. 2, overall U.S. inventories grew much more than expected as production recovered from a cold snap in January."
}