{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0F0LI_L.jpg",
  "title": "Ukraine's Zelenskiy urges West to keep up pressure on Russia",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 16, 2024 11:50AM ET",
    "Updated Jan 16, 2024 01:26PM ET"
  ],
  "comments": [
    3,
    [
      [
        "Ken Roth",
        "2024-01-17 14:26:20",
        "The old republican party would have helped ukraine immediately but today the republicans are under full control of a few MAGA nuts and 50% of them are too afraid to lose their job in congress on next election so they are willing to sell their soul to Trump",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Ken Roth",
        "2024-01-17 14:20:38",
        "Unfortunately for our Ally this now depends on the republican house ",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Mark Jannetty",
        "2024-01-16 19:43:15",
        "Russia is succeeding in this war. They are draining support of Ukraine, draining the financial and military backing. Russia can carpet bomb them tomorrow but that was never their goal. Bidens bank account is the only one that wants to see this continue ",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Brad Albright",
        "2024-01-16 20:10:02",
        "Another unhinged perspective with no grounding in reality. ",
        "https://www.investing.com/members/236251128"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/ukraines-zelenskiy-urges-west-to-keep-up-pressure-on-russia-3275466",
  "paragraph": "2/2\n© Reuters. Ukraine's President Volodymyr Zelenskiy attends the 54th annual meeting of the World Economic Forum in Davos, Switzerland, January 16, 2024. REUTERS/Denis Balibouse\n2/2\n(Reuters) -Ukrainian President Volodymyr Zelenskiy urged the West on Tuesday to tighten sanctions pressure on Kremlin leader Vladimir Putin and to step up its support for Kyiv to ensure that Moscow did not succeed in its war.  Western hesitation in its backing for Kyiv and fears of an escalation in the war with Russia were costing time and lives, and could prolong the fighting by years, he told the World Economic Forum in Davos in an emotional speech.  With the West's once-staunch wartime support for Kyiv now wavering amid political wrangling in Washington and Brussels, Zelenskiy said that Europeans needed to understand that Putin's plans went beyond the war in Ukraine.  \"In fact, Putin embodies war ... He will not change ... We must change. We all must change to the extent that the madness that resides in this man's head or any other aggressor's head will not prevail,\" Zelenskiy said.  Nearly two years after Russia launched its full-scale invasion, Zelenskiy said he strongly opposed freezing the conflict along its current lines.  \"Putin is a predator who is not satisfied with frozen products,\" he said. He said sanctions on Moscow needed to be enforced properly and that the lack of sanctions on Russia's nuclear sector were an illustration of the West's weakness.  \"Of course, I am grateful for each package of sanctions... Thank you. But bringing peace closer will be a reward for all those who care to ensure that sanctions work one hundred percent,\" he said.  European Union and NATO leaders echoed Zelenskiy's concerns telling the forum the West could not let up supplying Ukraine with weapons and money if it wants Kyiv to prevail. \"Ukrainians need predictable financing throughout 2024 and beyond. They need a sufficient and sustained supply of weapons to defend Ukraine and regain its rightful territory\" European Commission chief Ursula von der Leyen warned. NO CHARITY NATO Secretary-General Jens Stoltenberg, also speaking at Davos, said support for Ukraine was not charity but an investment in the alliance's own security. \"We just have to stand by Ukraine. At some stage, Russia will understand that they are paying too high a price and sit down and agree to some kind of just peace - but we need to stand by Ukraine,\" he stated.  The forum comes as Kyiv's troops are going onto a more defensive footing after a major counteroffensive last year was unable to break through Russian defensive lines in Ukraine's occupied south and east.  Kyiv is now focused on trying to secure Western assistance held up by in the U.S. Congress and Brussels, reforming its conscription effort to replenish manpower and addressing artillery shortages at the front. In a question-and-answer session after his speech, Zelenskiy said he had received \"positive signals\" about the unlocking of financial support from the European Union.  He said he hoped that the United States would approve further aid within weeks. To drive home his point about the need to support Kyiv, he asked rhetorically what other European nation could provide a combat-ready army that could hold back Russian forces.  \n\"If anyone thinks this is only about Ukraine, they’re fundamentally mistaken. Possible directions and even timeline of a new Russian aggression beyond Ukraine become more and more obvious.\" Zelenskiy met senior officials earlier on the sidelines of the forum, including U.S. Secretary of State Antony Blinken, U.S. National Security Advisor Jake Sullivan, NATO's Stoltenberg and international investors such as executives from JPMorgan."
}