{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0H05B_L.jpg",
  "title": "House committee raises doubts about US Navy's Indo-Pacific logistics",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 18, 2024 01:05AM ET",
    "Updated Jan 18, 2024 02:21AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/house-committee-raises-doubts-about-us-navys-indopacific-logistics-3276892",
  "paragraph": "© Reuters. FILE PHOTO: A man uses his mobile phone near the U.S. Capitol in Washington, U.S., January 10, 2024. REUTERS/Nathan Howard/File Photo\nBy Michael Martina WASHINGTON (Reuters) - A U.S. congressional committee on China has sent a letter to the Secretary of the Navy raising doubts about a plan to move fuel from Hawaii to storage facilities across the Indo-Pacific and warning that the U.S. military risks being unprepared for a possible conflict.  In a letter dated Jan. 17 and seen by Reuters, Mike Gallagher, the Republican chair of the House of Representatives' select committee on China, told Secretary Carlos Del Toro that a long-term plan to redistribute fuel from Hawaii's Red Hill underground bulk storage facility was a \"strategic imperative\" in light of China's historic military buildup. The Pentagon in October began to drain the 1940s-era Red Hill facility at Joint Base Pearl Harbor-Hickam after a leak contaminated the water systems there, and said the fuel would be loaded onto tanker ships and transported to existing support sites. The full closure of the site is expected to take several years. Gallagher wrote that he was not convinced the Defense Department had developed a long-term solution and that without a robust logistics network to sustain U.S. bases, ships and aircraft with fuel, the U.S. military in the Pacific would \"grind to a halt.\" \"It is unclear how exactly the Navy will replace and distribute the aggregate bulk fuel capacity of Red Hill,\" Gallagher said, noting that storage capacity at new dispersed locations would require more frequent trips by ships around the Pacific, adding to operational risk. A Navy spokesperson said: \"As with all congressional correspondence, the Department of the Navy will respond, as appropriate. We have nothing additional to provide at this time.\" U.S. military experts have warned about gaps in U.S. defense logistics as China, which now has more naval vessels than the United States, has dramatically expanded its military and not ruled out using force to bring Taiwan under its control. China considers the democratically governed island part of its own territory. U.S. officials have turned to commercial tankers under the Tanker Security Program to give the Pentagon access to U.S.-registered vessels to deliver fuel to the military in the event of a crisis.  That program would not be enough, Gallagher said.  \"The Navy appears to be short – by several dozen – ships that will be needed to transport and deliver fuel to our bases and forces operating across the Indo-Pacific,\" Gallagher said, citing a 2016 Defense Department determination that it would need 86 tankers for moving equipment and supplies for global operations. Gallagher requested that Del Toro detail in writing to the committee whether the department had enough forward fuel storage facilities and access to refinery capacity for operations in the Indo-Pacific, whether it had identified secure locations to build replacement facilities for Red Hill, and whether it had plans to integrate facilities of allies and partners in redistributing fuel.  \n\"We must address potential weaknesses in our logistical supply lines, while we still have the time to do so,\" he said.  Fuel storage in the region can be controversial.    The U.S. embassy in the Philippines said on Jan. 11 that the U.S. delivered fuel from Hawaii to Subic Bay, formerly a U.S. Navy base in the country's north that is not currently one of the sites Manila has agreed to give U.S. military access.    The move was done in coordination with the Philippines government, according to the U.S., but a Philippine senator had said the 39 million gallon fuel shipment raised concerns about unauthorized extension of agreements on the pre-positioning of military supplies."
}