{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBQ0HF_L.jpg",
  "title": "US court rejects sentence appeal by Mexican drug lord 'El Chapo'",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 27, 2023 04:49PM ET",
    "Updated Dec 27, 2023 05:20PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-court-rejects-sentence-appeal-by-mexican-drug-lord-el-chapo-3264158",
  "paragraph": "© Reuters. FILE PHOTO: Mexico's top drug lord Joaquin \"El Chapo\" Guzman is escorted as he arrives at Long Island MacArthur airport in New York, U.S., January 19, 2017, after his extradition from Mexico. U.S. officials/Handout via REUTERS/File Photo\nMEXICO CITY (Reuters) - A U.S. court has rejected an appeal by former Mexican drug lord Joaquin \"El Chapo\" Guzman to review a 2019 ruling that sentenced him to life in prison.  Guzman, who for years led the powerful Sinaloa cartel that is blamed for thousands of deaths in Mexico, had filed habeas corpus petitions - civil suits used to assess whether an imprisonment is lawful - and asked for legal representation in this appeal. \"This was perhaps the most notorious criminal prosecution of the decade, and the charges of which petitioner was convicted could well have resulted in the death penalty but for the terms of his extradition,\" Judge Brian Cogan, from the Eastern District of New York, said in the ruling denying the petition.  The ruling rejects arguments that Guzman's defense did not sufficiently explore a plea bargain and cites sealed evidence suggesting Guzman still controls up to billions of dollars in assets, even if they are not in his own name. Cogan, who also presided over Guzman's 2019 trial and conviction, rejected the request for legal counsel, saying Guzman already had help from Mariel Colon Miro, a lawyer who has in recent years represented Guzman and his wife.  Colon did not immediately respond to a request for comment. The judge also questioned where Guzman had obtained the funds to pay his lawyers and why his wife - released from prison in September - has not had access to his assets. Guzman, 66, is serving a life sentence in a Colorado prison known as the \"Alcatraz of the Rockies,\" where prisoners are kept in solitary confinement for 23 hours per day. After twice escaping from maximum-security prisons in Mexico, including in a mile-long tunnel from his cell, Guzman was in 2017 deported to the United States and convicted on drug trafficking charges in 2019. \nGuzman's Sinaloa cartel remains one of the country's two most powerful criminal organizations, alongside its main rival, the Jalisco New Generation cartel.  A powerful faction within the Sinaloa cartel is now led by Guzman's four sons, one of whom has also been extradited to the United States."
}