{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "Around 20 civilians killed in Congo attack, army and rebels trade blame",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 25, 2024 02:54PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/around-20-civilians-killed-in-congo-attack-army-and-rebels-trade-blame-3283402",
  "paragraph": "GOMA, Democratic Republic of Congo (Reuters) - Around 20 civilians were killed in an attack in eastern Democratic Republic of Congo on Thursday, the army and M23 rebels said, accusing each other of launching the assault. The deaths were the latest fallout from fighting between Congolese troops and M23, whose offensives have forced tens of thousands of people to flee their homes and worsened the region's decades-long security and humanitarian crisis. Thursday's attack took place in the town of Mweso in Masisi territory, around 80 km (50 miles) from the city of Goma in North Kivu province, the two sides said.  They gave different accounts of what happened. The army said in a statement that M23 fired mortar bombs on Mweso as the rebel force retreated in the face of a military operation to push them back. M23 leader Bertrand Bisimwa accused the army of using drones and heavy artillery to bomb residential areas in Mweso. He said the bombardment killed babies, women and men and destroyed homes, churches and schools, in a statement posted on X. The army said 19 civilians were killed and 27 wounded. M23 put the death toll at 20. Reuters was not able to verify their accounts. The long-running conflict has sparked a diplomatic crisis between Congo and neighbouring Rwanda, which Kinshasa accuses of backing the rebels. Rwanda denies any involvement. The M23 and its predecessor groups have claimed to defend Tutsi interests against ethnic Hutu militias whose leaders participated in the 1994 Rwandan genocide of more than 800,000 Tutsis and moderate Hutus."
}