{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0L0MA_L.jpg",
  "title": "Fake 'Biden' robocall tells New Hampshire Democrats to stay home",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 22, 2024 12:27PM ET",
    "Updated Jan 22, 2024 10:46PM ET"
  ],
  "comments": [
    2,
    [
      [
        "Charles Manson",
        "2024-01-23 14:44:50",
        "\"Hello Comrade, Stay Home today, bad weather, Biden not on Ballot, much snow,\" Wow. Now that would convince me to stay home. The accent sounds like they may be from Delaware.",
        "https://www.investing.com/members/249519852"
      ],
      [
        "Barry Nickerson",
        "2024-01-23 10:26:18",
        "Why do I get the feeling that all of a sudden they can trace and bust a robocaller?  After all these years...",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Tre Hsi",
        "2024-01-23 15:13:53",
        "\"they\", who is \"they\"?",
        "https://www.investing.com/members/203741693"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/fake-biden-robocall-tells-new-hampshire-voters-to-stay-home-3279918",
  "paragraph": "© Reuters. FILE PHOTO: U.S. President Joe Biden speaks to the media following a gathering with mayors attending the U.S. Conference of Mayors' annual winter meeting, in the East Room at the White House in Washington, U.S., January 19, 2024. REUTERS/Anna Rose Layden\nBy Steve Holland MANCHESTER, New Hampshire (Reuters) -As New Hampshire voters prepared to cast their votes in the state's first-in-the nation primary Tuesday, a robocall is circulating in the state urging Democrats to stay home - using a fake audio of U.S. President Joe Biden.  \"It's important that you save your vote for the November election….voting this Tuesday only enables the Republicans in their quest to elect Donald Trump again,\" the call says. The White House confirmed Monday that the call was not recorded by Biden and said the incident highlights the challenges emerging technologies present, especially ahead of the November presidential election. \"The president has been clear that there are risks associated with deep fakes. Fake images and misinformation can be exacerbated by emerging technologies,\" White House press secretary Karine Jean-Pierre told reporters in Washington. The New Hampshire attorney general, John Formella, announced he is investigating what he called an apparent \"unlawful attempt to disrupt the New Hampshire Presidential Primary Election and to suppress New Hampshire voters.\" The audio of the call was provided to Reuters by supporters of a campaign to encourage voters to write in Biden's name on their ballots. Biden's campaign manager Julie Chavez Rodriguez said the call was \"disinformation\" and an attempt to suppress voting.  Support for Biden's write-in campaign will be closely watched amid weak polls for the president, although the results have no bearing on the Democratic Party's nominating contest.  The call was first reported by NBC News.  Biden's name is not on the ballot Tuesday, because the national Democratic Party made South Carolina their first official primary, ending New Hampshire's historical status and angering some Democrats there. In the audio, the Biden \"voice\" is heard using one of his signature phrases, \"What a bunch of malarkey.\" The calls included the personal cell phone number of Kathy Sullivan, a former New Hampshire ballot law commissioner and New Hampshire Democratic Party chair. Sullivan called the robocall an attempt at election interference and requested an investigation. It was not clear how widely the audio call was circulated.  In a statement, Sullivan said she was made aware of it on Sunday night. \"Multiple people have described receiving a phony voice message created through AI that mimics the voice of President Biden, in an attempt to suppress their participation in the upcoming New Hampshire primary,\" she said. She said the call links back to her personal cell phone number without her permission. The explosion of generative AI - which can create text, photos and videos in response to open-ended prompts - in recent months has spurred both excitement about its potential as well as fears it could make some jobs obsolete, upend elections and even possibly overpower humans. The campaign for former President Donald Trump said it was \"absolutely not\" involved in the robocall.  The campaign for Democrat Dean Phillips, a Minnesota congressman who is running for the Democratic presidential nomination, said it was not involved. \nThe Phillips campaign said it found out about the call from a reporter on Sunday night. \"Any effort to discourage voters is disgraceful and an unacceptable affront to democracy. The potential use of AI to manipulate voters is deeply disturbing,\" the Phillips campaign said."
}