{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "Myanmar rebel group claims control of town bordering India, Bangladesh",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 15, 2024 08:55AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/myanmar-rebel-group-claims-control-of-town-bordering-india-bangladesh-3274423",
  "paragraph": "(Adds acronym of rebel group that took control of Laukkai town in paragraph 6) (Reuters) -An ethnic armed group in the western Myanmar state of Rakhine said it has taken control of a town bordering India and Bangladesh, marking the latest loss for the military government as it battles rebellion in several parts of the country. Myanmar is in the throes of an insurgency on multiple fronts, where allied anti-junta groups backed by a pro-democracy parallel government have seized control of several military posts and towns. It is the biggest challenge the junta has faced since it mounted a coup against an elected government in 2021. A spokesperson for the Arakan Army (AA) said late on Sunday it had conquered Paletwa, a port town on the Kaladan river that is key to trade with neighbouring countries.  \"Regarding border stability issues, we will cooperate at our best with neighbouring countries,\" said AA spokesperson Khine Thu Kha in a statement, adding the group will take over administration and law enforcement in the area. A spokesperson for the junta did not respond to a request for comment. Reuters could not independently verify the AA's claim. The fall of Paletwa in the west comes after another rebel group in the Three Brotherhood Alliance, the MNDAA, took Laukkai town in northern Shan State on the border with China. Last week, the junta agreed a ceasefire with the alliance for the region bordering China. The talks were held in the Chinese city of Kunming and facilitated by Chinese officials.  But on Sunday, the rebel alliance said junta forces are breaching the ceasefire agreement, launching attacks in several townships in Shan State."
}