{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0L0MP_L.jpg",
  "title": "Turkish parliament to debate Sweden's NATO bid on Tuesday -sources",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 22, 2024 12:44PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/turkish-parliament-to-debate-swedens-nato-bid-on-tuesday-sources-3279924",
  "paragraph": "© Reuters. FILE PHOTO: Swedish and NATO flags are seen printed on paper this illustration taken April 13, 2022. REUTERS/Dado Ruvic/Illustration\nBy Huseyin Hayatsever ANKARA (Reuters) - The Turkish parliament's general assembly is set to debate Sweden's NATO membership bid on Tuesday, three sources from parliament said. After likely full parliamentary approval on Tuesday, President Tayyip Erdogan is expected to sign it into law, concluding a lengthy process that has frustrated some of Ankara's Western allies. Sweden and Finland asked to join the military alliance in 2022 after Russia's invasion of Ukraine. But NATO member Turkey raised objections over what it said was the two countries' protection of groups that Ankara deems terrorists. Turkey endorsed Finland's membership bid last April but, along with Hungary, it kept Sweden waiting until it toughened its stance on local members of the Kurdistan Workers' Party (PKK), which the European Union and United States also list as a terrorist group. In response, Stockholm introduced a new anti-terrorism bill that makes being a member of a terrorist organisation illegal. Sweden and NATO members Finland, Canada and the Netherlands also took steps to relax Turkey arms-export policies. Erdogan sent Sweden's bid to parliament in October, but has also linked its ratification with U.S. approval of sales of F-16 fighter jets to Turkey.  The White House backs the sale, though there is no clear timeframe for the U.S. Congress to approve it and Turkey faces some congressional opposition over delaying NATO enlargement and over its human rights record. After talks with Turkish Foreign Minister Hakan Fidan earlier this month, U.S. Secretary of State Antony Blinken said he expected Turkey to ratify Sweden's NATO membership bid \"in coming weeks.\" \nThe parliament's foreign affairs commission approved the bid last month in the first step of the ratification process. Erdogan's AK Party, its nationalist MHP allies, and the main opposition CHP voted in favour of ratification in the commission meeting, while the small Islamist Felicity party and right-wing Iyi party voted against it. Pro-Kurdish DEM was absent during the vote."
}