{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0O0EA_L.jpg",
  "title": "Russia says Ukraine had 15-minute warning on PoW flight; Kyiv denies this",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 25, 2024 06:24AM ET",
    "Updated Jan 26, 2024 08:42AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/russia-says-ukraine-had-15minute-warning-on-pow-flight-kyiv-demands-international-probe-3282650",
  "paragraph": "3/3\n© Reuters. A vehicle of Russian Emergencies Ministry drives along a road near the crash site of the Russian Ilyushin Il-76 military transport plane outside the village of Yablonovo in the Belgorod Region, Russia January 24, 2024. REUTERS/Stringer\n2/3\nMOSCOW/KYIV (Reuters) -A senior Russian lawmaker said Ukrainian military intelligence had been given a 15-minute warning before a Russian military transport plane carrying Ukrainian prisoners of war entered an area where it was shot down on Wednesday, killing all on board. Moscow accuses Kyiv of downing the Ilyushin Il-76 plane in Russia's Belgorod region, killing 74 people on board, including 65 captured Ukrainian soldiers en route to be swapped for Russian PoWs. Russia's Investigative Committee said on Thursday the plane was struck by a Ukrainian-made surface-to-air missile. Ukraine denied that it was given a warning. It has neither confirmed nor denied that its forces downed the plane but has challenged details of Moscow's account and called for an international investigation. \"The Ukrainian side was officially warned, and 15 minutes before the plane entered the zone they were given complete information,\" Andrei Kartopolov, a former general with close ties to Russia's defence ministry, told lawmakers, according to the ruling United Russia party. He said Ukraine's military command confirmed receipt of the warning. His assertion contradicted statements by Ukrainian military intelligence that Russia had not informed it about the flight arrangements. Ukrainian military intelligence spokesperson Andriy Yusov, said that contrary to practice before previous PoW swaps, Kyiv had received no requests from Russia to refrain from attacks in the airspace where the plane was downed. He challenged Moscow's version of events. \"No evidence has been provided for the charges ... Nothing has been shown to prove the wreckage and the presence of people on board,\" he said on national television on Thursday. Conflicting narratives from both sides are a daily feature of a war now nearing the end of its second year. In this case the stakes are especially high, as it is the deadliest incident of its kind on internationally recognised Russian territory since Russia's February 2022 invasion. The United Nations Security Council met on Thursday at the request of Russia to discuss the downed plane. The U.N. was not in a position to verify the circumstances of the crash, U.N. political affairs chief Rosemary DiCarlo told the council.  \"What is clear is that the incident took place in the context of Russia's invasion of Ukraine and ongoing war,\" she said. \"To avoid further escalation, we urge all concerned to refrain from actions, rhetoric, or allegations that could further fuel the already dangerous conflict.\"  'PROVOCATION' The Russian defence ministry on Wednesday said that its air defences were active earlier in the morning and had shot down a Ukrainian drone in the region. Yusov said Ukraine had been using reconnaissance drones in the area, and that Russia had launched attack drones. There was \"no confirmed information\" that Ukraine had hit any targets, he said. \"Unfortunately, we can assume various scenarios, including provocation, as well as the use of Ukrainian prisoners as a human shield for transporting ammunition and weapons for S-300 systems (being used in the war),\" he told Radio Svoboda. Fragments of what appeared to be a missile have been found at the site where the plane crashed in Russia's southwestern Belgorod region near the border with Ukraine, the TASS state news agency cited emergency services as saying on Thursday. In a statement posted on the Telegram messenger app, Russian investigators said their \"preliminary\" conclusion was that the plane had been hit by an anti-aircraft missile from the Zenit rocket family, and a criminal investigation had been opened. Ukraine said it had opened its own investigation into a potential violation of the rules of war.  President Volodymyr Zelenskiy said on Wednesday that greater clarity was needed, particularly when it came to who was on board, and he accused Russia of \"playing with the lives of Ukrainian prisoners\". Russia has sole access to the site of the crash, where TV pictures showed debris scattered over snowy fields. TASS said the plane's flight recorders had been recovered and would be flown to Moscow for examination. \nUkraine's human rights commissioner Dmytro Lubinets told Reuters he believed the incident was a planned Russian misinformation campaign. He said a list of Ukrainian PoW casualties, which was shared after the crash by Russian media, included soldiers already returned in a previous swap. \"The Russians will make loud statements but will not allow anyone in. They will not hand over any materials for analysis and will simply blame Ukraine,\" he told national television."
}