{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0C00M_L.jpg",
  "title": "Scientists assert 'alien mummies' in Peru are really dolls made from Earthly bones",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 12, 2024 08:50PM ET",
    "Updated Jan 12, 2024 08:56PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/scientists-assert-alien-mummies-in-peru-are-really-dolls-made-from-earthly-bones-3273891",
  "paragraph": "4/4\n© Reuters. An X-rays and study carried out by the Institute of Legal Medicine of Peru on the 'alien mummies' that concluded that they are dolls made with animal bones is displayed in Lima, Peru, January 12, 2024. REUTERS/Sebastian Castaneda \n2/4\nBy Marco Aquino LIMA (Reuters) - A pair of \"alien mummies\" that mysteriously turned up at the airport in Peru's capital last October have entirely Earthly origins, according to a scientific analysis revealed on Friday. The two small specimens were described as humanoid dolls by experts at a press conference in Lima, and likely fashioned from both human and animal parts. A separate three-fingered hand believed to be from Peru's Nazca region was also analyzed, with experts ruling out any connection to alien life. \"They're not extraterrestrials. They're dolls made from animal bones from this planet joined together with modern synthetic glue,\" said Flavio Estrada, an archeologist with Peru's Institute for Legal Medicine and Forensic Sciences.  \"It's totally a made-up story,\" Estrada added. The two figurines turned up in the Lima airport offices of courier DHL in a cardboard box, and were made to look like mummified bodies dressed in traditional Andean attire. Some media outlets subsequently speculated about possible alien origin.  Last September, two tiny mummified bodies with elongated heads and hands with three fingers were featured at a Mexican congressional hearing, generating widespread media coverage. Mexican journalist and UFO enthusiast Jaime Maussan claimed those bodies were about 1,000 years old and recovered from Peru in 2017, but not related to any known species. \nMost experts later dismissed them as a fraud, possibly mutilated ancient human mummies combined with animal parts, but certainly from Earth. At the Lima press conference on Friday, which was organized by Peru's culture ministry, experts did not say that the dolls found in the DHL office were related to the bodies presented in Mexico, and they stressed that the remains in Mexico are also not extraterrestrial."
}