{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "Storm may not be wintry enough to end New York City's snow drought",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 06, 2024 07:03AM ET",
    "Updated Jan 07, 2024 11:21PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/new-york-city-awaits-winter-storm-that-could-end-twoyear-snow-drought-3268558",
  "paragraph": "By Joseph Ax and Brendan O'Brien NEW YORK (Reuters) -New York City's historic, two-year snow drought may not come to an end this weekend, despite the arrival of a winter storm system that began passing through the most populous U.S. city and across the East Coast on Saturday.  The city's 8.5 million residents have not seen more than 1 inch (2.54 cm) of snow fall in Manhattan's Central Park since Feb. 13, 2022, a record-long streak of 692 days. But as of 7 p.m. Saturday, only 0.2 inch had been recorded in Central Park, and the National Weather Service was forecasting only 0.8 inch of accumulation before the storm moves out to sea late on Sunday night. Marc Chenard, an NWS meteorologist, said on Saturday evening that the city's long streak of paltry snow looked set to continue.  \"It's already mixing into rain and it's going to continue to do that,\" he said. Last winter, just 2.3 inches (5.84 cm) of snow fell in New York City, the least in recorded history in a city where snowfall of more than a foot (30 cm) was, at least until recently, not uncommon. Experts say New York City's lack of snow is another sign of how climate change is affecting weather patterns around the world. The U.S. Southwest, for example, experienced a record stretch of extreme heat last summer. The weather service also warned of minor urban flooding and the possibility of roads being glazed with ice. Beyond the city, as much as 8 inches (20 cm) of snow was forecast in interior portions of New York state, New Jersey and northeast through New England along and just north of Interstate 95. Some areas could see as much as a foot of snow, the weather service said.  The agency and state officials urged the 16 million people who were under a winter storm watch across the region to stay vigilant as snow from the storm could cover roads and topple trees and electrical lines, making travel treacherous and knocking out power.  \nBoston, home to about 650,000 people, was expected to get as much as 7 inches (18 cm) as heavier snow moved in on Saturday evening. Mayor Michelle Wu cautioned residents to be careful over the weekend, but said the storm appeared unlikely to disrupt the start of the workweek.  Winter weather was also on tap for parts of eastern California and the West Coast, where some communities across the region could get as much as a foot (30 cm) of snow and wind gusts of more than 40 mph (64 kph), causing whiteout conditions on roadways, the weather service warned."
}