{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "Blasts kill nearly 100 at slain commander Soleimani's memorial; Iran vows revenge",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 03, 2024 07:32AM ET",
    "Updated Jan 03, 2024 05:47PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/at-least-20-killed-in-blasts-near-iranian-guards-commander-soleimanis-tomb-during-ceremony-3266336",
  "paragraph": "By Parisa Hafezi DUBAI (Reuters) -Two explosions killed nearly 100 people and wounded scores at a ceremony in Iran on Wednesday to commemorate commander Qassem Soleimani who was killed by a U.S. drone in 2020, Iranian officials said, blaming unspecified \"terrorists\". Iranian state television reported a first and then a second blast after 20 minutes during a crowded fourth-anniversary event at the cemetery where Soleimani is buried in the southeastern city of Kerman. No one claimed responsibility for the blasts. A senior Biden administration official said in Washington that the blasts appeared to represent \"a terrorist attack\" of the type carried out in the past by Islamic State militants.  Iranian President Ebrahim Raisi condemned the \"heinous and inhumane crime\", and Iran's top authority Supreme Leader Ayatollah Khamenei vowed revenge for the bloody twin bombings. \"Cruel criminals ... must know that they will be strongly dealt with from now on and ... undoubtedly there will be a harsh response,\" Khamenei said in a statement, according to state media. Several countries, including Russia and Turkey, condemned the attacks, and the U.N. Secretary-General called for those responsible to be held accountable.  Iranian Health Minister Bahram Eynollahi told state TV the death toll was 95, down from 103, and said 211 others were injured, making it the deadliest attack in the history of the Islamic Republic, which has faced similar incidents in the past from various groups, including Islamic State. Iran has in the past blamed Israel for attacks on individual people or places within its borders - claims which Israel has neither confirmed nor denied - but there was no indication of any involvement of a foreign state in the cemetery explosions. The U.S. has seen no indication Israel was behind the blasts, White House national security spokesperson John Kirby (NYSE:KEX) said. An unnamed official told state news agency IRNA that \"two explosive devices planted along the road leading to Kerman's Martyrs' Cemetery were detonated remotely by terrorists\". VIDEOS SHOW DOZENS OF BLOODIED BODIES Videos aired by Iranian state media showed dozens of bloodied bodies strewn around with some bystanders trying to help survivors and others hurrying to leave the blast area.  \"I heard a very loud sound and then felt pain in my back ... then I could not feel my legs,\" a wounded woman at a Kerman hospital told state television. Iran's Red Crescent rescuers tended to wounded people at the ceremony, where hundreds of Iranians had gathered to mark the anniversary of Soleimani's killing. Some Iranian news agencies said the number of wounded was much higher. \"A terrible sound was heard there, despite all the security and safety measures. The matter is still under investigation,\" Reza Fallah, head of the Kerman Red Crescent Society, told state television.  Later, the state news agency said the cemetery had been evacuated and closed until further notice. The government announced that Thursday would be a day of mourning. While the authorities did not publicly assign blame, top commander of Iran's Quds force Esmail Qaani said the attacks were carried out by \"the agents of the Zionist regime (Israel) and the United States\".  Tehran often accuses its arch enemies, Israel and the United States, of backing anti-Iran militant groups.  State TV showed crowds gathered at the cemetery at night, chanting: \"Death to Israel\" and \"Death to America\". The United States was not involved in any way in the explosions and has no reason to believe Israel was, U.S. State Department spokesperson Matthew Miller told a regular news briefing. Iran's foreign ministry said in a statement that it will use all international means to identify and bring to justice those involved in the attacks and their supporters. Meanwhile, President Raisi cancelled a planned visit to Turkey on Thursday.  EARLIER ATTACKS In 2022, the Sunni Muslim militant group Islamic State claimed responsibility for a deadly attack on a Shi'ite shrine in Iran which killed 15 people.  Earlier attacks claimed by the group include deadly twin bombings in 2017 which targeted Iran's parliament and the tomb of the Islamic Republic's founder Ayatollah Ruhollah Khomeini. Baluchi militants and ethnic Arab separatists have also staged attacks in Iran. The U.S. assassination of Soleimani in a Jan. 3, 2020, drone attack at Baghdad airport and Tehran's retaliation by attacking two Iraqi military bases that house U.S. troops brought the United States and Iran close to full-blown conflict. As chief commander of the elite Quds force, the overseas arm of Iran's Revolutionary Guard Corps (IRGC), Soleimani ran clandestine operations abroad and was a key figure in Iran's longstanding campaign to drive U.S. forces from the Middle East. Tensions between Iran and Israel, along with its ally the United States, have reached a new high over Israel's war on Iran-backed Hamas militants in Gaza in retaliation for their Oct. 7 rampage through southern Israel. \nYemen's Iran-backed Houthi militia have attacked ships they say have links to Israel in the entrance to the Red Sea, one of the world's busiest shipping lanes.  U.S. forces have come under attack from Iran-backed militants in Iraq and Syria over Washington's backing of Israel and have carried out their own retaliatory airstrikes."
}