{
  "image": "https://i-invdn-com.investing.com/news/Bitcoin_800x533_L_1535981090.jpg",
  "title": "Bitcoin to $2.3 Million? ARK Invest Doesn't Exclude This",
  "category": "Cryptocurrency news",
  "publisher": "Investing.com",
  "date": "Published Feb 05, 2024 07:27AM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/cryptocurrency-news/bitcoin-to-23-million-ark-invest-doesnt-exclude-this-3292640",
  "paragraph": "U.Today - In its Big Ideas 2024 report, ARK Invest has unveiled significant insights into the future of Bitcoin, suggesting an optimal allocation proportion of 19.4% within the global investment portfolio. This marks a substantial increase from the 0.5% allocation observed in 2015, indicating growing recognition of Bitcoin's role on the broader investment landscape.\nThe report posits that allocating just 1% of the $250 trillion global investable asset base to Bitcoin could potentially drive its price to $120,000. However, the more noteworthy projection arises with a 19.4% allocation, forecasting a potential price of $2.3 million. While these figures may raise eyebrows, they underscore the evolving perception of Bitcoin as a legitimate asset class.\nHighlighting key catalysts for Bitcoin in 2024, the report places a spotlight on the upcoming halving, expected in April. This event, occurring approximately every four years, historically coincides with the initiation of a bull market. The forthcoming halving will reduce Bitcoin's inflation rate from ~1.8% to ~0.9%, potentially influencing its value.\nInstitutional acceptance also emerges as a crucial factor, with ARK anticipating a shift in perception from viewing BTC as a speculative instrument to recognizing it as a strategic investment in diversified portfolios. Notably, influential figures such as Larry Fink, CEO of BlackRock (NYSE:BLK), have signaled a change in stance toward Bitcoin's potential as a \"flight to quality.\"\nThis article was originally published on U.Today"
}