{
  "image": "https://i-invdn-com.investing.com/news/world_news_3_69x52._800x533_L_1419494235.jpg",
  "title": "Russian stars' semi-naked party sparks wartime backlash",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 27, 2023 07:15PM ET",
    "Updated Dec 28, 2023 02:05PM ET"
  ],
  "comments": [
    3,
    [
      [
        "Teena Marie",
        "2023-12-29 03:31:40",
        "Manufactured hysteria",
        "https://www.investing.com/members/242916302"
      ],
      [
        "Rajesh Kumar",
        "2023-12-29 03:09:24",
        "Strippers are partying, so what's the problem. If you are good to them, they will invite you too. ",
        "https://www.investing.com/members/229240398"
      ],
      [
        "Barry Nickerson",
        "2023-12-28 11:47:56",
        "Every time I see the word -rapper- in the news, it's either they are doing something illegal, or getting shot.",
        "https://www.investing.com/members/249373719"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/russian-stars-seminaked-party-sparks-wartime-backlash-3264179",
  "paragraph": "By Andrew Osborn MOSCOW (Reuters) - A rapper who attended a celebrity party with only a sock to hide his modesty has been jailed for 15 days, sponsors of some of Russia's best known entertainers have torn up their contracts, and President Vladimir Putin is reported to be unamused.  An \"almost naked\" party at a Moscow nightclub held at a time when Russia is engaged in a war with Ukraine and the authorities are pushing an increasingly conservative social agenda, has provoked an unusually swift and powerful backlash. A video clip of Putin's spokesperson listening to an explanation from one of the stars who attended has been circulating online. Baza, a news outlet known for its security services contacts, has reported that troops fighting in Ukraine were among the first to complain after seeing the footage and that photographs of the event reached an unimpressed Putin. Dmitry Peskov, Putin's spokesperson, on Wednesday asked reporters to forgive him for not publicly commenting on the burgeoning scandal, saying: \"Let you and I be the only ones in the country who aren't discussing this topic.\" Maria Zakharova, a spokesperson for the Russian Foreign Ministry, said that the event had \"stained\" those who took part, but that they now had a chance to work on themselves, according to the Ura.ru news outlet. The fierce backlash from the authorities, pro-Kremlin lawmakers and bloggers, state media, and Orthodox Church groups has been dominating the headlines for days, displacing stories about rising egg prices and allowing people to let off steam by railing against the show-business elite instead.  The party, in Moscow's Mutabor nightclub, was organised by blogger Anastasia (Nastya) Ivleeva and attended by well-known singers in their underwear or wearing skimpy costumes who have been staples on state TV entertainment programmes for years. DOUBLE APOLOGY Ivleeva, who has since become one of Russia's most recognised names, is seen in one clip showing off an emerald-studded chain around her backside worth 23 million roubles ($251,000) at a time when some Russians are struggling to get by.  She has since issued two public apology videos for the event which spanned Dec.20-21.  In the second tearful apology, released on Wednesday, Ivleeva said she regretted her actions and deserved everything she got but hoped she could be given \"a second chance.\"  Her name has since disappeared as one of the public faces of major Russian mobile phone operator MTS, the tax authorities have opened an investigation that carries a potential five-year jail term, and a Moscow court has accepted a lawsuit from a group of individuals demanding she pay out 1 billion roubles ($10.9 million) for \"moral suffering.\" If successful, they want the money to go to a state fund that supports Ukraine war veterans.  \"To hold such events at a time when our guys are dying in the (Ukrainian) special military operation and many children are losing their fathers is cynical,\" said Yekaterina Mizulina, director of Russia's League for a Safe Internet, a body founded with the authorities' support.  \"Our soldiers on the front line are definitely not fighting for this.\" Many of the party's famous participants have recorded apologies, including journalist Ksenia Sobchak whose late father Anatoly was once Putin's friend and boss. SOCIAL CONSERVATISM The scandal comes at a time when Putin, who is expected to comfortably win another six-year term at a March election, has doubled down on social conservatism, urging families to have eight or more children, and after Russia's Supreme Court ruled that LGBT activists should be designated as \"extremists.\" Nikolai Vasilyev, a rapper known as Vacio who attended wearing only a sock to cover his penis, was jailed by a Moscow court for 15 days and fined 200,000 roubles ($2,182) for propaganda of \"non-traditional sexual relations.\" Other more famous names have had concerts and lucrative state TV airtime cancelled, contracts with sponsors revoked, and, in at least one case, are reportedly being cut out of a new film. The scandal has angered those who support Russia's war in Ukraine. Standing outside the Bolshoi Theatre on Thursday, Nadezhda, one Moscow resident, told Reuters she was outraged and thought those who took part should be punished and not shown on TV anymore.  \"If you're partying at least don't film it,\" she said. \"At such a difficult time (for Russia), they should at least be ashamed. Aren't they ashamed before those who are fighting for us?\"  Alexander, another Muscovite, said those who attended had not broken any law and were free to do as they pleased at what was a private event. But one woman who said her nephew had lost both legs in combat wrote in a post to the League for a Safe Internet that the stars should pay for prosthetic legs for her relative and others to make amends. \n\"That would be a better apology,\" the unidentified woman wrote.  ($1 = 91.6205 roubles)"
}