{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0J08O_L.jpg",
  "title": "Biden's New Hampshire votes matter, even though he's not on the ballot",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 20, 2024 04:33PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/bidens-new-hampshire-votes-matter-even-though-hes-not-on-the-ballot-3278901",
  "paragraph": "3/3\n© Reuters. Boston Mayor, Michelle Wu promotes the write-in campaign to put U.S. President Joe Biden’s name on the New Hampshire Democratic primary ballot, during a Get Out The Vote (GOTV) event in Manchester, New Hampshire, U.S. January 20, 2024. REUTERS/Faith Ni\n2/3\nBy Steve Holland and Jarrett Renshaw WASHINGTON (Reuters) - Democrats are trying to temper expectations for U.S. President Joe Biden in next week's Democratic primary election in New Hampshire, as supporters scramble to gin up write-in support for him since his name is not on the ballot. The primary on Jan. 23 offers the first at-the-polls gauge of Biden’s political strength this election cycle, and the unprecedented situation will be closely watched amid polls showing him tied with likely Republican challenger Donald Trump .  A poor showing against Democratic longshots Dean Phillips, a Minnesota congressman, and self-help author Marianne Williamson is likely to fuel concerns that Biden is weak heading into the general election. Biden did not register for the New Hampshire contest after the state refused his demand that it cede its top spot in the presidential primary calendar to the more diverse South Carolina.  But his New Hampshire supporters can still vote for him because many U,S, states allow voters to write the name on a ballot paper of a candidate who is not officially running. That candidate wins if they receive more votes than the registered candidates. Andy Smith, director of the University of New Hampshire Survey Center, said Biden should achieve \"a fairly significant win,\" but added that he didn't really know what that looks like.  \"What is a big enough win to count? Right now we see Biden with upwards of 70% of the vote. Is that enough? Does that mean the Democratic Party is behind him, or does it show division in the party?\" Smith told Reuters. Supporters say the unpredictable race should not be viewed as some type of national litmus test, because turnout will be low, write-in campaigns are notoriously hard and Biden angered Democrats there by booting the state from its historical role as the party first-in-the-nation primary.  Jim Demers, one of the organizers of the shoe-string Biden write-in campaign said he’s seen polls that range from less than 50% to 60% of the vote for Biden.  State officials expect to declare a Democratic winner on Tuesday after tallying write-in votes. Biden allies say the benchmark should be the 2010 write-in campaign of Alaska Senator Lisa Murkowski, the first U.S. senator to win that way in 50 years, taking about 40% of the vote and besting a Tea Party favorite. \"She won with 39% of the vote as a candidate in a write-in effort she led and Joe Biden and his campaign aren’t even participating in an effort to write his name in for this one,\" said Jim Messina, who was then-President Barack Obama's campaign manager in 2012. The Democratic National Committee ruled that the New Hampshire election effectively won’t count and the winner won't amass New Hampshire's 23 delegates in the march to the party's nomination.  Some New Hampshire Democrats are definitely upset.  \"When it comes down to it, we’re in the Democratic primary and Biden has chosen to take his name off of the New Hampshire ballot,\" said state representative Jonah Wheeler, a Democrat who supports Williamson. Biden's high-profile supporters including California Representative Ro Khanna, Illinois Gov. J.B. Pritzker and Boston Mayor Michelle Wu have been helping rally the faithful, and organizers have a shoe-string budget to teach voters how to write in a candidate. A CNN poll conducted by the University of New Hampshire Survey Center in mid-November showed 65% of likely Democratic primary voters in New Hampshire plan to write in Biden’s name, with 10% going for Phillips and 9% for Williamson. In 2020, Biden finished a disappointing fifth in a crowded Democratic primary that saw some 300,000 votes cast. State officials expect less than 100,000 votes this year. Lyndon B. Johnson, then the Democratic incumbent, shunned the New Hampshire primary in 1968 due to over-confidence, only to see an insurgent campaign from Minnesota, U.S. Senator Eugene McCarthy and his anti-Vietnam War platform. Johnson supporters mounted a barely successful write-campaign, but a weakened Johnson dropped out of the race weeks later. David Watters, a write-in advocate and Democratic state senator in New Hampshire, said the best way right now to register rejection of former President Donald Trump, his likely Republican challenger, is to write-in Biden on Tuesday.  \"We've got to stand up for Joe Biden,\" Watters said. Elliot and Edith Smith, a married couple, attended a Dean Phillips campaign event in Nashua earlier this month. Like many U.S. voters, they are dissatisfied by a choice between of Biden and Trump, but they don’t see any other viable options. \nThe were both planning to vote for Biden in the state’s primary, but not enthusiastically, over deep concerns about Biden’s vigor and whether the 81-year-old president can withstand a second term. “I am disgusted with both parties, but we can’t elect Trump,” said Elliot Smith, 72. “I’m a Democrat, but would consider other Republicans like Haley or Christie in the general election, but there’s no chance they can beat Trump.”"
}