{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBR09O_L.jpg",
  "title": "Russia says some in the West are hinting at looking for peace in Ukraine",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Dec 28, 2023 07:13AM ET",
  "comments": [
    2,
    [
      [
        "Ken Roth",
        "2023-12-29 12:53:08",
        "Somebody at my bank are hinting that my mortgage is about to be paid be somebody….",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Ken Roth",
        "2023-12-29 05:11:12",
        "In his dreams…this only ends with russia leaving all occupief territories in ukraine",
        "https://www.investing.com/members/213081368"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/russia-says-some-in-the-west-are-hinting-at-looking-for-peace-in-ukraine-3264319",
  "paragraph": "© Reuters. FILE PHOTO: Russia's Foreign Minister Sergei Lavrov attends a meeting with India's Foreign Minister Subrahmanyam Jaishankar in Moscow, Russia December 27, 2023. Alexander Nemenov/Pool via REUTERS/File Photo\nBy Guy Faulconbridge MOSCOW (Reuters) - Russian Foreign Minister Sergei Lavrov said on Thursday that some in the West were suggesting that Moscow should discuss peace in Ukraine because the United States and its allies had failed to defeat Russian forces in Ukraine. Nearly two years into Russia's full-scale invasion of Ukraine, Moscow controls about 17.5% of Ukrainian territory and a Ukrainian counter-offensive this year has failed to win any major territorial gains against Russian forces who have defended the front with extensive mine fields and swarms of drones. Lavrov, in an interview with RIA state news agency and the Rossiya 24 TV channel, said there were signs that the West was changing its tactics and strategy on Ukraine. \"The West is really changing its tactics - maybe even thinking about clarifying the strategy. Because if the 'strategic defeat of Russia' is a strategy, forgive the tautology, then this strategy failed miserably,\" Lavrov said. \"There are some approaches, some whispers: why don't you (Russia) meet with someone in Europe who would be ready to talk, talk about Ukraine without Ukraine itself,\" said Lavrov, who also reiterated that Moscow would achieve all its goals in Ukraine. President Vladimir Putin has repeatedly said he is ready to talk about peace in Ukraine but on Russia's terms. U.S. officials have said they think he is waiting for the 2024 U.S. presidential election before making any serious move towards peace. Ukraine says it will not rest until every last Russian soldier is ejected from its territory as defined in 1991 when the Soviet Union collapsed. The West says it will not push Ukraine towards peace. Putin casts the Ukraine war as a battle for Russian survival against an arrogant West which he says is plotting to cleave Russia apart and to steal its vast natural resourves. U.S. President Joe Biden has said the West does not seek to destroy Russia but wants Kyiv to defeat Moscow's forces on Ukrainian territory. Biden also said in 2022 that Russia had suffered a \"strategic failure\" in Ukraine. Lavrov, who has been in post since 2004, also said on Thursday that major Western powers had met in \"secret\" about 10 days ago as part of a G7 plus developing nations meeting to discuss a \"peace formula\" proposed by Ukrainian President Volodymyr Zelenskiy. Lavrov said they had agreed on a further meeting in January and a \"peace summit\" in February based on the Zelenskiy peace formula. Reuters could not independently verify his assertions.  \nZelenskiy's 10-point peace plan calls for the withdrawal of Russian troops and cessation of hostilities and the restoration of Ukraine's state borders with Russia.  Moscow says the Zelenskiy idea is absurd as it does not include Russia in talks."
}