{
  "image": "https://i-invdn-com.investing.com/news/World_News_9_800x533_L_1420026261.jpg",
  "title": "Rabbis protest at United Nations asking for ceasefire in Gaza",
  "category": "General",
  "publisher": "Reuters",
  "date": "Published Jan 09, 2024 03:42PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/general/rabbis-protest-at-united-nations-asking-for-ceasefire-in-gaza-3270632",
  "paragraph": "By Kanishka Singh (Reuters) - About three dozen rabbis and rabbinical students from U.S. organizations on Tuesday protested at the United Nations, urging a ceasefire in Gaza and asking U.S. President Joe Biden's administration to allow such resolutions to pass instead of vetoing them in the Security Council. The protests were organized by U.S. Jewish groups including Jewish Voice for Peace, Jews for Racial and Economic Justice, and Rabbis for Ceasefire. Social media posts by the groups said 36 rabbis were at the demonstration inside the U.N. Security Council Chamber. The Huffington Post reported that the rabbis gained access to the building as part of a guided tour. The U.N. has demanded an immediate humanitarian ceasefire in Gaza amid the huge death toll from the war. Washington has vetoed resolutions for such calls in the Security Council, saying it would let Palestinian Islamist group Hamas, which governs Gaza, regroup and rebuild. More than three-quarters of the 193-member U.N. General Assembly backed a move to demand an immediate humanitarian ceasefire last month. Tuesday's protesters at the United Nations carried banners that read \"Biden: the world says ceasefire\" and \"Biden: Stop vetoing peace.\" Ceasefire protests have been seen recently in many parts of the U.S., ranging from near airports and bridges in New York City and Los Angeles to vigils outside the White House and marches in Washington near the U.S. Capitol.  On Monday, demonstrators demanding a ceasefire in Gaza interrupted a speech by Biden in a church in South Carolina. The president said he had urged Israel to reduce its attacks and \"significantly get out of Gaza.\" Jewish groups in the U.S. have been divided over Israel's response to the Oct. 7 attack by Hamas. Anti-Defamation League CEO Jonathan Greenblatt has labeled groups demanding a ceasefire in Gaza, such as Jewish Voice for Peace, as \"hate groups\" that do not represent the Jewish community. Hamas' Oct. 7 attack on Israel killed 1,200 people, according to Israeli tallies. Israel's subsequent assault on Gaza has killed more than 23,000 Palestinians, about 1% of the 2.3 million population there, according to Gaza's health ministry. Israeli bombardments have flattened much of the densely populated enclave, leaving Gazans homeless, with food shortages threatening famine."
}