{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0F0LC_L.jpg",
  "title": "US Supreme Court sidesteps fight over transgender student bathroom access",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 16, 2024 09:42AM ET",
    "Updated Jan 16, 2024 12:21PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-supreme-court-snubs-fight-over-transgender-student-bathroom-access-3275227",
  "paragraph": "© Reuters. FILE PHOTO: A general view of the U.S. Supreme Court building in the rain the day before the start of the court's new term in Washington, U.S. October 2, 2022. REUTERS/Jonathan Ernst/File Photo\nBy John Kruzel WASHINGTON (Reuters) - The U.S. Supreme Court on Tuesday declined to hear an Indiana public school district's defense of a policy barring transgender students from using bathrooms corresponding with their gender identity, as the justices steered clear - at least for now - of a contentious issue in the nation's culture wars.  The justices turned away the Metropolitan School District of Martinsville's appeal of a lower court's ruling that a middle school's policy on bathroom access likely violated the rights under the U.S. Constitution and a federal anti-discrimination law of a transgender student who was prohibited from using the boys' bathroom. The Martinsville district appealed a 2023 ruling by the Chicago-based 7th U.S. Circuit Court of Appeals that the student, identified in court papers as \"A.C.,\" is protected under a law called Title IX that bars sex discrimination in education and the Constitution's 14th Amendment requirement that people be protected equally under the law. The Supreme Court has said relatively little about transgender rights and in the past avoided hearing arguments on the issue of bathroom access in public schools, with no national legal precedent in place.  Transgender rights are a major area of controversy. Republicans in various states have pursued a wave of laws affecting transgender people including restricting bathroom access, limiting transgender participation in sports and access to gender-affirming medical care, and the teaching of subjects related to gender identity. In the Indiana case, A.C. is a transgender boy who was a seventh grade student in 2021 when his mother brought a lawsuit on his behalf against the school district and his school's principal. A.C. sought unspecified money damages and a court order to be allowed to use bathrooms for males. U.S. District Judge Tanya Pratt in 2022 ruled in favor of A.C., ordering the school to allow bathroom access corresponding with the student's gender identity. The 7th Circuit affirmed Pratt's ruling, prompting the school's appeal to the Supreme Court, which has a 6-3 conservative majority. According to the lawsuit, A.C. was diagnosed with gender dysphoria, a condition involving distress resulting from a discrepancy between a person's gender identity and sex at birth, and was in the process of having his name and gender legally changed on his birth certificate. The school district in a court filing argued that Title IX lets schools provide separate bathrooms on the basis of sex and that equal-protection concerns do not bar schools from protecting the interests of other students \"in shielding their bodies from exposure to the opposite sex.\" Federal courts have been divided on school policies requiring transgender students to use the restroom corresponding to their birth sex. The Richmond, Virginia-based 4th U.S. Circuit Court of Appeals found a Virginia school's policy illegal, while the Atlanta-based 11th Circuit upheld one in a Florida school. The Supreme Court in 2021 declined to take up a legal battle involving a transgender public high school student named Gavin Grimm who had been barred by a Virginia county school board from using the bathroom corresponding with his gender identity. The court's denial of the school board's appeal left in place the 4th Circuit ruling favoring Grimm, who had graduated from high school by the time the justices acted. \nMore recently, the Supreme Court in April 2023 refused to let West Virginia enforce a state law banning transgender athletes from female sports teams at public schools, one of many Republican-backed measures across the country targeting LGBT rights.  (This story has been refiled to correct the day of the week in paragraph 1)"
}