{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0K073_L.jpg",
  "title": "Russia suspends operations at fuel export terminal after suspected Ukrainian drone attack",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 21, 2024 07:32AM ET",
    "Updated Jan 21, 2024 03:51PM ET"
  ],
  "comments": [
    2,
    [
      [
        "Billy Foos",
        "2024-01-22 02:41:33",
        "Putin has an 80% approval rating among his people.. Biden has a 30% approval rating.. ",
        "https://www.investing.com/members/208442913"
      ],
      [
        "Brad Albright",
        "2024-01-22 14:04:34",
        "Are you sure about that? I though Russian state media reported Putin's approval was 180%.",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Otis Grant",
        "2024-01-21 15:35:16",
        "Why hasn't anyone assassinated puketin to bring peace to the world. They would become a legendary hero for all of history ",
        "https://www.investing.com/members/251132356"
      ],
      [
        "Will Hicks",
        "2024-01-22 14:51:18",
        "Go for it and do Trump while you're at it. ",
        "https://www.investing.com/members/243723594"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/fire-erupts-at-russias-novatek-baltic-sea-terminal-after-suspected-ukrainian-drone-attack-3278950",
  "paragraph": "By Andrew Osborn and Maxim Rodionov (Reuters) -Russian energy company Novatek said on Sunday it had been forced to suspend some operations at a huge Baltic Sea fuel export terminal due to a fire started by what Ukrainian media said was a drone attack.  The giant Ust-Luga complex, located on the Gulf of Finland about 170 km (110 miles) west of St. Petersburg, is used to ship oil and gas products to international markets. It processes stable gas condensate - a type of light oil - into light and heavy naphtha, kerosene and diesel to be shipped by sea.  It was not clear how long the disruption would last, how many tankers would have to idle outside the port, and what the knock-on effect would be on international energy markets.  Critical infrastructure facilities in the surrounding Leningrad region were placed on high alert, with security units and law enforcement agencies ordered to destroy any drones detected, the regional administration said on Telegram. The Interfax-Ukraine news agency, citing unnamed sources, said the fire was the result of a special operation carried out by Ukraine's security services. \"The Ust-Luga Oil terminal ... is an important facility for the enemy. Fuel is refined there, which, among other things, is also supplied to Russian troops,\" it cited one source as saying. \"A successful attack on such a terminal not only causes economic damage to the enemy ... but also significantly complicates the logistics of fuel for the Russian military.\"  Reuters could not confirm that the fire resulted from a Ukrainian drone attack.  If it did, such an attack would demonstrate Kyiv's ability to conduct strikes deeper into Russia than usual using what are believed to be domestically produced drones at a time when it is on the defensive on the battlefield and struggling to secure as much Western financing as it wants.  Such an attack, the latest in a spate of apparent strikes in recent days targeting Russian energy facilities, would also raise awkward questions about the quality of Russian air defence systems around key infrastructure facilities. The incident, along with what Russia says was a Ukrainian artillery strike on civilians in a Russian-held city in eastern Ukraine that left at least 25 dead, could prompt wider Russian retaliation in a war which shows no sign of ending.  Alexander Drozdenko, the Leningrad region's governor, said on the Telegram messaging app, that there had been no casualties at the Ust-Luga terminal and all workers had been safely evacuated. Russian news agencies reported that two storage tanks and a pumping station had been damaged, but that the fire had been brought under control. Novatek, which is Russia's largest liquefied natural gas producer, said in a statement it had suspended some operations after the fire which it said was the result of \"external influence.\" \"The technological process at Novatek-Ust-Luga has been stopped, and an operational headquarters has been established to eliminate the consequences. Damage assessment will be carried out later,\" the company said. Russian news outlet Shot reported that local residents had heard a drone operating nearby followed by several explosions. Russia and Ukraine have targeted each other's energy infrastructure in strikes designed to disrupt supply lines and logistics, each side seeking to demoralise the other.  On Friday, a drone attack hit an oil depot in Russia's western region of Bryansk, bordering Ukraine, for which Moscow blamed Kyiv. That came a day after an attack on a Russian Baltic Sea oil terminal that Russian officials said was unsuccessful. Baza, a Russian news outlet known for its security services contacts, posted footage on Telegram on Sunday of large flames shooting into the sky over what appeared to be an industrial complex. Three international tanker ships were anchored near the Ust-Luga terminal, though there were no reports of damage to them from the fire, the St Petersburg-based Fontanka outlet said. \nDrozdenko said a \"high alert regime\" had been introduced and that officials had gathered for an emergency meeting.  Novatek processed 3.4 million tons of stable gas condensate at the complex in the first half of 2023, according to the most recent data available, up 0.6% from the same period a year earlier."
}