{
  "image": "https://i-invdn-com.investing.com/news/Ethereum_800x533_L_1599056633.jpg",
  "title": "Self-Proclaimed Satoshi Craig Wright Takes Dig at Ethereum's Vitalik Buterin",
  "category": "Cryptocurrency news",
  "publisher": "U.Today",
  "date": "Published Feb 05, 2024 01:58PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/cryptocurrency-news/selfproclaimed-satoshi-craig-wright-takes-dig-at-ethereums-vitalik-buterin-3293074",
  "paragraph": "© Reuters Self-Proclaimed Satoshi Craig Wright Takes Dig at Ethereum's Vitalik Buterin\nU.Today - In an unexpected turn of events today, self-proclaimed Satoshi Nakamoto Craig Wright took a swipe at Ethereum's creator, Vitalik Buterin. Wright revisited a series of posts by Buterin in 2017, where he discussed the early versions of the Ethereum protocol.\nBack then, Buterin had responded to a question about the possibility of building Ethereum on top of Bitcoin, expressing concerns about potential conflicts with Bitcoin's development team. He cited fears that protocol rules might change, making it difficult for him to build on a base protocol at odds with his vision.\nFast forward to January 2024, and Wright seized the opportunity to comment on Buterin's past remarks. He argued that Ethereum only exists due to centralized development teams that have the power to alter the protocol. Wright mused about the hypothetical scenario of having everything built on Bitcoin, envisioning a more streamlined and less fragmented system.\nBitcoin v. EthereumWright's comments add fuel to the longstanding rivalry between Bitcoin and Ethereum, highlighting fundamental differences in their approaches to decentralization and protocol governance. While Ethereum has achieved considerable success as a platform for smart contracts and applications, Wright argues for the stability and originality of Bitcoin's protocol.\nMoreover, it revives the centralization debate in both cryptocurrency ecosystems. On the one side is OFAC's censorship of ETH transactions; on the other side is the enormous concentration of BTC in the hands of whales and miners.\nThis article was originally published on U.Today"
}