{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0N0V3_L.jpg",
  "title": "Ohio lawmakers ban gender-affirming care for minors, overriding veto",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 24, 2024 05:22PM ET",
    "Updated Jan 24, 2024 05:31PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/ohio-lawmakers-ban-genderaffirming-care-for-minors-overriding-veto-3282313",
  "paragraph": "© Reuters. FILE PHOTO: The Ohio House of Representatives Chamber is seen as lawmakers are expected to vote on whether to override the governor's veto of a bill that would ban gender-affirming care for minors, one of the dozens of bills introduced this year to restri\n(Reuters) - Ohio's Republican-dominated Senate voted on Wednesday to ban gender-affirming care for minors and prohibit transgender athletes from competing on girls' and women's sports teams, overriding a veto and finalizing the measures as law. Ohio's Republican Governor Mike DeWine had vetoed the legislation, in a break with his party, saying that he had heard from parents of transgender youth who told him gender-affirming care had been lifesaving for their children. But Ohio's Senate on Wednesday joined the House of Representatives to override the governor's veto.  \"The Ohio Senate deserves to be commended today for its commitment to protecting women and children,\" Republican state Representative and bill sponsor Gary Click said in a statement, adding that the legislation addresses \"the civil rights issues of our day.\" The new law, due to take effect in 90 days, will block physicians from performing gender reassignment surgery or prescribing puberty-blocking drugs to assist a minor with gender transition. It will also prohibit school districts, public universities and private colleges that participate in national athletics conferences from allowing trans women to participate in women's sports. \"Transgender Ohioans, their families, and allies will continue to fight for our rights because Ohio is our home,\" Siobhan Boyd-Nelson, co-interim executive director of LGBTQ rights group Equality Ohio, said in a statement. \nThe divisive issue of gender-affirming care for trans youth has become a mainstay of the Republican Party's national political platform. Lawmakers in a majority of states have introduced bills to stop children from receiving gender-affirming care in recent years, and at least 22 other states have passed such bans.  Courts have been divided on legal challenges to the bans. Most lower courts have blocked the bans, but appeals courts have upheld the laws. In November, three Tennessee families of transgender children asked the U.S. Supreme Court to hear their case against that state's ban."
}