{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0I0DA_L.jpg",
  "title": "Israeli drones attack hospital in southern Gaza, Palestinian Red Crescent says",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 19, 2024 06:49AM ET",
    "Updated Jan 20, 2024 02:42AM ET"
  ],
  "comments": [
    2,
    [
      [
        "The NOC",
        "2024-01-20 09:37:03",
        "Source: Trust me bro...",
        "https://www.investing.com/members/224940723"
      ],
      [
        "Mark Jannetty",
        "2024-01-19 16:48:07",
        "they seem trustworthy 🤣",
        "https://www.investing.com/members/241633026"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/israeli-tanks-renew-push-towards-biggest-hospital-still-working-in-gaza-3278128",
  "paragraph": "6/6\n© Reuters. Israeli soldiers take part in a ground operation, amid the ongoing conflict between Israel and the Palestinian Islamist group Hamas, in a location given as Gaza Strip, in this handout picture released on January 19, 2024. Israeli Army Handout/Handout via \n2/6\nBy IbraheemAbu Mustafa and Nidal al-Mughrabi GAZA/DOHA/TEL AVIV (Reuters) -The Palestinian Red Crescent accused Israel of firing on Friday at a hospital in Khan Younis, as a major advance in the main city in the southern Gaza Strip threatened the few healthcare facilities still open. The Red Crescent said displaced people were injured \"due to intense gunfire from the Israeli drones targeting citizens at Al-Amal Hospital\" as well as the rescue agency's base. The military said it was checking the report. Nearby in the same city, Israeli tanks were also approaching Gaza's biggest remaining functioning hospital, Nasser, where people reported hearing shellfire from the west. Residents also reported fierce gun battles to the south. Israel has launched a major new advance in Khan Younis this week to capture the city, which it says is now the primary base of the Hamas fighters who attacked Israeli towns on Oct. 7, precipitating a war that has devastated the Gaza Strip. The Gaza health ministry said 142 Palestinians had been killed and 278 injured in Gaza in the past 24 hours, taking the death toll from more than three months of war there to 24,762. The World Health Organization says most of the enclave's 36 hospitals have stopped working. Only 15 are partially functioning and those are operating at up to three times their capacity, without adequate fuel or medical supplies, it says.  Israeli officials have accused Hamas fighters of operating from hospitals, including Nasser, which staff deny. More than 1.7 million people - around 75% of Gaza's population - are estimated to be displaced, many forced to move repeatedly, according to U.N. Palestinian refugee agency (UNRWA) figures. Many have sought refuge in tents that do little to protect them from the elements and disease. Among them, Mohammed al-Ghandour wanted to give his bride a beautiful wedding but they had to flee their homes in Gaza City and the couple finally got married this week in a tent city in Rafah, near the Egyptian border, where they now live. \"My happiness is maybe at 3% but will get myself ready for my wife. I want to make her happy,\" Ghandour said.  NETANYAHU REJECTS STATEHOOD While saying he was not shying away from the \"human tragedy\" inflicted on Gaza civilians, Israeli President Isaac Herzog cast the offensive as a step towards more peaceful relations with the Palestinians in the future, and bolstering global security, during his appearance at the World Economic Forum in Davos.  In the north, where Israel says it has started pulling out troops and shifting to smaller scale operations, 12 people were killed in Israeli strikes on a residential building near the largely non-functioning Al Shifa Hospital in Gaza City, Palestinian health officials said. An Israeli strike on a house in Al-Nusseirat refugee camp in the central Gaza Strip killed five Palestinians, health officials said. Washington has had scant success in persuading its ally to alleviate the plight of the civilian population, deprived since October of regular aid and adequate medical care. Israel says it will fight on until Hamas is eradicated, an aim Palestinians call unachievable because of the group's structure and deep roots in an enclave it has run since 2007. Diplomats were dealing on Friday with the repercussions after Israeli Prime Minister Benjamin Netanyahu appeared to rule out an independent Palestinian state, rejecting a long-standing pillar of U.S. strategy in the Middle East. \"Israel must have security control over the entire territory west of the Jordan River,\" Netanyahu told a briefing in Tel Aviv on Thursday. \"It clashes with the principle of sovereignty, but what can you do?\" U.S. President Joe Biden spoke with Netanyahu on Friday, the White House said, without disclosing details of the call. White House spokesperson John Kirby (NYSE:KEX) later said Biden still believed in a two-state solution. \"He recognizes that's going to take a lot of hard work. It's going to take a lot of leadership there in the region,\" Kirby told reporters at a White House briefing. Biden's strong support so far for Israel has created friction with some members of his own Democratic party who are concerned over the war's steep toll on Palestinian civilians. Dozens of Biden's fellow Democrats signed a letter on Friday urging his administration to reaffirm that the United States strongly opposes \"the forced and permanent displacement\" of Palestinians from Gaza. HOSTAGE KILLED Israel's onslaught on Gaza was triggered by Hamas attacks in which around 1,200 people were killed and 253 taken hostage, of whom about half are still in Gaza, according to Israeli tallies. In one of countless protests in Israel since Oct. 7 to push for action to secure the release of the hostages, some 200 women marched in Tel Aviv on Friday, including one pulled along in a cage. They chanted \"Their time is running out, bring them back\". Israeli cabinet minister and former military chief Gadi Eizenkot said a deal would be needed for the hostages to be released alive. Al-Nasser Salah al-Deen Brigades, a Gaza-based militant group allied to Hamas, said on Friday an Israeli soldier it was holding captive had been killed in an Israeli air strike, according to a video released by the group to media outlets.  \nThe footage showed the wounded hostage being operated on before he spoke in Hebrew urging Israeli leaders to reach a settlement with Gaza groups that would secure their release. There has been no Israeli army comment.  The Russian foreign ministry said on Friday it had received a delegation from Hamas and had urged it to release the hostages, including three Russian nationals. Hamas said both sides emphasized the importance of reaching a ceasefire."
}