{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK070H6_L.jpg",
  "title": "New tensions stir old fears on island near North Korean border",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 08, 2024 09:02AM ET",
    "Updated Jan 09, 2024 03:52AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/new-tensions-stir-old-fears-on-island-near-north-korean-border-3269603",
  "paragraph": "5/5\n© Reuters. South Korean marines patrol on Yeonpyeong Island, South Korea, January 8, 2024. REUTERS/Kim Hong-Ji \n2/5\nBy Ju-min Park and Minwoo Park YEONPYEONG ISLAND, South Korea (Reuters) - As Kim Jeoung-hee huddled in a bomb shelter on South Korea's Yeonpyeong Island, scared and confused with around 250 other people, memories flooded back of the day in 2010 when North Korean troops shelled near their homes. Authorities told them to take shelter on Friday as North-South tensions spiked again. This time no-one aimed any shells at the small patch of land just on the southern side of the two Koreas' disputed maritime border. But the alarm was a reminder of how vulnerable Yeonpyeong remains more than 13 years after the bombardment that killed two soldiers and two civilians there, and left an unconfirmed number of North Korean casualties after South Korea fired back. \"Every time I hear a bang I get scared,\" Kim told Reuters on Monday, standing in the same bomb shelter, a bunker buried in a hill with toilets, a small kitchen and blankets inside. \"Everyone is living with that nightmare.\" Friday's scare came after North Korea fired off more than 200 shells a few miles from the island, and still more over the weekend, in what it described as artillery drills. The South responded on Friday with its own live-fire exercises. The corresponding actions marked a further escalation between the rivals. In November North Korea said it would deploy stronger armed forces and new weapons on its border with the South, a day after Seoul suspended part of a 2018 military accord in a protest over Pyongyang's launch of a spy satellite. The breakdown of the 2018 agreement left many on Yeonpyeong fearing they could be back in the firing line. Kim said he and other island leaders met with South Korean military officials earlier on Monday to air their concerns about Friday's alarm, including what he said was a lack of clarity and communication. They also requested that the military help provide food in the future, after children and elderly had to spend up to four hours underground. \"Considering what happened 14 years ago, this shouldn’t have been dealt with this way,\" Kim said. \"If there’s a real emergency, residents deserve to know what really is happening.\" The ferry service was also suspended that day, effectively trapping residents on the island, Kim said. \"Everyone here has been held hostage,\" he said. CHINESE FISHING TRAWLERS DISAPPEAR South Korea's Defence Ministry acknowledged it had not sent the islanders a notice when North Korea started firing on Friday, but said that was because the drills were taking place some distance away.  The ministry said it asked local authorities to send out an alert later after it launched its own exercises, as it worried North Korea might respond. \"In the future, our military will continue to strictly consider public safety-related matters and collaborate with the relevant local government,\" a spokesperson told Reuters. On Monday, many of the passengers on the ferry that runs twice daily to the island were young South Korean marines in uniform, dozing or listening to music next to camouflaged rucksacks. Around 30% of the island's roughly 2,000 registered inhabitants are military personnel. Off the coast a South Korean naval vessel could be seen, and marines patrolled the streets. Chinese fishing trawlers that often crowd the waters nearby have been conspicuously absent so far in January - a further cause for concern as those vessels often disappear when tensions rise, a coast guard official told Reuters. \"This time, again they are apparently staying away,\" said the official who asked not to be named as he is not authorized to speak to the media. \"Probably North Korea might have given a warning to them already.\" \nKim said he and his fellow islanders were scanning the horizon, waiting for the return of the Chinese fleets, and the reduction in tensions that might herald. \"We look at Chinese fishing boats and feel more comfortable,\" he said."
}