{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK101Q1_L.jpg",
  "title": "Pentagon chief says he should have handled cancer diagnosis better",
  "category": "General",
  "publisher": "Reuters",
  "date": [
    "Published Feb 01, 2024 10:52AM ET",
    "Updated Feb 01, 2024 02:41PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/general/pentagon-chief-says-should-have-handled-cancer-diagnosis-better-3290266",
  "paragraph": "By Idrees Ali and Phil Stewart WASHINGTON (Reuters) -U.S. Defense Secretary Lloyd Austin on Thursday apologized for failing to tell President Joe Biden and senior staff about his recent prostate cancer diagnosis ahead of time, adding that the health scare was a \"gut punch\" that had shaken him. Austin, 70, also apologized for the way he handled his subsequent hospitalization, which was kept secret from the public, senior staff and Biden himself for days. \"(Biden) has responded with a grace and warm heart that anyone who knows President Biden would expect and I'm grateful for his full confidence in me,\" Austin said in his first press conference since his secret hospitalization.  Austin's secrecy surrounding his condition and his Jan. 1 hospitalization caught the White House and Congress off guard, and even Biden didn't know Austin was hospitalized during much of the first week of January. \"I did not handle this right,\" Austin said. The incident triggered a political uproar. Republicans accused Austin of dereliction of duty. Biden, a Democrat, has said he has confidence in Austin despite what the president agreed was a lapse in judgment. Austin said privacy and not secrecy was behind his decision not to tell the White House or public about the diagnosis earlier. \"It was a gut punch,\" Austin said referring to his diagnosis. Austin said he still had some leg pain, but his doctors were confident it would improve over time.  Austin was admitted to Walter Reed National Military Medical Center in Maryland on Dec. 22 to treat prostate cancer. He returned to the hospital on Jan. 1 due to complications that included a urinary tract infection.  His hospitalization was not disclosed until four days later, and the Pentagon did not specify why he was being treated until Jan. 9. Austin said he had never directed anyone in his staff to keep his January hospitalization from the White House or the public. He added that he did not know what information had been passed to his deputy, Kathleen Hicks, who temporarily took over his duties.  Some prominent Republicans, including former President Donald Trump, called for Austin to be removed from his job. Austin is a retired four-star general who led forces in Iraq and who is America's first Black defense secretary. \nThe chair of the U.S. House of Representatives Armed Services Committee has asked Austin to testify before the panel over the failure to timely disclose his hospitalization. \"Congress must understand what happened and who made decisions to prevent the disclosure of the whereabouts of a cabinet secretary,\" committee chairman Mike Rogers (NYSE:ROG) wrote last month."
}