{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0I0N3_L.jpg",
  "title": "US Senator Tim Scott endorses ex-rival Trump in blow to Haley",
  "category": "Politics",
  "publisher": "Reuters",
  "date": [
    "Published Jan 19, 2024 12:45PM ET",
    "Updated Jan 19, 2024 10:00PM ET"
  ],
  "comments": [
    12,
    [
      [
        "Ken Roth",
        "2024-01-21 11:38:42",
        "As the KKK riders holds their hands over the shoulders of the black propel to show they are gods in Birth of Nation so does Trump hold Scott who says yes massa",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Mark Jannetty",
        "2024-01-21 11:47:04",
        "so your saying the Democrats are supporting trump 🤔 ",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Ac Tektrader",
        "2024-01-20 02:13:46",
        "the Russians are quite excited in the state controlled media their saying their man Donald Trump'is going back to the white house after after the American election.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ac Tektrader",
        "2024-01-20 02:10:13",
        "it quite humorous to watch the the maga cult coverup the proven crimes against America by Donald Trump ",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Mark Jannetty",
        "2024-01-20 10:44:57",
        "proven?🤣🤣 🤡",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Mark Gesswein",
        "2024-01-21 14:24:37",
        "You’re a moor-on. 🤡🤡🤡",
        "https://www.investing.com/members/245851936"
      ],
      [
        "Barry Nickerson",
        "2024-01-20 00:59:06",
        "It's quite humorous seeing all the dem supporters here complaining about a republican endorsing another republican.  I don't see anybody endorsing Old Joe.",
        "https://www.investing.com/members/249373719"
      ],
      [
        "Ac Tektrader",
        "2024-01-19 23:55:49",
        "with Scot in Trump's political stable medicare and social security Will be in trouble if Trump is reelected.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ac Tektrader",
        "2024-01-19 23:53:38",
        "hate social security and Medicare want it compromised or even done away with them vote Republican... Trump's new little buddy senator Scott, ran on a platform of breaking social security and medicare ....",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Tom Saltzman",
        "2024-01-19 19:50:51",
        "If the charges were credible, he would likely be charged, but they're fake just like the 2020 election results.",
        "https://www.investing.com/members/200520915"
      ],
      [
        "Ac Tektrader",
        "2024-01-19 23:13:19",
        "Tom still pushing Trump's proven lies; even his closest associates say Trump is lying, perhaps your support is more about his bigotry and racism like so many other Maga supporters.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ac Tektrader",
        "2024-01-19 23:36:48",
        "Tom, nothing is fake about those charges. the feds don't bring charges against anyone unless they have overwhelming evidence an at least a 97% chance of conviction.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Tom Saltzman",
        "2024-01-20 00:20:34",
        "Ac Tektrader",
        "https://www.investing.com/members/200520915"
      ],
      [
        "Brad Albright",
        "2024-01-20 00:58:51",
        "If the charges were credible... Are we talking about Biden's \"corruption\" now?",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Tom Saltzman",
        "2024-01-20 12:14:04",
        "Brad Albright",
        "https://www.investing.com/members/200520915"
      ],
      [
        "Charles Manson",
        "2024-01-19 19:49:00",
        "In other news ... \"Bet that new \"AI Maintenance Program\" they installed was done by the same ground crew that forgot to add more Gorilla Tape to those Doors that fell off a few weeks back. Just a \"Simulated Engine Fire\" to test the planes fire suppression system was not selected for the \"Ground Test Mode\". They really need to bring back the Grounds Maintenance Drug Testing Program. Anyway, gotta go do some Laundry, Love to All, Charles.\"",
        "https://www.investing.com/members/249519852"
      ],
      [
        "Ken Roth",
        "2024-01-19 18:57:36",
        "Its an insult to the american people that he is not yet sentenced and with his proud boys in cell block D",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Mark Gesswein",
        "2024-01-19 19:10:13",
        "It’s an insult to our intelligence that you keep spouting this nonsense. No one believes your BS propaganda, Kenny boy.",
        "https://www.investing.com/members/245851936"
      ],
      [
        "Ac Tektrader",
        "2024-01-19 23:17:31",
        "Mark still pushing the proven lies of Trump and the maga cult.the insult to our intelligence is coming from Trump's maga crowd. with one lie after another.",
        "https://www.investing.com/members/224473057"
      ],
      [
        "Ken Roth",
        "2024-01-20 07:45:34",
        "Mark Gesswein",
        "https://www.investing.com/members/213081368"
      ],
      [
        "Mark Gesswein",
        "2024-01-21 14:27:25",
        "Ken Roth",
        "https://www.investing.com/members/245851936"
      ],
      [
        "Flat Top",
        "2024-01-19 18:54:11",
        "I like to see Trump Vivek 2024. ",
        "https://www.investing.com/members/236391078"
      ],
      [
        "Tom Saltzman",
        "2024-01-19 19:52:06",
        "Vivek 2028",
        "https://www.investing.com/members/200520915"
      ],
      [
        "Ac Tektrader",
        "2024-01-19 23:22:52",
        "more pro authoritarian true believers ...Since Vivek believes in the white replacement conspiracy and his people are from India and non white I wonder who he's planning to replace.",
        "https://www.investing.com/members/224473057"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/politics/us-senator-tim-scott-to-endorse-donald-trump--nyt-3278581",
  "paragraph": "© Reuters. U.S. President Donald Trump greets Senator Tim Scott (R-SC) as he welcomes the 2018 College Football Playoff National Champion Clemson Tigers at the White House in Washington, U.S., January 14, 2019. REUTERS/Joshua Roberts/File Photo\nBy Gram Slattery CONCORD, New Hampshire (Reuters) -U.S. Senator Tim Scott, who had campaigned against Donald Trump for the Republican presidential nomination, endorsed his former rival at a rally in New Hampshire on Friday night, dealing a blow to Trump's top remaining primary competitor, Nikki Haley. The move by Scott comes just four days before the pivotal Republican nominating contest in New Hampshire, in which Trump is facing off against Haley, a former South Carolina governor who first appointed Scott to the U.S. Senate. Only Florida Governor Ron DeSantis, who has largely written off New Hampshire to challenge Haley in her home state of South Carolina, remains in the three-way contest for the nomination.  Haley is trailing Trump by 14 points in New Hampshire, according to an average of polls maintained by polling analysis website 538. She is feverishly trying to close the gap, as the state is widely seen as one of her best shots to score a win off the former president and keep her campaign hopes alive. Speaking before hundreds of cheering supporters in Concord, many of whom waited several hours outside in 15 degree Fahrenheit temperatures, Scott listed several reasons why he said the country needed another Trump term, arguing he would lower taxes and unite the country. \"That's why I came to the very warm state of New Hampshire to endorse the next president of these United States, Donald Trump,\" Scott shouted. Scott, the lone Black Republican in the Senate, is the latest conservative U.S. lawmaker to endorse Trump, who won Iowa's caucus on Monday by a historic margin.  After Scott spoke, Trump briefly acknowledged his endorsement, before bashing Haley and Democratic President Joe Biden, who he is likely to face in a general election rematch in November. As in some previous campaign stops, he also ramped up his criticism of New Hampshire's Republican governor, Chris Sununu, who endorsed Haley in December and has been campaigning heavily with her in recent weeks. \"I think your governor sucks,\" Trump said to cheers. In 2012, Haley appointed then U.S. House Representative Scott to replace retiring U.S. Senator Jim DeMint, making him the first Black Republican in the chamber since 1979.  Now the nation's top elected Black Republican in a party whose base is majority white, Scott's endorsement could be critical in a contest where race has become a dominant theme. Trump's team and Scott's team had been in contact before the endorsement for several weeks, according to multiple people briefed on the talks.  The senator had launched a presidential primary bid of his own earlier in the year, portraying himself as someone who could unify a politically divided country, but he dropped out in November after failing to gain traction in the polls and turning in a series of lackluster debate performances. Trump has stepped up his attacks on Haley, including racial language mocking her Indian heritage, while Haley has been criticized for not citing slavery as the cause of the U.S. Civil War and for this week saying the United States has never been a racist country.  Scott, meanwhile, has largely managed to avoid drawing Trump's ire despite some previous criticism of the former president, including over race. \nIn 2017, Scott said Trump had \"compromised his moral authority to lead\" after the then-president cited \"very fine people on both sides\" of a white nationalist rally in Charlottesville where one woman was killed. Earlier on Friday, Haley scored the endorsement of the Republican governor of Vermont, Phil Scott. While a much lower-profile figure at the national level, Scott is well-known in much of New Hampshire, which shares a border with Vermont."
}