{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0L0Q6_L.jpg",
  "title": "Venezuela issues arrest warrants for 14 alleged conspirators -attorney general",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 22, 2024 04:02PM ET",
    "Updated Jan 22, 2024 04:09PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/venezuela-issues-arrest-warrants-for-14-alleged-conspirators-attorney-general-3280005",
  "paragraph": "© Reuters. FILE PHOTO: Venezuela's chief prosecutor Tarek William Saab holds a news conference in Caracas Venezuela May 4, 2020. REUTERS/Manaure Quintero\nCARACAS (Reuters) - Venezuela's attorney general on Monday said 14 arrest warrants were issued against civilians and former military personnel for allegedly conspiring against the government of President Nicolas Maduro.  On Jan. 15, Maduro told legislators who back the government that conspiracies against him and high ranking government figures had been dismantled between May and December. Attorney General Tarek William Saab said he subsequently asked a court on Jan. 19 to issue arrest warrants against those involved in the conspiracies.  \"The five revealed conspiracies, the five plots that I wanted to describe as a conspiracy ... are all being prosecuted as I have explained to reach a definitive, final sentence with the maximum penalty,\" Saab said. Some 32 people, including civilians and members of the military, have been detained over the conspiracies, Saab added. Maduro recently alleged the conspiracies included plans to assassinate him and Defense Minister Vladimir Padrino. The attorney general's office detailed warrants for the arrests of human rights activist Tamara Suju and journalist Sebastiana Barraez - who both live abroad - for an alleged plot at the end of last year. \n\"The attorney general continues to criminalize the work of lawyers and human rights defenders,\" Suju said via X, formerly known as Twitter. The defense ministry alleged the plots counted on assistance from members of the military, but provided no further details."
}