{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0M0QG_L.jpg",
  "title": "Yellen reassures Ukraine's PM on budget support -US Treasury statement",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 23, 2024 02:44PM ET",
    "Updated Jan 23, 2024 03:45PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Mark Jannetty",
        "2024-01-23 19:59:00",
        "guess she doesn't know that it's the house that controls the purse strings. According to NPR, it would cost less than that to finish the wall. Americans security or Joe Bidens payoff?",
        "https://www.investing.com/members/241633026"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/yellen-reassures-ukraines-pm-on-budget-support-us-treasury-statement-3280959",
  "paragraph": "© Reuters. FILE PHOTO: U.S. Treasury Secretary Janet Yellen meets with Mexican business leaders during her visit in Mexico City, Mexico December 6, 2023. REUTERS/Daniel Becerril\nBy David Lawder WASHINGTON (Reuters) -U.S. Treasury Secretary Janet Yellen reassured Ukrainian Prime Minister Denys Shmyhal on Tuesday that the Biden administration was committed to securing $11.8 billion in budget support to Kyiv as part of a supplemental U.S. funding request. The Treasury said in a statement following a virtual meeting between the two officials that Yellen \"underscored the importance of Congress acting on financial support for Ukraine as quickly as possible.\" The Biden administration's supplemental budget request for another $61 billion for Ukraine, including the budget support and $30 billion for the U.S. Department of Defense to supply Ukraine with weapons and other support, has been bogged down for months in Congress, as Republicans demand that it be paired with changes to increase security controls on the U.S.-Mexico border. The measure also would include $14 billion in assistance for Israel. So far this year, Congress also has been consumed with avoiding a government shutdown, last week passing a stop-gap measure to keep U.S. government agencies funded. The Treasury said that the U.S. leadership in providing direct budget support for Ukraine would catalyze other donors, which are expected to provide roughly three-quarters of Ukraine's 2024 external financing needs, which support vital government operations, including hospitals, schools and first responders. \n\"Financial support to Ukraine remains inextricably linked to its success on the battlefield\" the Treasury said, adding that it also demonstrate the resolve of the U.S. and its allies to defend the territorial sovereignty and freedoms of democratic countries. \"Providing financial support to Ukraine will help Ukraine win the war and advance U.S. national security interests globally,\" the Treasury added."
}