{
  "image": "https://i-invdn-com.investing.com/news/news_headline_open_108x81._800x533_L_1419519630.jpg",
  "title": "Spelman College receives $100 million gift, a record for historically Black schools",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 18, 2024 06:00PM ET",
    "Updated Jan 18, 2024 06:05PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/spelman-college-receives-100-million-gift-a-record-for-historically-black-schools-3277822",
  "paragraph": "By Daniel Trotta (Reuters) - Atlanta's Spelman College has received a $100 million gift from one of the school's trustees and her husband, in what Spelman called the largest single donation ever given to a historically Black college or university. The gift from trustee Ronda  Stryker  (NYSE:SYK), a businesswoman and philanthropist, and her husband, William Johnston, chairman of the wealth management firm Greenleaf Trust, coincides with the 100-year anniversary of the school's official naming, Spelman said in a statement. Historically Black colleges and universities, also known as HBCUs, have played a crucial role in providing higher education to African Americans, who were denied equal access to education for most of U.S. history, and count among their alumni U.S. Vice President Kamala Harris, a graduate of Washington's Howard University. There are about 100 HBCUs, a classification designated by the Higher Education Act of 1965 for any accredited historically Black college or university established before 1964. Spelman was founded in 1881 as the Atlanta Baptist Female Seminary, 16 years after the end of chattel slavery in the U.S., and was renamed Spelman College in 1924, according to its website. It still specializes the education of women of African descent. \"We are invigorated and inspired by this incredible act of generosity,\" Spelman College President Helene Gayle said in the statement. Three-fourths of the $100 million will go toward endowed scholarships and $25 million will be used to develop an academic focus on public policy and democracy, improve student housing, and other needs, the statement said."
}