{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0808P_L.jpg",
  "title": "Blinken says Israel must make 'hard choices,' work with Palestinian leaders",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 09, 2024 03:42AM ET",
    "Updated Jan 09, 2024 04:07PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/blinken-to-discuss-way-forward-in-gaza-as-he-meets-israeli-leaders-3269983",
  "paragraph": "2/2\n© Reuters. U.S. Secretary of State Antony Blinken meets Israel's Foreign Minister Israel Katz, during his week-long trip aimed at calming tensions across the Middle East, at David Kempinski Hotel, in Tel Aviv, Israel, January 9, 2024. REUTERS/Evelyn Hockstein/Pool\n2/2\nBy Simon Lewis TEL AVIV (Reuters) - Israel must make \"hard choices\" if it wants to normalize relations with more of its neighbors and should support Palestinian leaders who are willing to live side-by-side with Israelis, U.S. Secretary of State Antony Blinken said on Tuesday in Tel Aviv. Blinken in recent days has toured Israel's Arab neighbors to discuss plans for the future governance of Gaza and integration in the Middle East. He is now in Israel for talks with Prime Minster Benjamin Netanyahu and his war cabinet, formed after the Oct. 7 attacks by Palestinian Hamas militants that Israel says killed 1,200 people.  Israel launched an air and ground assault on the Gaza Strip in response that has killed more than 23,000 Palestinians, according to Gaza's health ministry. Blinken said on Monday in Saudi Arabia that regional states wanted integration with Israel - a major goal for Netanyahu, who wants to improve economic ties across the Middle East. But that normalization of relations would require a \"practical pathway\" to a future Palestinian state, Blinken said. At Tuesday's news conference in Tel Aviv, Blinken declined to characterize how Netanyahu and his cabinet responded to his appeal on a Palestinian state, but said Israel would have to make \"hard decisions, hard choices\" to take advantage of the opportunity offered by regional integration. Four Arab states have formalized ties with Israel in pacts known as the Abraham Accords - the United Arab Emirates, Bahrain, Sudan and Morocco. U.S. negotiations aimed at reaching a deal normalizing relations between Israel and Saudi Arabia were halted when the Gaza conflict erupted in October. Blinken said Israel needs to support Palestinian leaders \"who are willing to lead their people living side-by-side in peace with Israel,\" an apparent reference to the Palestinian Authority (PA), which exercises limited self-rule in some areas of the occupied West Bank. \"And Israel must stop taking steps that undercut Palestinians' ability to govern themselves effectively,\" Blinken added, criticizing impunity for violence committed by extremist Jewish settlers in the West Bank, as well as settlement expansion, demolitions and evictions. Blinken has said a revitalized PA should ultimately take charge of Gaza if and when Israel achieves its goal of eliminating Hamas, which has run the enclave since 2007.  \"The Palestinian Authority also has a responsibility to reform itself, to improve its governance,\" Blinken said, adding he would raise those issues with PA President Mahmoud Abbas when the two meet in Ramallah on Wednesday.  As well as trying to tamp down regional tensions that have flared since the war began, the U.S. top diplomat has been discussing plans for the future governance of Gaza, which could involve Israel's Muslim-majority neighbors. Blinken also urged Israel's leaders to avoid civilian harm and protect civilian infrastructure in the war in Gaza when he met one-on-one with Netanyahu and his war cabinet.  \nBlinken said he had reached an agreement with Israel's government for a United Nations team led by newly appointed Senior Humanitarian and Reconstruction Coordinator for Gaza Sigrid Kaag to carry out an assessment mission in northern Gaza to determine what needs to be done before Palestinians can return to their homes there. \"There are a lot of really challenging and important issues to deal with, including things like unexploded ordnance, booby traps and other explosives that had been left by Hamas,\" Blinken said, urging Israel to give Kaag its full support."
}