{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0A0X4_L.jpg",
  "title": "New York Trump judge latest target of threats aimed at US officials",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 11, 2024 02:43PM ET",
  "comments": [
    1,
    [
      [
        "Stephen Fa",
        "2024-01-12 13:54:39",
        "Sounds a lot like radical Democrats threatening SCOTUS judges like what happened",
        "https://www.investing.com/members/200910591"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/new-york-trump-judge-latest-target-of-threats-aimed-at-us-officials-3272795",
  "paragraph": "2/2\n© Reuters. FILE PHOTO: Justice Arthur Engoron speaks during the trial of former U.S. President Donald Trump, his adult sons, the Trump Organization and others in a civil fraud case brought by state Attorney General Letitia James, at a Manhattan courthouse, in New Yo\n2/2\nBy Andrew Goudsward WASHINGTON (Reuters) - A threat against the judge overseeing Donald Trump’s civil fraud trial in New York on Thursday is the latest in a string of incidents targeting prominent U.S. officials that have raised worries in the U.S. Justice Department. Justice Arthur Engoron, a frequent target of the former U.S. president’s ire, was threatened hours before he was due to preside over closing arguments, a court spokesperson confirmed. It was not clear if any arrests were made. U.S. Attorney General Merrick Garland last week warned of a “deeply disturbing spike in threats against those who serve the public.” Prosecutors have recently brought cases against those accused of threatening FBI agents, federal judges, presidential candidates, members of Congress, members of the military and election workers, Garland said. “These threats of violence are unacceptable,” Garland told reporters. “They threaten the fabric of our democracy.” Security incidents in the first weeks of 2024 have generated added concern in a year when a presidential election and progressing legal cases against Trump, the frontrunner for the Republican nomination, are poised to put the nation’s divisions on vivid display. The threat against Engoron came days after Judge Tanya Chutkan, who is assigned to the election interference case against Trump in Washington federal court, was the subject of an apparent “swatting” incident, in which people report fake emergencies to trigger a police response to a specific address.  Special Counsel Jack Smith, who is prosecuting the two federal criminal cases against Trump, and Republican U.S. Representative Marjorie Taylor Greene, a stalwart Trump ally, were both subjects of “swatting” incidents on Christmas Day, according to media reports. \nA spate of hoax bomb threats on Jan. 3 briefly forced the evacuation of several U.S. statehouses. Authorities said there was no credible threat. Federal prosecutors recently indicted a New Hampshire man accused of sending texts threatening the lives of three presidential candidates and charged a 72-year-old Florida man with leaving voicemails threatening to kill Democratic U.S. Representative Eric Swalwell and his children."
}