{
  "image": "https://i-invdn-com.investing.com/news/USpresidentialelection2020_800x533_L_1601390264.jpg",
  "title": "US court will not revisit ruling limiting voting rights lawsuits",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 30, 2024 01:27PM ET",
    "Updated Jan 30, 2024 03:07PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/us-appeals-court-will-not-reconsider-ruling-limiting-voting-rights-laws-scope-3287356",
  "paragraph": "© Reuters \nBy Nate Raymond\n(Reuters) -Civil rights activists on Tuesday failed to convince a federal appeals court to reconsider a ruling that could sharply curtail lawsuits enforcing a landmark voting rights law's protections against racial discrimination.\nThe full 8th U.S. Circuit Court of Appeals rejected a request by the Arkansas Public Policy Panel and the Arkansas State Conference NAACP to reconsider a 2-1 ruling by a panel of judges holding that only the government and not private plaintiffs can pursue cases enforcing Section 2 of the Voting Rights Act.\nThe panel's November decision marked the first time a federal appeals court had reached such a conclusion. The vast majority of Voting Rights Act lawsuits for decades have been filed by private parties, not the U.S. Department of Justice.\nThe ruling came in a lawsuit challenging a redistricting plan for the Arkansas State House of Representatives that the two groups alleged undermined the voting power of Black people in the Republican-led state.\nThe plaintiffs, represented by the American Civil Liberties Union, have called the November decision \"radical.\" It applies to seven states within the 8th Circuit's jurisdiction, Arkansas, Iowa, Minnesota, Missouri, Nebraska, North Dakota and South Dakota.\n\"That it chose not to rehear the case ignores the gravity of what's at stake — generations of precedent protecting voters and in turn our democracy,\" Sophia Lin Lakin, a lawyer with the ACLU who argued the appeal, said in a statement.\nThe plaintiffs said they were \"exploring next legal steps.\" They could now try to appeal the ruling to the U.S. Supreme Court, where two members of the court's 6-3 conservative majority, Neil Gorsuch and Clarence Thomas, have raised the question of whether private litigants do have a right to sue.\nIn 2022, U.S. District Judge Lee Rudofsky, an Arkansas federal judge appointed by former Republican President Donald Trump, held that only the U.S. attorney general is empowered to file lawsuits under Section 2 of the Voting Rights Act.\nThat provision prohibits voting rules that are racially discriminatory.\nIn November's 2-1 opinion authored by U.S. Circuit Judge David Stras, another Trump appointee, the 8th Circuit held that the law does not lay out a \"private right of action,\" even though courts including the Supreme Court have taken on such cases for decades.\nThree judges dissented from Thursday's decision to not have the full 8th Circuit rehear the case, including U.S. Circuit Judge Steven Colloton, an appointee of Republican former President George W. Bush, who called the November ruling \"flawed.\""
}