{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0S0P8_L.jpg",
  "title": "Exclusive-Republican candidate Nikki Haley was targeted in second swatting attempt",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 29, 2024 03:59PM ET",
    "Updated Jan 30, 2024 02:26AM ET"
  ],
  "comments": [
    1,
    [
      [
        "Benjamin USA",
        "2024-01-30 07:28:35",
        "Trunp cucks are scared of her",
        "https://www.investing.com/members/200821892"
      ],
      [
        "Jared Krebsbach",
        "2024-01-30 09:16:47",
        "lol, sure buddy",
        "https://www.investing.com/members/232356104"
      ],
      [
        "Brad Albright",
        "2024-01-30 11:44:49",
        "Jared Krebsbach",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Mark Jannetty",
        "2024-01-30 16:08:46",
        " we will see if Biden and his lady parts debates Trump. want to make a wager",
        "https://www.investing.com/members/241633026"
      ],
      [
        "Brad Albright",
        "2024-01-31 01:15:47",
        "Mark Jannetty",
        "https://www.investing.com/members/236251128"
      ],
      [
        "Brad Albright",
        "2024-01-31 13:55:49",
        "Have you had a chance to ask m0mmie if she'll cover a bet for you?",
        "https://www.investing.com/members/236251128"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/exclusiverepublican-candidate-nikki-haley-targeted-in-second-swatting-attempt-3286338",
  "paragraph": "© Reuters. FILE PHOTO: Republican presidential candidate and former U.S. Ambassador to the United Nations Nikki Haley speaks during a campaign event, ahead of the South Carolina Republican presidential primary election, in Conway, South Carolina, U.S., January 28, 2\nBy Alexandra Ulmer (Reuters) -Two days after a man called in a fake emergency at the South Carolina home of Republican presidential candidate Nikki Haley, she was targeted by a second \"swatting\" attempt on New Year’s Day, this time by someone who said Haley had shot her daughter, according to an incident report seen by Reuters. A Charleston County sheriff’s deputy responded on Jan. 1 to Haley's home after a person who identified themself as “Rose” called 911 claiming Haley’s daughter was lying in a pool of blood and Haley was threatening to shoot herself, a sheriff’s office report said. The caller claimed to be on the phone with Haley. The deputy spoke to an unidentified woman at the front door who matched Haley's description and quickly concluded the call was a hoax, according to the report, which Reuters received in response to a request for records of swatting incidents at Haley's residence. The Jan. 1 swatting attempt has not been previously reported. The hoaxes against Haley, who is challenging frontrunner former President Donald Trump for the Republican presidential nomination, occurred in the town of Kiawah Island, an affluent, gated South Carolina community of around 2,000 people. Reuters reported on Saturday that Haley's Kiawah Island home had been swatted on Dec. 30, when a man called authorities and claimed to have shot a woman and threatened to harm himself at her home. The swatting incidents are among a wave of violent threats, bomb scares and other acts of intimidation against government officials, members of the judiciary and election administrators since the 2020 election that have alarmed U.S. law enforcement officials ahead of this year’s U.S. presidential contest. Haley did not immediately respond to a request for comment. The sheriff’s office has not publicly identified any suspects in the hoax calls. Swatting is the filing of false reports to the police to set off a potentially dangerous response by officers. Law enforcement experts see it as a form of intimidation or harassment that is increasingly being used to target prominent figures, including officials involved in the civil and criminal cases against Donald Trump.  On NBC's \"Meet the Press\" on Sunday, Haley alluded to a second swatting attempt but did not provide a date for the incident or share details of what happened. \"I think we've had it happen twice,\" she said. Swatting cases have surged over the past two months, targeting both allies and rivals of Trump as he campaigns to return to the White House.  “Swatting and physical threats are designed to terrorize the civil servants our democracy relies upon,” said David Becker, executive director of the nonpartisan Center for Election Innovation and Research. “As the presidential campaign ramps up, it appears that harassment is increasing.”  Targets have included figures publicly opposed to Trump, such as Maine Secretary of State Shenna Bellows, a Democrat who barred him from her state’s primary ballot. Judges and at least one prosecutor handling cases against Trump have been targeted. But Trump backers such as U.S. Representative Marjorie Taylor Greene have also faced swatting attempts. GUNS DRAWN, ELDERLY PARENTS HOME  In the Dec. 30 incident, Haley's parents, aged 87 and 90, and their caretaker were home at the time, according to records received by Reuters on Monday, which provided new information on the incident. Deputies “observed a silhouette of an individual through the second-floor window balcony. Deputies presented their weapons and ordered the individual to raise their hands,” an incident report from the sheriff’s office said. Deputies then observed two people raise their hands, and possibly a third person, through the window.  The incident report did not identify the individuals. But Haley said on Sunday that deputies had \"guns drawn pointing at my parents.\" A deputy approached the front door and spoke to the caretaker, who said no one had been shot, the incident report said. Deputies later spoke to the homeowner, seemingly Haley, on the phone, it added.  \"It put my family in danger,\" Haley said in Sunday’s TV interview about the Dec. 30 incident. \"It was not a safe situation. And that goes to show the chaos that's surrounding our country right now.\" The call was made by a man who identified himself as \"Travis,\" according to the incident report. Officials spoke with the occupants of the home and let them listen to the 911 call, but they “did not recognize the voice,\" the report said. Authorities were unable to locate the number the call originated from, the report added.  \nHowever, authorities appear to have more information about the Jan. 1 call. The report on that incident, which was released to Reuters with redactions, said authorities had determined the caller's phone number.  Haley and her husband bought the $2.4 million Kiawah Island residence in October 2019, local property records indicate."
}