{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0C00V_L.jpg",
  "title": "North Korea halts radio broadcasts, curbs exchanges with South -Yonhap",
  "category": "World news",
  "publisher": "Reuters",
  "date": "Published Jan 12, 2024 11:02PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/north-korea-halts-radio-broadcasts-curbs-exchanges-with-south-yonhap-3273896",
  "paragraph": "© Reuters. FILE PHOTO: A South Korean soldier stands guard in the truce village of Panmunjom inside the demilitarized zone (DMZ) separating the two Koreas, South Korea, February 7, 2023. REUTERS/Kim Hong-Ji/File Photo\nBy Cynthia Kim SEOUL (Reuters) - North Korea stopped operating a radio station used to send coded messages to its agents in South Korea, the Yonhap news agency said on Saturday, the latest sign the isolated country is shaking up the way it handles relations with Seoul. North Korea has been stepping up pressure on Seoul in recent weeks, declaring it the \"principal enemy\", saying the North will never reunite with the South and vowing to enhance its ability to deliver a nuclear strike on the U.S. and America's allies in the Pacific. Radio Pyongyang, known as a numbers station, in the past broadcast mysterious coded numbers presumed to be targeted at Pyongyang's spies operating in South Korea. Its website was also down on Saturday. North Korean leader Kim Jong Un, addressing a year-end meeting of his ruling party, ordered a \"decisive policy change\" in relations with the South, instructing the military to be prepared to pacify and occupy the South in the event of a crisis.  Early on Saturday, North Korea announced plans to dissolve organisations in charge of civilian exchanges with South Korea. State media KCNA reported a decision \"to readjust all relevant organizations... including the North Side Committee for Implementing June 15 Joint Declaration, the North Headquarters of the Pan-national Alliance for Korea's Reunification\". North and South Korea remain technically at war after the 1950-53 Korean War ended in a truce, not a peace treaty, and tensions are running high. \nSeoul-based news outlet NK News said on Friday several North Korean propaganda sites were unaccessible more than 24 hours after they went offline. The websites of Uriminzokkiri, DPRK Today, Arirang Meari, Tongil Voice, Ryomyong and Ryugyong have been down since at least Thursday morning, it said."
}