{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0M023_L.jpg",
  "title": "Death toll in China landslide rises to 25, rescuers search for missing",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 22, 2024 10:03PM ET",
    "Updated Jan 23, 2024 06:00AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/death-toll-in-china-landslide-rises-to-11-rescuers-still-search-for-missing-3280168",
  "paragraph": "© Reuters. Rescue workers search for survivors in the debris after a landslide hit Zhenxiong County, in Zhaotong, Yunnan province, China January 22, 2024. China Daily via REUTERS \nBEIJING (Reuters) - The death toll from a landslide in China's Yunnan province rose to 25 late on Tuesday as rescue workers battled freezing temperatures and snow to locate dozens of missing people.  Rescuers worked through the night sifting deep mounds of earth at the site of the landslide in Zhenxiong County, state-owned China Central Television (CCTV) reported on Tuesday. One rescuer said large machines cannot be used due to the unstable soil, according to a report from local media outlet The Cover, owned by the Sichuan Daily Newspaper Press Group. \"If the excavation is unloaded below, the top may continue to collapse. It is difficult to carry out large-scale mechanical operations, and it is very difficult to rescue on site,\" the worker was quoted as saying in the report. After the landslide hit on Monday, at least 47 people from 18 households were reported missing, CCTV said, adding that 25 of those people were now confirmed dead. Another 19 were still missing and three other people had been accounted for by the rescue team.  Another two people were hospitalized for head and body injuries, the national health commission said. The landslide hit two villages in the southwestern city of Zhaotong at about 5:51 a.m. (2151 GMT), covering houses in brown mountain soil at the foot of a hill, CCTV reported. \"The mountain just collapsed, dozens were buried,\" a man surnamed Gu, who witnessed the landslide, told the state-owned TV station for the neighbouring province of Guizhou. Gu said four of his relatives were buried under the rubble.  \"They were all sleeping in their homes,\" he said. \nMore than 500 people were evacuated from their homes, CCTV said. Officials told a press conference on Tuesday the landslide was triggered at a steep cliff area at the top of a mountain slope."
}