{
  "image": "https://i-invdn-com.investing.com/news/world_news_2_69x52._800x533_L_1419494365.jpg",
  "title": "Hamas airs video of Israeli hostages, says will disclose their fate",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 14, 2024 04:55PM ET",
    "Updated Jan 14, 2024 05:52PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/hamas-airs-video-of-israeli-hostages-says-will-disclose-their-fate-3274160",
  "paragraph": "By Dan Williams JERUSALEM (Reuters) -Hamas aired video on Sunday showing three Israeli hostages it is holding in Gaza in which they urged their government to stop the offensive against the Palestinian Islamist group and bring about their release, as both sides marked the 100th day of the war. The undated 37-second video of Noa Argamani, 26, Yossi Sharabi, 53, and Itai Svirsky, 38, ended with the chyron: \"Tomorrow we will inform you of their fate.\"  Hamas said earlier on Sunday it had lost contact with some hostages as Israeli forces shelled Gaza, noting that they might have been killed in the process. At the outset of the war, it also threatened to execute hostages in retaliation for Israeli military strikes. Israeli officials have generally declined to respond to Hamas' public messaging on the hostages, casting it as psychological warfare. Hagar Mizrahi, a forensic official with Israel's Health Ministry, told local TV on Dec. 31 that autopsies of slain hostages who had been recovered found causes of death inconsistent with Hamas' account they had died in air strikes. But Israel has also made clear it is aware of the risks to hostages from its offensive, and is taking precautions. \"The military operation takes time. It obligates us to be precise, and we are adapting it in accordance with the threats and the hostages who are in the field,\" chief armed forces spokesperson Rear-Admiral Daniel Hagari said on Sunday. Of some 240 people seized by Hamas in an Oct. 7 cross-border killing spree that sparked the war, around half were released in a November truce. Israel says 132 remain in Gaza and that 25 of them have died in captivity. \nThe hostage crisis has riveted Israelis reeling from the worst attack in their history. Some hostages' relatives have called on Prime Minister Benjamin Netanyahu to enter another truce or even call off the war. He has vowed to fight on until Hamas is destroyed, which he argued would enable the hostages' release. Last month, Netanyahu said in parliament he had asked Beijing to help free Argamani, whose mother Liora is Chinese. Suffering from a terminal illness, Liora Argamani has appealed to be reunited with her daughter before she dies."
}