{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBR0AN_L.jpg",
  "title": "How history, race and politics divide Tennessee on gun legislation",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 28, 2023 08:04AM ET",
    "Updated Dec 28, 2023 04:50PM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/how-history-race-and-politics-divide-tennessee-on-gun-legislation-3264351",
  "paragraph": "© Reuters. Democratic Tennessee State Representative Justin Pearson chants with protesters after he and other Democratic representatives walked out of the house chamber after Democratic State Representative Justin Jones was silenced by a procedural move during a spe\nBy Donna Bryson (Reuters) - Photographs can say a lot without words. After a school shooting in Tennessee, they recorded the frustrations of parents and state legislators whose cries for gun control were silenced. In one photo, it’s almost possible to hear Representative Justin Pearson’s measured tones as he stands in prayer with one hand raised at the Capitol following a legislative session that failed to change any gun laws. In March, a former student at the Covenant School in Nashville killed three 9-year-old children and three staff members. Pearson and his fellow Representative Justin Jones, both of whom are Black Democrats, were briefly expelled for leading a protest for gun control on the House of Representatives floor. A third Democrat representative, Gloria Johnson, who is white, was not expelled for her role in the protest, leading to accusations of racism. Republicans who overwhelmingly control the chamber deny they are racist and oppose anything seen as a retreat from the U.S. Constitution's Second Amendment right to \"keep and bear arms.\" Cameron Sexton, the Republican who is speaker of the Tennessee House of Representatives, did not see racism as a problem to be addressed in the chamber. \"Sometimes people use that word (racism) as a drop the mic moment to try to stop people from having conversations,\" he said. Pearson represents Memphis, a city with a Black majority that has struggled to contain gun violence. Pearson has lost friends and relatives to gun violence. “When we went to the well of the House floor, it wasn’t just the Covenant kids that I was thinking about,” Pearson told Reuters. “I was thinking about the people in Memphis who are mourning every day.” Months after the protest, a special legislative session called by Tennessee’s Republican governor ended with no progress on gun safety laws. During the special session, Republican leaders banned members of the public from holding signs during proceedings and limited their access to the Capitol building. State troopers, whose presence was increased during the session, at one point ejected members of the public, including Covenant parents, from a hearing after a lawmaker said the crowd was unruly.  Mary Joyce, a real estate broker whose daughter was in the Covenant classroom where three of her classmates were killed, spoke to lawmakers during the special session and took part in protests for gun control at the Capitol. \"It feels like we were just screaming under water,\" Joyce told Reuters. \"No one could hear us.\"  WEIGHT OF HISTORY Johnson said gun control advocates will continue to push for change in the next legislative session, which opens in January. “I always have hope. I wouldn’t be in this business if I didn’t hope that people would listen,” said Johnson, who also is running for the U.S. Senate. “And we know that 80% of Tennesseans want to see gun sense legislation, 70% want red flag laws, 80% want safe storage laws. At some point the super majority has to start listening to the people. Because it will affect their elections.” Jack Johnson, a Republican leader in the state Senate, said his constituents do not support such gun control measures as red flag laws to temporarily remove guns from individuals who might harm themselves or others.  \"Dispossessing law-abiding citizens of constitutional rights is not an answer to our violence problem in Tennessee,” Johnson said. Tennessee has laws to keep guns out of the hands of people involved in domestic violence cases. Democrats and even the Republican governor have called for broader red flag measures.  Looking at the photographs, it's almost possible to hear chants for change that echo the soundtrack of civil rights era demonstrations. In the 1960s, John Lewis, then a student at the American Baptist Theological Seminary -- one of four historically Black colleges and universities in Nashville -- was a leader in the sit-in movement that ended racist discrimination at Nashville businesses such as a Woolworth’s lunch counter. It was the start of a career of challenging segregation for Lewis, who went on to represent Georgia in the U.S. Congress and have a Nashville street named for him. Lewis’s faith inspired him and infused his political rhetoric. Pearson and Jones have tapped into that tradition. And deeper. Jones read from the Bible's Book of Jeremiah – whose remonstrations fueled the abolitionist orations of Frederick Douglass – during the campaign for more gun control.  \"Until we act, there will be no peace for the thousands of children who came here demanding we act, who are afraid that if they’re in school they will be gunned down because you have passed laws that make it easier to get gun than it is to get health care in this state,” Jones said on the House floor. He also walked the state house hallways carrying a child's coffin, drawing attention to the many young people affected by gun violence.  A state office building located on Representative John Lewis Way offers another glimpse of history. When Sarah Shoop Neumann, a nurse whose son is a Covenant student, entered the building to testify for gun control, she was struck at the portraits of lawmakers on the walls. “It’s all white men,” she said. “Even in the recent years, it’s still not that different.” Melissa Alexander, a commercial real estate broker whose son is a Covenant student, said, “The make-up of the legislature also needs to be more diverse to represent the issues and constituencies, what the constituents want in the state of Tennessee.” Alexander along with Neumann and Joyce have organized to push for gun control. Slavery, segregation and violence have had an enduring impact on race relations, not just in the South, but across the United States. \nPearson acknowledged the weight of the past. But he sees hope for a better future. “Not so much that we are able to see that future become a reality even though I pray for that, but that a hundred years from now the next kid that’s protesting that’s marching that’s fighting, they’re fighting for something different, they’re fighting for something new,” he said. “They hope and pray that the fight is worth it because there is somebody, they do not know who they were, do not know their names, who fought for them today. And that’s us.\""
}