{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0902Y_L.jpg",
  "title": "South Korea opposition leader urges end to politics of hate after attack",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 09, 2024 10:10PM ET",
    "Updated Jan 10, 2024 02:07AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/south-korea-opposition-leader-hopes-for-end-to-politics-of-hate-after-attack-3270833",
  "paragraph": "3/3\n© Reuters. South Korea's opposition Democratic Party leader Lee Jae-myung speaks after being discharged at Seoul National University Hospital in Seoul, South Korea, January 10, 2024. Yonhap via REUTERS\n2/3\nBy Hyunsu Yim SEOUL (Reuters) -South Korea's main opposition party leader, Lee Jae-myung, said on Wednesday he hoped his stabbing would mark the end of the \"politics of hate\", as police said the man accused of attacking him told them he wanted to stop Lee from becoming president. The opposition leader spoke after he was discharged from a Seoul hospital, where he had been recovering since last week's attack in the southern city of Busan. \"I hope this case, which shocked everyone, can serve as a milestone to end the politics of hate and confrontation and restore proper politics,\" Lee told reporters and supporters. South Korean politics have become increasingly polarised and heated recently ahead of a general election in April, with President Yoon Suk Yeol's conservative People Power Party and Lee's Democratic Party neck and neck in the polls.  Lee was attacked in Busan by a man who lunged at him with a camping knife after asking for his autograph. Surgeons operated on Lee for more than two hours to repair the jugular vein in his neck. The suspect, arrested on charges of attempted murder, appears to have been motivated by his own political beliefs, police told a briefing on the investigation. The 67-year-old man, whom authorities have not been named, told police he wanted to prevent Lee from becoming president and his party from winning the election. The suspect was also dissatisfied with how bribery charges against Lee have been handled. Lee is on trial over the charges, which he has denied. The attack was condemned as an \"act of terror\" and a challenge to democracy by President Yoon and politicians from both the ruling and opposition parties. Earlier on Wednesday, man accused of the attack told reporters as he left a police station he was sorry over the fallout.  \nThree members of Lee's Democratic Party announced they would leave the party, citing disagreements over his leadership, but wished him a swift recovery. Though the Democratic Party and Yoon's People Power Party account for the majority of lawmakers in parliament, several politicians on both sides have indicated they plan to break away to form new parties for the general election."
}