{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0B01Z_L.jpg",
  "title": "Blinken to meet senior Chinese official ahead of Taiwan elections",
  "category": "World news",
  "publisher": "Investing.com",
  "date": "Published Jan 11, 2024 09:29PM ET",
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/blinken-to-meet-senior-chinese-official-ahead-of-taiwan-elections-3272966",
  "paragraph": "© Reuters. FILE PHOTO: U.S. Secretary of State Antony Blinken waves as he boards his plane to return to Washington, following his week-long trip aimed at calming tensions across the Middle East, in Cairo, Egypt, January 11, 2024. REUTERS/Evelyn Hockstein/Pool/File P\nWASHINGTON (Reuters) - U.S. Secretary of State Antony Blinken will meet senior Chinese official Liu Jianchao in Washington on Friday, the State Department said in his official schedule, the talks coming just a day ahead of elections in Taiwan that will test efforts to ease U.S.-China tensions.  The Jan. 13 presidential and parliamentary contests in Taiwan, which China claims as its territory, represent the first real wild card in 2024 for the Biden administration's goal of stabilizing ties with China. Blinken's routinely publicized schedule did not give further details about the 10 a.m. ET (1500 GMT) meeting. But the meeting will be the latest in a flurry of U.S.-China interactions following a November summit between U.S. President Joe Biden and Chinese President Xi Jinping in San Francisco.  Those include a Wednesday meeting between Liu and White House deputy national security adviser Jon Finer, a phone call on Thursday between U.S. Secretary of Commerce Gina Raimondo and China's Commerce Minister Wang Wentao, and the resumption this week of long-frozen military talks between the countries.  The meetings appear aimed in part at insulating the U.S.-China relationship - which tumbled to historic lows last year - from the kind of friction that typically results from elections in Taiwan.  \"The health of the U.S.-China relationship, I don't think you can view as a derivative of cross-Strait tensions,\" a senior U.S. administration official told reporters on Wednesday, adding that the aim was to manage tensions and try to avoid unintended conflict. Taiwan's government has accused China of an unprecedented campaign of election interference, using everything from military activity to trade sanctions to sway the vote toward candidates Beijing may prefer. China has labelledthose allegations \"dirty tricks\". Washington has warned China not to interfere in the democratically governed island's elections, and said Beijing will be the provocateur should it choose to respond with additional military pressure. China has never renounced the use of force to bring Taiwanunder its control. The U.S. is Taiwan's most important international backer and arms supplier despite the lack of formal diplomatic ties with the island. China says Taiwan is its most sacred red line and the most dangerous issue in U.S.-China relations, warning any move toward formal independence by the island means conflict.  Liu is the head of the Chinese Communist Party's international department, which handles ties with foreign political parties. A one-time senior anti-corruption official, Liu led Beijing's efforts to compel the return of Chinese criminal suspects who had fled overseas through its Operation Fox Hunt.  The U.S. has criticized the program for using tactics it calls \"transnational repression\" toward Chinese dissidents, such as kidnappings and pressure on suspects' families. \n“The Biden administration should reconsider the optics and consequences of engaging with an official tied to Operation Fox Hunt, if for no other reason that it undermines our commitment to supporting those who seek refuge from authoritarian regimes, like China,” said Craig Singleton, a China expert at the Foundation for Defense of Democracies in Washington. The White House said in his meeting with Liu that Finer had stressed the importance of peace and stability across the Taiwan Strait and in the South China Sea, a potential flashpoint where Beijing has been increasingly assertive of its expansive territorial claims that put it at odds with regional countries, including U.S. ally the Philippines."
}