{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEJBN05N_L.jpg",
  "title": "Thousands protest in Belgrade to demand elections annulled",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Dec 24, 2023 08:10PM ET",
    "Updated Dec 25, 2023 06:41PM ET"
  ],
  "comments": [
    1,
    [
      [
        "Intricate Cypher",
        "2023-12-25 02:08:51",
        "media bias, that sounds really bad. Thank god the media in most countries are unbiased",
        "https://www.investing.com/members/221691788"
      ],
      [
        "Petey Pete",
        "2023-12-25 05:03:01",
        "Lol they would never be biased. Owned by small business men that just want to bring you the news",
        "https://www.investing.com/members/245762756"
      ]
    ]
  ],
  "link": "https://www.investing.com/news/world-news/thousands-protest-in-belgrade-to-demand-elections-annulled-3263133",
  "paragraph": "5/5\n© Reuters. Supporters of the opposition 'Serbia Against Violence' (SPN) attend a protest, after the SPN alleged major election law violations in the Belgrade city and parliament races, in Belgrade, Serbia, December 24, 2023. REUTERS/Marko Djurica\n2/5\nBELGRADE (Reuters) -Thousands gathered in the centre of Belgrade in an anti-government protest on Sunday to demand the annulment of parliamentary and local elections a week ago that international observers said were unfair.  The populist ruling Serbian Progressive Party (SNS) won 46.72% of the votes in snap parliamentary elections last weekend, according to state election commission preliminary results. An international monitoring mission on Monday said the SNS gained an unfair advantage through media bias, the improper influence of President Aleksandar Vucic and voting irregularities such as vote buying.  Vucic said the elections were fair. On Sunday, police fired pepper spray, a Reuters witness said, after a crowd tried to break into the Belgrade town hall where the local election commission is based. Some of the protesters climbed the building and broke windows. Some threw stones at windows, breaking glass.  \"Vucic thief,\" protesters chanted. In a statement, the interior ministry called on protesters to \"refrain from breaking into the town hall.\" \"By reacting calmly we are trying not to hurt protesters,\" Vucic said in his address in early evening.  The centre-left opposition alliance Serbia Against Violence came second in the election with 23.56% of the vote, and the Socialist Party of Serbia third with 6.56%. Srdjan Milivojevic and Vladimir Obradovic of the Serbia Against Violence coalition tried to open the door of the town hall but were unable to enter, while the crowd shouted \"get in, get in,\" and \"no surrender.\" \nAround 10 p.m. (2100 GMT) the anti-riot police pushed protestors away from the town hall.  Another member of Serbia Against Violence Marinika Tepic has been on hunger strike since the elections to demand they should be annulled."
}