{
  "image": "https://i-invdn-com.investing.com/news/news_headline_rolled_69x52._800x533_L_1419494221.jpg",
  "title": "Suspect in 8 Chicago-area slayings turns up dead in Texas",
  "category": "General",
  "publisher": "Reuters",
  "date": [
    "Published Jan 22, 2024 07:20PM ET",
    "Updated Jan 23, 2024 01:51AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/general/seven-people-found-shot-to-death-at-two-locations-near-chicago-3280123",
  "paragraph": "By Steve Gorman and Daniel Trotta (Reuters) -A man suspected of shooting eight people to death and wounding another in suburban Chicago has turned up dead hundreds of miles away in Texas, where he apparently took his own life after an encounter with law enforcement there, police said on Monday. The death of 23-year-old Romeo Nance near the town of Natalia, Texas, about 35 miles (56 km) southwest of San Antonio, ended a manhunt that began with the slaying of one man and the wounding of another in two Chicago-area shootings on Sunday, police said. The search for a suspect in Sunday's gun violence led police to the discovery of two more crime scenes on Monday in the city of Joliet, Illinois, where seven members of one family were found shot to death in two houses across the street from each other. There was no immediate word on a possible motive for the shootings, but police in Joliet, a town about 35 miles (56 km) southwest of Chicago, said investigators believed Nance knew the seven people slain at the two dwellings there. \"I've been a policeman 29 years. This is probably the worst crime scene I've ever been associated with,\" Joliet Police Chief William Evans said about two hours before the search for the suspect had ended. The Joliet Police Department said it learned Monday night that U.S. marshals had located Nance about 1,200 miles (1,930 km) away in south-central Texas near Natalia, \"at which time it is believed that Nance took his own life with a handgun following a confrontation with Texas law enforcement officials.\"  No further details were provided, and the circumstances and sequence of events surrounding the killings in Illinois likewise remained sketchy on Monday night. Authorities said the first person killed in the spate of gun violence was a man found shot dead on Sunday afternoon in Joliet Township, identified as a 28-year-old immigrant from Nigeria who has been living in the U.S. for about three years. An investigation of that shooting led deputies to an overnight stakeout in search of Nance, the registered owner of the suspected getaway vehicle, at his last known address in the nearby city of Joliet. \nOfficers eventually made entry into Nance's residence and a second home across the street after finding blood outside one of the two dwellings. They found five people dead of gunshot wounds inside one home and two inside the other, police said, bringing the total death toll at the three homicide scenes to eight. A ninth person, a 42-year-old man, was left wounded from yet another \"random\" shooting on Sunday in Joliet that authorities said was linked to Nance's vehicle but who was not otherwise connected to the other victims. (Writing and reporting by Steve Gorman in Los Angeles; Additional reporting by Daniel Trotta in Carlsbad, California, and Maria Ponnezhath in Bangalore; Editing by Sandra Maler, Miral Fahmy and Michael Perry)"
}