{
  "image": "https://i-invdn-com.investing.com/trkd-images/LYNXMPEK0G054_L.jpg",
  "title": "China state media races to plant presence in Nauru after switch from Taiwan",
  "category": "World news",
  "publisher": "Reuters",
  "date": [
    "Published Jan 17, 2024 01:16AM ET",
    "Updated Jan 17, 2024 03:11AM ET"
  ],
  "comments": [
    0,
    null
  ],
  "link": "https://www.investing.com/news/world-news/china-state-media-races-to-plant-presence-in-nauru-after-switch-from-taiwan-3275686",
  "paragraph": "By Ryan Woo BEIJING (Reuters) -A reporter from Xinhua landed in Nauru on Wednesday, the first from China's official news agency to step foot on the remote Pacific Islands nation after it ditched Taiwan for China, as Chinese state media raced to build up its local presence.  On the tiny island nation, which has a land area of just 21.1 sq km (8.1 sq miles), China's state television CCTV has moved even more quickly, filing its first report from Nauru on the same day when Nauru said it would no longer recognise Taiwan as a country and instead would re-establish ties with China, which claims Taiwan as part of its territory.  With the Nauru presidential office in the background, a CCTV reporter on Monday said Nauru had severed its \"so-called diplomatic relations\" with Taiwan and recognised the government of the People's Republic of China as the sole legal government representing the whole of China.  The CCTV reporter was in Nauru even before the island nation switched its ties back to China from Taiwan. Nauru briefly recognised China in the 2000s.  According to state-owned Beijing Daily, the CCTV reporter arrived in Nauru in May 2023 as the Communist Party representative of a Chinese harbour engineering company working on a local project. The race to plant a Chinese media presence in the island nation of just around 12,000 people precedes even any official announcement on the arrival of Chinese diplomats in Nauru.  Xinhua, in a report filed from the Nauru capital Yaren on Wednesday, said it had hired a correspondent and set up a reporting office in Nauru on the same day when diplomatic ties changed.  Taiwan said the news of Nauru's diplomatic change of heart had come \"suddenly\" and China specifically chose the timing after the Taiwanese presidential election to target Nauru just as countries were offering congratulations to Taiwan on the smooth voting process on Saturday. Since the break in ties, Taiwanese media have run stories about Nauru's health problems, particularly the high obesity figures, and its role in housing refugees for Australia. Taiwan's internet users have also left angry messages on the Nauru government's Facebook (NASDAQ:META) page denouncing the decision, prompting the Nauru government to post that \"This page invites educated, informed and constructive criticism. It does not condone abuse and profanity\". \nNauru's government has since restricted comments on its official Facebook page, and warned that online abuse could attract criminal sanctions, after a wave of derogatory comments were posted in the wake of the announcement. In Beijing on Wednesday, Chinese Foreign Ministry spokesperson Mao Ning said the resumption of ties would \"bring unprecedented development opportunities to Nauru\"."
}